{
    "post_url": "https://www.reddit.com/r/Music/comments/qipq7g/were_sticky_fingers_a_band_of_brothers_from/",
    "time_posted": "2021-10-29 20:06:54",
    "time_now": "2021-10-30 01:29:05",
    "ups": 81,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hil8vkp",
            "body": "Would you consider touring with the American rapper Sticky Fingaz of the hip hop group Onyx?"
        },
        {
            "comment_id": "hil8t5t",
            "body": "Can you guys release the lyrics to bootleg rascal? Still don’t know what diz says in that bridge"
        },
        {
            "comment_id": "hil8qnr",
            "body": "Hey Boys! Massive fan from the UK. Came to watch you at Brixton O2 on May 4th 2019. Was the best experience. \nI have a couple of questions! \n1: When are you coming back to the UK to tour? Desperate to see you guys live again! \n2: Dylan, I am a massive fan girl for you, big love. Is it true you have a smiley face tattooed on your ass? If so, we have matching tattoos haha! \nWould literally make my life if Dylan could reply to me &lt;3"
        },
        {
            "comment_id": "hil8l74",
            "body": "Loving the new tracks, keep ‘em coming\nAny word on if the book is still coming out?"
        },
        {
            "comment_id": "hil8l03",
            "body": "You boys got any recent recordings of Headlock?"
        },
        {
            "comment_id": "hil8jqc",
            "body": "Hey boys! The first time I ever heard your music was years ago. I heard cyclone and was just hooked! When can I look forward to a us tour? I’ve been dying to see you guys for years. Keep making beautiful sounds my friends"
        },
        {
            "comment_id": "hil8hgz",
            "body": "What are the odds of you guys playing Clouds N Cream in Melbourne when you come down? I have only heard it at the Corner and every time you boys come down I'm waiting there plastic cup in hand for the tune. You made my day when you played Bootleg Rascal at Festival Hall in 2018, now it's time for C&amp;C to shine."
        },
        {
            "comment_id": "hil86m4",
            "body": "can you describe your upcoming album in a few words? can’t wait for it!!!\n\nabsolutely loved Yours To Keep, it put my into your top 1% of fans on Spotify"
        },
        {
            "comment_id": "hil86fu",
            "body": "Paddy I met Damon Albarn at the Edinburgh Fringe  and told him to go listen to Sticky and F-POS. Not sure if he went on to do so, but either way he heard the name Paddy Cornwall ;)"
        },
        {
            "comment_id": "hil83qy",
            "body": "When is the rest of the WCMTWG album rolling out?¿"
        },
        {
            "comment_id": "hil7png",
            "body": "What is Freddy's favourite synthesizer???"
        },
        {
            "comment_id": "hil7nib",
            "body": "How does Paddy do the fucken vocals for Lazerhead"
        },
        {
            "comment_id": "hil7la3",
            "body": "Any chance happy endings and helping hand will ever make it to Spotify etc? Love hearing the progression of sound album by album"
        },
        {
            "comment_id": "hil7l2v",
            "body": "can u come on discord instead?"
        },
        {
            "comment_id": "hil7idf",
            "body": "I’m old and don’t have much time left, when are you planning to come to so cal specifically? Signed, still waiting in San Diego from the last tour."
        },
        {
            "comment_id": "hil7cyf",
            "body": "Seen you guys at cooly hotel in 2014, again at night quarter in 2017 and again at riverstage 2019\n\n\nBut yas never play \"if you go\"\n\n\nWhy is that? It's a hell tune"
        },
        {
            "comment_id": "hil7bt8",
            "body": "can i PLEASE join the band omg"
        },
        {
            "comment_id": "hil705o",
            "body": "What in the heck does the tattoo under Paddys eye say?"
        },
        {
            "comment_id": "hil704d",
            "body": "Where is your favourite venue to play in Australia? Which is the worst?"
        },
        {
            "comment_id": "hil6zmy",
            "body": "Why don't you guys ever play \"if you go\" ?\n\n\nSuch a sick song"
        },
        {
            "comment_id": "hil6z02",
            "body": "Surely play an enmore gig soon. would absolutely go off"
        },
        {
            "comment_id": "hil6x6w",
            "body": "there is a relationship between velvet sky and sleeping through the flood? Soy for the verse \" in my mind, in the velvet morning sky, ist hard to barato so horas its gonna be\""
        },
        {
            "comment_id": "hil6wz2",
            "body": "Coming to the uk any time soon? :)"
        },
        {
            "comment_id": "hil6uv8",
            "body": "is my rush the b side of saves the day or is it gonna be on the album as well? (put it on the album pls)"
        },
        {
            "comment_id": "hil6ujr",
            "body": "Sup guys absolutely love you and the new tunes tho your land of pleasure album is always gonna be my favorite! I hope you have a NZ tour in the works.\nWhats been your guys favourite album or song to work on? Are you always thinking the one your working on is the best or does one of your past ones stick out? Cyclone is unreal as well!!"
        },
        {
            "comment_id": "hil6ufe",
            "body": "What would be the best possible way for younger bands/acts to navigate the musical landscape of Australia post-COVID, given the current state of the arts especially the way it’s valued here contrary to other places (e.g. Europe)?"
        },
        {
            "comment_id": "hil6sqi",
            "body": "Dizza!! What’s ya favourite guitar ya use g? Whatta ya recommend? I see ya using a Tele a lot. You lads are the best band to walk the face of the planet my g. You have inspired us so fuckin hard bro it’s cooked, we’ll be opening for ya one day!! Farkin legends ❤️❤️"
        },
        {
            "comment_id": "hil6s1s",
            "body": "Kia ora lads just wondering if you are planning any releases for acoustic versions of the WCMTWG songs?(such as the one by one acoustic version)? \n\nKeep on keeping on boys, yous are legends"
        },
        {
            "comment_id": "hil6rk2",
            "body": "Who are your biggest influences, fashion-wise! Love each of your individual styles"
        },
        {
            "comment_id": "hil6mu8",
            "body": "you can only listen to one song for the rest of you life? what is it? go!"
        },
        {
            "comment_id": "hil6it1",
            "body": "Who was the best with the ladies back in the day?"
        },
        {
            "comment_id": "hil6hz0",
            "body": "Fave European city? Saw you rock Madrid's socks off last tour. Love you boys"
        },
        {
            "comment_id": "hil6fnv",
            "body": "Was there a reason Cyclone wasn’t on streaming platforms for such a long time?"
        },
        {
            "comment_id": "hil6b31",
            "body": "what do you miss most about touring? are you coming to Argentina for the next tour? ❤️"
        },
        {
            "comment_id": "hil69fp",
            "body": "Are u gonna tour 2022?"
        },
        {
            "comment_id": "hil68xv",
            "body": "Favourite bar in melbourne?"
        },
        {
            "comment_id": "hil6644",
            "body": "Hey lads, is true you guys were meant to be the secret headline act for splendour 2019?"
        },
        {
            "comment_id": "hil6574",
            "body": "Where are the concert clips from in your new video for Saves the Day? Love it btw!!!"
        },
        {
            "comment_id": "hil64wr",
            "body": "When’s the album coming out"
        },
        {
            "comment_id": "hil64es",
            "body": "Hey legends been a big fan for years. Seen you multiple times. How did you overcome all the shit that was circulating a couple years ago? It’s great to see you weather through it all and come out still making music. Inspirational stuff especially considering the work you guys do outside of music etc. big love from Connor in the Gong ❤️"
        },
        {
            "comment_id": "hil61nx",
            "body": "How’s dizz going since all the recording stuff"
        },
        {
            "comment_id": "hil61jk",
            "body": "Will we get an acoustic album?"
        },
        {
            "comment_id": "hil61ed",
            "body": "When are you coming to Peru? We've been waiting way too long to see you guys!"
        },
        {
            "comment_id": "hil61a7",
            "body": "Will you guys ever not use a professional recording studio and go completely DIY for a project?"
        },
        {
            "comment_id": "hil6187",
            "body": "What are y’all’s favorite bands :)"
        },
        {
            "comment_id": "hil5xfe",
            "body": "if music wasn’t a thing, what do you think you’d be doing career wise?"
        },
        {
            "comment_id": "hil5wr9",
            "body": "Whattup you absolute legends!! I needa know what type of pedals diz n seamus use to get that reggae sound?? Like in the tunes Murderous Nerves, Dreamland, willow tree. I can’t find one that sounds like it farkin anywhere! Please lads hahaha \n\nLove the new tunes bois"
        },
        {
            "comment_id": "hil5w7e",
            "body": "How does spotify royalties work. Is it enough to live off or do you need touring to supplement."
        },
        {
            "comment_id": "hil5vls",
            "body": "Who started the band? I have a feeling it was Paddy"
        },
        {
            "comment_id": "hil5ty2",
            "body": "How many tracks will be on the album?"
        },
        {
            "comment_id": "hil5snz",
            "body": "What’s the odds of you guys playing a show in Southern California?"
        },
        {
            "comment_id": "hil5s5y",
            "body": "what has been your favorite show to date and why?"
        },
        {
            "comment_id": "hil5rbz",
            "body": "Oi 🖤 When is the book released?"
        },
        {
            "comment_id": "hil5rao",
            "body": "Massive fan since day dot so was spewin when I saw you boys were taking a hiatus, what happened with all dat? What sparked it all? Love ya work and please never disband fa real 💕"
        },
        {
            "comment_id": "hil5pdf",
            "body": "Have you met any of Happy Mondays/Stone Roses/Oasis?\n\nI remember hearing a story of Paddy and Johnny seeing Noel G backstage and Paddy meeting Mani"
        },
        {
            "comment_id": "hil5mym",
            "body": "What can we expect from the new album?? Anything really out of left field?"
        },
        {
            "comment_id": "hil5jps",
            "body": "I used to think of you guys every time I went to Newtown. When I hit the streets it'd play in my head. Can I play support for you guys sometime? If you just wanna hangout and jam thats cool too it'll be great swing by lol"
        },
        {
            "comment_id": "hil5e4z",
            "body": "Hey fullas  \nYou gonna pop out some more vinyl soon or what?  \n\n\ncheers for the lovely tunes"
        },
        {
            "comment_id": "hil5dh5",
            "body": "This question is from my boyfriend.\n\n\"I got off of fentanyl and heroin by learning Sticky Fingers songs on guitar. Between that and surfing...I had something to do...to live for, even if it was just to pluck along and punctuate the time that seemed to dilate in uncomfortable ways during withdrawal and sobriety. The Land of Pleasure was where my mind escaped to when it couldn't take the reality that lay before me.\n\nIt's been half a decade now since I got clean from fent and found balance in my life. I'm happily settled down, more happy than I have ever been.  But I still escape into the world of Sticky Fingers every day. I feel like I owe you all, in a way I can't explain. I guess there is no question here, I just wanted to let you know how incredibly grateful I am for your presence and how proud I am of a band that always soldiers on. My life is better for having Sticky Fingers in it. Thank you.\""
        },
        {
            "comment_id": "hil5bzi",
            "body": "Any chance the lads will be at splendour in the grass 2022?\n\nAlso love the new tunes lads, that shit pops off!"
        },
        {
            "comment_id": "hil56g7",
            "body": "Love the podcast fellas,  best thing to bless my ears in some years. How frequent will it be? And when are ya heading back to the home of Diz?"
        },
        {
            "comment_id": "hil56dc",
            "body": "You’ve blessed us with 3 singles so far - any chance of dropping a 4th today? What’s the favourite song to play live?"
        },
        {
            "comment_id": "hil564q",
            "body": "Freddy will you please collab with Horrowshow?"
        },
        {
            "comment_id": "hil4wrm",
            "body": "When are you coming to Argentina?!"
        },
        {
            "comment_id": "hil4ejg",
            "body": "Can you come to california i have the perfect socks i bought paddy 2 years ago that i need to give him"
        },
        {
            "comment_id": "hil4a1b",
            "body": "I loved the \"Last Waltz\" show you put on a few years ago. Is there any chance Sticky Fingers might do another cover of a classic song like \"Ghost Town\" or even some of that bluesy classic rock from Van Morrison and The Band, Dr John etc?\n\nSo here is the question, if you had to chose another song to cover, what might it be?"
        },
        {
            "comment_id": "hil49wd",
            "body": "Dylan and Paddy can you guys release the lyrics to your individual albums i wanna sing along but i want to make sure im getting it right (important because i realized ive basically been singing an entire verse in cool and calm wrong until i got the vinyl with lyrics)"
        },
        {
            "comment_id": "hil4700",
            "body": "Any more live sticky videos for YouTube in the vault? Your Rhiannon cover on JJJ back in the day is a thing of beauty"
        },
        {
            "comment_id": "hil44ix",
            "body": "Love you dogs x"
        },
        {
            "comment_id": "hil420r",
            "body": "Might be a bit serious but you obviously understand mental health and I have a younger brother with schizophrenia so wanna know how you appreciate it but don't let if effect the day to day life"
        },
        {
            "comment_id": "hil41b4",
            "body": "Lads! Hurry up and come run around in newy, been waiting a minute to finally hear you guys play. Thanks for the years of drowning out my car troubles with your tunes x"
        },
        {
            "comment_id": "hil3yqu",
            "body": "Is it true Rum Rage was written in the bathroom? On acid?"
        },
        {
            "comment_id": "hil3wc5",
            "body": "What’s the songwriting process usually like? Guitar first, then lyrics?\n\nAny plans to do small gigs in the future or are you teeing up another stadium tour?\n\nStoked you boys are back at it again your music has got me through the best time and the dark days.\n\nEdit: forgot to add - how many tracks don’t make it onto the final release? Any chance of a b-sides and rarities album in the future?"
        },
        {
            "comment_id": "hil3u17",
            "body": "Hey lads hope you’ve been well!\n\nDo you think in the current age of streaming and the internet it’s become far easier for an up and coming band/artist to become successful without relying on the grind of little gigs to become known?"
        },
        {
            "comment_id": "hil3suj",
            "body": "Hey lads, was wondering what the meaning of slow was or how it came about. Love it!"
        },
        {
            "comment_id": "hil3qub",
            "body": "Can we get lyrics to the marriage song and the story behind the untitled track D posted on YouTube a couple of years ago"
        },
        {
            "comment_id": "hil3mzy",
            "body": "I discovered you guys on a Slightly Stoopid or Stick Figure FB fan page. Someone was on the page saying that Sticky Fingers is the band that everyone needs to hear (and I couldn’t agree more!). So thankful I decided to listen! My question: Are any of you into the reggae rock genre and if so do you have any favorite bands you listen to?  Thanks and love the new tunes!"
        },
        {
            "comment_id": "hil3ksz",
            "body": "Hey fellas! Huge fan every since I heard you cover Rhiannon. Love the new music so far. Great vibes. \n\nMy question is, what is the cats name on the cover of Land of Pleasure? I must know.\n\nAlso, who do I gotta talk to about getting you guys at Bonnaroo next year?\n\nMuch love dudes 💜"
        },
        {
            "comment_id": "hil3i5f",
            "body": "If you could time machine to see any 3 bands live, who would it be? Who are your individual fashion inspirations? Would you guys ever consider releasing covers of songs?"
        },
        {
            "comment_id": "hil3eel",
            "body": "When are you guys going to take responsibility for shaping my whole teenage adolescence"
        },
        {
            "comment_id": "hil3d87",
            "body": "Dream collaboration??"
        },
        {
            "comment_id": "hil3bmd",
            "body": "What tuning is Yours to Keep in? Is it between standard and Eb? \n\nAnd is the guitar  intro of Saves the day inspired by Hendrix at all?"
        },
        {
            "comment_id": "hil37l1",
            "body": "\nRemember me? Seven executions...\n\nRemember me? I have no remorse...\n\nRemember me? I'm high-powered...\n\nRemember me? I drop bombs, like Hiroshima...\n\nChikka-chikka, Onyx???\n\n(Oops, that's RBX's part, not Sticky Fingaz part, it's been a while, lol)"
        },
        {
            "comment_id": "hil36x6",
            "body": "Are you ever gonna to collaborate with Bootleg Rascal?"
        },
        {
            "comment_id": "hil36iw",
            "body": "plans to come to the states anytime soon? Saw you in brooklyn 6 years ago, best show of my life"
        },
        {
            "comment_id": "hil34la",
            "body": "I heard Bootleg Rascal in a brunch spot in Massachusetts for the first time like two years ago or something. Was a guiding light through lockdown for me"
        },
        {
            "comment_id": "hil2zje",
            "body": "Hi 3 questions!!\n\n1. You guys mentioned in the podcast that some songs were written and composed in just a few hours/days. What songs took the longest to write? Are you more proud of songs that come about just spur of the moment or the ones that are more methodical?\n\n2. Meaning behind Eddy's song and will you ever play it live because i will fly to saturn to see that happen\n\n2. Any plans to come to North America? California (specifically san fran/san jose) NEEDS you!!!!\n\nLove you!!!!"
        },
        {
            "comment_id": "hil2wws",
            "body": "hey boys hope things are going well! just wondering how yous feel about the impact you have had on the aus music scene as a whole. i feel like a lot of new bands coming through have adopted and expanded upon the raggae/surf sorta sound you guys pioneered years ago. loving my rush aswell great track"
        },
        {
            "comment_id": "hil2ugb",
            "body": "Do you hold any resent towards triple j for not playing your stuff for so long? I know I do although I did discover you guys through them"
        },
        {
            "comment_id": "hil2tom",
            "body": "Are you familiar to the refrence to your band by Hiriko Araki's Jojo's Bizzare Adventure Part 5: Vento Aureo? How do you guys feel about having one of the more memorable character/stand being named after you?"
        },
        {
            "comment_id": "hil2sp1",
            "body": "Fellas! When are u returning to Mexico City? We miss you so much! Also, the new tunes are awesome!\n\nWhat are your favourite tracks of every album? \n\nSending lots of good vibes from Mexico !!"
        },
        {
            "comment_id": "hil2smm",
            "body": "Love ya guys"
        },
        {
            "comment_id": "hil2qv7",
            "body": "Who you're favourite artist / producer to work with and why?"
        },
        {
            "comment_id": "hil2piq",
            "body": "Is take it easy ever gonna be released???"
        },
        {
            "comment_id": "hil2nnt",
            "body": "Hey lads, loving the new tunes, so keen for more. Question is: What do you see the future of the band looking like? Or is it even something you’ve thought about or do you just take it as it comes? Do you see yourselves continuing to make music together for the foreseeable future or does the idea of more independent projects seem more appealing as you get older and you can use your experience and reach in the industry to have a more personal approach? I personally loved Dizza’s solo tracks and all of the F-pos stuff and wondered if you have all had similar ideas or have any plans? Essentially just want to know what the future of sticky looks like. You lads have been with me through all of my late teens and early 20’s and have helped me through so much and would love to see more from all of you. I’m greedy... sorry haha. Big love ❤️"
        },
        {
            "comment_id": "hil2f9p",
            "body": "When’s the tour boys, need to see you again"
        },
        {
            "comment_id": "hil2677",
            "body": "Do you feel that Triple J has too much of a stronghold on the Aussie music scene? I feel the only way for an artist or band to “make it” and have any form of commercial success is to appease the employees of Triple J and for me that just doesn’t sit right. Thoughts? \n\nAlso, shouts out for being independent from day one! Big ups me brothers 🤙"
        },
        {
            "comment_id": "hil1v8o",
            "body": "Thanks for doing this boys, hope you’re all well and happy. Loving the new tunes. Been listening to you guys since I was a little youngin and nothings changed 8 years later. Would love to see what sort of tattoos you guys all have, my first tat was a Stifi tat I got in Bali many moons ago. Was also wondering what’s been your guys favourite song to work on throughout the years? \n\nThanks for everything guys, I’ve been living with bipolar since a young age and your guys music has  helped me through so much. Hope to see you in west AUS soon. Take it easy xx"
        },
        {
            "comment_id": "hil1rcu",
            "body": "Who is a better fighter, Paddy or Dyl?"
        },
        {
            "comment_id": "hil1qz9",
            "body": "What’s your favorite release from you guys for 2021? WCMTWG, Saves The Day, or My Rush?"
        },
        {
            "comment_id": "hil1qc2",
            "body": "How is your day to day life? Do you really flow through life like your songs?\n\nI found you out through my Turkish ex who was constantly playing your music when we got high haha. Greetings from an Estonian."
        },
        {
            "comment_id": "hil1kk1",
            "body": "Hey guys! My question is simple:\n\nWhen will you come to Toronto? And if you need a ride or pick up from the airport in my ghetto car (that has timeless character) let me know   😊🐬\n\nI'll pick ya'll up! I even put that shit on my vision board, so who knows.... 😏\n\nThe best of love and glad you're all still creating ♡"
        },
        {
            "comment_id": "hil1fhd",
            "body": "What's been the boys' biggest regret within the Stifi journey so far? Not releasing more/less tunes? Touring too much/too little? Not getting going sooner?"
        },
        {
            "comment_id": "hil19l2",
            "body": "When do we get to hear hyper live?"
        },
        {
            "comment_id": "hil16e8",
            "body": "Velvet skies acoustic pls boys"
        },
        {
            "comment_id": "hil10bu",
            "body": "Will you keep touring after the hype of the album dies down?"
        },
        {
            "comment_id": "hil0zm1",
            "body": "Are you coming to Argentina?"
        },
        {
            "comment_id": "hil0v13",
            "body": "Thanks for the new tunes!!! \n\nAny plans to sell out arena shows again? Or would you prefer playing in smaller joints like Hordon Pavillon/ Enmore Theatre? Cheers"
        },
        {
            "comment_id": "hil0ukw",
            "body": "With such a big discography at this point, what's a song of yours you guys think doesn't get enough love?\n\nI'm a big Flight 101 fan"
        },
        {
            "comment_id": "hil0qp6",
            "body": "Also will there be any tunes similar to Loose Ends/ Teenage vertigo on the new album? Rocky punky type shiz, love banging those choons out"
        },
        {
            "comment_id": "hil0qns",
            "body": "Tell us something funny about your dublin gig back in 2019. How was it?"
        },
        {
            "comment_id": "hil0og5",
            "body": "When are we grabbing pints in Dublin boys"
        },
        {
            "comment_id": "hil0nic",
            "body": "Paddy, when's that velvet skies acoustic coming my man? I'm waiting patiently here!!"
        },
        {
            "comment_id": "hil0lys",
            "body": "Imagine you're all shipped off to a desert island - what one album would you each take?"
        },
        {
            "comment_id": "hil0hb0",
            "body": "- Paddy, you’ve smashed it with your sobriety and trying to evolve as a human this year. Congrats. 🥳🌈How hard was it and what advice can you give to others that realise that booze and drugs is starting to take a toll on them? Also did you find yourself down a spiritual (or pseudo spiritual) rabbit hole to recover?\n\n- what’s some really wholesome non rock and roll things that you guys get into? \n\nMuchos g."
        },
        {
            "comment_id": "hil0fkg",
            "body": "hey boys, **LOVING** the tunes, and had a couple of questions;\n\n1.\tHow ya all going?\n2.\theard that the WCMTWG album(s) will have 19 songs total, is that true, and which song from it has been a personal favourite of the band/why.\n3.\tFollows on, but next possible AUS tour? - dying to see you all live.\n\nKeep up the good shit fellas, we’re all backing you."
        },
        {
            "comment_id": "hil0bnk",
            "body": "How much do i have to pay to hear you play Sunsick Moon live? i’ll pay it"
        },
        {
            "comment_id": "hil0aah",
            "body": "When will you come back to the US, west coast specifically?"
        },
        {
            "comment_id": "hil08e8",
            "body": "Is It true Monte is better at golf than Seamus"
        },
        {
            "comment_id": "hil07oz",
            "body": "What are your top 3 fav songs on the new record"
        },
        {
            "comment_id": "hil06df",
            "body": "Which one of you pisses the rest of the band off most  (dw I won’t tell them)"
        },
        {
            "comment_id": "hil03gd",
            "body": "Loving everything, is there a set date for album release &amp; how many songs you giving us on it? Cheers boys 🤙🏼🤙🏼"
        },
        {
            "comment_id": "hikzzbk",
            "body": "I’ve been to the festival hall concert and Melbourne arena concert. I’m a huge fan. It’s no secret that Sticky could be viewed as having a somewhat troubled pass. But you’ve largely come out unscathed. What to you take of bands like Rancid Eddie being cancelled for something as small lyrics in a song. Do you guys feel lucky to have a more supportive fan base?"
        },
        {
            "comment_id": "hikzyx2",
            "body": "Any plans to tour the UK, specifically Scotland? 🙏🏼🙏🏼"
        },
        {
            "comment_id": "hikzlik",
            "body": "Will your guys tour in Europe and the US??"
        },
        {
            "comment_id": "hikzj8t",
            "body": "Fellas, hope you are all well! Anything in the new album similar to Lazerhead in terms of style, that song is an absolute beauty and has one of my favourite build ups! Cheers"
        },
        {
            "comment_id": "hikzeai",
            "body": "Love the new choons boys, couple questions for ya.\n\n1. Question for paddy, whats the meaning of life?\n2. Can we go for a drink in King St sometime?\n3. Whens the stifi book coming?\n\nCheers boys 😘"
        }
    ],
    "top_3_comments_top": [
        {
            "comment_id": "hil5dh5",
            "body": "This question is from my boyfriend.\n\n\"I got off of fentanyl and heroin by learning Sticky Fingers songs on guitar. Between that and surfing...I had something to do...to live for, even if it was just to pluck along and punctuate the time that seemed to dilate in uncomfortable ways during withdrawal and sobriety. The Land of Pleasure was where my mind escaped to when it couldn't take the reality that lay before me.\n\nIt's been half a decade now since I got clean from fent and found balance in my life. I'm happily settled down, more happy than I have ever been.  But I still escape into the world of Sticky Fingers every day. I feel like I owe you all, in a way I can't explain. I guess there is no question here, I just wanted to let you know how incredibly grateful I am for your presence and how proud I am of a band that always soldiers on. My life is better for having Sticky Fingers in it. Thank you.\"",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0nic",
            "body": "Paddy, when's that velvet skies acoustic coming my man? I'm waiting patiently here!!",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0bnk",
            "body": "How much do i have to pay to hear you play Sunsick Moon live? i’ll pay it",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0qp6",
            "body": "Also will there be any tunes similar to Loose Ends/ Teenage vertigo on the new album? Rocky punky type shiz, love banging those choons out",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil3eel",
            "body": "When are you guys going to take responsibility for shaping my whole teenage adolescence",
            "ups": 1,
            "downs": 0
        }
    ],
    "top_3_comments_best": [
        {
            "comment_id": "hil5dh5",
            "body": "This question is from my boyfriend.\n\n\"I got off of fentanyl and heroin by learning Sticky Fingers songs on guitar. Between that and surfing...I had something to do...to live for, even if it was just to pluck along and punctuate the time that seemed to dilate in uncomfortable ways during withdrawal and sobriety. The Land of Pleasure was where my mind escaped to when it couldn't take the reality that lay before me.\n\nIt's been half a decade now since I got clean from fent and found balance in my life. I'm happily settled down, more happy than I have ever been.  But I still escape into the world of Sticky Fingers every day. I feel like I owe you all, in a way I can't explain. I guess there is no question here, I just wanted to let you know how incredibly grateful I am for your presence and how proud I am of a band that always soldiers on. My life is better for having Sticky Fingers in it. Thank you.\"",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0nic",
            "body": "Paddy, when's that velvet skies acoustic coming my man? I'm waiting patiently here!!",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0bnk",
            "body": "How much do i have to pay to hear you play Sunsick Moon live? i’ll pay it",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0qp6",
            "body": "Also will there be any tunes similar to Loose Ends/ Teenage vertigo on the new album? Rocky punky type shiz, love banging those choons out",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil3eel",
            "body": "When are you guys going to take responsibility for shaping my whole teenage adolescence",
            "ups": 1,
            "downs": 0
        }
    ],
    "top_3_comments_hot": [
        {
            "comment_id": "hil5dh5",
            "body": "This question is from my boyfriend.\n\n\"I got off of fentanyl and heroin by learning Sticky Fingers songs on guitar. Between that and surfing...I had something to do...to live for, even if it was just to pluck along and punctuate the time that seemed to dilate in uncomfortable ways during withdrawal and sobriety. The Land of Pleasure was where my mind escaped to when it couldn't take the reality that lay before me.\n\nIt's been half a decade now since I got clean from fent and found balance in my life. I'm happily settled down, more happy than I have ever been.  But I still escape into the world of Sticky Fingers every day. I feel like I owe you all, in a way I can't explain. I guess there is no question here, I just wanted to let you know how incredibly grateful I am for your presence and how proud I am of a band that always soldiers on. My life is better for having Sticky Fingers in it. Thank you.\"",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0nic",
            "body": "Paddy, when's that velvet skies acoustic coming my man? I'm waiting patiently here!!",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0bnk",
            "body": "How much do i have to pay to hear you play Sunsick Moon live? i’ll pay it",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil0qp6",
            "body": "Also will there be any tunes similar to Loose Ends/ Teenage vertigo on the new album? Rocky punky type shiz, love banging those choons out",
            "ups": 1,
            "downs": 0
        },
        {
            "comment_id": "hil3eel",
            "body": "When are you guys going to take responsibility for shaping my whole teenage adolescence",
            "ups": 1,
            "downs": 0
        }
    ]
}