{
    "time_posted": "2021-10-30 12:03:03",
    "url": "https://www.youtube.com/watch?v=-0szkaz56UM",
    "time_now": "2021-10-31 17:25:30",
    "ups": "10604",
    "downs": "151",
    "views": "451000",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Woah",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This whole vido sounded like a thats your proubles not mine type of deal",
            "polarity": 0.2,
            "subjectivity": 0.4
        },
        {
            "body": "WHY wouldn’t you have thought about taking your precious things with people you don’t know personally inside your home? Come on. Idk. People just don’t think ahead anymore. Hindsight is 20/20 folks.",
            "polarity": 0.25,
            "subjectivity": 0.65
        },
        {
            "body": "for one thing.. how bad of a bug problem do you have to have to have a tent put over your house to get rid of them..",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "To much breaking bad",
            "polarity": -0.24999999999999992,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "A company shouldn’t have to tell you to lock your doors. That’s like if you’re driving and run out of gas then complain to the car company that they never told you to get gas.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Does terminx have to tell you how to wipe your a$$ too?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lol breaking bad???",
            "polarity": 0.0500000000000001,
            "subjectivity": 0.6833333333333333
        },
        {
            "body": "😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Breaking Bad style",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Yes, the company should still remind it's customers to not leave valuables, important documents or any other item of significance behind, but it's also big common sense (which apoarently some people still don't have), who would be stupid enough to leave any valuables when your home is under a tent, which that outright tells criminals or anybody... NOBODY HOME. I don't believe the pest control is responsable, that is the owner's/customer's responsibility. Invest in Temporary security system?.No, invest in having more common sense, much cheaper.",
            "polarity": -0.08249999999999999,
            "subjectivity": 0.5375000000000001
        },
        {
            "body": "What’s with the paranoia pieces?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Seems to me the only thing that's infested them houses burglars",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Okay, what does the termite exterminator company have to do with your stuff getting stolen? That’s on you at that point. You leave expensive jewelry out in the open when your house is underneath a tent so it’s obvious to any burglar that nobody’s home. It’s not their fault you’re an idiot maybe lock your stuff up or hell if you’re really that worried camp out in a tent in for front yard for a few days LMAO",
            "polarity": -0.02500000000000001,
            "subjectivity": 0.5375000000000001
        },
        {
            "body": "She obviously didn’t watch Breaking Bad…",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Old news",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "When I see those houses, all I think is Breaking Bad",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "That is not the company’s fault lmao",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Hope they get a good amount of the chemicals being used. Disgusting.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.8
        }
    ]
}