{
    "time_posted": "2021-10-30 12:03:03",
    "url": "https://www.youtube.com/watch?v=-0szkaz56UM",
    "time_now": "2021-11-01 18:08:57",
    "ups": "11647",
    "downs": "171",
    "views": "519620",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Terminex get sued 💯💰",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Vamose Pest",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Walter White is cooking Meth under the tent ⛺",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Definitely not surprised",
            "polarity": -0.05,
            "subjectivity": 0.9
        },
        {
            "body": "I would even think that the company workers could steal my belongings and would at least hide them or take them with me, mostly in America I wouldnt trust anyone",
            "polarity": 0.1,
            "subjectivity": 0.45
        },
        {
            "body": "Very clever",
            "polarity": 0.21666666666666667,
            "subjectivity": 1.0
        },
        {
            "body": "Walt?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Smells like a set up my thoughts",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Omfg!!! There is a movie that I watched out of the redbox probably 4-5 Months ago called don't tell a soul where two brothers do  exactly the same thing!!",
            "polarity": 0.125,
            "subjectivity": 0.1875
        },
        {
            "body": "\"Let's apply booby traps?\"\n\n\"No you retard\"",
            "polarity": -0.9,
            "subjectivity": 1.0
        },
        {
            "body": "Lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Terminix top priority is my safety not to get the bugs out??? I'm going with somebody else",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Um...don't you think that \"valuable jewelry,\" should stay with you or in a safe, not just burglars, but also while a bunch of \"bug guys\" have access to your home!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "It's her fault they took it 🙄is she stupid. Leaving ur valuables laying around these days and blaming the termite company 😂😂",
            "polarity": -0.7999999999999999,
            "subjectivity": 1.0
        },
        {
            "body": "I believe when I went with Terminix, they had the lowest price, but they used outside workers who looked homeless when they tented  my house. I locked up the house. But I took all of my car mechanic valuable tools, luxury watches, xbox, guns, laptops. The only thing they could really steal was my big screen TV and my clothes.  That is common sense when you gonna leave your house for three days to have it fumigated.  She must live in a very rich area where you do not have to think about such things as common sense crime prevention. In poor areas like Whittier California, you can't even leave your garage open because someone will come inside your garage and steal your car battery charger.",
            "polarity": -0.01601239669421487,
            "subjectivity": 0.49318181818181817
        },
        {
            "body": "My friend had her house treated and she removed all of her food, clothing and valuables out. Not under fear of theft, but the obvious contamination.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Nice closet and Loui. Oh well 🤷‍♀️",
            "polarity": 0.6,
            "subjectivity": 1.0
        }
    ]
}