{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qiicru/lpt_turning_your_your_headlight_on_when_its/",
    "time_posted": "2021-10-29 13:49:13",
    "time_now": "2021-10-30 16:50:27",
    "ups": 5515,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hijgdv4",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hinqngw",
            "body": "It is the law that if there isn't complete clear skies with sun, at least your daylights have to be on.\n\nIf you have a car newer than 2000, it probably turns them on automatically, and you can't turn them off until the car is off, or they burn out.\n\nKnow what you cars auto setting is, then you'll never have to worry about changing the headlights ever again.",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.39444444444444443
        },
        {
            "comment_id": "hinqgod",
            "body": "Honorable mention: RainX.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinkndc",
            "body": "You can’t tell me what to do! You’re all snowflake sheep. My car my rules. I can drive however I want to drive. The government has no business interfering in public safety. Don’t tread on me!",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment_id": "hin8mu9",
            "body": "I remember I was once driving this crappy convertible with no heating, and a storm went through my city the same day my car overheated and I had to pull over.\n\nNearly got hit getting back on the road because this big white truck didn't have headlights on. That thing would have decapitated me had he not swung into the next lane.",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.10416666666666667
        },
        {
            "comment_id": "hin7kg5",
            "body": "Additionally, turning on your headlights will also turn on your rear running lights for some vehicles and make it easier for vehicles behind you to judge how much space they actually have to avoid rear ending you accidentally.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hin2hwr",
            "body": "So Pro you could charge everyone $9.99 a day to continue using this advice",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin2dym",
            "body": "I finally got a car with \"auto\" headlights setting. I was so annoyed when I realized the lights dont automatically turn on when the wipers are turned on. Doesnt make any sense.",
            "polarity": -0.2,
            "subjectivity": 0.9
        },
        {
            "comment_id": "himxwzy",
            "body": "In Canada since 1990 ( 31 years ago ) day time running lights have been mandatory on all vehicles either built in Canada OR imported into Canada. I am amazed that the USA lags so far behind on such a BASIC safety device.  JimB.",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.58125
        },
        {
            "comment_id": "himvl6j",
            "body": "Dude it's not a life pro tip as much as an actual law, at least in Europe.\n\nIf visibility conditions require it----&gt; turn headlights on.",
            "polarity": -0.15,
            "subjectivity": 0.25
        },
        {
            "comment_id": "himux4a",
            "body": "and turn off the fucking high beams on public roads ffs",
            "polarity": 0.08,
            "subjectivity": 0.3033333333333333
        },
        {
            "comment_id": "himur5k",
            "body": "And in MA it's a law. If your wipers are on, your lights should be on",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himtwft",
            "body": "In MA this is law but the number of people I see who struggle with this is still pretty high. I remember stopping at the end of the street seeing no cars in the fog and starting to go. Almost pulled out into an oncoming grey (why is it always a monochrome color?)  car with no lights on but stopped myself on a whim, didn't care it was 5:00AM I slammed that horn hard.",
            "polarity": 0.01366666666666667,
            "subjectivity": 0.45633333333333337
        },
        {
            "comment_id": "himt5gc",
            "body": "\"Oh, noes! It's raining. I forgot how to drive!!\" 😱\n\nI frequently say that when it rains, knowing it's going to be rough with a lot of non-essential drivers out there. \n\nApplies to fog, as well. SUV passed me without lights when it was incredibly difficult to see. I got their attention and they immediately put their lights on, thumbs up to say good job, carry on.\n\nAnd thank you to the other drivers who warn me. I appreciate you.",
            "polarity": 0.01499999999999999,
            "subjectivity": 0.5349999999999999
        },
        {
            "comment_id": "himrwv1",
            "body": "Law in Washington. Pet peeve when people don’t turn on lights in rain or at dusk!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himrwmv",
            "body": "I like how these things are offered as automatic, set-and-forget features now. In some Fords (I drive fleet vehicles for work, I wouldn't choose to drive Ford), you don't have to touch the light or wiper controls as both have automatic settings. As in, the lights are on when the engine is, off when it's not, high beams on when the sun is down and no vehicles are coming (it has radar), high beams off when the sun is down and vehicles *are* coming (or ahead of us). Likewise, the wipers are off while the windshield is dry, and they adjust their speed based on how much water is on the windshield. I don't know how that works, but it does. On the newer vehicles, I never touch the light or wiper controls. They just work.\n\nMy own personal vehicle has none of those options, so I turn the headlights on after starting the car. Seatbelt, ignition, set mirrors, set up radio (Bluetooth), start playlist or audiobook, **lights**, transmission, gas. (And yes, I know the gas pedal is giving the carburetor or fuel injection system *air*, not *fuel*.)\n\nAnd yes, I'll flash someone if their lights aren't on. It's no big deal if they don't turn them on, it's more of a courtesy kind of thing, since we do have a lights/wipers law here.",
            "polarity": 0.17158730158730157,
            "subjectivity": 0.4826984126984127
        },
        {
            "comment_id": "himq3pg",
            "body": "You shouldn’t be passing in such weather, but your point still stands.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himpxwh",
            "body": "In Sydney, you legally have to turn on flashlights when it’s poor weather!",
            "polarity": -0.15,
            "subjectivity": 0.4
        },
        {
            "comment_id": "himoufh",
            "body": "TIL that headlights aren't compulsory in america. \n\nI get annoyed even when somebody has them turned off in perfect weather condition. It's so easy to mistake it for a parked csr when the lights aren't on.",
            "polarity": 0.3444444444444444,
            "subjectivity": 0.8777777777777778
        },
        {
            "comment_id": "himoua8",
            "body": "State of Missouri, if your wipers are required your headlights are required as well should be like this everywhere.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himoqso",
            "body": "I’m drive semi tractor trailer. Its a 2020 Volvo, and it has a really great safety feature. If I turn on wipers on continuous mode - the headlights turn on and stay on until I shut the engine off. You literally can not turn them off.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "himoi4c",
            "body": "TIL people drive without headlights.\n\nWhat are all of you on about? You need to have your lights on even if it isn’t raining. If the car is on, the lights need to be on. \n\nIt’s not rocket science, nor is it a huge inconvenience to remember but it could save your or someone else’s life one day.",
            "polarity": 0.4000000000000001,
            "subjectivity": 0.9
        },
        {
            "comment_id": "himl5b4",
            "body": "Just fuckin leave your lights on.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himdwei",
            "body": "Parallel LPT - Use your turn signals.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himdjg0",
            "body": "Moving from Canada (mandatory daytime running lights) to the UK (no DRL req.) was a real eye opener, especially as a cyclist.",
            "polarity": 0.1,
            "subjectivity": 0.65
        },
        {
            "comment_id": "himcoxw",
            "body": "People in this thread are talking about all kind of various conditions in which your lights should be on. Everyone has a different opinion. That’s the problem. The solution is: car running = lights on. If you are one of the COUNTLESS drivers out there who drives with their headlights NOT ON at any hour of the day: you are not as safe a driver as you would be if you would just run with your lights on full time. Lights are for all hours of the day in all visibility types. In any condition, they make your vehicle significantly more conspicuous. Any arguments about wasted bulb life expectancy or “you don’t need it during broad daylight” are all bullshit. Grow up and turn your lights on literally all the time. Your light control dongle probably has an “automatic” setting. Switch it to that and leave it there and your battery will not drain when the key is out.",
            "polarity": 0.20113636363636367,
            "subjectivity": 0.5511363636363636
        },
        {
            "comment_id": "himbo1q",
            "body": "Same goes for cyclists in cities. Just keep the damn lights on, it makes it a million times easier to spot you. And give up on those weak ass keychain LED lights that have non-replaceable batteries, get a set of proper lights that you can remove from the bike when it’s parked.\n\nEven when I’m cycling in pitch black darkness there’s so many people who are cycling with no lights on at all. And then ignore traffic rules. I’m never not amazed ambt the stupidity of certain people in this world. It’s depressing.",
            "polarity": -0.12842261904761904,
            "subjectivity": 0.5318452380952381
        },
        {
            "comment_id": "himb45q",
            "body": "I hate that people don’t understand this.\n\nWas driving home from a road trip in the middle of a massive rain storm. \n\nSome dude was in a gray car with no lights on kicking up massive amounts of water on the freeway and it felt like I was following a gray cloud of mist. Couldn’t see or pass him for shit",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "himasvx",
            "body": "I always have my headlights on low, regardless of the time of day or the weather.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "himastp",
            "body": "Knowledge bomb from the top minds of reddit.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himaje2",
            "body": "I always drive with my lights on because I’m a Safety Sam and don’t wanna get hit",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hima4k3",
            "body": "Tbh, put your headlights on all the time. \n\nTheres so many situations where your car irrespective of colour can be difficult to see, that leaving headlights on is just sensible.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "comment_id": "him94r3",
            "body": "Where I come from, you are required to have your headlights on whenever you are driving your car, period. A car with headlights off is a parked car.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him7xfu",
            "body": "Here in NC, when its raining, they'll update the highway overhead messaging system (the kind they alerts you when there is an accident on your way to work, or what car to look out for during an amber alert) stating that its NC law to have headlights on if your windshield wipers are on. \n\nThis should be drilled into the head of every driver's ed student before they even take their permit test.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "comment_id": "him6rft",
            "body": "And if you’re in the U.S., it’s the law.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him5fut",
            "body": "Also, if it's raining and still bright, wearing sunglasses can help reduce the refractions on the windshield and help you see better.",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.6499999999999999
        },
        {
            "comment_id": "him4ikg",
            "body": "gray cars are the worst with this, they blend in",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "him2s2v",
            "body": "I keep my lights on all the time, it is statistically more likely to reduce accidents because you stand out more.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "him0s4c",
            "body": "Bro thank you!!!!!!! I have this conversation with people all the time and they think I'm crazy!!!",
            "polarity": -1.0,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hilzc6z",
            "body": "Plus you can see better",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilywgh",
            "body": "“Turning your your headlight on when it's raining is not so much so you can see better, but so other people can see you.”\n\nMuch like wearing a mask during the COVID-19 pandemic.  Stay safe out there, folks!",
            "polarity": 0.27999999999999997,
            "subjectivity": 0.355
        },
        {
            "comment_id": "hilycrd",
            "body": "I wish car makers would just program cars to turn their headlights on when the wipers are put into a continuous operation.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilxc1p",
            "body": "Last week I saw a semi change lane and hit a car into the side barrier. It was raining, i noticed a minute or so before the accident that the car didn't have their lights off and I kept my distance. Didn't appear to be serious but the car did look banged up. Semi though? Looked like it didn't even get a scratch.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.36666666666666664
        },
        {
            "comment_id": "hilwvg3",
            "body": "Not trying to be a dick but I thought this was very apparent and common knowledge.",
            "polarity": -0.1175,
            "subjectivity": 0.4775
        },
        {
            "comment_id": "hilw962",
            "body": "In most states it's the fucking law to do this. It honestly blows my mind there are people out there who don't do this. Your cars automatic lights should be ready to go whenever it rains so nothing even requires you doing anything unless you go out of your way to change the settings. My first car I ever bought with my own money was a used 2000 base trim Malibu and that POS had automatic lights so I never buy the excuse in 2021 your cars lights \"can't do this\". I used to be EMS and a majority of our calls in the rain were always people that had minor/major accidents because some blockhead thought they were too good to have their lights on. This was especially an issue on the damn highways out of all places. One of the easiest, safest things you can do when it's raining and there are people that expend unnecessary effort by not having them on (since they are automatic and should be on without any input from you unless you mess with them intentionally).",
            "polarity": 0.06874999999999998,
            "subjectivity": 0.6465277777777778
        },
        {
            "comment_id": "hiluzsx",
            "body": "You should always be turning on your headlights, even in broad daylight. The reason is as you mentioned - not so you can see others but so others can easily see you.",
            "polarity": 0.24791666666666667,
            "subjectivity": 0.5729166666666667
        },
        {
            "comment_id": "hiltbzm",
            "body": "Do people somehow not have cars that turn headlights on automatically after wipers have been activated for at least 5 seconds? Pretty sure every car made has that feature now",
            "polarity": 0.15,
            "subjectivity": 0.762962962962963
        },
        {
            "comment_id": "hilscna",
            "body": "I'm in the camp that believes no matter what time of day it is or what type of weather it is, drive with your headlights on. All the time. It won't hurt anything. It's only going to make you more visible. The other night around 5:45pm, it's starting to get dark in my area earlier. I go to pull out on a busy road and catch myself at the last second because here comes a piece of crap Chrysler mini van, a dark yellow gold color with no headlights on. Totally blends in with the leaves changing color all around us that are yellow and green right now. And they lay their horn on at me when I'm not even in their lane. Never wanted to chase someone down so bad before just to say \"hey turn your headlights on\".",
            "polarity": -0.07749118165784832,
            "subjectivity": 0.3879409171075838
        },
        {
            "comment_id": "hilqi9r",
            "body": "Daytime running lights are the worst.  If the headlights are on, the tail lights need to be on too. I find a lot of people think their lights are on, when they are not. Dash lights should not come on unless ALL your lights are on. PERIOD.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilqesh",
            "body": "Early morning and at night I always see several cars without their lights on. If it is a car past say 2012, I know it comes with automatic lights and why people don’t use them I don’t know. Some people just seem so oblivious.",
            "polarity": -0.049999999999999996,
            "subjectivity": 0.18333333333333335
        },
        {
            "comment_id": "hilqdwv",
            "body": "Any time visibility is poor hour headlights should be on. This also makes sure your taillights are on and vehicles behind you can see you",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.7296296296296297
        },
        {
            "comment_id": "hilqbtb",
            "body": "No fucking shit lol.",
            "polarity": 0.45,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hilpk3a",
            "body": "LPT just always have your headlights on. It makes you easier to see even when it's sunny out.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilpdku",
            "body": "Why don’t people just have their lights on 24/7 it’s the first thing I do after I turn on the car",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hilpcdp",
            "body": "In Finland it's illegal to drive without headlights on.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilpaeu",
            "body": "Also USE YOUR FREAKING TURN SIGNAL. Do the simple things to help our fellow drivers.",
            "polarity": 0.0,
            "subjectivity": 0.35714285714285715
        },
        {
            "comment_id": "hilnyf6",
            "body": "Bad advice,it makes it harder to see.",
            "polarity": -0.3999999999999999,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hilmvrk",
            "body": "That the law is most first world countries, bro. This ain't a prolifetip. Your just an idiot for not already doing it.",
            "polarity": -0.01666666666666668,
            "subjectivity": 0.5444444444444444
        },
        {
            "comment_id": "hilknuz",
            "body": "So many idiots drive around in pouring rain with no headlights, I just don't get it. They are so hard to see.",
            "polarity": -0.19722222222222227,
            "subjectivity": 0.6138888888888889
        },
        {
            "comment_id": "hilhqqk",
            "body": "Why the fuck aren't people taught this in driving school? There is so much basic knowledge that doesn't seem to be conveyed to new drivers some countries (like the US) and it just seems insane",
            "polarity": -0.3159090909090909,
            "subjectivity": 0.5448863636363637
        },
        {
            "comment_id": "hilgxi9",
            "body": "LPT: follow the law.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilfq3g",
            "body": "It’s the only reason.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilec04",
            "body": "Your day running lights don’t always turn on your tail lights, and this is super dangerous in the rain.    \nI can’t see the beige, gray, or blue car in front of me until I’m closer than I’d like to be in the rain.     \nTurn your lights on manually in the rain.",
            "polarity": -0.08888888888888889,
            "subjectivity": 0.5555555555555556
        },
        {
            "comment_id": "hilc3ko",
            "body": "This. If you have a neutral tone car.  TURN THE LIGHTS ON GOD DAMMIT.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilb0a5",
            "body": "This isn't a pro tip. It's common fucking sense. It's also the law in many states.",
            "polarity": -0.1333333333333333,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilawj2",
            "body": "I was driving through the panhandle of Florida a few months back when a tropical storm hit. It was literally so bad I couldn’t see more than 10 feet in front of my car. Lights were the only reason no one hit each other",
            "polarity": -0.08749999999999998,
            "subjectivity": 0.44027777777777777
        },
        {
            "comment_id": "hila73f",
            "body": "I'm honestly surprised people don't know this. Well, I came from a tropical country, so it's common sense there. Californians don't get much rain, so they don't think about it, or they don't care.",
            "polarity": 9.25185853854297e-18,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "hila4gr",
            "body": "It’s actually a law to have them on in the rain. Nice high jack to karma farm.",
            "polarity": 0.25333333333333335,
            "subjectivity": 0.5466666666666667
        },
        {
            "comment_id": "hila4bg",
            "body": "Many US States require this.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil9xtv",
            "body": "Unless you're in Seattle. Then you have to drive in the rain at night with your lights off. You also have to tailgate people, and SDOT can't use reflective line markers. \n\nGood luck everyone!\n\nAnd don't think you hard about why accident rates and insurance are so goddamn high.",
            "polarity": 0.24777777777777776,
            "subjectivity": 0.5605555555555556
        },
        {
            "comment_id": "hil7968",
            "body": "Unfortunately this only helps people who don't think that they're the only ones that matter. I usually flash them, then reach out my window to make the motion of turning on the lights, then depending on how bad it is change my gesture.  Once in a great while someone gets the hint.",
            "polarity": -0.10833333333333328,
            "subjectivity": 0.7777777777777777
        },
        {
            "comment_id": "hil5jdu",
            "body": "These LPTs are getting desperate. Common sense isn't a \"pro\" tip",
            "polarity": -0.44999999999999996,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hil59e4",
            "body": "Every car should have a switch that turns on the lights when wipers are on. Would cost 5 cents to add to any car.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil57xp",
            "body": "Don't pretty much all cars on the road at this point have daytime running lamps already?",
            "polarity": 0.225,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hil32zw",
            "body": "It’s weird to me now that places don’t have running lights. In Canada, running lights are the law, there are normally low beams, but some cars have other lights, on all the time. \n\nIt’s exactly really weird when you see a car even in on a nice sunny day without any lights on.\n\nLights on makes you more visible and easier to see in basically all driving conditions.",
            "polarity": -0.00416666666666667,
            "subjectivity": 0.6958333333333333
        },
        {
            "comment_id": "hil314o",
            "body": "Idiots literally pay money to be able to do this.(keep lights off)",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.7125
        },
        {
            "comment_id": "hil2q09",
            "body": "This is literally in the Highway Code…",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikwlww",
            "body": "Having your headlights on in rain is literally the law everywhere. This isn't a LPT.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikvtds",
            "body": "Many EU countries have mandatory daylight/running lights laws. Its super helpful spot cars, especially grey/silver or non dominant colors. Its important to be seen, thats why I will always drive a red car.",
            "polarity": 0.24666666666666667,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hikvowk",
            "body": "I’m crying from how much I need people to read and understand this. I won’t go into any kind of detail for my job safety but there was recently an accident at my work involving exactly this type of scenario — dark grey car lights off in the rain just before dusk — and it came close to ruining my life and career. I cannot overstate how important this is",
            "polarity": 0.13124999999999998,
            "subjectivity": 0.4625
        },
        {
            "comment_id": "hikunbv",
            "body": "Also it's illegal to drive in California without your headlights if you have your wipers on",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiks5de",
            "body": "Great rule of thumb: if your wipers are on, your headlights should be too.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hikrkdm",
            "body": "LPT, it’s the law.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikrfiy",
            "body": "Daytime running lights are the standard where I am, specifically due to this issue.",
            "polarity": -0.0625,
            "subjectivity": 0.1875
        },
        {
            "comment_id": "hikr2sy",
            "body": "Law in Ohio.  If your windshield wipers are on headlights must be on.  Daytime.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikn4ck",
            "body": "Most of the time your headlights are for other drivers, your brights are for you",
            "polarity": 0.1875,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hikmmb5",
            "body": "Thank you! More folks need to understand this o/",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiklavk",
            "body": "I run my lights any time of the day for this reason.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikkusa",
            "body": "This has been posted in one form or another so many times, are there not mods in this sub?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hikkgjq",
            "body": "This isn’t so much of a life pro tip as common sense.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hikhrsu",
            "body": "It's also so you can see signs that might be obstructed by rain or fog. Road signs are specially designed to send back nearly all the light that hits them and not scatter, making them appear very brightly even when it's dark or conditions make them hard to see.",
            "polarity": 0.18935374149659867,
            "subjectivity": 0.516156462585034
        },
        {
            "comment_id": "hikgkac",
            "body": "This also goes for just gray, gloomy days. Ride around in your gray car on a gray day and you may as well have stealth mode on. Until you get hit.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikd32s",
            "body": "bUt ThEyRe AuToMaTiC\n\n\nJust turn your lights on when you turn the car on and leave them on. It’s really that simple.",
            "polarity": 0.1,
            "subjectivity": 0.2785714285714286
        },
        {
            "comment_id": "hikcyl7",
            "body": "And then there are the idiots that turn on their parking lights and leave their headlights off.\n\nPeople annoy me.",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hikb350",
            "body": "Most semi new car has these “always on” LED lights now so when all the really old car get scraped the problem will solve itself",
            "polarity": 0.24545454545454545,
            "subjectivity": 0.38484848484848483
        },
        {
            "comment_id": "hik5j79",
            "body": "This just confirms previous LPT to just give up with this shitty subreddit. What is even this shitty advice",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "comment_id": "hijy8di",
            "body": "If I'm driving, my headlights are on, just habit for safety reasons.  I go through headlamps more often, so I don't buy the super bright but shorter life lamps.",
            "polarity": 0.5111111111111111,
            "subjectivity": 0.6555555555555554
        },
        {
            "comment_id": "hiju2bv",
            "body": "ALSO if you are on the interstate and it is hard rain DO NOT TURN ON YOUR FLASHERS. We can see you just fine with your headlights on and your not supposed to use ur flashers for heavy rain (IDK WHY YOUR NOT SUPPOSED TO I JUST KNOW YOUR NOT) All i know is one time i got stuck behind someone in heavy rain with their flashers on and i swear it about made me go crazy cus they just kept blinking and all i could see was that flashing shit! Lmao",
            "polarity": -0.11562499999999999,
            "subjectivity": 0.6802083333333333
        },
        {
            "comment_id": "hijs46a",
            "body": "Thank you, captain obvious",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijqh2p",
            "body": "It's actually broader than this in my opinion.  The situations where you need your headlights to see the road/surroundings is a subset contained entirely within the set of situations where other people need your headlights to see you.\n\nTherefore, the decision point on whether headlights are necessary is whether or not they're needed to ensure that you're visible to other vehicles, NOT whether you need them to see.  Or, as other have noted, just drive with your headlights/running lights on at all times and don't think about it further.",
            "polarity": -0.05357142857142857,
            "subjectivity": 0.4785714285714286
        },
        {
            "comment_id": "hijpp3e",
            "body": "[deleted]",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijozdw",
            "body": "I just always keep my lights on if my car is on. A great habit to get into.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hijo99e",
            "body": "This post is kinda stupid and redundant, but at the same time, I can see some people not having their lights on when it rains. And that's equally as stupid",
            "polarity": -0.44999999999999996,
            "subjectivity": 0.58125
        },
        {
            "comment_id": "hijmfkc",
            "body": "Some states require you to have your headlights turned on regardless. I got pulled over for not having my headlights turned on once in the middle of June, bright and sunny morning. guess the cop had nothing better to do. \nIt's actually shocking how many people don't turn their headlights on right after starting the car.... don't you like to see where you're fucking going?????",
            "polarity": 0.04821428571428574,
            "subjectivity": 0.5294642857142857
        },
        {
            "comment_id": "hijkck4",
            "body": "Wow this is so smart",
            "polarity": 0.15714285714285714,
            "subjectivity": 0.8214285714285714
        },
        {
            "comment_id": "hijj0ig",
            "body": "Headlights and seatbelts saves lives",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijiv77",
            "body": "In WI it's the law. If your windshield wipers are on, your headlights need to be on too.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijhwo8",
            "body": "One very foggy morning i flashed my lights at an oncoming car to remind them. They actually took the time to roll down their window to give me the finger.",
            "polarity": 0.014814814814814808,
            "subjectivity": 0.22962962962962963
        },
        {
            "comment_id": "hijhvlo",
            "body": "Looks for the popcorn 🍿",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijh53v",
            "body": "Hazard lights too.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hijgdv4",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijiv77",
            "body": "In WI it's the law. If your windshield wipers are on, your headlights need to be on too.",
            "ups": 343,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijhwo8",
            "body": "One very foggy morning i flashed my lights at an oncoming car to remind them. They actually took the time to roll down their window to give me the finger.",
            "ups": 96,
            "downs": 0,
            "polarity": 0.014814814814814808,
            "subjectivity": 0.22962962962962963
        },
        {
            "comment_id": "hijj0ig",
            "body": "Headlights and seatbelts saves lives",
            "ups": 57,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijozdw",
            "body": "I just always keep my lights on if my car is on. A great habit to get into.",
            "ups": 44,
            "downs": 0,
            "polarity": 0.8,
            "subjectivity": 0.75
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hijgdv4",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijiv77",
            "body": "In WI it's the law. If your windshield wipers are on, your headlights need to be on too.",
            "ups": 341,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil32zw",
            "body": "It’s weird to me now that places don’t have running lights. In Canada, running lights are the law, there are normally low beams, but some cars have other lights, on all the time. \n\nIt’s exactly really weird when you see a car even in on a nice sunny day without any lights on.\n\nLights on makes you more visible and easier to see in basically all driving conditions.",
            "ups": 36,
            "downs": 0,
            "polarity": -0.00416666666666667,
            "subjectivity": 0.6958333333333333
        },
        {
            "comment_id": "hijhwo8",
            "body": "One very foggy morning i flashed my lights at an oncoming car to remind them. They actually took the time to roll down their window to give me the finger.",
            "ups": 93,
            "downs": 0,
            "polarity": 0.014814814814814808,
            "subjectivity": 0.22962962962962963
        },
        {
            "comment_id": "hijj0ig",
            "body": "Headlights and seatbelts saves lives",
            "ups": 59,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hijgdv4",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijiv77",
            "body": "In WI it's the law. If your windshield wipers are on, your headlights need to be on too.",
            "ups": 347,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil32zw",
            "body": "It’s weird to me now that places don’t have running lights. In Canada, running lights are the law, there are normally low beams, but some cars have other lights, on all the time. \n\nIt’s exactly really weird when you see a car even in on a nice sunny day without any lights on.\n\nLights on makes you more visible and easier to see in basically all driving conditions.",
            "ups": 39,
            "downs": 0,
            "polarity": -0.00416666666666667,
            "subjectivity": 0.6958333333333333
        },
        {
            "comment_id": "hijhwo8",
            "body": "One very foggy morning i flashed my lights at an oncoming car to remind them. They actually took the time to roll down their window to give me the finger.",
            "ups": 92,
            "downs": 0,
            "polarity": 0.014814814814814808,
            "subjectivity": 0.22962962962962963
        },
        {
            "comment_id": "hijj0ig",
            "body": "Headlights and seatbelts saves lives",
            "ups": 58,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}