{
    "post_url": "https://www.reddit.com/r/politics/comments/qj0ah3/court_filing_lists_documents_trump_seeks_to/",
    "time_posted": "2021-10-30 08:15:59",
    "time_now": "2021-10-30 16:48:41",
    "ups": 434,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "himuzze",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hinrqzw",
            "body": "Here's the text of the article:  \nBy Luke Broadwater  \nOct. 30, 2021, 5:02 a.m. ET  \nWASHINGTON — Former President Donald J. Trump is seeking to block from release a wide range of documents related to the Jan. 6 attack on the Capitol, the National Archives said Saturday in an early-morning federal court filing detailing what Mr. Trump is fighting to keep secret.  \nIn the filing, in the United States District Court for the District of Columbia, John Laster, the director of the National Archives’ presidential materials division, laid out for the first time exactly which documents Mr. Trump was asserting executive privilege over. The former president is hoping to prevent the documents from being reviewed by the House committee empowered to investigate the mob violence at the Capitol.  \nAccording to the filing, Mr. Trump has asserted executive privilege specifically over 770 pages of documents, including 46 pages of records from the files of Mark Meadows, his former chief of staff; Stephen Miller, his former senior adviser; and Patrick Philbin, his former deputy counsel. Mr. Trump is also objecting to the release of the White House Daily Diary — a record of the president’s movements, phone calls, trips, briefings, meetings and activities — as well as logs showing phone calls to the president and to Vice President Mike Pence concerning Jan. 6, Mr. Laster wrote.  \nMr. Trump has also asserted executive privilege over 656 pages that include proposed talking points for Kayleigh McEnany, his former press secretary; a handwritten note concerning Jan. 6; a draft text of a presidential speech for the “Save America” rally that preceded the mob attack; and a draft executive order on the topic of election integrity, the filing states.  \nFinally, Mr. Trump asserted executive privilege over 68 additional pages, including a draft proclamation honoring the Capitol Police and two officers who died after the riot, Brian D. Sicknick and Howard Liebengood, as well as related emails; a memo about a potential lawsuit against several states that Joseph R. Biden Jr. won in the November election; an email chain from a state official regarding election-related issues; and talking points on alleged election irregularities in one Michigan county.  \nThe filing comes in response to a lawsuit Mr. Trump filed this month against the National Archives seeking to block the disclosure of White House files related to his actions and communications surrounding the Jan. 6 riot.  \nIn that lawsuit, in a 26-page complaint, a lawyer for Mr. Trump argued that the materials must remain secret as a matter of executive privilege. The lawyer said the Constitution gave the former president the right to demand their confidentiality even though he was no longer in office — and even though President Biden has refused to assert executive privilege over them.  \nThe lawsuit touched off what is likely to be a major legal battle between Mr. Trump and the House committee investigating the Jan. 6 attack, in which a mob of his supporters stormed the Capitol seeking to disrupt Congress’s counting of electoral votes to formalize Mr. Biden’s victory. Its outcome will carry consequences for how much the panel can uncover about Mr. Trump’s role in the riot, pose thorny questions for the Biden administration and potentially forge new precedents about presidential prerogatives and the separation of powers.  \nThe leaders of the committee, Representative Bennie Thompson, Democrat of Mississippi, and Representative Liz Cheney, Republican of Wyoming, have condemned Mr. Trump’s lawsuit as “nothing more than an attempt to delay and obstruct our probe.”  \n“It’s hard to imagine a more compelling public interest than trying to get answers about an attack on our democracy and an attempt to overturn the results of an election,” Mr. Thompson, the committee’s chairman, and Ms. Cheney, the vice chairwoman, wrote in a statement after the suit’s filing.  \nA key issue yet untested. Donald Trump’s power as former president to keep information from his White House secret has become a central issue in the House’s investigation of the Jan. 6 Capitol riot. Amid a new lawsuit by Mr. Trump and a move to hold Stephen K. Bannon in contempt of Congress, here’s a breakdown of executive privilege:  \nWhat is executive privilege? It is a power claimed by presidents under the Constitution to prevent the other two branches of government from gaining access to certain internal executive branch information, especially confidential communications involving the president or among his top aides.  \nWhat is Trump’s claim? Former President Trump has filed a lawsuit seeking to block the disclosure of White House files related to his actions and communications surrounding the Jan. 6 Capitol riot. He argues that these matters must remain a secret as a matter of executive privilege.  \nIs Trump’s privilege claim valid? We probably won’t know for a long time, if ever. The constitutional line between a president’s secrecy powers and Congress’s investigative authority is hazy. Historically, such disputes have usually been resolved through compromise, not judicial rulings.  \nIs executive privilege an absolute power? No. Even a legitimate claim of executive privilege may not always prevail in court. During the Watergate scandal in 1974, the Supreme Court upheld an order requiring President Richard M. Nixon to turn over his Oval Office tapes.  \nMay ex-presidents invoke executive privilege? Yes, but courts may view their claims with less deference than those of current presidents. In 1977, the Supreme Court said Nixon could make a claim of executive privilege even though he was out of office, though the court ultimately ruled against him in the case.  \nIs Steve Bannon covered by executive privilege? This is unclear. If any contempt finding against Mr. Bannon evolves into legal action, it would raise the novel legal question of whether or how far a claim of executive privilege may extend to communications between a president and an informal adviser outside of the government.  \nWhat is contempt of Congress? It is a sanction imposed on people who defy congressional subpoenas. Congress can refer contempt citations to the Justice Department and ask for criminal charges. Mr. Bannon could be held in contempt if he refuses to comply with a subpoena that seeks documents and testimony.  \nThe committee has demanded detailed records about Mr. Trump’s every movement and meeting on the day of the assault. The panel’s demands, sent to the National Archives and Records Administration, include material about any plans formed within the White House or other federal agencies to derail the Electoral College vote count by Congress.  \n“Plaintiff’s claims of executive privilege fail because the privilege is not absolute, and here it is outweighed by Congress’s compelling need for information about the extraordinary attack that occurred on the Capitol,” lawyers for the government wrote Saturday in response to Mr. Trump’s lawsuit. “The committee’s investigation into the Jan. 6 attack plainly embodies a legitimate legislative purpose.”  \nIn a pair of letters this month to the National Archives, which is the custodian of White House papers from Mr. Trump’s tenure, Mr. Biden’s top White House lawyer, Dana Remus, made clear that the current president did not think a claim of executive privilege was legitimate under these circumstances.  \nMr. Trump’s lawsuit names as defendants Mr. Thompson and David S. Ferriero, the head of the National Archives.",
            "polarity": 0.021657125768967878,
            "subjectivity": 0.38309267486899057
        },
        {
            "comment_id": "hinm2wy",
            "body": "He's stalling.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinf9k1",
            "body": "Why is trumpo acting so guilty?",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hine85m",
            "body": "Well, this doesn't fit in with Tucker Carlson's theories at all! He's gonna be gutted when he finds out there might inadvertently be some misinformation in his new documentary!",
            "polarity": 0.21212121212121213,
            "subjectivity": 0.28484848484848485
        },
        {
            "comment_id": "hincgek",
            "body": "We will find out the coup was planned, and trump did nothing after the riot started but watch tv, and plan his second fake term in office.",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinboqq",
            "body": "Perhaps misleading them to empty boxes?",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hin7yik",
            "body": "So those are the ones they really need to see I guess.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hin49bx",
            "body": "Executive privilege ends when you are no longer the President.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin3jbl",
            "body": "“ record of the president’s movements, phone calls, trips, briefings, meetings and activities — as well as logs showing phone calls to the president and to Vice President Mike Pence concerning Jan. 6, “ \n\nIf those get out he’s fucked IMO",
            "polarity": -0.6,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hin0d5n",
            "body": "Thanks, you narrowed down the documents revealing the most severe crimes.\n\nNow, plead the 5th.",
            "polarity": 0.18148148148148147,
            "subjectivity": 0.32962962962962966
        },
        {
            "comment_id": "himy4xl",
            "body": "Since we know they had talking points for steps to try to steal the election, these notes for aryan barbie probably included the announcement trump had taken over and was now supreme leader. These people are not smart, they probably had the plans all written down.",
            "polarity": -0.13134920634920635,
            "subjectivity": 0.4658730158730159
        },
        {
            "comment_id": "himy4pk",
            "body": "That is a lot of criminal treason Trump is trying to cover up",
            "polarity": -0.4,
            "subjectivity": 0.55
        },
        {
            "comment_id": "himy4jc",
            "body": "Good.  He has provided Congress with a map of where the bones are hidden.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "himxwsl",
            "body": "https://twitter.com/kaitlancollins/status/1454338718345596931?s=21\n\n&gt; Major news overnight — Per a sworn declaration from the National Archives, Trump is trying to keep more than 700 pages of files out of the hands of the Jan. 6 committee, including 30 pages of his daily schedule, visitor logs and call records for Trump/Pence, @kpolantz reports.\n\n&gt; This includes documents from Trump's top aides, including three handwritten notes from Mark Meadows, proposed talking points for Kayleigh McEnany, files from Stephen Miller and deputy counsel Pat Philbin, the White House \"daily diary\" and drafts for remarks regarding 1/6.\n\n&gt; The National Archives says Trump wanted to assert privilege over \"a handwritten note from former Chief\nof Staff Mark Meadows’ files listing potential or scheduled briefings and telephone calls concerning the January 6 certification and other election issues.\"",
            "polarity": 0.10416666666666667,
            "subjectivity": 0.3194444444444444
        },
        {
            "comment_id": "himx6ws",
            "body": "1,500 pages is a lot to hide",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himvozb",
            "body": "I’m trying to think of the documents he could validly claim privilege (not used to further a crime) and I’m not coming up with much.",
            "polarity": 0.1,
            "subjectivity": 0.35
        },
        {
            "comment_id": "himvcns",
            "body": "Donny ALWAYS trying to hide something.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "himuzze",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "himy4jc",
            "body": "Good.  He has provided Congress with a map of where the bones are hidden.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.26666666666666666,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "himxwsl",
            "body": "https://twitter.com/kaitlancollins/status/1454338718345596931?s=21\n\n&gt; Major news overnight — Per a sworn declaration from the National Archives, Trump is trying to keep more than 700 pages of files out of the hands of the Jan. 6 committee, including 30 pages of his daily schedule, visitor logs and call records for Trump/Pence, @kpolantz reports.\n\n&gt; This includes documents from Trump's top aides, including three handwritten notes from Mark Meadows, proposed talking points for Kayleigh McEnany, files from Stephen Miller and deputy counsel Pat Philbin, the White House \"daily diary\" and drafts for remarks regarding 1/6.\n\n&gt; The National Archives says Trump wanted to assert privilege over \"a handwritten note from former Chief\nof Staff Mark Meadows’ files listing potential or scheduled briefings and telephone calls concerning the January 6 certification and other election issues.\"",
            "ups": 1,
            "downs": 0,
            "polarity": 0.10416666666666667,
            "subjectivity": 0.3194444444444444
        },
        {
            "comment_id": "himy4xl",
            "body": "Since we know they had talking points for steps to try to steal the election, these notes for aryan barbie probably included the announcement trump had taken over and was now supreme leader. These people are not smart, they probably had the plans all written down.",
            "ups": 1,
            "downs": 0,
            "polarity": -0.13134920634920635,
            "subjectivity": 0.4658730158730159
        },
        {
            "comment_id": "himvcns",
            "body": "Donny ALWAYS trying to hide something.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "himuzze",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "himy4jc",
            "body": "Good.  He has provided Congress with a map of where the bones are hidden.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.26666666666666666,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "himy4xl",
            "body": "Since we know they had talking points for steps to try to steal the election, these notes for aryan barbie probably included the announcement trump had taken over and was now supreme leader. These people are not smart, they probably had the plans all written down.",
            "ups": 1,
            "downs": 0,
            "polarity": -0.13134920634920635,
            "subjectivity": 0.4658730158730159
        },
        {
            "comment_id": "himvcns",
            "body": "Donny ALWAYS trying to hide something.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himxwsl",
            "body": "https://twitter.com/kaitlancollins/status/1454338718345596931?s=21\n\n&gt; Major news overnight — Per a sworn declaration from the National Archives, Trump is trying to keep more than 700 pages of files out of the hands of the Jan. 6 committee, including 30 pages of his daily schedule, visitor logs and call records for Trump/Pence, @kpolantz reports.\n\n&gt; This includes documents from Trump's top aides, including three handwritten notes from Mark Meadows, proposed talking points for Kayleigh McEnany, files from Stephen Miller and deputy counsel Pat Philbin, the White House \"daily diary\" and drafts for remarks regarding 1/6.\n\n&gt; The National Archives says Trump wanted to assert privilege over \"a handwritten note from former Chief\nof Staff Mark Meadows’ files listing potential or scheduled briefings and telephone calls concerning the January 6 certification and other election issues.\"",
            "ups": 1,
            "downs": 0,
            "polarity": 0.10416666666666667,
            "subjectivity": 0.3194444444444444
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "himuzze",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "himy4jc",
            "body": "Good.  He has provided Congress with a map of where the bones are hidden.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.26666666666666666,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "himy4xl",
            "body": "Since we know they had talking points for steps to try to steal the election, these notes for aryan barbie probably included the announcement trump had taken over and was now supreme leader. These people are not smart, they probably had the plans all written down.",
            "ups": 1,
            "downs": 0,
            "polarity": -0.13134920634920635,
            "subjectivity": 0.4658730158730159
        },
        {
            "comment_id": "himvcns",
            "body": "Donny ALWAYS trying to hide something.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himxwsl",
            "body": "https://twitter.com/kaitlancollins/status/1454338718345596931?s=21\n\n&gt; Major news overnight — Per a sworn declaration from the National Archives, Trump is trying to keep more than 700 pages of files out of the hands of the Jan. 6 committee, including 30 pages of his daily schedule, visitor logs and call records for Trump/Pence, @kpolantz reports.\n\n&gt; This includes documents from Trump's top aides, including three handwritten notes from Mark Meadows, proposed talking points for Kayleigh McEnany, files from Stephen Miller and deputy counsel Pat Philbin, the White House \"daily diary\" and drafts for remarks regarding 1/6.\n\n&gt; The National Archives says Trump wanted to assert privilege over \"a handwritten note from former Chief\nof Staff Mark Meadows’ files listing potential or scheduled briefings and telephone calls concerning the January 6 certification and other election issues.\"",
            "ups": 1,
            "downs": 0,
            "polarity": 0.10416666666666667,
            "subjectivity": 0.3194444444444444
        }
    ]
}