{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qimmw9/lpt_never_ask_someone_for_their_number_give_yours/",
    "time_posted": "2021-10-29 17:18:06",
    "time_now": "2021-10-30 16:50:13",
    "ups": 14199,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hikc1ad",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hinqngy",
            "body": "Literally did this yesterday in the afternoon, got invite out to the bar in the evening,  went to a rocky horror picture show at night, wandered the streets for houseparties in the morning, gave her a kiss goodbye after. Getting brunch together tomorrow. \n\nAll this from a bad pickupline from r/tinder.",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hinqdo9",
            "body": "Umm no.\n\nI know my place in the social structure. If I don’t put forth the effort, I don’t get girls to go out on dates. Girls have so many options where I live that my 38 year old, 5’11”, 210 lb self Isn’t getting them to just choose me after 10 minutes of talking. \nThis is a horrible LPT.",
            "polarity": -0.046060606060606066,
            "subjectivity": 0.4533333333333333
        },
        {
            "comment_id": "hinp1r1",
            "body": "I can confirm this works wonders, it makes you look confident and just the right level of assertive without scaring anyone away. It's also a great way to show your interest since you're being proactive, sometimes people are a bit shy to give their details even when they want to. Do this and watch your networking and love life improve",
            "polarity": 0.31714285714285717,
            "subjectivity": 0.6438095238095238
        },
        {
            "comment_id": "hinopom",
            "body": "This works for email too. Even better if you don't feel comfortable giving out your number.",
            "polarity": 0.45,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinkg6g",
            "body": "First of all. THIS IS SOME GREAT ADVICE!!! Love how this is written.",
            "polarity": 0.5833333333333334,
            "subjectivity": 0.561111111111111
        },
        {
            "comment_id": "hinj8dg",
            "body": "Going to have to hard disagree here for me. \n\nBasic assumption that most people exchanging phone numbers are single people, probably young and probably a bit drunk and that the rules of the game haven't changed significantly in the last decade, when I was the above.\n\nStandard scenario would be 10 beers deep each at a bar, chatting, getting on well, fancied each other a bit but not going for a 1 night stand just yet, or have just completed a 1 night stand.\n\nWhat I'm saying is, there will likely be regret the next morning, from the booze, from drunken activities, from whatever, a significant portion of people would rather just forget about this and certainly won't make a proactive move to revisit it.\n\nIf you don't get their number, you may be shut down simply because the other person thought you were both drunk or whatever.\n\nYou should both exchange numbers, just don't be a weirdo if you get ghosted.",
            "polarity": -0.02877928949357521,
            "subjectivity": 0.4507180650037792
        },
        {
            "comment_id": "hing2x2",
            "body": "I had been chatting with a lady at the dog park, and after a few times I asked her if she'd have coffee. She said, \"Yeah, I'm around\". I offered her my number and she gave hers in exchange. I texted her once about coffee. No reply. Furthermore, she never came back to the dog park. I'm not even gonna bother anymore.",
            "polarity": -0.1,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hinexr5",
            "body": "This won't work, don't do it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinelqq",
            "body": "There is no single correct policy for all people and situations. It will be messy. Try not to be a dick. Try also to be brave. Good luck.",
            "polarity": 0.3339285714285714,
            "subjectivity": 0.5535714285714286
        },
        {
            "comment_id": "hine4fu",
            "body": "I totally agree with this, but the first time I did this, the woman turned out to be gay and I thought it was hilarious.",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hindvkd",
            "body": "Why not ask, if they seem reluctant; give them yours! \nSmarter, not HARDER",
            "polarity": 0.05,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hindk9f",
            "body": "I'm a girl and I gave my number to a guy and now we're married with a baby on the way. He always tells me how it was my confidence that was instantly attractive. Basically, if you're interested in someone, put the offer out there and if they're interested in you they will contact you and if they're not they won't but at least you gave it a shot.",
            "polarity": 0.25,
            "subjectivity": 0.53
        },
        {
            "comment_id": "hindd7g",
            "body": "&gt;When you ask for a number, regardless of gender or orientation, you're putting someone on the spot.\n\nIs this real? Whatever happened to just being a normal well-adjusted human being that can get through benign social situations without any anxiety?",
            "polarity": 0.09583333333333333,
            "subjectivity": 0.2791666666666667
        },
        {
            "comment_id": "hincao8",
            "body": "Actually the way it works now is that you ask for their social media and just start DMing on there until they offer their number lol",
            "polarity": 0.2777777777777778,
            "subjectivity": 0.2888888888888889
        },
        {
            "comment_id": "hinbvkp",
            "body": "This is true for Kijiji/Craig’s list. Couldn’t figure out how to get in touch with someone to buy their thing until I offered my number instead of asking for theirs.",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinaluc",
            "body": "So they can just throw it away immediately after..?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinaajr",
            "body": "Our you can show the slightest bit of initiave and get her number.\n\nA lot of women won't take the initiative in this instance if they don't lose the number at all. Not taking their number leaves a lot of room for era",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin6zf1",
            "body": "Reminder! DO NOT just give your number out.  You give your number to someone who doesn't give it to you, means you're just asking for trouble via constant prank calls,  to straight up getting threats.  You never know who you're giving your number out too.  \n\nBe safe, have some permasen garlic wings and enjoy the day!",
            "polarity": 0.2,
            "subjectivity": 0.38666666666666666
        },
        {
            "comment_id": "hin6iqa",
            "body": "Yeah, but in context OP",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin5qvc",
            "body": "Dumb tip. Like a woman will take the initiative to ask u out lol",
            "polarity": 0.21250000000000002,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hin5m5y",
            "body": "These tips get worse each day lmao",
            "polarity": 0.09999999999999998,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hin3hr3",
            "body": "I gave a woman my number, because she was always flirting with me every time I went to McDonald's. It was in the form of a note. She was the assistant manager.\n\nI tried to be romantic.\n\nI get a text later that night from her husband.\n\nFML..\n\nAlso, she stopped working at McDonald's after that... Maybe just a coincidence, IDK. But I never saw her again.",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hin30zp",
            "body": "I enjoyed doing this with business cards (works in the romantic context as well).\n\nObviously you get a higher response rate if you get THEIR number and reach out first. \n\nBut the quality of the interest is waaaaay higher if you give them your contact. Like it's probably gonna actually turn into something real quality 🤷‍♂️\n\nVery helpful with Waitresses who flirt with you too; lots of people just flirt for tips or just have that personality. Leaving a card takes away the awkwardness if she wasn't really interested.",
            "polarity": 0.19,
            "subjectivity": 0.42333333333333334
        },
        {
            "comment_id": "hin2uqk",
            "body": "Oof. Stop trying to remove the world from all 'awkward' moments.",
            "polarity": -0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hin2qur",
            "body": "I’m gonna go ahead and say that it’s just fine to ask for somebody’s number. They can figure out the response the want to provide. This doesn’t need to be so complicated.",
            "polarity": -0.04166666666666666,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hin1w3j",
            "body": "Bad strategy for meeting girls!",
            "polarity": -0.8749999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hin0wc7",
            "body": "You still might want to give yours out too: a gorgeous girl gave me her number once in university and said that I should give her a call so we could hang out. I lost it :(",
            "polarity": -0.025000000000000022,
            "subjectivity": 0.95
        },
        {
            "comment_id": "hin0d6l",
            "body": "Every time I’ve done this (never to a total stranger btw) the girl has texted me on the spot to make sure it went through and I could save it. I’d say it’s great advice because it makes you less creepy. I’ve actually done it with guys too for business or just to be bros.",
            "polarity": 0.10555555555555556,
            "subjectivity": 0.5925925925925927
        },
        {
            "comment_id": "hin012x",
            "body": "Why don’t they teach this in school? I wish I knew this before somehow..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himyr0w",
            "body": "Have business cards made up with your name, phone number, email address and any other relevant contact information. Do not use your physical address as you will still be able to use these cards should you move.  Include a phrase describing a favourite hobby, career or something to use as a bit of an icebreaker. I have “Uber geek” on mine.  Have these printed on the thickest available card stock as hopefully the other person will be subconsciously impressed.",
            "polarity": 0.2928571428571428,
            "subjectivity": 0.5454081632653061
        },
        {
            "comment_id": "himyi3i",
            "body": "Putting people on the spot is a part of life. Get over it and ask for the number. If they say no, say “No problem. Worth a shot.”\n\nEveryone is so worried about being uncomfortable. That’s unrealistic.",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.7000000000000001
        },
        {
            "comment_id": "himxg4g",
            "body": "Yea, dumb advice.",
            "polarity": -0.375,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himxcmk",
            "body": "NEVER EVER give your number to strangers.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himx900",
            "body": "It's not really worth the effort either way.",
            "polarity": -0.15,
            "subjectivity": 0.1
        },
        {
            "comment_id": "himx7le",
            "body": "In social situations it still doesn't hurt to use a burner phone number or google voice as well. \n\nEven if you think someone is cool, you should still protect yourself against getting unwanted messages yourself.",
            "polarity": 0.19166666666666665,
            "subjectivity": 0.35833333333333334
        },
        {
            "comment_id": "himx5rj",
            "body": "Yesss I actually just realized I always do this with the other mothers at the park. I always say “if u want to I can give u my number so u can let me know when u come to the park so our babies can play together” they always text me later and it really is more simple than saying “give me your number”",
            "polarity": 0.075,
            "subjectivity": 0.2664285714285714
        },
        {
            "comment_id": "himwn3x",
            "body": "Never ask someone for their number = 10k upvote?? 90% of you are only alive today because someone asked someone for their number. What’s next, never talk to someone without prior written consent? Never ask someone to dance regardless of the situation?\n\nDear me I bet in 2 generations time western civilisation will be a small fraction of the population it is today. Yall doomed lol",
            "polarity": 0.09285714285714286,
            "subjectivity": 0.35714285714285715
        },
        {
            "comment_id": "himwip1",
            "body": "Expect for when you've been hit by a car",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himuo4z",
            "body": "Well I am screwed then .... I dont have a phone :(",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himu54e",
            "body": "If they don’t call you\nIt was probably not meant to be",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himtw3t",
            "body": "You karma whore lol. We all know where you got this.",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "comment_id": "himtrib",
            "body": "OP, are you giving your number or to random people?\n\nHave a conversation with them first. If you're having a great conversation, asking them for their number isn't putting them in the spot.",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.5277777777777778
        },
        {
            "comment_id": "himsvkg",
            "body": "Bit weird to say \"here's my number\"",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himspln",
            "body": "To paraphrase Blizzard: \"do you guys not have chat apps?\"\n\nSeriously who tf calls or uses sms anymore. I don't want my family calling me let alone some guy I wanna bang. Email, signal, telegram, discord, Twitter... Just don't call me. Text is like the last resort. And I don't answer (and actively block) calls from people that aren't already in my contacts.\n\nI'd also much rather have someone burn a contact email address (since I can make a new one in 60 seconds on my domain's CPanel) than I would give them my phone number; if they subscribe my contact email to a bunch of shit after raging at me, nbd black-hole it new one *pop* done, but do the same shit to my phone number and I'll still be blocking granny porn ads and people in India saying they have $3 million dollars and I only need to send them $30k to secure it, for the next 3 years. And chat apps just, one press, blocked.\n\nThis is just... Really bad advice. Truly. Even if nothing else comes of it, you giving out personal information that can be scraped, hacked into, uploaded to databases like fb and twitter so now they have your name and number so when *they* have a breach your data is now all over the web and now a little bit of digging and oh you left your birthday and home town as publicly available info on FB and now you have accounts that are being taken over via recovery questions, or even your phone plan gets sim swapped because they have the number and the enough information to pose as you, and suddenly your bank account is drained.\n\nAnd it's all because you gave out your phone number. Tisk tisk.",
            "polarity": -0.02533891547049441,
            "subjectivity": 0.4544258373205742
        },
        {
            "comment_id": "himsm32",
            "body": "i feel like some women would prefer you to engage first in text so when she has your number, she has to be the one to start the conversation and most females aren't used to that and not good at it because of that",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.4777777777777778
        },
        {
            "comment_id": "himrdns",
            "body": "A lot of girls like to be pursued or “chased” and it’d be a turnoff to have a guy putting the ball in their court immediately 🤷‍♂️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himqplx",
            "body": "Yea sounds too excessive. Sometimes you see love at first sight and you have to ask. You can't go up to a random person and ask.. hey want my number lol.  On top of that. How will you meet the date in the first place? For guys we have to engage first. As we all know.  And saying \"excuse me want me number\" just sounds wrong",
            "polarity": 0.125,
            "subjectivity": 0.5250000000000001
        },
        {
            "comment_id": "himqep3",
            "body": "I also like to break the ice first by letting them know I'm married with kids. It lowers my potential threat level a couple points and shows them I must be a catch since I have a stable family dynamic.",
            "polarity": 0.125,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "himq7if",
            "body": "This is terrible advice for dating, at least for presumably a man trying to ask a woman out. Giving her your number and expecting her to do the work reeks of cowardice. Maybe you can set up the date first and then say here's my number in case something happens, but trying to just hand your number out won't get you very far",
            "polarity": -0.23,
            "subjectivity": 0.6833333333333333
        },
        {
            "comment_id": "himpvln",
            "body": "Can confirm, got a text back day of, literally yesterday haha",
            "polarity": 0.1,
            "subjectivity": 0.15
        },
        {
            "comment_id": "himpo16",
            "body": "This is one of the shittiest advices if I've ever heard one lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "comment_id": "himpktb",
            "body": "I've also said \"feel to block my #; I won't be offended.\"\n\n&amp;#x200B;\n\nTruth is, I WON'T be offended.   I just don't want to waste MY time.",
            "polarity": -0.2,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himpe6v",
            "body": "I'd like to talk to you about your car's extended warranty",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himp7l9",
            "body": "“Putting someone on the spot” \nOmg so frightening to say no",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himousz",
            "body": "So I was flying from Frankfurt to Mexico City once and since it’s like a 10 h. flight, I tried to stay around the kitchen areas of the plane just to stretch my legs for as long as I could. While standing there, an air-hostess solid (8/10) started small talking to me.  The small talk kept going for like 15-20 mins and since it was already late and most of the passengers were sleeping she came back to talking like 3 more times. After the last time, I went back to my seat in between 2 other guys and got a few hours of sleep. I woke up when we were about to arrive to Mexico City and was just waiting for the plane to land so I could take my stuff and leave, and out of nowhere this super cute blonde-blue eyed German hostess that I was taking to earlier walks to my row, hands me a piece of paper and said: “that’s my phone number, me and the rest of the crew are going to hang out tonight in México D.F. and it’d be cool if you’d join us.” The 2 guys in my row looked at me with their eyes wide opened as I was holding the piece of paper and replying to the air hostess that I’d love to join, still not sure if I was being pranked or what. Man, that confidence boost lasts until today and that was around 16 years ago, my chadness peaked that day.",
            "polarity": 0.05791666666666666,
            "subjectivity": 0.4073611111111111
        },
        {
            "comment_id": "himorjl",
            "body": "Heres two stories about the same girl. One of my classmates ordered her a car part from his work and asked if he can keep her number. She said please dont and blocked him. \n\nShe mentioned her car having a different problem and I slipped here my number and said incase you break down. Like a day later she called me just to hang and we dated for a while.",
            "polarity": -0.038888888888888896,
            "subjectivity": 0.2534722222222222
        },
        {
            "comment_id": "himnsh9",
            "body": "If it's at a bar or something though there's prob no shot she'll remember you between the alcohol and 20 other guys hitting on her that night. So eh, I'd still say to always ask and just hit her up the next day reminding her who you are and go from there.",
            "polarity": -0.0625,
            "subjectivity": 0.1875
        },
        {
            "comment_id": "himnjhf",
            "body": "This is fine as long as you're not a guy. 9/10 women won't initiate a conversation even if they're interested, for a variety of reasons that don't really matter.\n\nOP doesn't really have much experience with women. If you give a woman your number and she texts or calls she's not \"at least a bit curious\", if she does that it's a done deal and all you have to do is to take the next step.",
            "polarity": 0.09074074074074073,
            "subjectivity": 0.37777777777777777
        },
        {
            "comment_id": "himnbj3",
            "body": "I'm not a number. I'm a free man!",
            "polarity": 0.5,
            "subjectivity": 0.8
        },
        {
            "comment_id": "himn0ld",
            "body": "How do you give the number though? I feel like it will be a little awkward just walking up to a stranger, complementing them, and then giving them your number out of no where.",
            "polarity": -0.39375,
            "subjectivity": 0.75
        },
        {
            "comment_id": "himmiwx",
            "body": "You just have to let some trust and sympathy for each other develop and then its only a matter of being polite. \"Could we share numbers?\". I don't think reading into things so much is really helpful. If you vibe, you vibe. If not, you don't. There's no need for games of cat and mouse. Just be two humans. I'm kind of sick of all the \"make her wait, she will get needy\" bs. Just be yourself..",
            "polarity": -0.00785714285714285,
            "subjectivity": 0.6664285714285715
        },
        {
            "comment_id": "himlxhg",
            "body": "good luck getting a callback from a girl, even if she does like you",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "himlsdj",
            "body": "I have never, ever, ever heard back from a girl that I did the \"give her your number instead of asking for hers so you seem all different and confident\" thing to. I am even personable and attractive, and this move worked not once in a lifetime.",
            "polarity": 0.325,
            "subjectivity": 0.6083333333333334
        },
        {
            "comment_id": "himloq3",
            "body": "Pro tip, offer your number when you would normally ask for theirs. A guy randomly asked me if he could give me his number a few weeks ago. . . Needless to say I felt super confused - not even sure if he was flirting at the time.",
            "polarity": -0.0880952380952381,
            "subjectivity": 0.6436507936507935
        },
        {
            "comment_id": "himkoyk",
            "body": "This is actually not true for men. \n\nI have plenty of dating experience and I swear to god if you give your number to a girl she wont text u unless she is very intrested in you. You have to be a man and ask her number and text her the next day or the day after that. \n\nAs a man you have to do the initial persueing and then afterwards she has to do more of the persueing",
            "polarity": 0.10500000000000001,
            "subjectivity": 0.29
        },
        {
            "comment_id": "himknam",
            "body": "This screams Reddit louder than any preceding post 😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himkaun",
            "body": "This should be taught in schools",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himk19p",
            "body": "I didn’t give my number to any of the car warranty folks 🤔🤣🤦🏼‍♂️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himjpwn",
            "body": "This is brilliant! Not only will you be avoiding all the awkwardness and anxiety of possible rejection, you'll also be avoiding all the awkwardness and anxiety of any dates ever! Brilliant.\n\nAny girl who calls a guy is going to have called someone else before meeting you already. So you're going to be too late. \n\nYou need to show that you at least have the balls to ask for a number to be in the running. The guys who are too spineless to even call a girl, filter themselves out by not calling. Talk about an own goal. \n\nThis is basic dating 101 people.",
            "polarity": 0.2375,
            "subjectivity": 0.765625
        },
        {
            "comment_id": "himj10s",
            "body": "This is honestly really good advice, I mean I don’t really just chat people up or try to get numbers or give mine very often but like I never thought of things that way and next time I want to chat someone up and I feel we click I’ll keep this in mind.",
            "polarity": 0.15749999999999997,
            "subjectivity": 0.35750000000000004
        },
        {
            "comment_id": "himikcc",
            "body": "I mean people really shouldn’t take dating advice from random sweaties on the internet. Don’t give a girl your frickin phone number unless you’re feeling like an absolute hot dog and even then unless you’re way out of her league is she going to hit you up. Whatever you may think, however desperately you want to go against social norms, it is currently and will be in the foreseeable future up to the guy to initiate communication. You’re setting yourself up for disappointment 9/10 times listening to this advice.",
            "polarity": -0.13291666666666666,
            "subjectivity": 0.5129166666666667
        },
        {
            "comment_id": "himijh9",
            "body": "Definitely a good idea, especially in person. \n\nHowever, do be careful online (particularly on dating apps), as there may be unscrupulous characters who may abuse your number if given out too easily and/or too frequently. Always get a strong feel and build a rapport first, perhaps exchanging social media as a precursor to exchanging numbers.",
            "polarity": 0.22407407407407406,
            "subjectivity": 0.5777777777777778
        },
        {
            "comment_id": "himihg2",
            "body": "You literally farmed this from another question earlier today. Well done I guess.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himi5lu",
            "body": "&gt;When you ask for a number, regardless of gender or orientation, you're putting someone on the spot. There are pressures to respond one way or the other.\n\nwhen you give yours, you put pressure on them to call you. Which a lot of people will just not overcome. \n\nIt's a shitty advice because all people and all situations are different. Like I'm all for equality but as a man I'm kinda *expected* to make the first move, so if I shift that responsibility onto a woman she may never call not even because she didn't like me, but because she *couldn't* force herself to call or she thougt that me doing that is a red flag. Or it can be the opposite way and she'll be thrilled. You never know. Each person and their take is different, so it's a bad advice",
            "polarity": -0.008333333333333316,
            "subjectivity": 0.4083333333333333
        },
        {
            "comment_id": "himhlgc",
            "body": "Jesus. This will get downvoted because it seems like an unpopular idea, but fuck taking on all this responsibility for someones fragile ability to interact socially. If someone is uncomfortable giving you their number they should just be able to say so and if not, thats their problem, not mine. I'm not going to push them if they say no and I have misread the situation, but I am also not going to walk on eggshells around people just in case they might feel upset about something completely normal.\n\nBeing uncomfortable isnt a bad thing. Its just a fact of life and putting the responsibility of managing your own subjective judgements of the world onto people who don't know whats going on inside your head is just a stupid way to live. You are destined to be disappointed if you can't cope with the slight discomfort of even the smallest confrontation, even if it has positive intention. \n\nThe real LPT is learn how to communicate your feelings and be ok with people not liking it. \n\nThere is nothing wrong with saying something like \"Thats nice of you to ask, but I am not interested in taking this any further. Nothing personal, I just dont think this friendship/relationship is compatible. Hope you can understand that.\"",
            "polarity": -0.07117604617604617,
            "subjectivity": 0.6224025974025975
        },
        {
            "comment_id": "himhiaq",
            "body": "This is a go tip, but it only sucks if that particular person, looks for your number when they  are desperate.",
            "polarity": -0.18333333333333332,
            "subjectivity": 0.6583333333333333
        },
        {
            "comment_id": "himha5l",
            "body": "Lol a friend just made a post on her wall about how guys always hand their number out to her like this and how upset she was that guys never ask for her number anymore. But she's an entitled rich girl, so there's that.",
            "polarity": 0.5875,
            "subjectivity": 0.725
        },
        {
            "comment_id": "himh304",
            "body": "This is definitely well meaning advice, but in the real world the success rate for it will be incredibly low. \n\nIt will only succeed if the man is extremely attractive, or if the woman is extremely assertive.",
            "polarity": 0.16785714285714287,
            "subjectivity": 0.5857142857142856
        },
        {
            "comment_id": "himh1yl",
            "body": "that’s the dumbest thing i’ve read in a while. you’ve mentally gymnasticd yourself with PC culture into never getting a girlfriend. guess what, it’s ok to put people on the spot. it happens everyday and there’s nothing wrong with it. There’s also nothing wrong with saying “sorry i’m not interested” and leave it at that. this is a terrible tip especially for men who want to date and have a relationship. if people keep up this ridiculous behavior where no one can be offended or uncomfortable ever our race is just going to cease to exist. the birth rate is already very low and will continue to shrink if people like OP are influencing the culture.",
            "polarity": -0.27152777777777776,
            "subjectivity": 0.7491666666666666
        },
        {
            "comment_id": "himgimj",
            "body": "Underrated as hell!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himgc30",
            "body": "Yeah, good luck with that if you're a straight man.",
            "polarity": 0.44999999999999996,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himfys2",
            "body": "If girl is interested she'll give you the number. If she isn't she might be on the fence. Then you can work it over text and get her over the fence. Can't do that without the number",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himfwd5",
            "body": "if you are in that weird of a spot you shouldn't ask or give your number",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himfwby",
            "body": "That's exactly what I did 21 years ago with my wife with whom I've been married with for 19 years now. It was a gamble, but it paid off!",
            "polarity": 0.28125,
            "subjectivity": 0.25
        },
        {
            "comment_id": "himfhps",
            "body": "Be wary of handing out your phone number. Use something like hangouts tied to a burner Gmail.\n\nMight not get you laid, but might help you avoid getting scammed.",
            "polarity": -0.5,
            "subjectivity": 0.7
        },
        {
            "comment_id": "himf7k2",
            "body": "I haven't realized that I have been doing this for quite a while, I have some friends that are girls and I have their number, so yeah, I recommend this method for getting friends of the opposite sex.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himex01",
            "body": "SIKE. That's the wrong numbah!",
            "polarity": -0.625,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hime3tn",
            "body": "This is bad advice if you are asking for a number because it's someone you like. This is because when you give someone your number you are making them do work. You have to incentive calling you in some way. Like plan an activity and take their contact details to help organise it. This also ensure the other person is enthusiastic about the situation because if they're not they can just say they can't make it without turning you down and feeling awkward",
            "polarity": -0.19611111111111107,
            "subjectivity": 0.6461111111111111
        },
        {
            "comment_id": "hime334",
            "body": "Or just learn to read people properly. It's pretty easy to tell if someone is interested in you.\n\nThis LPT is some real beta bs. Just ask for a number, worst case they just say no and it's over with quick.",
            "polarity": 0.07777777777777777,
            "subjectivity": 0.688888888888889
        },
        {
            "comment_id": "himdn75",
            "body": "I have multipurpose business cards that link to a 3 character website.   \nIf I'm interested in someone I'll give them the card and it's up to them to visit.   \nIf they do there's a drop-down for their name which gets removed after a month.   \nPuts the ball in their court, doesn't give them any pressure and keeps everything light and fun.",
            "polarity": 0.31666666666666665,
            "subjectivity": 0.4666666666666666
        },
        {
            "comment_id": "himd7lg",
            "body": "I hope more people see this post. I'm not a truster, I don't trust easy and I don't like to hand out my phone number. I get enough calls as it is from scammers. Having someone ask for my number and want to confirm that it will ring my phone is not a situation I want to be in. Receiving someone's number would be soo much easier...",
            "polarity": 0.2833333333333333,
            "subjectivity": 0.5083333333333334
        },
        {
            "comment_id": "himd5qb",
            "body": "So, did you just happen to have notes and a pen around or little premade cards with your number? Or did they put your number in their phone immediately?",
            "polarity": -0.1875,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himd01p",
            "body": "I’m a travel photographer so when I started for like $50 I got 500 cards made with my socials and phone number. I haven’t asked for someone’s number in about 5 years now. I just give them my card. Then it’s on them to reach out to me in any sense. I use it for people I have met or potential dating when I was single. It’s great because it gives the other person the power. I once got a message from someone over a year later. \nNot all folks can use the the photographer as an “excuse” but you can always make a card up travelling or just networking.",
            "polarity": 0.09226190476190477,
            "subjectivity": 0.3982142857142857
        },
        {
            "comment_id": "himcdug",
            "body": "Instructions unclear, she did not appreciate me staring at her intensely while waiting for her to text me so I have her number too.",
            "polarity": 0.2,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himc0ai",
            "body": "Text them your number on the spot. Works great. \" Here let me text you my number, you can reach out if you like\".",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "himboya",
            "body": "No. A better way is to give them your number by physically putting your number in. And text yourself. Just say \n\n'Hey, would you mind if I gave you my phone number? Then give yourself a unique (not silly or weird) name and send a text to yourself just with a period. Worked for me plenty.",
            "polarity": -0.025,
            "subjectivity": 0.7035714285714285
        },
        {
            "comment_id": "himb932",
            "body": "Another shitty lpt",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himaxxi",
            "body": "use a qr-code generator to create a qr-code with your contact information. there are many free online. it is an easy way to handover contact information and if you are good in photoshopping, you can combine it with cute catpictures or funny stuff.",
            "polarity": 0.46388888888888885,
            "subjectivity": 0.7888888888888889
        },
        {
            "comment_id": "himam10",
            "body": "This advise is totally useless. Get the number. If you give yours there’s a lower chance of getting a response. \n\nThe idiots guide:\nMessage them, don’t be a creep in the message, leave it if they don’t respond, if they do respond then work on getting the date lined up.",
            "polarity": -0.65,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himak25",
            "body": "This doesn’t work. Many people are not as socially adept as you think, and although they are interested in you, they will not take the initiative to call/text you. Not everyone is as ballsy and charismatic as you think.",
            "polarity": 0.4625,
            "subjectivity": 0.725
        },
        {
            "comment_id": "himabuf",
            "body": "And, we can Google your number before we call and see just how bad you are at the internet",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "himaagn",
            "body": "Ask to swap numbers. Both people are then able to contact the other properly.",
            "polarity": 0.125,
            "subjectivity": 0.3666666666666667
        },
        {
            "comment_id": "hima30k",
            "body": "What  load of sanctimonious drivel.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him9mt8",
            "body": "Yeah I was going to do this for a girl I like, but it just so happened that her friend gave me the number of the girl I liked so it worked out and I thought that was funny",
            "polarity": 0.425,
            "subjectivity": 0.9
        },
        {
            "comment_id": "him9ia8",
            "body": "I think this Is a perfect example of a LPT that is overthinking it",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "him952t",
            "body": "This is awful advice for men. Ask for her number, display confidence, learn to read body language, and be respectful if told no. Most women prefer not to initiate a conversation, even if they consider you interesting. You're going to get a lot less dates as a man this way. This idea that we should give our numbers out to \"make women feel more comfortable\" is ridiculous and OP had obviously thought about this in his head more than he's actually practiced it.\n\nSource: I interact with people outside of Reddit.",
            "polarity": 0.054166666666666675,
            "subjectivity": 0.5180555555555556
        },
        {
            "comment_id": "him8i45",
            "body": "I made this comment earlier today on an askreddit thread  about the worst place to ask a girl for their number:\n\n&gt;Anywhere always. It makes way more sense to just hand them your number on a slip of paper and if they're interested they will hit you up. If not, it's just a compliment and will almost always be taken with grace.\n\nI got one updoot 😡",
            "polarity": -0.0625,
            "subjectivity": 0.625
        },
        {
            "comment_id": "him7xi3",
            "body": "Another great alternative is to ask for their email. Not as invasive and more professional.",
            "polarity": 0.46666666666666673,
            "subjectivity": 0.45
        },
        {
            "comment_id": "him7nbr",
            "body": "fucking redditors I swear to god, and then you complain you're single",
            "polarity": -0.3357142857142857,
            "subjectivity": 0.5071428571428571
        },
        {
            "comment_id": "him7ls2",
            "body": "My boyfriend asked a friend to pass on his number instead of asking for mine and I thought it was awesome that he put the ball in my court",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "him7ic5",
            "body": "Dumb advise. \"Be passive, be weak, sit and wait\"",
            "polarity": -0.375,
            "subjectivity": 0.5625
        },
        {
            "comment_id": "him799o",
            "body": "You assume that everyone is perfectly fine with sending a message first, when it you're interested it's on you to message first often times",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.41666666666666663
        },
        {
            "comment_id": "him6wg4",
            "body": "When I was single I would cut up squares of paper with my name and number to carry in my wallet for this reason. Obviously don’t let the person see your little wallet stack, but have it in hand. Confidence and a positive attitude are key. Now get out there and work your magic my Kings and Queens.",
            "polarity": 0.07805735930735931,
            "subjectivity": 0.6266233766233766
        },
        {
            "comment_id": "him6cwt",
            "body": "I can see where that could be useful if you're coming from the \"I just met this person and it would be putting them on the spot\" sort of situation...\n\nbut in general, you can literally just communicate with people like a rational human being.  Once you've both established that you enjoy each other's company you can simply offer the prospect of mutually exchanging numbers.  It's not that hard.\n\n.. just don't be too weird during the process.  ...let them learn about how weird you really are over time.",
            "polarity": -0.046666666666666676,
            "subjectivity": 0.45738095238095233
        },
        {
            "comment_id": "him5zft",
            "body": "Real LPT, don't get dating advice from Reddit.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "him5krp",
            "body": "This is one of the reasons I recommend everybody carry business cards with them. It doesn't matter what you do you can put some spiel down and your name and number. It's a super easy and low pressure way to give your number to somebody. They don't even have to stand there and awkwardly pretend to put your number in their phone if they're not interested. It's also easier in loud or noisy environments like bars and clubs.\n\nAnd obviously it has other more practical uses too, like with actual networking and so forth.",
            "polarity": 0.032828282828282825,
            "subjectivity": 0.533080808080808
        },
        {
            "comment_id": "him5iq5",
            "body": "Sorry but I don’t agree with this at all. You have to be able to read the room. If he/she/they aren’t showing any signs of attraction you shouldn’t ask at all, and offering yours is even worse IMO, as it comes off a little pushy and weak.",
            "polarity": -0.1925,
            "subjectivity": 0.67
        },
        {
            "comment_id": "him5drg",
            "body": "As someone in sales, reading the title almost gave me an aneurysm.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him4d8f",
            "body": "This. And addendum to this, make it quick. Give the number, really quick chit chat, then leave before you get outright rejected or make it awkward.",
            "polarity": 0.022222222222222216,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "him4aql",
            "body": "Holy shiiit, this is genius. There was this girl i was really interested in, and i am so bad at dating. I gave her my number and stuff worked out really well as OP says. That's was the only time i ever did that and i can really see why it's brilliant. Ahah",
            "polarity": 0.1416666666666667,
            "subjectivity": 0.5944444444444444
        },
        {
            "comment_id": "him42sv",
            "body": "Better LPT: Skip giving your number. Just show your dIck, you'll definitely know if they're interested.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "him3p5h",
            "body": "Most men on here won’t get a call back because they are too nice.  Learn to close or HJ turned BJ. No numbers exchanged. Both will be happier for it.",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.5
        },
        {
            "comment_id": "him3h6u",
            "body": "Great post! There's a lot of toxic \"pickup\" advice for men that essentially pressure women (and/or men) into certain situations. Consequently, the \"relationship\" lasts insofar that this pressuring—and the facade that comes from *acting*, i.e. pretending to be someone you're not—can be sustained. What a terrible, fatiguing, and mentally draining way to live (if one wants to be more attractive, identify what's holding you back and improve those deficits). The toxicity of such pickup advice stems from objectifying women, i.e. not viewing women as human beings but rather as sub-human objects that are to be manipulated; not surprisingly, the advice tends to only work on insecure women.\n\nIn fact, this objectification and subsequent dehumanizing of people, regardless of sex/gender isn't specific to dating/pickup. It's pretty common in many other areas in life if you're observant. The implied philosophical premise is that people don't have free will and instead are deterministic so all one needs to do to get someone to do X is to do Y.\n\nThe premise of determinism is false because people fundamentally have a *choice* whether to *focus*—and remain in focus, i.e. concentrate—on any given thing to identify whether X is good. Human behavior *appears* deterministic insofar that people choose not to remain in focus and instead rely on their sub-human, animalistic impulses and associations (their more human traits are mimicked, often by pressure to conform, from those who more consistently exercise their free will and rationality; their parroting of others is often revealed when they don't understand what contexts in which a behavior applies), which unfortunately is prevalent in today's times. Dismissing people who don't fit these molds because they're statistical outliers is cherry-picking qua rationalizing and consequently overgeneralization; it also encourages conformity by using statistical averages, i.e. what is most popular, as standards of mental health.",
            "polarity": 0.12096349596349595,
            "subjectivity": 0.47828185328185324
        },
        {
            "comment_id": "him2keh",
            "body": "Except a lot of people who can’t even give their number out, won’t text first or initiate plans or start conversation. Pretty simple.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.5634920634920635
        },
        {
            "comment_id": "him266c",
            "body": "Yo... this is so brilliant and elegant, yet so simple, I can not believe I never thought of this... Totally eliminates all the anxiety of asking for her number in such a smooth fashion. Bravo and thank you.",
            "polarity": 0.3,
            "subjectivity": 0.6845238095238096
        },
        {
            "comment_id": "him1w51",
            "body": "Don't ever ask for a number, period. If someone wants to be in contact with you, they'll make sure you have it.",
            "polarity": 0.35,
            "subjectivity": 0.4944444444444444
        },
        {
            "comment_id": "him1blg",
            "body": "Don't give them your number. Give them your 'business card' that has your number on it. It's cooler",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him16aw",
            "body": "Holy shit so this is why it was working before, i did this by accident during the first few weeks of college and then people stopped giving me their number after that, this must be why!",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.41111111111111115
        },
        {
            "comment_id": "him15sc",
            "body": "In the world of online dating, that's a shitty advice. Don't give your number to someone, let them give your their number to find out if they are even real.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "him0jvu",
            "body": "If a girl gave me their number out of the blue, I'd assume they'd try to either: sell me something or they lost a bet between their friends.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "him0iq5",
            "body": "do you hand them a card?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him0dgr",
            "body": "All time bad LPT that would only get traction on this site",
            "polarity": -0.3499999999999999,
            "subjectivity": 0.8333333333333333
        },
        {
            "comment_id": "him00jn",
            "body": "This forces the other person to invite you to something",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hilzpfq",
            "body": "Same goes for names, occupations, and opinions.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hilz3dd",
            "body": "Disagree. Sometimes you gotta be proactive.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilytda",
            "body": "Nah I have social skills I’ll just ask",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment_id": "hilycq3",
            "body": "Or, if the girl really seems into you, you might ask, depends on the vibe.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hilxvkq",
            "body": "Would have been nice to know about 30 minutes ago",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilxgu3",
            "body": "This works great as a life pro tip if your goal in life is avoiding awkwardness at all costs, or you really don't care if the other person contacts you or not. \n\nIf you're a guy looking to date, or any other person in a situation where you're trying to sell yourself, this is terrible advice. Even if they're interested, there's always a chance that they'll simply forget. \n\nOr if they're a woman you're trying to date, you as a man are expected to lead and make the first move. That's simply the facts of our evolutionary biology and the society we live in. I'm not saying there aren't exceptions, but most women will expect you to take the lead.",
            "polarity": 0.06553030303030304,
            "subjectivity": 0.4706349206349206
        },
        {
            "comment_id": "hilwzn9",
            "body": "I remember hearing opposite advice from Neil Strauss... I think he is more qualified than random Reddit post... godspeed all the same",
            "polarity": 0.0,
            "subjectivity": 0.28125
        },
        {
            "comment_id": "hilwnqb",
            "body": "Or just ask them for their number. It isn't radioactive material. You can handle being told no.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilwhn5",
            "body": "That's a good way to never hear from a girl again. You're basically putting the onus on her to make the first move, initiate contact, open the conversation up, etc. The vast majority of girls won't do this (and honestly aren't completely comfortable doing this unless they're a super dominant forward girl) unless you've established super high interest in the initial interaction. And if that's the case and she has crazy high interest, then why don't you simply recognize that, get her number, and then make the moves? In the long run, over the course of many interactions, most all of the time, you're going to lose points for having girls take your number down. It's simply not attractive. It looks weak in the early stages of the interaction, which are crucial. You should KNOW that you're a high value dude and that she's interested and operate from that mindset. You should ASSUME she would want you to text her and set up plans since you guys are standing there talking and vibing. And rather than a fun text Convo in her phone that you started that she can respond to and remember, if you throw your number at her, you're just another of the countless contacts in her phone, and worse than that you're a contact that she's never even texted/called.\n\nA number is not just a number. Numbers have an element of quality. Some girl who you talked to for 5 mins, didn't vibe with much at all and was wishy washy about the number exchange after you were awkward about the number, yeah that's not going anywhere. A girl that you spent 25 mins, sat down with, vibed, and got to a point where you're comfortable with each other, and started discussing a date/activity with, and it felt like the number was just the natural profession of the interaction and a way to keep in contact and make plans with,  has a MASSIVELY higher chance of working out. Ideally you have enough social/emotional intelligence to gauge whether this is ACTUALLY someone that wants to see you again so you don't put low interest girls in the position of exchanging numbers out of obligation. Truthfully the number means very little, it's the events leading up to that number.\n\nGetting HER number also gives you an opportunity to call back to some joke you guys shared when meeting, and come right out of the gate with a text that isn't the typical \"hey good meeting you\" shit that quickly devolves into boring \"you too\" or \"how's your day?\". You can VERY quickly differentiate yourself from the last ten boring dudes she talked to. You can even shoot her a flirty/funny text while she's still in front of you, and often they'll find it funny text you right back and now suddenly the lines of communication over phone are already wide open in a flirty, playful way and you've eliminated that weird first text stage and moved to \"fun guy that I'm talking to\" stage where it only feels natural to meet up again (or at least text throughout the day or call each other up until your schedules allow). \n\nYou can reinitiate contact quickly and in a fun way by doing this and keep the vibe up instead of her putting it off for three days because she forgets or isn't sure what to say, the attraction fades, and (if she even remembers she \"has\" to text you at all) she starts rationalizing \"eh maybe he wasn't that cool after all\". Girls these days have so many options and you NEED to keep it hot make a meetup happen within a few days or it will fizzle out. Throwing your number out in the wind like that HOPING she'll contact you just gives the potential to slow things down and make them feel less smooth and happenstance to her (and looks bad and increases the chances she will NEVER talk to you again). \n\nYou're making a big deal of figuring out whether she's interested or not. It's not that cryptic.  Want to know how you know she's interested? She responds to your first text. If she doesn't respond to a follow up then it's done and you move on and then it's TRULY on her to initiate communication if she's interested.",
            "polarity": 0.0692692197360872,
            "subjectivity": 0.5109934978007267
        },
        {
            "comment_id": "hilwf3w",
            "body": "Great tip! I’ve always said this and did this all through college myself and still to this day. All for the same reasons you explained. Cheers!",
            "polarity": 0.5,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hilvs7r",
            "body": "Sometimes if it’s going well I’ll offer my number but they’ll just give me theirs in return. This is a pretty good tip",
            "polarity": 0.475,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hilvp9l",
            "body": "Ironically, right under this post is a video on public freakout where this woman is working out in the gym and this guy comes up and starts harassing her. \"Hey, can I ask...\" He stops and immediately walks away when she yells at him to back off. Weird how reddit always works out like that.",
            "polarity": -0.053571428571428575,
            "subjectivity": 0.4005952380952381
        },
        {
            "comment_id": "hilv2tt",
            "body": "I don't text men first so this advice would not work for me or other women who are more traditional.",
            "polarity": 0.15625,
            "subjectivity": 0.4895833333333333
        },
        {
            "comment_id": "hiluwb5",
            "body": "Damn. I never thought of it this way but you're totally right. Thank you for the tip!",
            "polarity": 0.3571428571428571,
            "subjectivity": 0.5357142857142857
        },
        {
            "comment_id": "hiluunm",
            "body": "Give your number by key into their phone and hit call. You have their number. Should only ethically be used when both parties are interested",
            "polarity": 0.1125,
            "subjectivity": 0.775
        },
        {
            "comment_id": "hilunxi",
            "body": "From a guys perspective, I get where this is coming from but I think it could fall short. It puts the work on the girl/woman to send the first text and get the conversation started. Sometimes I like to get the conversation started myself.",
            "polarity": 0.125,
            "subjectivity": 0.31666666666666665
        },
        {
            "comment_id": "hilujcj",
            "body": "What a terrible idea.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilucom",
            "body": "\"Give me a call sometime.\"\n\n\"No. Here's my number. You ring.\"\n\n\"...\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilu032",
            "body": "My fiancé did this with me. When he met me I was pretty much mentally checked out of wanting to pursue any relationships due to some really screwed up things that had happened in my life so I didn’t actually reach out for like a month. He saw me several times a week at the gym which is where I was working. Always just friendly, short greetings when he arrived and left. Never asked me why I hadn’t texted. Never even brought it up. Coolest customer I ever saw. And even though my head wasn’t on right, I was still really impressed with his confidence. I’d say his patience was very soundly rewarded. And I still think back on that and find myself impressed with the way he behaved towards me, especially now, knowing what he was actually thinking about me 😜 \nHe also happens to be the best thing that’s ever happened to me too so 😊",
            "polarity": 0.25915966386554623,
            "subjectivity": 0.419453781512605
        },
        {
            "comment_id": "hiltrvk",
            "body": "This is terrible advice lol.  And leave it to reddit to think it's good advice",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.7666666666666666
        },
        {
            "comment_id": "hiltclg",
            "body": "Make sure to ask them if they want your autograph too.",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "comment_id": "hilseic",
            "body": "This isn't an LPt, it's just your oinion. Your last paragrah makes it embarrasingly obvious how sexually discriminitory as well. Two different sets of rules. I'd bet your about 25 and think your advice is relevatory. You have a loooong way to go kid.",
            "polarity": 0.125,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hils1oq",
            "body": "Scribbling it on bathroom stall walls is a quirky alternative",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilqjg8",
            "body": "Anyone else annoyed by the absolutes in these titles? There are many situations when asking for someone's number is fine. NEVER SAY NEVER!",
            "polarity": 0.20694444444444446,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilqels",
            "body": "Get over it.  Ask for the number. If people don’t want to give it to you then they can make one up.  Tough titties.",
            "polarity": -0.3888888888888889,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment_id": "hilqe80",
            "body": "So... you write it down after asking if they would like your number? Or do you ask for their number to send it to? Oh... ok got it.",
            "polarity": 0.17222222222222222,
            "subjectivity": 0.3944444444444445
        },
        {
            "comment_id": "hilpgxg",
            "body": "YESYESYES! This! Works so much better!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilpd17",
            "body": "Such a pro tip wow lol. Doesn't matter guys (who I think this post was only being written towards) if you want to get contact information for another person do it however you'd like. Give out your number or ask for theirs it really doesn't matter",
            "polarity": 0.22000000000000003,
            "subjectivity": 0.68
        },
        {
            "comment_id": "hilon9a",
            "body": "They're called business cards.  Mine say \"gentleman at large\" on them",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.42857142857142855
        },
        {
            "comment_id": "hilo5uf",
            "body": "The opposite of this is true when selling something.  Always have the other party make the first offer.",
            "polarity": 0.11875,
            "subjectivity": 0.3395833333333333
        },
        {
            "comment_id": "hiljt9j",
            "body": "Always ask for a girls number, giving her your number is a black hole. If she doesn’t want to talk she can either ignore you or tell you or not give you her number to begin with.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hilj9j0",
            "body": "I disagree. Giving your number to a girl and expecting her to call you is too much. Girls like follow and not lead. This might work for business and friendship but not romantic occasions",
            "polarity": 0.1,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hilj4li",
            "body": "Oddly enough, this works well if you have elementary aged kids who want to set up playdates.\n\nI would write my name and number and \"Josh's Mom\" on a piece of paper and leave it in my son's backpack for him to give to any friends he wanted to invite over.\n\nIf I got a phone call or a text, I knew that (a) my kid actually liked the kid enough to want to hang out with him, (b) the kid actually liked my kid enough to want to hang out with him, and (c) their parent was cool with it.\n\nThere's nothing more awkward than face-to-face playdate invitations to another parent and nothing comes of it. Did they forget? Were they just too busy? Do they only let their kid play with LDS kids? Should mention it again?",
            "polarity": 0.14583333333333334,
            "subjectivity": 0.6541666666666667
        },
        {
            "comment_id": "hilhvfe",
            "body": "Strong disagree on this one.\n\nGiving out your number is definitely nicer and puts people less on the spot but I would be shocked if you didn't lose out on a lot of dates/meeting women by doing this.\n\nMost women don't want to make the first move -- because nobody wants to make the first move; its has the potential to be awkward and super vulnerable.\n\nDon't get me wrong I fully understand the intention and the reasoning for it. I just can't imagine it would workout for most people.",
            "polarity": 0.0,
            "subjectivity": 0.5666666666666668
        },
        {
            "comment_id": "hilhpqq",
            "body": "Completely disagree. Most women want a guy to make the first move and that includes asking for the number and calling. The key here is if the girl says no or gives the number and doesn't answer after two attempts STOP pursuing. Have some self respect and pursue someone that is interested",
            "polarity": 0.22000000000000003,
            "subjectivity": 0.5466666666666666
        },
        {
            "comment_id": "hilhfk8",
            "body": "The real lpt: you probably shouldn't trust a \"tip\" that starts with \"never\"",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "hilhayn",
            "body": "You lack confidence. If you set clear expectations and ask for permission before doing something people don't feel pressured into giving what you ask. This is how consent works.",
            "polarity": 0.10000000000000002,
            "subjectivity": 0.3833333333333333
        },
        {
            "comment_id": "hilh6ei",
            "body": "did you get this LPT idea from the askreddit today about the worst places to ask a girl for her number in the comments?",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilf8hz",
            "body": "Def works like a charm with online dating. 9/10 times after we've made a connection on the app, asking them to throw me a text works",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilbph5",
            "body": "What if they call when I’m around my wife?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilakzo",
            "body": "What is this, life pro tips for people who have no confidence?\n\nJust be a man and ask her for her number. If she says no, move on. No big deal.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hil9xjo",
            "body": "Nah. Shit life pro tip.",
            "polarity": -0.2,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hil9qdc",
            "body": "Dumbest tip I’ve ever read. I know plenty of women that get a number from a guy who they ARE interested in and I ask them, why don’t you contact them? They all respond with something about not wanting to be the first person to say anything. I know, it’s pretty dumb but that’s the logic of most women. They don’t want to make the move, they want the guy to. Which means you ask for her number. \n\nAnd to guys, if she doesn’t want to give you her number, just move on. If you have to convince her, she’s not interested.",
            "polarity": 0.125,
            "subjectivity": 0.5555555555555555
        },
        {
            "comment_id": "hil7vgc",
            "body": "You're either a moron, a woman, or live in a very culturally different place than I am(Southeast US).  As a man, unless you're a top 2-5% of the dating pool(I'm probably around the 8-13%), 99% of women will never contact you.  Plus showing that you have the confidence in yourself to think that the other person will give you their number is an attractive thing.  All the women I've known want a man of action, a doer, and giving your number is very passive.",
            "polarity": 0.10142045454545454,
            "subjectivity": 0.546875
        },
        {
            "comment_id": "hil7pdz",
            "body": "Just more terrible advice over on LPT.",
            "polarity": -0.25,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hil7ejg",
            "body": "Honestly, I'd rather link them to my Facebook, Discord or Steam account. If I gave them my number there's a 99% chance I won't answer their call or get any text messages because I don't get a signal in my house unless I'm standing next to a window or door.",
            "polarity": 0.3,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hil2z3q",
            "body": "Being on the spectrum, social etiquette and cues were not always obvious to me. This girl I had not seen since 5th graded ended up in one of my first college math classes. I was glad to see an old friend again, I figured if I ever miss a class or have a math question I could ask her. I asked her for her number but she declined and after a week was no longer in that class..\n\n&amp;#x200B;\n\nfor me, it had nothing to do with \"oh a girl\"...it was just shes an old friend ...in my mind it was \"oh its...(girls name)\" as if no time had passed.",
            "polarity": 0.1638888888888889,
            "subjectivity": 0.38333333333333336
        },
        {
            "comment_id": "hil2rg8",
            "body": "I have never asked for a number.  I always gave mine.  It has worked very well for me.  Highly recommended.",
            "polarity": 0.18,
            "subjectivity": 0.41999999999999993
        },
        {
            "comment_id": "hil274e",
            "body": "Disagree with this, respectfully. You came to talk to them and it's on you to text and drive the conversation that hopefully leads to a date. You give someone your number expecting them to text you and might as well not have bothered them at all.",
            "polarity": 0.5,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hil024a",
            "body": "I used to think along the same lines, but I don't think this is good advice, at least not as a hard rule.\n\nCase in point: When I first met my wife she was nervous because she had noticed me (we worked together) and was interested. But she didn't show it. We talked for the first time and I gave her my number so as not to come on too strong. She didn't realize that I hadn't gotten hers. She figured I'd call, and I never did, so I must not be interested. Almost missed the opportunity of a lifetime.\n\nWe bumped into each other later, ended up getting together, and had a laugh about it afterward. But she always thought it was weird. She told me that even if she hadn't just blanked out about me not getting her number, she probably wouldn't have called. She would have assumed I wasn't that interested if I didn't bother to ask for her number.   \n\n\nI realize that's a one-off situation, but you're also putting the pressure on the other person. I think it's a mistake to assume that it will definitely come across as confidence. It could just as easily be viewed as arrogance. You're basically saying, \"You want to pursue this? YOU make a move.\"  \n\n\nLike most hard rules for dating or meeting people, take this with a grain of salt. Everyone is different and responds to these situations differently. There may be situations where giving your number out is a better idea than asking for theirs, but it's going to depend on the situation, the other person, and your dynamic with them.",
            "polarity": 0.09826388888888889,
            "subjectivity": 0.45972222222222214
        },
        {
            "comment_id": "hikyp8a",
            "body": "Or: give them your IG/snap! People often feel more comfortable giving out their social media cause it’s easier to block &amp; limit interactions vs someone having your number\n\nI’m super paranoid of someone having my # &amp; me having to consider changing it cause I’ve had it for so long &amp; it’s connected to EVERYTHING when I log in😪",
            "polarity": 0.24333333333333332,
            "subjectivity": 0.48666666666666664
        },
        {
            "comment_id": "hikwwje",
            "body": "The thought is nice, but I'm guessing you're a guy. As a woman, I was always taught to always take someone's number instead of giving out yours. There's enough crazies out there that I need to be able to have the control over whether there will be a second meeting.",
            "polarity": 0.275,
            "subjectivity": 0.53125
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hikc1ad",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hikd1jq",
            "body": "This tip only works for finding a relationship. How will I know what number to call the mechanic when my car breaks down when he/she only has my number...",
            "ups": 4592,
            "downs": 0,
            "polarity": -0.051851851851851864,
            "subjectivity": 0.762962962962963
        },
        {
            "comment_id": "hikh6sf",
            "body": "I like to say, \"Hey, let me give you my number.\" And then write it on a piece of paper and hand it to them.\n\nThen they look at it and it's just a giant number 4.\n\n99% of friendships start, according to my friend who is a liar, with two people laughing at something stupid.\n\nYou can use a different number, but I highly recommend the number 4 for the following reasons:\n\n* 4 is a boring number that nobody ever chooses as their favorite number, which is why it's the funniest choice. Humor subverts expectations.\n* 4 is a weird-looking number. Just look at it.\n* 4 isn't easily confused with any other letters or numbers.\n* 3 isn't enough anymore. Comedy used to come in threes, but inflation brought it up to 4.\n* 5 is too many and looks like the letter S.\n* 1 can look like an l, or a 7, or just a confusing line on a slip of paper.\n* 6 sounds too much like \"sex.\"\n* 7 is too predictable. Everyone picks 7. Don't pick 7.\n* 8 is slightly funny, but it looks like a B when handwritten.\n* 2 sucks. I'm not going to choose 2 because I hate it.\n* 9 is too odd and, frankly, 9 is a creepy number. I would watch out for anyone who chooses 9.\n* And anything more than 2 digits kills the joke.\n\nThat's why you should use 4, in my experience.",
            "ups": 1551,
            "downs": 0,
            "polarity": -0.12408333333333335,
            "subjectivity": 0.6182500000000001
        },
        {
            "comment_id": "hilu032",
            "body": "My fiancé did this with me. When he met me I was pretty much mentally checked out of wanting to pursue any relationships due to some really screwed up things that had happened in my life so I didn’t actually reach out for like a month. He saw me several times a week at the gym which is where I was working. Always just friendly, short greetings when he arrived and left. Never asked me why I hadn’t texted. Never even brought it up. Coolest customer I ever saw. And even though my head wasn’t on right, I was still really impressed with his confidence. I’d say his patience was very soundly rewarded. And I still think back on that and find myself impressed with the way he behaved towards me, especially now, knowing what he was actually thinking about me 😜 \nHe also happens to be the best thing that’s ever happened to me too so 😊",
            "ups": 884,
            "downs": 0,
            "polarity": 0.25915966386554623,
            "subjectivity": 0.419453781512605
        },
        {
            "comment_id": "hiksfjs",
            "body": "I lost my phone number, could I have yours?",
            "ups": 752,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hikc1ad",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hikd1jq",
            "body": "This tip only works for finding a relationship. How will I know what number to call the mechanic when my car breaks down when he/she only has my number...",
            "ups": 4592,
            "downs": 0,
            "polarity": -0.051851851851851864,
            "subjectivity": 0.762962962962963
        },
        {
            "comment_id": "hils1oq",
            "body": "Scribbling it on bathroom stall walls is a quirky alternative",
            "ups": 334,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilu032",
            "body": "My fiancé did this with me. When he met me I was pretty much mentally checked out of wanting to pursue any relationships due to some really screwed up things that had happened in my life so I didn’t actually reach out for like a month. He saw me several times a week at the gym which is where I was working. Always just friendly, short greetings when he arrived and left. Never asked me why I hadn’t texted. Never even brought it up. Coolest customer I ever saw. And even though my head wasn’t on right, I was still really impressed with his confidence. I’d say his patience was very soundly rewarded. And I still think back on that and find myself impressed with the way he behaved towards me, especially now, knowing what he was actually thinking about me 😜 \nHe also happens to be the best thing that’s ever happened to me too so 😊",
            "ups": 883,
            "downs": 0,
            "polarity": 0.25915966386554623,
            "subjectivity": 0.419453781512605
        },
        {
            "comment_id": "hiksfjs",
            "body": "I lost my phone number, could I have yours?",
            "ups": 749,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hikc1ad",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hikd1jq",
            "body": "This tip only works for finding a relationship. How will I know what number to call the mechanic when my car breaks down when he/she only has my number...",
            "ups": 4587,
            "downs": 0,
            "polarity": -0.051851851851851864,
            "subjectivity": 0.762962962962963
        },
        {
            "comment_id": "hils1oq",
            "body": "Scribbling it on bathroom stall walls is a quirky alternative",
            "ups": 337,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilu032",
            "body": "My fiancé did this with me. When he met me I was pretty much mentally checked out of wanting to pursue any relationships due to some really screwed up things that had happened in my life so I didn’t actually reach out for like a month. He saw me several times a week at the gym which is where I was working. Always just friendly, short greetings when he arrived and left. Never asked me why I hadn’t texted. Never even brought it up. Coolest customer I ever saw. And even though my head wasn’t on right, I was still really impressed with his confidence. I’d say his patience was very soundly rewarded. And I still think back on that and find myself impressed with the way he behaved towards me, especially now, knowing what he was actually thinking about me 😜 \nHe also happens to be the best thing that’s ever happened to me too so 😊",
            "ups": 881,
            "downs": 0,
            "polarity": 0.25915966386554623,
            "subjectivity": 0.419453781512605
        },
        {
            "comment_id": "hiksfjs",
            "body": "I lost my phone number, could I have yours?",
            "ups": 752,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}