{
    "post_url": "https://www.reddit.com/r/politics/comments/qj1qru/its_clear_capitalism_isnt_working_when_us/",
    "time_posted": "2021-10-30 09:42:31",
    "time_now": "2021-10-30 16:48:29",
    "ups": 2501,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hin4dgw",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hinsu25",
            "body": "Seems to be working in Scandinavian countries(ranked higher on the free market index than we are). What’s clear is the Crony capitalism isn’t working",
            "polarity": 0.25,
            "subjectivity": 0.5611111111111111
        },
        {
            "comment_id": "hinsmhn",
            "body": "Republicans!!  Not ‘politicians’. Jfc stop protecting them.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinrrjo",
            "body": "For some, child labor is preferable to encouraging immigration. Or raising the minimum wage",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinrjo7",
            "body": "It works but you need a submissive lower class. Robots could end up being that.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinqwe2",
            "body": "Capitalism isn't working because we've stopped oiling it with appropriate regulation.  Like untempered steel it has become brittle and fragile.  We need to quench the fires of capitalism in the waters of appropriate worker protections.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinqsgq",
            "body": "But China \nIf any of u ACTUALLY think America has “child labor” issues welp - do a little more research and see how our biggest importer of goods ( CHINA ) not only has child labor issues but I’d say more like “child slaves” not even to mention our the actual laborers are treated.\nThere is no OSHA over there.",
            "polarity": 0.13541666666666666,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hinqoc3",
            "body": "I worked at a local warehouse as a forklift operator working with heavy duty truck parts. On the board posted above where we clocked in I saw a letter stating they were now allowed to hire 15 yr. olds to do the same job as 8 older men on our late 20s, early 30s, and 40s were doing and this was almost a year ago. I said screw that and started looking elsewhere for work. I knew that it was meant to also devalue us and keep our wages low. Plus no 15 year old should start destroying their body pulling parts at a warehouse for 10+ hours. They should be enjoying life. That warehouse was a shitshow &amp; a hazardous place to work in anyways.",
            "polarity": 0.06388888888888888,
            "subjectivity": 0.3298611111111111
        },
        {
            "comment_id": "hinqduy",
            "body": "We do have true capitalism though, we have crony capitalism... there’s a difference.",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinqdhf",
            "body": "&gt; It’s clear capitalism isn’t working when US politicians try to bring back child labor\n\nNah.  You're free to move to North Korea though.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.39444444444444443
        },
        {
            "comment_id": "hinqce2",
            "body": "[The mininum working age in Europe is 15.](https://europa.eu/youreurope/business/human-resources/employment-contracts/teenage-workers/index_en.htm)\n\nI worked when I was 15, not because I had to survive I just wanted to buy more games on steam. \"Child labor\" my ass, this sub can be so dramatic, like we're going to have kids up in the coal mines. If teens want to earn an extra buck, let them.",
            "polarity": 0.022222222222222237,
            "subjectivity": 0.4000000000000001
        },
        {
            "comment_id": "hinq9zk",
            "body": "We are living in the modern gilded age. The wealthy found a way to get all the benefits for the work of the lower classes. Who made the most money during covid again?",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hinpvqt",
            "body": "I mean this is what capitalism is. It's the same system that made slavary profitable. There is nothing intrinsically morally correct about Capitalism. In fact, left unchecked, it's very destructive. Governments and society is what determines slavary is illegal, child work is illegal, and that workers deserve benefits. Capitalism would sooner kick all that to the curb",
            "polarity": -0.2989285714285715,
            "subjectivity": 0.4060714285714286
        },
        {
            "comment_id": "hinpf8w",
            "body": "Child labor sounds to me like capitalism is working exactly as intended.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hinpf0g",
            "body": "Actually, capitalism is getting more capitalist if it’s finding cheaper labor.",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hinou3k",
            "body": "The entire government is being ran by democrats. So who exactly is the reason for all of these insane policies and crises? 2022 might be the last chance to fix or at least slow down the destruction.",
            "polarity": -0.21507936507936512,
            "subjectivity": 0.4329365079365079
        },
        {
            "comment_id": "hinokhp",
            "body": "Au contraire. When children are forced into the labor market to enrich capitalists, capitalism is doing *exactly* what capitalism does.\n\nCapitalism is working, right now, at full bore.",
            "polarity": 0.1464285714285714,
            "subjectivity": 0.38392857142857145
        },
        {
            "comment_id": "hinogqb",
            "body": "When u gonna learn?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinoajb",
            "body": "This is a really dumb take and they should feel awful for being this stupid… child labor is really popular where? In China?  Hmmm.",
            "polarity": -0.25833333333333336,
            "subjectivity": 0.7999999999999999
        },
        {
            "comment_id": "hinnxbt",
            "body": "I know hating on capitalism is all the rage, but child labor is very obviously not exclusive to this economic system.  And, just as obviously, you can have a capitalist society without child labor.",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hinnm8a",
            "body": "For me, it was the everything getting worse as time passed, and the whole system shitting the bed every 8-12 years, and the utter destruction of the culture I grew up in, that convinced me that capitalism wasn't working.\n\nTo invoke Norm McDonald, the worst thing about the Cosby wasn't the hypocrisy.\n\nThis isn't the \"it's not working\" territory of an obscure glitch or software bug. One must either admit that our system was maliciously hacked or that it was built with backdoors the whole time. I think we all know it's the latter. Capitalism is an operating system for the dukes and lords, and the more modern fascist ramblers, with a kill switch built in. \"Free markets\" are only tolerated when they drive outcomes the hereditary upper class already wants.",
            "polarity": 0.025000000000000005,
            "subjectivity": 0.5083333333333333
        },
        {
            "comment_id": "hinnfyd",
            "body": "Raising minimum wage won’t do anything as long as people can get paid to stay out of work collecting welfare, unemployment, covid relief, etc. If you had the option to get $30,000 per year doing absolutely nothing being unemployed or make $40,000 employed, which would you choose?",
            "polarity": 0.07500000000000001,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinneyw",
            "body": "Wisconsin is making way too many headlines lately as a testing ground for GOP initiatives. Thank goodness we have Gov. Evers for now but I am really scared for Wisconsin's future.",
            "polarity": 0.1,
            "subjectivity": 0.35625
        },
        {
            "comment_id": "hinmwh3",
            "body": "Wait!  What did I miss? All these (essential) jobs justifiably pay crap wages because they require no skills and are reserved for high school kids, dropouts, and drug addicts.   Are we facing a shortage of these demographics?",
            "polarity": -0.21333333333333335,
            "subjectivity": 0.5466666666666667
        },
        {
            "comment_id": "hinmt98",
            "body": "Grocery store in our town is, \"now hiring 14-16 year olds.\" I guess paying people more is entirely out of the question? Here's how I see it, couples can't make a living off of two incomes due to child care, healthcare, etc. It's better to just say F_it and have one work while the other gets side gigs and cares for the kids. That will create a bigger worker shortage and get the one working partner enough pay to make up for the one staying home?",
            "polarity": 0.10714285714285714,
            "subjectivity": 0.48214285714285715
        },
        {
            "comment_id": "hinlrho",
            "body": "Pollution. Poverty. Child labor. We are living in a Dickens novel.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinlp5m",
            "body": "“We could pay people a living wage. We would still make billions but they might live too. OR, hear me out, we could just hire children.” \n\n“Child laborer it is!”",
            "polarity": 0.17045454545454544,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinljv2",
            "body": "Capitalism is here to stay folks, at least in all of our lifetimes.",
            "polarity": -0.3,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hinl4o3",
            "body": "Where do you think child labor came from? Unfettered capitalism.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hink8ow",
            "body": "Laissez-faire capitalism isn’t working.  We just need to tweak a bit, not throw out the system.  Capitalism is still the best system, even if it isn’t great.",
            "polarity": 0.9,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hink1g8",
            "body": "Looks like Capitalism functioning just perfectly. It's only job is to make money.  It will grind all of us into dust if we let it.  Nothing is sacred, even the children",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hinjnb8",
            "body": "Anything to not pay a real wage. Robots not up and running fast enough… “you know children have the right to work too”…",
            "polarity": 0.22857142857142856,
            "subjectivity": 0.4785714285714286
        },
        {
            "comment_id": "hinjfxv",
            "body": "That’s what they’re there for. Put them to work",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinjduo",
            "body": "I feel like this is oversimplified. Unregulated capitalism surely doesn’t work, regulated seems to work better. Of course you could always make the argument that no matter what deregulation will creep in as a result of capital accumulating. No matter, Europe and Scandinavia in particular seem to still have politicians who serve the people and not their corporations.",
            "polarity": 0.3888888888888889,
            "subjectivity": 0.5740740740740741
        },
        {
            "comment_id": "hinizcn",
            "body": "It never went away.\n\nAgriculture laws permit workers not only below minimum wage, but also down to age ten.\n\nForeign children are frequently enslaved for work.\n\nIt's just not visible to you.",
            "polarity": -0.03611111111111111,
            "subjectivity": 0.3427777777777778
        },
        {
            "comment_id": "hinihbp",
            "body": "Idk I had my first job at 14 and was able to save up enough money to go to Europe when I was 15. Taught me the value of work and saving. Working as a young teenager as a positive thing for me.",
            "polarity": 0.21545454545454543,
            "subjectivity": 0.4807575757575758
        },
        {
            "comment_id": "hini0c8",
            "body": "Those kids will just need to pull themselves up by their Velcro",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinhxmb",
            "body": "“There’s obviously nothing wrong with teenagers getting summer jobs. But there is something very, very wrong with a system that would rather recruit more kids into the workforce instead of paying better wages and providing more benefits to adults. There’s something very wrong with a system where billionaires have seen their net worth balloon during the worst public health crisis in recent memory – and politicians seemingly have no desire to make them pay their fair share in taxes. There’s something very wrong with a system where minimum wage isn’t enough to afford a two-bedroom rental anywhere in the US.”\n\nThis",
            "polarity": -0.06333333333333334,
            "subjectivity": 0.5811111111111111
        },
        {
            "comment_id": "hinhvy0",
            "body": "Seeing the McDonald’s arches is a perfect example. They make crappy food they waste resources they don’t pay their employees living wage provide them with healthcare benefits, and their lobbyists work overtime to weaken worker protection laws. \n\nBut just the fact they make crappy food is enough for me. \n\nAnd they are famous for making crappy food. \n\nUnbelievable. \n\nAnd it says everything that Donald Trump likes them.\n\nFast food is poison",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.6833333333333332
        },
        {
            "comment_id": "hinha9l",
            "body": "McDonald’s workers smoke marijuana",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hingky0",
            "body": "Capitalism is working as intended - fucking over the average joe.",
            "polarity": -0.375,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hingbd6",
            "body": "How does this propaganda misinformation not get locked? Everyone bitching about child labor and capitalism should read the bill….which no one in this thread did.",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hingba4",
            "body": "Well maybe if actually grown adult would get a job instead of being on welfare",
            "polarity": 0.05,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hing58q",
            "body": "Except that none of the changes the article mentions are \"bringing back child labor.\"\n\nThe only new laws are to expand working hours for the ages that could already have jobs.\n\nAnother article designed to prey on your emotions through the headline alone.",
            "polarity": 0.04545454545454545,
            "subjectivity": 0.48484848484848486
        },
        {
            "comment_id": "hinfkee",
            "body": "Employer: \"Thank you for applying for this job!  Now if you'll just--\"\n\nJob Seeker:  \"Hold the fuck up.  I'll need you to fill out this form.\"\n\nEmployer: \"What's this?\"\n\nJob Seeker: \"I'll need your name, address, phone number, and your work history for the past five years complete with salary information.  I'll also need three personal references as well as three references from employees who no longer work here.\"\n\nEmployer: \"That's not how this works--\"\n\nJob Seeker: *slams down cup* \"And you'll need to piss in this cup.\"\n\nEmployer:  \"What?!\"\n\nJob Seeker:  \"I guess you don't need workers very bad.  Thanks for wasting my fuckin time.\"\n\n\nThe working class really needs to jump on this shit and take advantage of the desperation of the owning class, like they've done to us since forever.",
            "polarity": -0.1616049382716049,
            "subjectivity": 0.4339506172839507
        },
        {
            "comment_id": "hinfhjm",
            "body": "But to be fair the USA is a Corporate Oligarchy,..Not a First world Developed Capitalist Nation,.. The biggest waste of US Taxpayers Dollars is paying for the Tax Cuts for the Wealthy and the Corporations and Industry's the wealthy own. But in America people have voted for doing exactly that for Decades,.. Especially the poorly educated  willfully ignorant voters that have been voting themselves and their children and grandchildren out of the middle class and into poverty,...by voting for GOP Union Busting and Tax cut for the Wealthy,Voodoo Economics and Trickle Down and Supply Side Economics Bull $hit Politicians, that are also Pushing \"Tax Cuts for the Wealthy\" Fuckerey,... none of which have ever worked, and that are designed solely to, and only to, Help the Wealthy 2%,. and the Subsidy Sucking,Tax Evading, Union Busting, Worker Abusing, Wage Suppressing and Benefit Stealing Corporations and Businesses the Wealthy 2% own. And by simply eliminating the earnings Cap on Social Security,.. And Raising the Minimum Wage up to the $22.00 it should already be at,. if it had kept pace with the COL. That would get 98% of US Citizens on the way to Prosperity again fairly quickly. But as the world knows the GOP/GQP will only work to save Billionaires a Dollar, Or to give More Tax Cuts to the Wealthy and Corporations...the only Americans the GOP is actually concerned about. The GOP has screwed American family's... and every Worker in the United States of America out of All the Benefits that every other First world Developed Nation on earth has,.. Because Americans keep voting for the GOP Anti Union and \"Voodoo Economics \" Bull $hit\" pushing politicians..",
            "polarity": 0.194537037037037,
            "subjectivity": 0.573478835978836
        },
        {
            "comment_id": "hineh1m",
            "body": "Counterpoint: This is capitalism working as intended, it’s just that the locus of power has shifted from employers to employees for the first time since, I don’t know, the Black Death.",
            "polarity": 0.04166666666666667,
            "subjectivity": 0.3833333333333333
        },
        {
            "comment_id": "hinecrn",
            "body": "We need to start protesting this and make it harder for a child to work.  Let me rephrase that. We need to make it harder for corporations to hire children.  They fucked us adults already . We can't let them do that to the future generations.",
            "polarity": -0.2,
            "subjectivity": 0.20625
        },
        {
            "comment_id": "hine902",
            "body": "Is it also clear that we don't really have a democracy? When 2 senators can tank the will of 81 million, when Wyoming has as much senate power as California or New York, it kinda makes the whole democracy thing seem like a sad farce. Yeah, Jan. 6th was a threat to our democracy, but that \"democracy\" has been trash for a long time.",
            "polarity": -0.01420454545454545,
            "subjectivity": 0.44223484848484845
        },
        {
            "comment_id": "hindrzw",
            "body": "\"Capitalism isn't working\" is one framing. The way it should be put is that Capitalism is *winning.* This is what the system wants. Immiserated worker-cogs who start early and know they'll never retire.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.3833333333333333
        },
        {
            "comment_id": "hinculj",
            "body": "The issue is capitalism isn’t a form of government. If we legislate a living wage, like the minimum wage at its inception, had a public healthcare option and mandatory vacation time… We’d look a lot more like our allies who have figured it out. \n\nIn the US it seems whenever we mention this approach it’s met with outcries of socialism/communism, going after the “job creators,” and that these are jobs only meant for teenagers. That’s despite the average age being in the mid to late 30’s IIRC. \n\nLabor is labor and the unions that arose out of the original Fordist compromise knew this. It was generally viewed as unskilled labor. In the 1940s that meant a house, healthcare, and a pension. \n\nMy how far we’ve come…",
            "polarity": 0.06388888888888888,
            "subjectivity": 0.5351851851851852
        },
        {
            "comment_id": "hinclzn",
            "body": "I say let them have the 14 and 15 year old work those shifts, with the caveat that they must be paid 20x their normal hourly rate for the hours between 7pm and 11pm. Either the business really needs these kids to keep their business running and will pay it or they are just cheap aholes exploiting kids that are probably living in poverty.\n\nAnd the whole thing of 14 and 15 year olds needing to work is disgusting anyways...they should never be in a position where they are expected to work outside the home just to basically make ends meet, but that's a whole other discussion on top of this one.",
            "polarity": 0.04772727272727273,
            "subjectivity": 0.4431818181818182
        },
        {
            "comment_id": "hinck2f",
            "body": "Capitalism is and was the driving force of economic development over the last 200 years, capitalism is great.\n\nHowever, you need to put checks on capitalism as a government and provide things like healthcare, education and other things that don't make money or would be too expensive while being basic human rights.\n\nA healthy mix of socialism and capitalism is the best way, however most americans still think socialism = communism so scary and bad.",
            "polarity": 0.0979166666666667,
            "subjectivity": 0.4402777777777778
        },
        {
            "comment_id": "hincjne",
            "body": "The lack of nuance in our conversations is reflective of our slide into Idiocracy.\n\nParts of capitalism are a very powerful engine: it elevated the US to be the greatest power in the world for a time and gave it's citizens the highest quality of life per capita ... for a time.\n\nCapitalism also is inherently exploitative and tends to eat itself as it strives to transfer as much wealth from the bottom to the top.\n\nThat doesn't mean the system doesn't work. It means the system needs to be highly regulated to stay within reasonable bounds.\n\nAll the Scandinavian countries that currently have the happiest populations and incredible social safety features are ALSO CAPITALIST. They just don't let the corporations dictate the quality of life.",
            "polarity": 0.2518939393939394,
            "subjectivity": 0.5631060606060606
        },
        {
            "comment_id": "hinbds5",
            "body": "Have they tried paying the one guy at the top leas and everyone else a bit more?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinb5fl",
            "body": "Child labor is a sign that capitalism is working quite well. Antitrust laws are being pretty much ignored. Collective bargaining and unionization is the lowest has been in decades. Income inequality is thriving. Billionaires have increased their wealth by 70% in the last year and a half. All signs of a healthy capitalistic system. We’ll be back into the golden age of capitalism, The Guilded Age, in no time.",
            "polarity": 0.15476190476190474,
            "subjectivity": 0.34761904761904766
        },
        {
            "comment_id": "hinavni",
            "body": "Bottom line is that if you want better wages, maybe think bigger than McDonald’s.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinattj",
            "body": "&gt;Over the summer school board members in the Waukesha school district made headlines after they voted to leave a federal free meals program because they worried it made it easy for families to “become spoiled” or develop an “addiction” to the service. Imagine if kids became addicted to the government ensuring they didn’t starve, eh?\n\nThis is at the core of why the wealthy don't like government. In their minds they fund all of government and it all goes to spoilt poors who can't afford it on their own. \n\nIf those poors take too much of a liking to government and government services they are sure to keep voting for tax increases so that more services can be provided. \n\nThe wealthy would provide that the government do three basic things. Protect their wealth, promote their business interests, and protect them personally against their own actions. \n\nIt's amazing how this message is being parroted at school board meetings now and is taking food from kids mouths to protect the accumulated wealth of a few.",
            "polarity": 0.30238095238095236,
            "subjectivity": 0.6605158730158731
        },
        {
            "comment_id": "hinajss",
            "body": "Commies, you’ll never win. Go to China a be a slave. We don’t want this mess.",
            "polarity": -0.2875,
            "subjectivity": 0.2875
        },
        {
            "comment_id": "hinaflt",
            "body": "What’s old is new again. Gilded Age 2.0, woo!\n\nLet’s just hope another Progressive Era follows this one, too.",
            "polarity": 0.13522727272727272,
            "subjectivity": 0.32727272727272727
        },
        {
            "comment_id": "hin9khq",
            "body": "i wish more people were talking about this insane turn of events",
            "polarity": -0.25,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hin9294",
            "body": "Government interfering with the labor market on behalf of the employers is corruption.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin8z17",
            "body": "How many miles of employees who needed and or what to keep their jobs were fired for trivial matters over the last few years? Many employers have petty by managerial structures that penalize employees for being seconds late to work, using one too many sick days in a arbitrarily decided window of time, not wearing a uniform perfectly, etc. Now that employers need people suddenly things need to change.yet for year employers have treated workers as disposable. Dictated hours, dictated wardrobes, dictated hair styles, etc while refusing to commit to pay raises, health benefits, etc. It must change. If employers are going to attract millions back to work the abusive nature of employment where the threat of being fired and or being unable to pay ones bills will need to end. Employees aren't disposable trash that should consider themselves blessed to just to have a job. Employers aren't demigods who deserve public adoration.",
            "polarity": 0.05274725274725275,
            "subjectivity": 0.4454212454212454
        },
        {
            "comment_id": "hin7l1f",
            "body": "I’m on a road trip rn. I went to Burger King yesterday and they had to close the place down right after we ordered because there was only one employee on shift. He had to  take orders and then go cook the food. It took way longer than normal and I didn’t mind one bit. If I had to eat the apples the I packed instead of fries I would not have cared a bit. I hope these workers keep quitting. Force a change.",
            "polarity": 0.07003968253968253,
            "subjectivity": 0.6186507936507937
        },
        {
            "comment_id": "hin77qg",
            "body": "But china has child labor and it's  communist.  India has child labor and it's mostly socialist. So where do we go?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hin73xe",
            "body": "No, this is clearly capitalism working. This is what capitalism is.",
            "polarity": 0.10000000000000002,
            "subjectivity": 0.3833333333333333
        },
        {
            "comment_id": "hin6vcl",
            "body": "Nonsense, it's capitalism by definition. Capitalism exploits everything it can to make the most money off of finite resources without regard for anything else. **That's the intended goal. That's the mission**. Until very recently [they were completely open about this](https://en.wikipedia.org/wiki/Friedman_doctrine). What's not working is *our government* in its *regulation of capitalism*.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.44166666666666665
        },
        {
            "comment_id": "hin6dta",
            "body": "Well the alternative is paying workers more and we can't have that now can we?! /s",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hin6c7t",
            "body": "I thought they were going to turn to automation?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin505q",
            "body": "It was clear the current version of capitalism isn't working when they started selling you on \"trickle Down\".",
            "polarity": -0.01851851851851852,
            "subjectivity": 0.3574074074074074
        },
        {
            "comment_id": "hin4ji4",
            "body": "*Child labor isn't the plan. A.I. do the jobs is the plan.*",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hin4dgw",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hin7l1f",
            "body": "I’m on a road trip rn. I went to Burger King yesterday and they had to close the place down right after we ordered because there was only one employee on shift. He had to  take orders and then go cook the food. It took way longer than normal and I didn’t mind one bit. If I had to eat the apples the I packed instead of fries I would not have cared a bit. I hope these workers keep quitting. Force a change.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.07003968253968253,
            "subjectivity": 0.6186507936507937
        },
        {
            "comment_id": "hin505q",
            "body": "It was clear the current version of capitalism isn't working when they started selling you on \"trickle Down\".",
            "ups": 1,
            "downs": 0,
            "polarity": -0.01851851851851852,
            "subjectivity": 0.3574074074074074
        },
        {
            "comment_id": "hinattj",
            "body": "&gt;Over the summer school board members in the Waukesha school district made headlines after they voted to leave a federal free meals program because they worried it made it easy for families to “become spoiled” or develop an “addiction” to the service. Imagine if kids became addicted to the government ensuring they didn’t starve, eh?\n\nThis is at the core of why the wealthy don't like government. In their minds they fund all of government and it all goes to spoilt poors who can't afford it on their own. \n\nIf those poors take too much of a liking to government and government services they are sure to keep voting for tax increases so that more services can be provided. \n\nThe wealthy would provide that the government do three basic things. Protect their wealth, promote their business interests, and protect them personally against their own actions. \n\nIt's amazing how this message is being parroted at school board meetings now and is taking food from kids mouths to protect the accumulated wealth of a few.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.30238095238095236,
            "subjectivity": 0.6605158730158731
        },
        {
            "comment_id": "hin6dta",
            "body": "Well the alternative is paying workers more and we can't have that now can we?! /s",
            "ups": 1,
            "downs": 0,
            "polarity": 0.625,
            "subjectivity": 0.5
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hin4dgw",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hinattj",
            "body": "&gt;Over the summer school board members in the Waukesha school district made headlines after they voted to leave a federal free meals program because they worried it made it easy for families to “become spoiled” or develop an “addiction” to the service. Imagine if kids became addicted to the government ensuring they didn’t starve, eh?\n\nThis is at the core of why the wealthy don't like government. In their minds they fund all of government and it all goes to spoilt poors who can't afford it on their own. \n\nIf those poors take too much of a liking to government and government services they are sure to keep voting for tax increases so that more services can be provided. \n\nThe wealthy would provide that the government do three basic things. Protect their wealth, promote their business interests, and protect them personally against their own actions. \n\nIt's amazing how this message is being parroted at school board meetings now and is taking food from kids mouths to protect the accumulated wealth of a few.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.30238095238095236,
            "subjectivity": 0.6605158730158731
        },
        {
            "comment_id": "hin7l1f",
            "body": "I’m on a road trip rn. I went to Burger King yesterday and they had to close the place down right after we ordered because there was only one employee on shift. He had to  take orders and then go cook the food. It took way longer than normal and I didn’t mind one bit. If I had to eat the apples the I packed instead of fries I would not have cared a bit. I hope these workers keep quitting. Force a change.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.07003968253968253,
            "subjectivity": 0.6186507936507937
        },
        {
            "comment_id": "hin505q",
            "body": "It was clear the current version of capitalism isn't working when they started selling you on \"trickle Down\".",
            "ups": 1,
            "downs": 0,
            "polarity": -0.01851851851851852,
            "subjectivity": 0.3574074074074074
        },
        {
            "comment_id": "hin6dta",
            "body": "Well the alternative is paying workers more and we can't have that now can we?! /s",
            "ups": 1,
            "downs": 0,
            "polarity": 0.625,
            "subjectivity": 0.5
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hin4dgw",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hinattj",
            "body": "&gt;Over the summer school board members in the Waukesha school district made headlines after they voted to leave a federal free meals program because they worried it made it easy for families to “become spoiled” or develop an “addiction” to the service. Imagine if kids became addicted to the government ensuring they didn’t starve, eh?\n\nThis is at the core of why the wealthy don't like government. In their minds they fund all of government and it all goes to spoilt poors who can't afford it on their own. \n\nIf those poors take too much of a liking to government and government services they are sure to keep voting for tax increases so that more services can be provided. \n\nThe wealthy would provide that the government do three basic things. Protect their wealth, promote their business interests, and protect them personally against their own actions. \n\nIt's amazing how this message is being parroted at school board meetings now and is taking food from kids mouths to protect the accumulated wealth of a few.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.30238095238095236,
            "subjectivity": 0.6605158730158731
        },
        {
            "comment_id": "hin7l1f",
            "body": "I’m on a road trip rn. I went to Burger King yesterday and they had to close the place down right after we ordered because there was only one employee on shift. He had to  take orders and then go cook the food. It took way longer than normal and I didn’t mind one bit. If I had to eat the apples the I packed instead of fries I would not have cared a bit. I hope these workers keep quitting. Force a change.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.07003968253968253,
            "subjectivity": 0.6186507936507937
        },
        {
            "comment_id": "hin505q",
            "body": "It was clear the current version of capitalism isn't working when they started selling you on \"trickle Down\".",
            "ups": 1,
            "downs": 0,
            "polarity": -0.01851851851851852,
            "subjectivity": 0.3574074074074074
        },
        {
            "comment_id": "hin6dta",
            "body": "Well the alternative is paying workers more and we can't have that now can we?! /s",
            "ups": 1,
            "downs": 0,
            "polarity": 0.625,
            "subjectivity": 0.5
        }
    ]
}