{
    "time_posted": "2021-10-30 11:00:00",
    "url": "https://www.youtube.com/watch?v=-BB6q34RQIQ",
    "time_now": "2021-11-04 20:19:14",
    "ups": "648",
    "downs": "173",
    "views": "62852",
    "top_comments": [
        {
            "comment": "I'm afraid in some cities, masks will never go away, because, Hey, after all, its the safe and nice thing to do. Eventually I will literally move outta Los Angeles just because of the masks. I hate them so much",
            "likes": 4,
            "number_of_replies": 1,
            "polarity": -0.020000000000000007,
            "subjectivity": 0.7
        },
        {
            "comment": "Not the jab. Lol.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "comment": "Florida now has the LOWEST number of Covid cases in the US ... but you won't hear that on NBC \"news\". And what did Florida do? Not much, Florida's Governor let people have freedom, live their lives and makes their own choices. \nNBC is nothing but a Democrat owned propaganda outlet.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1340909090909091,
            "subjectivity": 0.45
        },
        {
            "comment": "I (like most people) never got sick, never had symptoms ... and yet I have the anti-bodies. And like many people, even though my natural immunity is STRONGER than your vaccine, I'm being forced to take the vaccine or lose my job thanks to tyrant Democrats.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.04761904761904761,
            "subjectivity": 0.4428571428571429
        },
        {
            "comment": "NBC = poison / propaganda / brainwashing",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.1
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I said from day one I’d never get this virus. And i still stand by what i said. Don’t care for these vaccines either, don’t need them. I also never took any flu vaccine. Yet i keep healthy and all these people taking shots keep getting sicker and more worried.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Maybe the makers of the vaccine and the ones in government have made enough millions.",
            "polarity": 0.0,
            "subjectivity": 0.5
        }
    ]
}