{
    "time_posted": "2021-10-30 11:00:00",
    "url": "https://www.youtube.com/watch?v=-BB6q34RQIQ",
    "time_now": "2021-11-02 02:23:52",
    "ups": "540",
    "downs": "124",
    "views": "51138",
    "top_comments": [
        {
            "comment": "Once the masses stop believe in mass psychogenic illnesses and start believing in more useful things such as for the elites and powers that be to drop dead, the crisis will go away, and no new one will appear for a few decades.🤔🤔🤪🤪",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.055303030303030326,
            "subjectivity": 0.32575757575757575
        },
        {
            "comment": "Longest two weeks ever!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Remove fauci’s vocal chords!  His whining bothers me",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The scamdemic is finally slowing down",
            "polarity": -0.07777777777777779,
            "subjectivity": 0.6444444444444445
        },
        {
            "body": "Yawn",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The only problem is you don't know if you got a cold later you don't know if you got the flu you don't know if it's the flu virus or you if it's the covid-19 they can basically take their pic in the hospital they could either put you down now or say that you have the regular flu it's basically up to the hospital if you live or die it's like the lottery as soon as they pull that oxygen off of you you're good as dad because they just fed the disease it was in your lungs all that oxygen made it grow rampantly and about 2 weeks later they take the oxygen away from you guess what you die I seen it happen over and over",
            "polarity": 0.010101010101010097,
            "subjectivity": 0.43322649572649574
        },
        {
            "body": "Yeah number one finances for America is pharmaceutical yeah the more people sick the more money they make",
            "polarity": 0.09523809523809523,
            "subjectivity": 0.6190476190476191
        },
        {
            "body": "I like the way they got all these people have no clue what's going on or they just hiding behind politics let's line up all these people for the the flu shot which never helped anybody anyhow I everybody ever known that took the flu shot got sick everybody I ever known got the flu shot ended up sick I never took the flu shot guess what I never got sick",
            "polarity": -0.6357142857142858,
            "subjectivity": 0.8178571428571428
        },
        {
            "body": "Ain't nobody immune to this virus this virus is going to act just like the flu every year it's going to change and every year we're going to have to take a shot that's the only way we're going to stay alive if we take the shot yeah you know the covid-19 flu shot is untested unfounded yeah you might survive the first 18 months to the year but what is it going to do to your kids you know next generation nobody knows because this stuff is still untested",
            "polarity": 0.0875,
            "subjectivity": 0.4333333333333333
        },
        {
            "body": "Wtf it’s not a bad thing. How they make it seem is crazy",
            "polarity": -0.25,
            "subjectivity": 0.8555555555555555
        },
        {
            "body": "Why?????  Because all the sheep are finally waking up and realizing this had all been one big government joke. I can't wait for the collapse of American government. Good times ahead!!",
            "polarity": 0.25,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "Sounds like you MSM nut jobs are disappointed!! Let’s go Brandon!!!",
            "polarity": -1.0,
            "subjectivity": 0.75
        },
        {
            "body": "Other",
            "polarity": -0.125,
            "subjectivity": 0.375
        }
    ]
}