{
    "time_posted": "2021-10-30 11:00:00",
    "url": "https://www.youtube.com/watch?v=-BB6q34RQIQ",
    "time_now": "2021-10-31 05:04:57",
    "ups": "355",
    "downs": "72",
    "views": "30747",
    "top_comments": [
        {
            "comment": "Masks inhibit air flow into and out of the lungs.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "time to release the next variant if numbers are dropping",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Americans are happy that US Covid deaths are down to 1,300 per day. New Zealand's total Covid deaths over 20 months is 28.\r\nAmericans must be embarrassed that they have 46 times New Zealand's 20 month total EVERY DAY!",
            "polarity": 0.15286195286195287,
            "subjectivity": 0.6163299663299664
        },
        {
            "body": "AMERICAN PANDEMIC & ANTI-VAXXERS ARE AN INTERNATIONAL JOKE.\r\nPopulation:      US 333M       NZ 5M   American population is 66 times larger than New Zealand. \r\nCovid deaths:  US 766,117   NZ 28    American Covid deaths is 27,361 times larger than New Zealand.\r\nWTF:                 US parents protest about?         A: 184 school shootings in 10 years                B: Masks.",
            "polarity": -0.025252525252525256,
            "subjectivity": 0.32323232323232326
        },
        {
            "body": "Because even though not everyone is vaccinated, everyone is vaccinated. The effects of vaccination spread to all people, like it does with flu shots.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Isnt it the present regime in Maharashtra incompetent and a failure but ensures that unconstitutional methods of restricting common people are gaining ground.  Not allowed to travel by local train, unconstitutional orders that goes against the freedom of movement in a democracy and behaving like a dictatorship by forcing vaccine compulsory for travelling by local train. Even in BEST Buses, the drivers and conductors at their whims and fancies are not STOPING at bus stops, putting passengers at hardship and wait of 1 to 2 hours, though these buses are purchased from taxes paid by all the common man who uses these.  Also, at APMC Market, one has to wait for 1 to 2 hours before a BEST Bus stops that too due to traffic jam.  Common man are put at hardship in a democracy because no one voices grievances due to lack of knowledge.  Any Govt. failure is known by the methods they use.\n\nAlso, in such Covid-19 situations, instead of increasing buses to a destination, BEST has curtailed the 504 and 506 to Deonar Bus Stand instead of running up to Vadala Station, this too is a repressive step by MVA Govt.  Seem nobody at the helm of affairs has an idea about the GROUND SITUATION, that is turning from bad to worse, due to such unconstitutional orders passed and behaving like a dictatorship.",
            "polarity": -0.01885964912280702,
            "subjectivity": 0.3557017543859649
        },
        {
            "body": "Because it's not time for the primary yet.",
            "polarity": 0.4,
            "subjectivity": 0.5
        },
        {
            "body": "time to release the next variant if numbers are dropping",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Because people are waking up. Also they are more sick from being bs'd than from Covid.",
            "polarity": -0.10714285714285715,
            "subjectivity": 0.6785714285714286
        },
        {
            "body": "Masks inhibit air flow into and out of the lungs.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "what kind of question is this",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "According to MSNBC, We all have higher chances of Covid-19 if we VOTE in Texas, South Dakota or Florida. We are all safe from Covid-19 if we VOTE in California or, New York. Covid-19 Has nothing to do with your health. Just what state you vote in..",
            "polarity": 0.29545454545454547,
            "subjectivity": 0.48484848484848486
        },
        {
            "body": "Are you paid??",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I have not ,busnesses in India Army ore in Hong  Kong.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "But the Hepatitis,Tuberculosis,Conjunctivitis,is Contagious . Was well yours hands to do not H ..S",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We put in Prison the Criminaks from NHS in case they have Monkey busnesses.We study,biology in Secondary School.",
            "polarity": -0.175,
            "subjectivity": 0.15
        },
        {
            "body": "we do not maje Malpractice.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I wonder why? Illegals are coming in by the hundred thousands. Could it be that all of this is bull?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"Wear your mask again\" \n\nNO! The elites aren't wearing theirs so I'm not wearing one!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}