{
    "time_posted": "2021-10-30 11:00:00",
    "url": "https://www.youtube.com/watch?v=-BB6q34RQIQ",
    "time_now": "2021-11-01 01:40:16",
    "ups": "474",
    "downs": "110",
    "views": "42589",
    "top_comments": [
        {
            "comment": "Well, for me it's cuz I made myself immune quite easily.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.43333333333333335,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment": "Because no ones getting tested.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "COVID is surging in Europe.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Get them all agent orange as soon as possible.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Same reason they dropped down in the 3 previous waves your geniuses!  Stop promoting Lord Fauci mandates!!",
            "polarity": -0.16035879629629626,
            "subjectivity": 0.19351851851851853
        },
        {
            "body": "It would be a disaster for democrats if we get covid under control",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "YT bans any information that contrary to *big brothers* doctors. This includes information that has be fact checked by the governments of the world.\n*Big Brother is doing something behind your back they don't want you to know*\nWeb search *Wuhan/FDA bat coronavirus funding* for the actual documents they are trying to hide.",
            "polarity": -0.08,
            "subjectivity": 0.19999999999999998
        },
        {
            "body": "Didn’t it drop before every wave?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "COVID is surging in Europe.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Because no ones getting tested.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As a vaccinated person I must say my vaccine status doesn’t defy who I am or what I stand for. Terminating the working class from employment is basically taking out the back bone of America. It’s an complete violation of constitutional rights and establishing authoritarianism throughout the country. While it’s still imposing freedom of choice being- get vaccinated or find a new job. People like front line workers, police, nurses, ems and even soldiers choose not to get it. Studies from Yale university show that over 78% of front line workers don’t work for the pay but for the protection of their fellow Americans. The vaccine isn’t a “vaccine” it’s more of an suppressant that prevents having the full effects of COVID only at a 97% effective rating. Which still means those with full vaccination including the booster still can pass COVID around. Even after 3/4/5 shots you can still get COVID and transfer it an individual just as much as a person who hasn’t received a shot at all. People with religious exemptions still face termination even with proof. It’s very un divine and radical that when you go to the Supreme Court you place your hand on the Bible and tell “GOD” you will tel the truth. But that’s doesn’t apply to these factors apparently. America is digging its own whole it’s disgusting, dividing your own country Turning your people against each other, steering false information through News causing propaganda .",
            "polarity": 0.11306818181818186,
            "subjectivity": 0.5114772727272727
        },
        {
            "body": "Well, for me it's cuz I made myself immune quite easily.",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Proof that this pand*mic is framed is in Africa, there the health system is much much worse than anywhere else in the world and number of vac**ated people is extremely low, there should be millions of dead people, but that is not happening",
            "polarity": -0.20000000000000004,
            "subjectivity": 0.4333333333333333
        },
        {
            "body": "this virus is very dangerous, take care",
            "polarity": -0.78,
            "subjectivity": 1.0
        },
        {
            "body": "We have so many unknowns around the world there’s gonna another surge in the winter just like last year with delta plus variant on going but this time in the us Italy Brazil Germany Russia and others we don’t need to worry about that right now because this pandemic could be the endemic everybody hitting the booster shot the kids should be vaccinated and 64 million people needs to be vaccinated or the covid surge in the winter comes again please be careful your fully vaccinated you still might get covid you need to get booster",
            "polarity": 0.17142857142857143,
            "subjectivity": 0.5255952380952381
        }
    ]
}