{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qi1t1p/lpt_you_are_not_responsible_for_other_peoples/",
    "time_posted": "2021-10-28 21:42:31",
    "time_now": "2021-10-30 16:51:02",
    "ups": 1964,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "higjkh0",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hikkhm8",
            "body": "Pretty sure I have alot to do with my daughters self esteem.",
            "polarity": 0.375,
            "subjectivity": 0.9444444444444444
        },
        {
            "comment_id": "hik8z36",
            "body": "“Screw those with low self-esteem! Just say what you want! You’re not responsible for the pain you cause.”",
            "polarity": -0.05,
            "subjectivity": 0.42500000000000004
        },
        {
            "comment_id": "hik3x25",
            "body": "Cool, I'm allowed to act however I want and as cruel as I want and if anyone objects it's their fault for not being confident enough.",
            "polarity": -0.037500000000000006,
            "subjectivity": 0.7458333333333333
        },
        {
            "comment_id": "hijtt4m",
            "body": "LPT being toxic AF again... What a total waste this sub has become.",
            "polarity": -0.1,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hijoupn",
            "body": "Got any other stupid LPTs OP?",
            "polarity": -0.46249999999999997,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hijo6aj",
            "body": "This just sounds toxic imo and is part of the problem with society today. So no I won’t be following this “tip” \n\nIt’s called being respectful and empathetic towards others that I guess most people have thrown out the window these days. 🤷‍♀️ \nNo no and no again and if you disagree with me that’s fine I get it I’m just saying.",
            "polarity": 0.3541666666666667,
            "subjectivity": 0.44999999999999996
        },
        {
            "comment_id": "hij7jue",
            "body": "Ok, so confident people dont give a damn about anything. Thats weird. Are they actually alive?",
            "polarity": 0.15,
            "subjectivity": 0.6833333333333333
        },
        {
            "comment_id": "hiinn73",
            "body": "as someone who maxed out confidence: We do care, just not much. The trick is to not completely ignore it, but also don't get too distracted by it",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "hiim3bt",
            "body": "This is doodoo advice. How is this any different than just \"lmao, stop being depessed, just smile?\" If a person is lacking self confidence, and their whole world is agreeing with them I doubt its as easy as, \"just be confident\"",
            "polarity": 0.33888888888888885,
            "subjectivity": 0.6277777777777779
        },
        {
            "comment_id": "hiigdgs",
            "body": "This kind of thinking is confusing to me. Does OP genuinely believe that caring about the well-being of others is a problem? You may not be able to completely control someone else's self esteem, bust as social creatures, you can have a mild to extreme impact and you should care about how your words and actions affect others.",
            "polarity": 0.19270833333333334,
            "subjectivity": 0.5489583333333333
        },
        {
            "comment_id": "hiig3si",
            "body": "If a friend or a lover has self esteem issues, it is your responsibility.  Friends fix each other.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiig2jd",
            "body": "You shall be baned for life in hell for expressing such heresy against reddit's moral code.",
            "polarity": 0.0,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hii9mo0",
            "body": "People that pointlessly mention how much money they make and how much sex the have are douchebags though.",
            "polarity": 0.05000000000000001,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hii963l",
            "body": "Op : \"Tact and empathy are for weak people\"",
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hii9460",
            "body": "Picking each other up from time to time is part of being human. Yes. True self confidence is something you have to find within yourself. I agree. But if you have an established relationship with someone asking them for some extra support or giving it is not weakness",
            "polarity": 0.056249999999999994,
            "subjectivity": 0.30625
        },
        {
            "comment_id": "hii8fw3",
            "body": "Actually confident people will care that someone mentioned their high salary while they make less, because then they'll ask for a raise or look for better opportunities",
            "polarity": 0.24833333333333335,
            "subjectivity": 0.485
        },
        {
            "comment_id": "hii65ii",
            "body": "This is phrased very badly. What you should encourage is *not to base your self-esteem on what other people think of you*. While I agree self-esteem comes from within, it's not so simple.",
            "polarity": -0.45875,
            "subjectivity": 0.649702380952381
        },
        {
            "comment_id": "hii5gj0",
            "body": "I mean that said there's nothing actually wrong about caring about other people and trying to be polite to them.\n\nAlso \"confident people\" can care about all sorts of things, sometimes. You're discussing confidence like it's a permanent absolute with no wiggle room. I can like a person and care about their opinion of me and it doesn't mean I have absolutely no confidence.\n\nThis feels like you're bitching about other LPTs which suggest polite ways to act with people. If you were a confident person, you wouldn't feel this urge to write this counter-LPT to them.",
            "polarity": -0.030555555555555558,
            "subjectivity": 0.7212962962962962
        },
        {
            "comment_id": "hii4o58",
            "body": "This feels a lot like a really reductionist way of saying “do what you want and be how you want and to hell with how it affects people around you”.\n\nIt makes me actually very sad that this post got so many upvotes, but I suppose that’s Reddit. This advice literally serves no purpose other than to excuse unkind people for being unkind.",
            "polarity": -0.025,
            "subjectivity": 0.425
        },
        {
            "comment_id": "hii2mbt",
            "body": "We're a naturally social species. We look towards others for self-assurance and insight. Your self-esteem is greatly tied towards your interactions with others. And sure, you can build it up on your own but it's likely not going to improve without positive human interaction. \n\nThat's not to say you should be overly sensitive and not let negative things people say roll off your shoulders sometimes, but it is misguided to believe that others don't have a direct impact on self-esteem.",
            "polarity": 0.20606060606060606,
            "subjectivity": 0.6051010101010101
        },
        {
            "comment_id": "hii2ge8",
            "body": "WTF! We all have responsibility in building and maintaining each others self-esteem. Confident people didn't get confident by themselves, they had positive reinforcement during their lives. A auto-confident person will most likely have a diagnosis. Ofc the opposite where a person purely get confidence through external validation is equally problematic. As most things in life, it is all about balance",
            "polarity": 0.16514167650531286,
            "subjectivity": 0.5511019283746557
        },
        {
            "comment_id": "hihzjso",
            "body": "Narcissists and sociopaths are so briming with confidence that they seek social gratification by taking advantage of other people much like in the scenarios you described. Your advice in this LPT needs to acknowledge limits to confidence as too much equates to lack of empathy for others.",
            "polarity": 0.07708333333333334,
            "subjectivity": 0.21041666666666664
        },
        {
            "comment_id": "hihyq09",
            "body": "[What Katt Williams thinks of Self-Esteem](https://youtube.com/shorts/V20wVTtOMGo?feature=share)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hihxvdn",
            "body": "Suggested caveat: this applies to adults. I’d say you are responsible for your kids’ self esteem, at least in part.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.47500000000000003
        },
        {
            "comment_id": "hihvhjf",
            "body": "This should be balanced by “If your criticism does not help somebody improve, and instead makes them want to stop you have failed as a critic”\n\nA genuine comment should not tear down self esteem, because the comment shouldn’t be destructive nor should the esteem be so fragile it breaks at a small wind",
            "polarity": -0.18425925925925926,
            "subjectivity": 0.4314814814814815
        },
        {
            "comment_id": "hihuqso",
            "body": "&gt;Confident people will not care if you think their laugh is funny.\r  \nConfident people will not care that you mentionned your high salary while they make less.\r  \nConfident people will not care that you have a lot of sex and they don't.\r  \nConfident people will not care that you made fun of something they love.\r  \nConfident people will not care that you dislike what they like.\n\nOn the flipside, confident people don't need to do any of those things.\n\nIf your confidence and self-esteem hinges on what you have that others don't, then it's not confidence or self-esteem at all. It's all just a crutch.",
            "polarity": 0.34939393939393937,
            "subjectivity": 0.6066666666666666
        },
        {
            "comment_id": "hihrzyw",
            "body": "Confidence and self esteem are not the same thing. You can have one without the other.",
            "polarity": -0.0625,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hihrq60",
            "body": "But, as it turns out, sociopaths also have high self esteem.\n\nIt's important that they know their worth, certainly. \n\nIt's empathy though, knowing other's worth and treating them as you or they would want to be treated is what's really important. Within reason. \n\nBut yes most of that was fairly true, people are different, can't always take things too seriously when others simply express an opinion or just absolutely hate something you like. It happens. We're all a little different. We're all a little the same. \n\nSome people are on a different wavelength.\n\nSome people are fucking square waves.",
            "polarity": 0.020576441102756898,
            "subjectivity": 0.5518546365914787
        },
        {
            "comment_id": "hihpheo",
            "body": "Yes. The best way o can put this is it's the same as the oxygen masks on an airplane. You have to make sure you're all good first so you're capable of helping and being good with others",
            "polarity": 0.47857142857142865,
            "subjectivity": 0.4638888888888889
        },
        {
            "comment_id": "hihm494",
            "body": "This is a shitty LPT, from the perspective of an asshole. Whether or not you are “responsible” for other people’s self-esteem (which you aren’t), that doesn’t mean be an asshole because confident people won’t care. Not everyone is confident. That doesn’t mean tiptoe around everyone, it means don’t be an asshole.",
            "polarity": 0.075,
            "subjectivity": 0.6611111111111111
        },
        {
            "comment_id": "hihm40w",
            "body": "Dumb shit like this post.",
            "polarity": -0.2875,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hihk0xo",
            "body": "I completely agree with this, but it is also one of those things that are so much easier said than done and also don't take into account individual circumstances. It is orders of magnitude easier to be confident when you are not prone to be depressed or had an okay childhood. While it is certainly your own responsibility to fix a broken self-esteem, it absolutely doesn't mean you should do that completely on your own. If you need help, get help, the sooner the better.",
            "polarity": 0.21552197802197803,
            "subjectivity": 0.599404761904762
        },
        {
            "comment_id": "hihhr62",
            "body": "Agreed it’s not your responsibility for someone else’s self esteem but you can influence it.\nYou can look for opportunities to build someone up and avoid opportunities to knock them down/ make fun of their mistakes. \nPeople who appear confident aren’t always sure of themselves.  It’s not a fixed state like shoe size.",
            "polarity": 0.3125,
            "subjectivity": 0.5305555555555556
        },
        {
            "comment_id": "hihgc6m",
            "body": "LPT, don't be a douchebag to those around you then blame them for not being confident enough.",
            "polarity": 0.25,
            "subjectivity": 0.6666666666666667
        },
        {
            "comment_id": "hihct5f",
            "body": "Hard lesson for me but worth it.",
            "polarity": 0.004166666666666652,
            "subjectivity": 0.3208333333333333
        },
        {
            "comment_id": "hihb17h",
            "body": "Invest in yourself. Not only financially but also with time and others. Self value is the best value. If they don't invest in you back, invest in yourself.",
            "polarity": 0.25,
            "subjectivity": 0.325
        },
        {
            "comment_id": "hih705v",
            "body": "If this is true. Why do words supposedly hurt?",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hih3pp6",
            "body": "My self esteem was completely eradicated by my mother since my childhood. She was 100% responsible for my low self esteem.\n\nNow that I’m a much older adult, my sled esteem is much better because of age and experience. However, it will never reach its potential because even though wounds heal, but scars stay there forever.",
            "polarity": 0.15238095238095237,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "higyxqe",
            "body": "Good post for r/CourtesyProTips",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "higuj4a",
            "body": "That being said, I you're intentionally trying to bring down other's self esteem, YOU have a problem and need to see a therapist.",
            "polarity": -0.14027777777777778,
            "subjectivity": 0.3319444444444445
        },
        {
            "comment_id": "higt4vu",
            "body": "This is total BS. While you are not responsible for other people's emotions you are responsible for doing harm, causing pain, assaulting, attacking, being a shitty horrible person.\n\nThis queen needs to get psychiatric help.",
            "polarity": -0.205,
            "subjectivity": 0.645
        },
        {
            "comment_id": "higqbx5",
            "body": "Having self-esteem without the encouragement of a peer group is very difficult.",
            "polarity": -0.65,
            "subjectivity": 1.0
        },
        {
            "comment_id": "higpy51",
            "body": "Thanks for the tip!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "comment_id": "higokdx",
            "body": "Confident people this... \n\nConfident people that... \n\nIt's worth noting however that confident does not necessarily equal right. And confident does not necessarily equal loving. \n\nIn a genuine loving relationship among friends, spouses, parents (towards their children), ideas, dreams, values are exchanged and shared. \n\nSomeone constantly berating, belittling a person's dreams can certainly take a toll in a relationship that is supposed to be loving--we're all human. (Most of us at least!)\n\nBest solution in that case: get away from that relationship, or avoid such relationships like the plague!",
            "polarity": 0.30694444444444446,
            "subjectivity": 0.531878306878307
        },
        {
            "comment_id": "higoglo",
            "body": "Dont worry about your confidence. Do things you like around people who respect you and be considerate of others but not to your own detriment.\n\nDon’t spend time with people who don’t respect you. Don’t make yourself small if the people around you treat you poorly. Don’t treat other people poorly. Make friends slowly. Leave acquaintanceships quickly if they don’t make you feel good. Beware of fast relationships/friendships, they don’t give you time to figure out how the person is going to treat you in the long run.\n\nIf someone who is unkind to you or has friends who are unkind to you says anything at all about your self-esteem, run.",
            "polarity": 0.030833333333333324,
            "subjectivity": 0.5475
        },
        {
            "comment_id": "hignvqo",
            "body": "I see a lot of posts along these lines and this is easily one of the best. Very well said and good for you for addressing both sides, and not just the one people will want to hear.",
            "polarity": 0.5833333333333333,
            "subjectivity": 0.5083333333333333
        },
        {
            "comment_id": "hignc7l",
            "body": "This is just a list of excuses for being rude.",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "higmy5l",
            "body": "Thanks for the advice you massive piece of shit, your feelgood collective of obvious hallmark dribble disguised as advice leaves that bad karma-whore taste in my mouth.\nIs this braindead insight targeting the braindead?\n\nEither way it would be mighty ironic if this comment affected your esteem in any way.",
            "polarity": -0.01428571428571426,
            "subjectivity": 0.7095238095238096
        },
        {
            "comment_id": "higmoj3",
            "body": "The first step for me was deleting Facebook.",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "higjkh0",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "higokdx",
            "body": "Confident people this... \n\nConfident people that... \n\nIt's worth noting however that confident does not necessarily equal right. And confident does not necessarily equal loving. \n\nIn a genuine loving relationship among friends, spouses, parents (towards their children), ideas, dreams, values are exchanged and shared. \n\nSomeone constantly berating, belittling a person's dreams can certainly take a toll in a relationship that is supposed to be loving--we're all human. (Most of us at least!)\n\nBest solution in that case: get away from that relationship, or avoid such relationships like the plague!",
            "ups": 350,
            "downs": 0,
            "polarity": 0.30694444444444446,
            "subjectivity": 0.531878306878307
        },
        {
            "comment_id": "higqbx5",
            "body": "Having self-esteem without the encouragement of a peer group is very difficult.",
            "ups": 99,
            "downs": 0,
            "polarity": -0.65,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hih3pp6",
            "body": "My self esteem was completely eradicated by my mother since my childhood. She was 100% responsible for my low self esteem.\n\nNow that I’m a much older adult, my sled esteem is much better because of age and experience. However, it will never reach its potential because even though wounds heal, but scars stay there forever.",
            "ups": 77,
            "downs": 0,
            "polarity": 0.15238095238095237,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "higmoj3",
            "body": "The first step for me was deleting Facebook.",
            "ups": 53,
            "downs": 0,
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "higjkh0",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "higokdx",
            "body": "Confident people this... \n\nConfident people that... \n\nIt's worth noting however that confident does not necessarily equal right. And confident does not necessarily equal loving. \n\nIn a genuine loving relationship among friends, spouses, parents (towards their children), ideas, dreams, values are exchanged and shared. \n\nSomeone constantly berating, belittling a person's dreams can certainly take a toll in a relationship that is supposed to be loving--we're all human. (Most of us at least!)\n\nBest solution in that case: get away from that relationship, or avoid such relationships like the plague!",
            "ups": 348,
            "downs": 0,
            "polarity": 0.30694444444444446,
            "subjectivity": 0.531878306878307
        },
        {
            "comment_id": "higqbx5",
            "body": "Having self-esteem without the encouragement of a peer group is very difficult.",
            "ups": 97,
            "downs": 0,
            "polarity": -0.65,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hih3pp6",
            "body": "My self esteem was completely eradicated by my mother since my childhood. She was 100% responsible for my low self esteem.\n\nNow that I’m a much older adult, my sled esteem is much better because of age and experience. However, it will never reach its potential because even though wounds heal, but scars stay there forever.",
            "ups": 75,
            "downs": 0,
            "polarity": 0.15238095238095237,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "higmoj3",
            "body": "The first step for me was deleting Facebook.",
            "ups": 55,
            "downs": 0,
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "higjkh0",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "higokdx",
            "body": "Confident people this... \n\nConfident people that... \n\nIt's worth noting however that confident does not necessarily equal right. And confident does not necessarily equal loving. \n\nIn a genuine loving relationship among friends, spouses, parents (towards their children), ideas, dreams, values are exchanged and shared. \n\nSomeone constantly berating, belittling a person's dreams can certainly take a toll in a relationship that is supposed to be loving--we're all human. (Most of us at least!)\n\nBest solution in that case: get away from that relationship, or avoid such relationships like the plague!",
            "ups": 351,
            "downs": 0,
            "polarity": 0.30694444444444446,
            "subjectivity": 0.531878306878307
        },
        {
            "comment_id": "higqbx5",
            "body": "Having self-esteem without the encouragement of a peer group is very difficult.",
            "ups": 98,
            "downs": 0,
            "polarity": -0.65,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hih3pp6",
            "body": "My self esteem was completely eradicated by my mother since my childhood. She was 100% responsible for my low self esteem.\n\nNow that I’m a much older adult, my sled esteem is much better because of age and experience. However, it will never reach its potential because even though wounds heal, but scars stay there forever.",
            "ups": 75,
            "downs": 0,
            "polarity": 0.15238095238095237,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "higmoj3",
            "body": "The first step for me was deleting Facebook.",
            "ups": 50,
            "downs": 0,
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ]
}