{
    "time_posted": "2021-10-30 11:00:01",
    "url": "https://www.youtube.com/watch?v=1ZCvjb6TqgI",
    "time_now": "2021-10-30 16:46:03",
    "ups": "4790",
    "downs": "133",
    "views": "160572",
    "top_comments": [
        {
            "comment": "He admits it to France/the world but not his own country of his mishaps. Thats all you need to know",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.6,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "If we lie to the government they put you in prison when they lie to all of us it's called being a politician",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democrats know there never out of a race because ultimately they control how the race is ran.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Well, I like politics but with living proves I learnt how to HATE CORRUPTED POLITICIANS that they only learn how to manipulate the Constitution, peoples needs and rights, to the press, ....Politicias are the US biggest VIRUS!!!!!!! and sadly the JUSTICE SYSTEM is soo BROKEN that they don't want to do nothing to put all these guys behind bars for good!",
            "polarity": -0.13214285714285712,
            "subjectivity": 0.6571428571428571
        },
        {
            "body": "Thanks again, Joe Biden….the gift that keeps on giving 🤦🏽‍♀",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "How much has Facebook and social media helped the Republican Party in the Virginia race?. Voting has never been fair in America and is much worse with social media. \n\nI'll be surprised if a.i let's my comment be seen",
            "polarity": 0.1111111111111111,
            "subjectivity": 0.45555555555555555
        },
        {
            "body": "FOX WITH MORE BS =FAKE NEWS",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "And if Trump would have made that deal , what would u be saying ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Watch out!  The other hand! Another distraction!",
            "polarity": -0.1953125,
            "subjectivity": 0.375
        },
        {
            "body": "stupidly doesn’t differentiate ✔️",
            "polarity": -0.7999999999999999,
            "subjectivity": 1.0
        },
        {
            "body": "John Kerry, making sure it's the democrat sweep Delaware, Maryland and Virginia, while Joe is in UK.",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "Refuse to work! stop paying taxes",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Biden to Macron: \"What we did was clumsy\" - Biden & Macron meet after [AUKUS] submarine dispute",
            "polarity": -0.3,
            "subjectivity": 0.4
        },
        {
            "body": "Biden has really accomplish something guys! Jimmy Carter is celebrating because he’s no longer the worst President we’ve ever had!",
            "polarity": -0.375,
            "subjectivity": 0.6
        },
        {
            "body": "The dims are cunning, stupid but cunning.\nFjb",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "How could McAuliffe win with everything that's known about him. His obvious hatred for parents and those disgusting false tactics. The only way he pulls this off is the same tactic used to get that potato in the WH.",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.6041666666666666
        },
        {
            "body": "So idiot taxpayer hating richard is celebrating wasteful spending?",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "It's just another scamming Bill to scam people out of money more tax dollars that's all it is they want to keep the inflation high keep the fuel costs high keep the control of people traveling in place they don't want nobody traveling because that's why they got the fuel fuel costs so high so it's all about control and power",
            "polarity": 0.24500000000000002,
            "subjectivity": 0.53
        },
        {
            "body": "IM SO TIRED IF MY “SUPERIORS” TELLING ME I JUST DONT UNDERSTAND!!! OUR OWN PERSONAL IDIOT WE REFER TO AS PRESIDENT IS ABLE TO DISCUSS IT WITH EVERYONE HE WANTS, THE TOTAL FAILURE OF HIM TO KNOW THIS WAS GOING TO HAPPEN WITH FRANCE JUST SHOWS THE COMPLETE FAILURE OF THE “PROGRESSIVE” POSITION ON EVERYTHING THEY TOUCH!!! THEY DONT SEE HOW WHAT THEY DO AFFECTS OTHERS, AND WORSE THEY DONT CARE.",
            "polarity": -0.13785511363636366,
            "subjectivity": 0.5340909090909091
        },
        {
            "body": "He admits it to France/the world but not his own country of his mishaps. Thats all you need to know",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "His whole time in government has been CLUMSY",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.4
        }
    ]
}