{
    "time_posted": "2021-10-30 11:00:01",
    "url": "https://www.youtube.com/watch?v=1ZCvjb6TqgI",
    "time_now": "2021-10-31 13:18:31",
    "ups": "8413",
    "downs": "221",
    "views": "330293",
    "top_comments": [
        {
            "comment": "The Lincoln project exposed for the desperate attempt to pose as racist supporters  with tiki torches\nBecause Virginia is going to the GOP how desperate they are.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.6,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Yeap, clowns are clumsy!",
            "polarity": -0.375,
            "subjectivity": 0.4
        },
        {
            "body": "The Lincoln project exposed for the desperate attempt to pose as racist supporters  with tiki torches\nBecause Virginia is going to the GOP how desperate they are.",
            "polarity": -0.6,
            "subjectivity": 1.0
        },
        {
            "body": "McAuliffe down 8 points to Youngkin. I think we'll find out this week whether Democrats resort to mass cheating if McAuliffe wins. In fact, that observation stands if from here on out Democrats win all their important races, and just enough to keep the balance of power forever in their favor.",
            "polarity": 0.2688888888888889,
            "subjectivity": 0.47777777777777775
        },
        {
            "body": "Lets go Brandon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The incompetent Kerry clumsily apologizing for Clumsy Joe: \"He literally didn't know about it.\" What incompetence!",
            "polarity": -0.3416666666666666,
            "subjectivity": 0.3888888888888889
        },
        {
            "body": "They are both not worth the sh*t on my shoes",
            "polarity": -0.15,
            "subjectivity": 0.1
        },
        {
            "body": "Ford is a has been in Tennessee. Why is he on Fox?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Noooooo more spending.  American Rescue Plan was not for us and this won’t help us either.  We don’t want this.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "I wish there was some way we could apologize to the French for this  betrayal but not the only one suffering by this corrupted communist Democrat government I feel so sorry for them",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Passing the buck again. Never Biden's fault.  He's an idiot",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "Does anyone believe that Joe is the president of the USA? I don't think so.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You, Gowdy, are part of that hate. You stabbed us in the back. Now you want to be in media!",
            "polarity": -0.4,
            "subjectivity": 0.45
        },
        {
            "body": "God help us fight the evil which has taken over the democrats.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I haven't heard the phrase ,\" balance the federal budget\". Since President Reagan.    This whole Biden administration must be smoking Crack with Hunter.   Myself and 80 million people have had enough.",
            "polarity": 0.1,
            "subjectivity": 0.45
        },
        {
            "body": "The French were not delivering the subs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Clumsy is as nice as you can say about our ignorant repulsive administration",
            "polarity": 0.15,
            "subjectivity": 0.7
        },
        {
            "body": "Harold, why would Younkin bring in Trump?  He doesn't need him.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Are they making politics so disgusting that we stop paying attention  .I mean this stuff will give you heath problems (heart attack ,stroke)and the only thing we can do I live our lives and enjoy our hobbies and family.i just wished that we could trust our leaders to do the right thing.idk any more!",
            "polarity": 0.019225417439703137,
            "subjectivity": 0.6747448979591837
        },
        {
            "body": "Is our host stupid? The US didnt break a deal with France, Australia did. France is pissed off cuz the US offered a better product. Who the hell wants a new diesel sub in the 21st century?",
            "polarity": 0.007272727272727287,
            "subjectivity": 0.41090909090909095
        },
        {
            "body": "Clowns usually are clumsy",
            "polarity": -0.275,
            "subjectivity": 0.325
        }
    ]
}