{
    "time_posted": "2021-10-30 11:00:01",
    "url": "https://www.youtube.com/watch?v=1ZCvjb6TqgI",
    "time_now": "2021-10-31 21:32:49",
    "ups": "8947",
    "downs": "229",
    "views": "352139",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "The creepy Democrat makes my skin crawl. I like Juan at least he smiles when he lies.",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "treason. refresh the Tree of Liberty.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democrats are scum.",
            "polarity": -0.3,
            "subjectivity": 0.4
        },
        {
            "body": "Why can't we do something? Sue the president, stop paying taxes, the people vs the IRS! Don't let them get in their buildings! We need to stop this and we need to stop them NOW!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What a embarrassment to the US! Stupid clown thinks hes the duly elected president! LOL",
            "polarity": -0.09999999999999992,
            "subjectivity": 0.85
        },
        {
            "body": "Why do we have laws we're going to apologise for? --- answer: this regime is crap.",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "That sign in the thumbnail would be hilarious at a Matt Gaetz rally",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "No one wants anything those toolbags say",
            "polarity": 0.2,
            "subjectivity": 0.1
        },
        {
            "body": "To hell with all they want to pass its all garbage",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We have a totally incompetent administration in power.  Joe Biden is a total embarrassment to our country",
            "polarity": -0.175,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "Paying illegal immigrants half million to sneak across the border it’s probably written in this bill but we’ll never know because the Republicans are too stupid to read it anyways",
            "polarity": -0.4888888888888889,
            "subjectivity": 0.5555555555555555
        },
        {
            "body": "I want  money",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why can't  he give  Americans  money  Biden making  my nerves  bad",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Can I give up by citizenship and get this money, this is so evil and a slap in the face on us hard working Americans who made this country,CLOSE THE BORDER., get it",
            "polarity": -0.6458333333333334,
            "subjectivity": 0.7708333333333333
        },
        {
            "body": "I miss Trey...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kerry and Jane Fonda are  both traitors....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Biden and dems are bringing America down, a third rate country, dont pass this garbage, debt increase crap",
            "polarity": -0.31851851851851853,
            "subjectivity": 0.362962962962963
        },
        {
            "body": "Fox you should bE exposing everything about the Lincoln project,  who is involved , monies coming in Ect... But you don't and wil not do any reporting on them.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Tomorrow, Monday, as many as 20% of Firemen, Police, EMT, Garbage collectors will quit, fired, walk off in NYC.\nAll it takes for all this to change is government leave people alone... imagine that, success by doing nothing.. to people.",
            "polarity": 0.4,
            "subjectivity": 0.25
        }
    ]
}