{
    "time_posted": "2021-10-30 11:00:01",
    "url": "https://www.youtube.com/watch?v=1ZCvjb6TqgI",
    "time_now": "2021-11-03 07:14:20",
    "ups": "10653",
    "downs": "271",
    "views": "451460",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Repent the day of the Lord is at hand! Escape the wrath that is to come!!\nDid you know the bible says most people are going to Hell? There is a narrow road to get to Heaven and very few find it? Why is this? Because we are dead in trespasses and unable to have full revelation of the bible and God’s will for our lives. We need the merciful gift from God of regeneration. This is where God brings us to life and leads us to repentance and the turning away from a life of sin and leads us to accept him as our Lord and Savior. We become servants of Christ rather than slaves of sin. The bible says unless a man be born again he will not enter the Kingdom of Heaven. The bible says we must examine ourselves to be sure we are in the faith! Is your eternity assured? Have you been reborn from above? I pray today that you will ask the Holy Spirit to regenerate you, teach you his word, and lead you to him if he hasn’t already. \nTitus 3:5 - Not by works of righteousness which we have done, but according to his mercy he saved us, by the washing of regeneration, and renewing of the Holy Ghost;\nMatthew 19:28 And Jesus said unto them, Verily I say unto you, That ye which have followed me, in the regeneration when the Son of man shall sit in the throne of his glory, ye also shall sit upon twelve thrones, judging the twelve tribes of Israel. 29And every one that hath forsaken houses, or brethren, or sisters, or father, or mother, or wife, or children, or lands, for my name's sake, shall receive an hundredfold, and shall inherit everlasting life But many that are first shall be last; and the last shall be first.\n\nIf you continue in my word you are my disciple indeed\nGive thanks in everything for this is the will of God concerning you\nI will bless the Lord at all times his praise shall continually be in my mouth\nPraying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints;",
            "polarity": 0.10821428571428571,
            "subjectivity": 0.3549206349206349
        }
    ]
}