{
    "time_posted": "2021-10-30 11:00:01",
    "url": "https://www.youtube.com/watch?v=1ZCvjb6TqgI",
    "time_now": "2021-11-02 06:30:53",
    "ups": "10372",
    "downs": "268",
    "views": "435511",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Where Is Greta Thunberg? \r\n\r\nIt seems as though the world is on the fast lane toward cleaning the car industry from polluting emissions. Everyone is rushing to create clean cars, whether battery or hydrogen powered engines, and bask in their cleanness.\r\nBut the green alibi hides behind it a dirty truth: Zero emission does not mean zero pollution. Mining rare Earth materials required for zero-emissions engines, building charging stations, and the complex logistics surrounding the “clean” industries will take a heavy toll on Earth. In the end, the only ones who will gain from the “clean revolution” are the tycoons who are selling it to us, and the government officials who placate them for their own reasons.\r\nWhere is Greta Thunberg these days? Like the rest of the pawns in the battle for wealth and power, the “climate knights” have sent her back to oblivion once they finished using her. It is all power games among giant corporations, but the environment and the climate are no one’s concern.\r\nEven if we switch to wind energy or ocean-wave energy, I don’t believe that we will gain much. We will have to pay for it elsewhere.\r\nFor this reason, I think that the crux of the problem is not emissions, but our behavior toward nature and toward our fellow human beings. Here is where we can produce positive and lasting results. If we could communicate with one another positively, we could stop the madness of excessive development that manufactures unnecessary and harmful products.\r\nIf we could slow down a bit, we wouldn’t need to burn so much fuel in order to defeat competitors in a race for wealth that makes no one happy. Only if we realize that our happiness depends on the quality of our relationships, and not on the padding of our bank accounts, we will be able to pause a little, think, and rebuild our civilization in a way that contributes to nature, to humanity, and to each of us.",
            "polarity": 0.0739246632996633,
            "subjectivity": 0.5830765993265993
        },
        {
            "body": "You know times are bad when the French pulls there ambassador",
            "polarity": -0.3499999999999999,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "IT WAS NOT SET IN STONE SUBMARINE DEAL AUSTRALIA AND FRANCE. FRENCH HAVING A DUMMY FIT",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Selling your soul France, don’t believe any of the smokescreen,  back away and take care of your country,",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Ketchup man should have departed with disgrace John Edwards. This is where he make his fatal mistake staying on with his stupidity. . 🕊🌬💨",
            "polarity": -0.6,
            "subjectivity": 1.0
        }
    ]
}