{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-31 09:11:58",
    "ups": "2415",
    "downs": "55",
    "views": "76222",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 71,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "mommy anna payo ko lang po wag po kayo masyadong ma conscious sa stretch marks nyo kasi it's part of motherhood. wala pong masama sa pagkakaron ng ganyan. Tsaka you're body po is not yet recovered po. almost a month palang po since nung nanganak kayo. Better to be more conscious sa baby nyo po muna and have more time to take care of him. Just a reminder lanh po hehe. Prone pa po kasi tayo sa post partum depression at baka mabinat po kayo yun din kasi kasabihan nh matatatanda eh. di naman masama maniwala wala pong mawawala. Concern lang po hehe.",
            "likes": 12,
            "number_of_replies": 0,
            "polarity": 0.34,
            "subjectivity": 0.5
        },
        {
            "comment": "Can relate to. Lumabas stretchmarks ko nung ma lapit na akong manganak. I'm proud of my tiger stripes kasi my beautiful baby naman ako.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.825,
            "subjectivity": 1.0
        },
        {
            "comment": "Relate na relate ako ms anna. 😂 first 3 months namin ni baby grabe ka hirap. Cs pa ako. Tapos 1week lang ung leave ni hubby from work. Then ako lang mag isa sa bahay. Tapos iyakin pa c baby. Walang tulugan. Pag umiiyak c baby sinasabayan ko na din.😂 dumarating na ako sa point na umiiyak sya nakatitig nalang ako sakanya. Andun ung pagod. Ung walang tulog. Feeling ko nag iisa lang ako. Ayaw nya pababa. Gusto karga lang. Gang ngaun iyakin pa din baby ko. Haha 1 year and 4months na sya.😊 peru di Ko nagkaron nang stretch mark. Cguro kasi ang liit lang nang tummy ko tapos 37weeks and 1day nanganak ako. Laban ms anna kayang kaya mu yan. ❤",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.225,
            "subjectivity": 0.31666666666666665
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Parang hinde yata nawawala ang stretch marks, maglilighten lang🤗",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Its nice to have time for ur self.. ingat lang po sa tnatawag nlang benat o binat.. kya hinay hinay po kau.. Godbless ur whole family!❤❤❤",
            "polarity": 0.4,
            "subjectivity": 0.7
        },
        {
            "body": "Naalala ko tuloy nung umiiyak na ako in the middle of the night .nasabi ko talagang di ko na kaya kasi mag isa lang ako LDR kami ni hubby. Pero kaya niyo yan.. mapapangiti ka nalang sa mga alaala . Promise !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i know ate anna doing her best but hands down kay daddy Geloy kasi nandyan sya todo support . naiisip parin nya na ilabas ka or idate kahit konting oras . binibigyan ka ng konting time para sa sarili mo . bihira lang ang ganyang mga lalaki kaya salute kay daddy boss G 🥰 . i love your growing family 😍😍😍",
            "polarity": 0.4481481481481482,
            "subjectivity": 0.3962962962962963
        },
        {
            "body": "Iba na talaga kapag may bata tsaka pag toddler na yan mas stress pa ang life he he he",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Basta wag kang ma stress thats part of marriage and having a new born baby normal tlga yan dnt worry lahat nagdaan dyan ang masasabi ko lang . CONGRATS! AND WELCOME TO OUR WORLD! 👏👏👏👏😋 PAG NALAGPASAN MO YAN YESSS TAYO LANG MALAKAS! 💪👍😂",
            "polarity": 0.44128787878787873,
            "subjectivity": 0.6681818181818181
        },
        {
            "body": "May point si Jelo. Nasanay kayu na dalawa lang kayo:). Then bigla may pangatlo na. It will get easier :). Sa youngest ko, di ako pinapatulog sa gabi i am lucky if i can get a decent 2 hrs sleep lol. Then during the day i have to clean,cook and take care of a toddler as well while my youngest is crying because he always wanted to be held. Being a mom is like a 24/7 job. Hang in there guys! Later masanay kana mapuyat and u will embrace na lagi ka mapupuyat. Hang in there:)",
            "polarity": 0.31875,
            "subjectivity": 0.725
        },
        {
            "body": "Nag smoke po si geloy? Delikado po kay baby.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}