{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-31 00:58:29",
    "ups": "1852",
    "downs": "44",
    "views": "51924",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 44,
            "number_of_replies": 3,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Swerte mo pa din anna meron ka katulong.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "SALUTE to all moms🎉 napaka swerte talaga ni miss ana cay maraming tumutulong sa pag alaga ung iba moms lahat na sa kanila linis laba alaga..aha kaya natin yan mga mommies we are the real hereos❤️ esp single moms mabuhay kau🎉🎉🎉",
            "polarity": 0.0642857142857143,
            "subjectivity": 0.2571428571428572
        },
        {
            "body": "Thank you miss ana, nireready na din namin yung sarili namin hahaha",
            "polarity": 0.2,
            "subjectivity": 0.4
        },
        {
            "body": "Can relate to. Lumabas stretchmarks ko nung ma lapit na akong manganak. I'm proud of my tiger stripes kasi my beautiful baby naman ako.",
            "polarity": 0.825,
            "subjectivity": 1.0
        },
        {
            "body": "💎 🥰 🤗",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Your preggy journey and my preggy journey are just months apart.  I appreciate the realness and the things I can expect post partum.  Puyat is real soon for us too.  Take care.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "I understand you sissy. First time mom , first three months ni baby yan pinakamahirap. I was in your situation before hirap ako lalo na magisa lagi ako kami lang ni baby nagaalaga kay baby dito ako aa US . Malayo family namin kaya ako tlaga. Just hold on lang sissy ..",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "You're doing great sizzy, boss G too! Hugs to Alexei. 😊",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "San po nabili ung white bed nia ung cocona po b un",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Girl, take some maternity leave. I’m sure your followers would  understand if you took some time off to focus on your new life. It’ll be good for your mental health.",
            "polarity": 0.3090909090909091,
            "subjectivity": 0.5358585858585859
        },
        {
            "body": "Kapag may toddler kana, duon mo ma realize na mas mhirap ang may toddler. 😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wait, talaga bang may gap sa gilid ng ipin ni Anna o ganyan na siya?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Struggle is real po talaga sa bagong baby.. Pero bilib pari  ksi nakkapagvlog ka parin Ms Anna.. 😊Godbless sa family👨‍👩‍👦😊",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        }
    ]
}