{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-31 17:25:44",
    "ups": "2727",
    "downs": "63",
    "views": "94863",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 82,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Dami nagsasabi kay Ms Anna ng kesyo mag maternity leave, ang employees naman kasi kahit naka-leave may income. Syempre kapag business pag di kayo gumalaw nganga kayo.\nTsaka syempre as a new mom, adjustment din talaga yan, syempre keeping a part of your routine from your previous life helps din sa mental health, like bilang magasawa magdate pa din, magself care pa din. Hindi naman pagiging masamang magulang kung may gawin din para sa sarili.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": -0.043434343434343436,
            "subjectivity": 0.2737373737373738
        },
        {
            "comment": "Iwasan niyo na po muna mglabas2 kasi mabibinat kayo & may covid weak lungs oa c baby.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "comment": "Take a break muna sa work ms.anna. kaya nga may maternity leave. Mabilis lang ang panahon. Mamimiss mo rin na ganyang phase ng baby. And swerte nga kayo dami nyo pwedeng mahingian ng tulong pagdating sa mag aalaga. Karamihan dito walang helper na kasama. Tapos nakakalabas p kayo ng wala si baby. Tiis tiis lang.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Most of my stretch mark paid away after a year.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "May napanood ako sa youtube lanbena stretch mark/scar remover may serum, gel at cream  mura lang effective daw pwd i try mo sa pwet muna habang fresh pa marks mo.",
            "polarity": 0.44999999999999996,
            "subjectivity": 0.65
        },
        {
            "body": "3:43 uyy is that a Sehun shirt I see",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Same yung stretch marks sa may legs ko, pero eventually nawala nalang sya mga 1 month or so di na sya visible.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Stretchmarks specially caused by pregnancy is the best trophy of a mother.. a reminder of a wonderful gift sent by heaven",
            "polarity": 0.7857142857142857,
            "subjectivity": 0.6238095238095238
        },
        {
            "body": "Di pa ako mommy pero ok lang kaya yun parang ang busy na ni ate Anna sa work? Andami nya errands. Hehe",
            "polarity": 0.3,
            "subjectivity": 0.4
        },
        {
            "body": "Take a break muna sa work ms.anna. kaya nga may maternity leave. Mabilis lang ang panahon. Mamimiss mo rin na ganyang phase ng baby. And swerte nga kayo dami nyo pwedeng mahingian ng tulong pagdating sa mag aalaga. Karamihan dito walang helper na kasama. Tapos nakakalabas p kayo ng wala si baby. Tiis tiis lang.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dami nagsasabi kay Ms Anna ng kesyo mag maternity leave, ang employees naman kasi kahit naka-leave may income. Syempre kapag business pag di kayo gumalaw nganga kayo.\nTsaka syempre as a new mom, adjustment din talaga yan, syempre keeping a part of your routine from your previous life helps din sa mental health, like bilang magasawa magdate pa din, magself care pa din. Hindi naman pagiging masamang magulang kung may gawin din para sa sarili.",
            "polarity": -0.043434343434343436,
            "subjectivity": 0.2737373737373738
        }
    ]
}