{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-30 20:51:56",
    "ups": "1578",
    "downs": "34",
    "views": "44557",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 34,
            "number_of_replies": 2,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Employee Working mom gets to take maternity leave for 3 months… pwede rin siguro sa Youtuber-moms 😅 mabilis lang paglaki ng newborn baby kaya every moment counts. hopefully you and Boss G gets to adjust soon",
            "likes": 9,
            "number_of_replies": 2,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Imagine yung mga new moms na hindi sing well off nila in terms of pang bayad sa kasambahay and walang luxury ng tulong sa magulang.",
            "likes": 2,
            "number_of_replies": 1,
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "comment": "Take a break sa work po,saglit lang yan lalaki din si baby at 1 day mapapaisip ka nalang ang bilis lumaki ng bata.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Just be careful and take care of your self din po need nyo din ng rest. Mahirap po mabinat. (bawal maulan ang bagong panganak po)",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Kayang kaya Anna and Jeloy...Ganyan  talaga kapag may baby nasa adjustment period  pa kayo.Ingat plagi and keep safe  always.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Ang bless ko talaga sa baby ko hindi siya nagpapuyat promise since first day iingit lang siya kapag gutom na pagkabigay ng milk tulog agad siya siguro kasi hindi ko siya sinanay na buhat since first day",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "That’s normal. All moms go thru that phase na puyatan. Ung tipong everyday lutang ka na but u still have to take care of the baby. Kaya mo yan!🙏🏼 also ung sa rashes ni baby, nagkaganyan din ung NB ko before. We didnt do anything as per pedia, nawala nalang siya ng kusa.",
            "polarity": -0.02500000000000001,
            "subjectivity": 0.625
        },
        {
            "body": "Take care of yourself po . Mhirap po labanan ang postpartum,  maglalagas pa po yang hair nyo. . Kapit lng po. Gnyan po tlga kpg may newborn . Puyat at pagod . Mswerte nlng din po kyo at may katulong po kyosa pg aalaga kay baby.\nNaku sulitin nyo po yang stage na yan. Nakakamiss po yan 😊",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fighting lng sisz!💪🏻 Struggle is real ktulad ni Simply Rhaze FTM.🙌🏻😍",
            "polarity": 0.1,
            "subjectivity": 0.3285714285714286
        },
        {
            "body": "Kaya niyo yan Ate. Ako nga tatlo na anak ko, 6 years old, 3 years old and 2 months old. Puro pa sila boys. Take note, wala silang yaya, ako lang at na-CS ako sa bunso ko. Isabay mo pa ang modules nila Kuya at work at home. Enjoy the moment kahit sobrang nakakapagod. God bless you and your Fam. ❤️😇\n\n-Mommy Ken of Ilocos ❤️",
            "polarity": 0.17500000000000002,
            "subjectivity": 0.275
        },
        {
            "body": "Imagine yung mga new moms na hindi sing well off nila in terms of pang bayad sa kasambahay and walang luxury ng tulong sa magulang.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "hi sis  im a mom of 3. sana po hindi mamahay si baby x. since mas madalas sya sa pasig, i think nmamahay sya kaya d sya comfortable sa condo. same dun sa 2nd daughter ko sa in laws ko behave sya pero sa house nmin hbdi sya nkakatulog ng maayos",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.30833333333333335
        },
        {
            "body": "Hi momsh...Same po Tayo nga stretch marks Andyan talaga sa thigh part Marami...pero kunting kunti lng sa tiyan ko...Kahit among ginawa ko Hindi na talaga nawala...😁😁 Hope po mawala yang stretch marks na nasa inyu ...Laban lng momsh...God Bless sa family...Lalo na Kay baby X...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "hi ATE anna try to use BIO oil... legit po un ^_^ mawala stretch marks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "anlala ng stretch mark mo ate anna 😱 sana matanggal yan.. 🥺",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "💜💜💜",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just be careful and take care of your self din po need nyo din ng rest. Mahirap po mabinat. (bawal maulan ang bagong panganak po)",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "You are doing great mommy anna! 😘\nJust utilize all the help you are getting.. it’s not easy but you can do it!!!",
            "polarity": 0.28841145833333326,
            "subjectivity": 0.7916666666666667
        },
        {
            "body": "ayan yung memories nyo kay baby as a parent madami  talaga kayong pagdadaanan kay baby but lahat ng yan worth it naman. Keep safe always God bless.",
            "polarity": 0.4,
            "subjectivity": 0.3
        },
        {
            "body": "Take a break sa work po,saglit lang yan lalaki din si baby at 1 day mapapaisip ka nalang ang bilis lumaki ng bata.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}