{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-11-02 06:31:02",
    "ups": "3271",
    "downs": "85",
    "views": "125993",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 96,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Be very cautious with smokers. Smoke may stay in the clothes and skin for many hours and lingers even in the walls etc. and not good for newborns. Maybe Geloy can consider quitting for the sake of the baby.",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.11666666666666665,
            "subjectivity": 0.46666666666666673
        },
        {
            "comment": "Slowdown, focus and enjoy motherhood..take the recommended 2-3 months to fully recuperate and nourish your baby 🙂",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Nakuw buti may katulong ka pa mas napapagaan trabaho. Hahahahaa... lalo na cguro kung kau lang ni geloy nasa bahay. Tpos magluluto mglilinis ng bahay magllba.😂😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dont worry po dami ko rin stretch mark sa legs at tyan maglilight din xa at invisible pag matagal na po kahit hindi e laser naging invisible na rin bandang legs ko",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "First time ko malaman you can get stretchmarks sa legs when you get pregnant. I used to think sa tummy lang. Thanks for sharing, AC!",
            "polarity": 0.27777777777777773,
            "subjectivity": 0.3444444444444444
        },
        {
            "body": "Hi Ms. Anna, super gets po kita. Super relate ako sainyo nung may new born kami 😄. Naka maternity leave ako ng 3 months sa ofc noon Kaya super focus sa baby at pa bf sakanya.. Pero yung 1st 3 months ang pinaka challenging saamin.. Kahit kasama ko din asawa ko na nasa bakasyon din at focus sa baby kasama ko (seaman sya). At nasa bahay in-laws ko. Kasi need talaga namin ng kasama sa pag alaga sa baby. May mga gabi o madaling araw na umiyak na ko sa pagod at antok.. Kasi kakaidlip ko Lang.. Need uli ako gising in kasi dede ang baby saakin haha.. Tapos ang sakit na din mag pa dede.. Feeling ko oras oras dumidede sakin si baby. Ang hirap. Ngayon natatawa na Lang ako pag naaalala ko. My baby is now 2yrs and 8 months old.. Super bibo at daldal at kuliiit. Pero masaya. Kala ko noon newborn pinaka mahirap na stage. Mahirap din nung pa one yr hanggang ngayon po 😅... Congratulations po. Makaka adjust din po kayo nyan soon. Aja! 👍❤️🤗",
            "polarity": 0.2941287878787879,
            "subjectivity": 0.5776515151515151
        }
    ]
}