{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-31 13:18:42",
    "ups": "2573",
    "downs": "60",
    "views": "86671",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 79,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Relate na relate ako ms anna. 😂 first 3 months namin ni baby grabe ka hirap. Cs pa ako. Tapos 1week lang ung leave ni hubby from work. Then ako lang mag isa sa bahay. Tapos iyakin pa c baby. Walang tulugan. Pag umiiyak c baby sinasabayan ko na din.😂 dumarating na ako sa point na umiiyak sya nakatitig nalang ako sakanya. Andun ung pagod. Ung walang tulog. Feeling ko nag iisa lang ako. Ayaw nya pababa. Gusto karga lang. Gang ngaun iyakin pa din baby ko. Haha 1 year and 4months na sya.😊 peru di Ko nagkaron nang stretch mark. Cguro kasi ang liit lang nang tummy ko tapos 37weeks and 1day nanganak ako. Laban ms anna kayang kaya mu yan. ❤",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.225,
            "subjectivity": 0.31666666666666665
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Anong milk ni baby x at diaper?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "sakin daming crack puro peke naman yung whitening at more enamel",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "nun nagka baby ako 3months ako na straight na puyat 😂 naiiyak nalang ako non as a single mom at cs sobrang hirap, pero after that period magging okay ndin lahat",
            "polarity": 0.20952380952380953,
            "subjectivity": 0.37142857142857144
        },
        {
            "body": "Iwasan niyo na po muna mglabas2 kasi mabibinat kayo & may covid weak lungs oa c baby.",
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "body": "Nag dye ka po ng eyebrow?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Nag yoyosi padin pala si dadi geloy, nako po ang second hand smoke para kay baby x",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "✨😚",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Normal lng po tlga yan momsh.dark p tlga(stretchmarks) kc bago plng pero mag lighten din xa pag tagal.😊 kahit wala ka gawin.just let ur body heal.wag magmadali.",
            "polarity": 0.15,
            "subjectivity": 0.6499999999999999
        },
        {
            "body": "Sino may alam where she got her white top? Yung nagpalit siya? Huhuhu need!!!",
            "polarity": 0.48828125,
            "subjectivity": 0.25
        }
    ]
}