{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-11-04 03:51:01",
    "ups": "3580",
    "downs": "104",
    "views": "144238",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 104,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Getting stretch marks removal done does not decrease the value of motherhood! They are DIFFERENT things. ‼️\n\nHow mothers do to their child, how they become responsible and how they prioritize or handle everything that has something to do with the child’s development, their future and how their relationship and connection goes is what truly matter. ♥️ Do what you gotta do mommah! Wanting to do something with your body that doesn’t harm your child is no crime. It does not make you less of a mom.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.008333333333333338,
            "subjectivity": 0.33541666666666664
        },
        {
            "comment": "Sana Geloy will quit smoking na lalo na may baby X Na 🥰",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Swerte nyo p nga sis.kc may kasama kau s bahay and kay baby,ung iba wala like us..first time parents din kami and we also have a baby boy.We are also employed salitan kami ng husband k para makawork din ako s office.nakakaya nmn namin 😊 so you guys can survive also😊enjoyin mo lng sis kc sobrang bilis lumaki ng baby..hnd n natin mababalikan pg may mga na missed  tau s mga ginagawa ng babies natin dhl nga mabilis lng sila lumaki.CS din pla me like you😊just enjoy your baby sis!😊",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": []
}