{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-30 16:46:14",
    "ups": "1314",
    "downs": "28",
    "views": "27154",
    "top_comments": [
        {
            "comment": "Give urself a break sissy. Also have a night nurse maski hindi full time para makatulog kayo ng maayos. Mahirap un hindi ka fully makarecover at back to work ka agad. A good sleep is the best medicine. take care!",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.5125,
            "subjectivity": 0.36250000000000004
        },
        {
            "comment": "I appreciate your effort ate anna for vlogging kahit na sobrang busy schedule mo ☺️ please remember to rest parin para sainyo ni baby!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.125,
            "subjectivity": 0.3
        },
        {
            "comment": "You're so lucky you are able to do things for yourself.  When I gave birth all my time and expenses went to the baby.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.41666666666666663,
            "subjectivity": 0.7291666666666667
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Shop reveal nung white dress sissy",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Employee Working mom gets to take maternity leave for 3 months… pwede rin siguro sa Youtuber-moms 😅 mabilis lang paglaki ni baby every moment counts and hopefully you and Boss G gets to adjust soon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dami mo reklamo...buti nga may anna na nag aalaga sa anak nyo...daming hanash...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Napakarami mong reklamo. Kesyo di mo magawa mga kaartehan mo sa buhay. Natural may new born baby ka. Gusto mo pa unahin mag paganda. Kakareklamo baka........ Kaw rin. Napaka raming tao jan na gustong gusto magkaanak. Ikaw puro reklamo.",
            "polarity": 0.11818181818181818,
            "subjectivity": 0.42727272727272725
        },
        {
            "body": "Super hirap po talaga may baby lalo na pag dumating sa point na alam mo may dinaramdam pero hindi pa sila makapagsalita kung saan at ano masakit. Pero mamsh worth it po yan lahat mabilis lang po sila lumaki. Naalala ko zombie mode kmi ng mister ko lalo na pag natututo na sila mag lakad habol ka naman ng habol. Tatawid tawid sa kuna. Kaya nyo yan mamsh. Enjoy nyo lang po ksi mabilis na po talaga panahon ngayon magugulat nalang po kayo malaki na c baby then mami-miss nyo yung mga panahong baby pa sila pati yung puyat at pagod nakakamiss din pala hehehe God bless your family",
            "polarity": 0.3444444444444444,
            "subjectivity": 0.4222222222222222
        },
        {
            "body": "normal po yan pag. first time parents...challenging..puyat talaga...  it is a blessing to have a baby.. you are also blessed you have someone that takes good care of your baby when your at work.. ❤️❤️God Bless",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.5277777777777778
        },
        {
            "body": "You're so lucky you are able to do things for yourself.  When I gave birth all my time and expenses went to the baby.",
            "polarity": 0.41666666666666663,
            "subjectivity": 0.7291666666666667
        },
        {
            "body": "Iwasan mo ms anna mag indian seat para ndi ka ganun magka stretch marks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pag red na stretchmarks nawawala siya 😊",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hi Ms.Ana!\nMy suggestion to you to have a good night with baby.\nGive baby a warm bath before he went to bed and use the way the nurse dressed him or cover like a cocoon arms inside and position him sideways and thank me later!\nI'm on the same situation like you or maybe worst than you! \nThis is a Australia way how they put baby to sleep and be sure you feed him well okey!\nLet me know if it's work on you! 😘🥰👄🇦🇺",
            "polarity": 0.1802083333333333,
            "subjectivity": 0.5356481481481482
        },
        {
            "body": "How much po procedure ng laser para sa stretch mark ate anna",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Naalala ko nung nagbreak out din skin ng baby ko,yung pla normal at nawawala din.😅 Panic mode ako inaway ko pa asawa ko baka kako hinahalikan hahaha",
            "polarity": 0.175,
            "subjectivity": 0.5249999999999999
        },
        {
            "body": "❤️❤️❤️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kelan k po punta sa Taguig Cityhall? Can i assist u po...im working there & avid fan of u :)",
            "polarity": 0.375,
            "subjectivity": 1.0
        },
        {
            "body": "Sa una lang yan Anna. First time mom rin ako and my baby is 1 month old. Kaya natin yan siszt! I also adjusting pero fighting!",
            "polarity": 0.203125,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "agree po sa iba ang puyat na gusto mo mag puyat sa puyat ng isang nanay. maiiyak ka nalang sa pagod at antok. you are doing great momma ♥️",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "I appreciate your effort ate anna for vlogging kahit na sobrang busy schedule mo ☺️ please remember to rest parin para sainyo ni baby!",
            "polarity": 0.125,
            "subjectivity": 0.3
        },
        {
            "body": "love you!!!!! 🥺❤️",
            "polarity": 1.0,
            "subjectivity": 0.6
        },
        {
            "body": "Give urself a break sissy. Also have a night nurse maski hindi full time para makatulog kayo ng maayos. Mahirap un hindi ka fully makarecover at back to work ka agad. A good sleep is the best medicine. take care!",
            "polarity": 0.5125,
            "subjectivity": 0.36250000000000004
        }
    ]
}