{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-10-31 21:32:59",
    "ups": "2765",
    "downs": "65",
    "views": "98885",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 83,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Iwasan niyo na po muna mglabas2 kasi mabibinat kayo & may covid weak lungs oa c baby.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "comment": "Dami nagsasabi kay Ms Anna ng kesyo mag maternity leave, ang employees naman kasi kahit naka-leave may income. Syempre kapag business pag di kayo gumalaw nganga kayo.\nTsaka syempre as a new mom, adjustment din talaga yan, syempre keeping a part of your routine from your previous life helps din sa mental health, like bilang magasawa magdate pa din, magself care pa din. Hindi naman pagiging masamang magulang kung may gawin din para sa sarili.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": -0.043434343434343436,
            "subjectivity": 0.2737373737373738
        },
        {
            "comment": "Take a break muna sa work ms.anna. kaya nga may maternity leave. Mabilis lang ang panahon. Mamimiss mo rin na ganyang phase ng baby. And swerte nga kayo dami nyo pwedeng mahingian ng tulong pagdating sa mag aalaga. Karamihan dito walang helper na kasama. Tapos nakakalabas p kayo ng wala si baby. Tiis tiis lang.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Bio oil sis... day and night application after bath!\nZebra mama after giving birth... same tayo legs and bum plus tummy meron chackra ni naruto😂 effective stretch marks remover😊 sana sayo din maging okay... in time maglight din yan... all things take time 💗 believe in his plan ☝Your a beautiful MAMA 😊",
            "polarity": 0.48750000000000004,
            "subjectivity": 0.60625
        },
        {
            "body": "True, iba talaga ng puyat ng meron newborn",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "♥️♥️♥️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I feel you!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}