{
    "time_posted": "2021-10-30 13:10:35",
    "url": "https://www.youtube.com/watch?v=2cE-e4XObPI",
    "time_now": "2021-11-03 03:07:19",
    "ups": "3431",
    "downs": "95",
    "views": "135895",
    "top_comments": [
        {
            "comment": "Every Mother's Battle Scar! I used to  be annoyed when I was a kid seeing my mother's stretch marks all over her tummy. Sorry but no one enlightened me how those scars should be look at. How and why those scars where there. After I had my girl I have this massive battlescars all over my tummy. I used to cry at night looking back how I see myself, how horrible I look and feel. But everytime I look at my child, I understand why I have this, why it shouldn't be ashamed of, why it should be normalised. Let us be the one to educate our children that this won't make her/him less beautiful. In the first place your genetics is a big factor. Even those Super Models have their own stretch marks. 💚",
            "likes": 103,
            "number_of_replies": 4,
            "polarity": -0.0030303030303030095,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Be very cautious with smokers. Smoke may stay in the clothes and skin for many hours and lingers even in the walls etc. and not good for newborns. Maybe Geloy can consider quitting for the sake of the baby.",
            "likes": 6,
            "number_of_replies": 1,
            "polarity": 0.11666666666666665,
            "subjectivity": 0.46666666666666673
        },
        {
            "comment": "Kaway kaway kay mommy rhaze 😊",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Sana Geloy will quit smoking na lalo na may baby X Na 🥰",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Swerte nyo p nga sis.kc may kasama kau s bahay and kay baby,ung iba wala like us..first time parents din kami and we also have a baby boy.We are also employed salitan kami ng husband k para makawork din ako s office.nakakaya nmn namin 😊 so you guys can survive also😊enjoyin mo lng sis kc sobrang bilis lumaki ng baby..hnd n natin mababalikan pg may mga na missed  tau s mga ginagawa ng babies natin dhl nga mabilis lng sila lumaki.CS din pla me like you😊just enjoy your baby sis!😊",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Lucky k kc my me time k p at my xtra xpenses k tretment s scars mo part yn pgging mother.\nLucky k kc my ngAssist s nyo. yun mga nSa ibang bnsa solo nila inaasikso bb nila.wg mo i complain ang puyat lahat mother nararanasan nya.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Imagine ms anna meron pa kayo katulong ako dito sa ibang bansa kaming mag asawa  lang with 3 kids, post partum depression is real, dumating ako sa point nung first 3 months after ko manganak ng bunso ko muntik na ako magpakamatay kala ko dati biro biro lang un pero pag pala zero tulog ka, you have other kids to feed and need to drop them to school with my infant, promise nakakabaliw,  pero dahil sa support ng family and husband kahit thru fone lang nakakatulong talaga, kaya nung sinabi mo ung iba ang puyat ng pag aalaga ng baby super agree talaga ako, halos araw araw ung first 2 months ko iyak lang ako ng iyak tapos naiiwang mag isa sa bahay 😢😢😢",
            "polarity": 0.18166666666666667,
            "subjectivity": 0.40166666666666667
        }
    ]
}