{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qibdbh/lpt_if_you_are_a_student_and_have_an_assignment/",
    "time_posted": "2021-10-29 08:09:09",
    "time_now": "2021-10-30 16:50:48",
    "ups": 28684,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hii3xr3",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hinmoku",
            "body": "I'm a fan of Gohar Khan too!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinaqy9",
            "body": "??? Who would ever think asking for more time AFTER something is due would ever be an option?!",
            "polarity": 0.171875,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "himqy9z",
            "body": "Shitty life pro tip send a corrupted docx.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himhixu",
            "body": "People that need this advice are too far gone...",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himagng",
            "body": "Ugh, another due date",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "him7g1n",
            "body": "My tenure at University I only had to ask for an extension once.  \n\nIt was a considerably more complex version of the previous programming assignment...  Like if the first one was for a 101 course, the new one was your Masters thesis...\n\nI honestly had been working on it since he initially assigned it.  And I think I had managed to work out all of the logic and such I needed.  But unfortunately my schedule was rather chaotic and I had ended up writing the entire program on three or four different systems without access to the stuff I had coded before, on systems that didn't have the software to even write code on.\n\nI compiled all of my various bits into a single file and I was starting to work on making sure it all meshed, I used the same naming system throughout etc...  Unfortunately come Wednesday I notice I had a lot more work to still do and I wouldn't get done by the time it was due on Friday.\n\nSo I stopped by his office and asked if I could please have a little more time...  I'd be able to finish it off over the weekend for sure and be able to submit it on Monday.\n\nNope.  He was tired of us kids waiting until the very last second to start working on his assignment and finding out too late they're more complicated than we had anticipated.\n\nI told him I had been working on it since the start and had it pretty well done I just needed a little more time to get everything working.  I offered to show him my code to prove it but he wouldn't bite...\n\nA lot of the other kids were going to protest and not hand anything in...  But I couldn't not hand anything in so I added the code I was still working on to the first assignment this one was based on, commented my stuff out so the program would work as it should.  I figured he'd at least be able to see what I was trying to go for.\n\nFast forward a week or so later...  Half the class got 0/100...  I ended up getting 70/100.",
            "polarity": 0.0696732129658959,
            "subjectivity": 0.5050798930067222
        },
        {
            "comment_id": "him0yzf",
            "body": "I thought this was going to be about sending a corrupt file before the due date",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hilwoqi",
            "body": "OR.....stop being lazy morons and just get it done. LPT is so bad now.",
            "polarity": -0.5833333333333334,
            "subjectivity": 0.8888888888888888
        },
        {
            "comment_id": "hilwf8w",
            "body": "As a teacher I actually love it when my students behave like mature adults and tell me they won't make the deadline.\nI make sure they know what I expect if something goes wrong. As I am teaching software development I also make sure that it is a totally normal process and you can still get a good grade.\n\nMost of the times they tell me right before the review or presentation... I really don't get it 😅",
            "polarity": 0.2935714285714286,
            "subjectivity": 0.5863492063492064
        },
        {
            "comment_id": "hilwejo",
            "body": "I'm a university tutor. I don't care when you e-mail me. I can give you a few days without a certificate. If you need longer, then (a) I want you to get that certificate, because (b) it sounds like some bad shit is going down. I don't form judgments about your responsibility. It's purely, am I authorised to give you this?",
            "polarity": -0.20825396825396827,
            "subjectivity": 0.47111111111111115
        },
        {
            "comment_id": "hilvbl4",
            "body": "Technically you're still irresponsible even if you do it like a day before, it tells me that you have poor time management skills and that it literally takes a day before the deadline that you know you're gonna miss it",
            "polarity": -0.2,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hilvar9",
            "body": "Adjunct prof here.  \n\nI'll give you all the time in the world if you have the guts to ask and have a decent reason.  In fact,  even if you just got busy with other work and really want to do a good job,  I'll probably not penalize you much (maybe not at all in the end).\n\n  I have ADHD and know what it's like.  Just turn in good work that shows you put forth good effort,  and i could care less about the rest. I want A papers. They are much easier to grade and i don't feel dumber after reading them.  \n\nI'm here to help you learn the material,  not cause you anxiety. Show me you learned it by the end of the semester and you will earn the grade you worked for.",
            "polarity": 0.2675,
            "subjectivity": 0.3808333333333334
        },
        {
            "comment_id": "hilukl0",
            "body": "I dunno. From my experience, college deadlines are very strict and you can't do anything about it. There are some professors that would let you submit some of the missing work before the final exam, but otherwise you can't really work around the deadlines.\n\nEdit: I see that my experience is pretty different from those in the comments. But this may be due to the difference in cultures.",
            "polarity": 0.04642857142857143,
            "subjectivity": 0.5035714285714286
        },
        {
            "comment_id": "hilry63",
            "body": "As a college prof, this advice is spot on. Should be comon sense really.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hilrokw",
            "body": "This is true, I’ve done it a few times and rarely have been turned down another day. Remember the more active you are in class the more they’ll remember you and like you. Imagine teaching 20-30 tired and sad faces that literally would rather be anywhere else. The few that participate make it worth it for a lot of teachers",
            "polarity": 0.03282828282828281,
            "subjectivity": 0.4944444444444444
        },
        {
            "comment_id": "hilreja",
            "body": "This only works if your professors answer your emails. Mine don't answer for shit",
            "polarity": -0.1,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hilqcg4",
            "body": "As a college adjunct professor, this is very much appreciated. I'm far more likely to be forgiving if students inform me before the due date than after if they will be submitting their work late.",
            "polarity": 0.06250000000000001,
            "subjectivity": 0.5958333333333333
        },
        {
            "comment_id": "hilofov",
            "body": "If you also state along the lines of “I will try to get it done by the due date if possible, but this extension will help a lot,” professors/teachers will also appreciate the fact you are trying to get it done. Most professors/teachers are realizing these days (especially during a pandemic) that students have a lot on their plate.",
            "polarity": 0.09375,
            "subjectivity": 0.71875
        },
        {
            "comment_id": "hilnu3o",
            "body": "This works great out in the work force too, just let your boss know you need more time a day before the deadline.",
            "polarity": 0.65,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hill26t",
            "body": "Only if the parents actually care. Surprised that I keep up with my kids and anyone does anything.",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hiljq53",
            "body": "I just did this last weekend. My computer crashed the day an assignment was due. I messaged my professor showed proof of the crash and she gave me an extra 24 hours.",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.18055555555555555
        },
        {
            "comment_id": "hili852",
            "body": "This makes literally no sense. How are you supposed to know, before the due date, that you won’t be done on time, when you don’t even start on it until the due date?",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hildw4j",
            "body": "Am a high school teacher, can confirm if a student emails me before a due date with honesty, I give them the benefit of the doubt and grant extensions. If it becomes a recurring thing or a pattern, then I have a longer conversation with the student. But a one time thing? We’re all people first and students/academics second.",
            "polarity": 0.07125000000000001,
            "subjectivity": 0.3120833333333333
        },
        {
            "comment_id": "hilcldn",
            "body": "This works professionally, too.",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hilc81z",
            "body": "Dear god, have been a teacher. This is the pure undiluted truth.",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilave6",
            "body": "As a manager, same for work assignments. I try very hard to give my team the time and resources they need, and often ask, \"Can you do X by Y o'clock on the Zth?\" Like I push back on timelines from our clients and my bosses because I'm trying to make sure no one feels super stressed or has to work weekends or whatever.\n\nSo it is extremely frustrating when people say \"oh yeah for sure!\" to that question, then they're wayyyy behind on the due date. Like I could have helped you if you were just honest with me. If I ask a question, don't just say what you think I want to hear... 😭 \n\nThis is my first management job and it is brutal. \n\nBut yes, early honesty is the best course in so many contexts!",
            "polarity": 0.1236111111111111,
            "subjectivity": 0.5721296296296295
        },
        {
            "comment_id": "hil8gn2",
            "body": "Not only is this common sense, it is also somehow reposted very often.",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hil5276",
            "body": "Any communication is important. And also ask for favors in email or to the side/away from people. The chances of receiving a yes are higher because people are more inclined to help when you don’t bombard them in front of others with requests.",
            "polarity": 0.3833333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hil2s1b",
            "body": "Same principle for bills.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hil2rxx",
            "body": "Or submit the correct file name with a defective file. Once they can't open it you submit the correct finished file.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil1q2c",
            "body": "Pretty much slacking 101",
            "polarity": 0.225,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hil12g1",
            "body": "LPT: if you have to go to the bathroom, make sure you get to a toilet BEFORE you have to go, rather than AFTER",
            "polarity": 0.23333333333333334,
            "subjectivity": 0.4444444444444444
        },
        {
            "comment_id": "hikz9u6",
            "body": "This is A+ advice. Source, am teacher.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikyqlr",
            "body": "I tried this when my dad died and the professor just said \"you had many weeks to prepare, you should only have to be doing final tweaks at this point\".\n\nNeedless to say I just dropped the class.",
            "polarity": 0.0,
            "subjectivity": 0.875
        },
        {
            "comment_id": "hiky5ms",
            "body": "You clearly didn't read the syllabus.",
            "polarity": 0.10000000000000002,
            "subjectivity": 0.3833333333333333
        },
        {
            "comment_id": "hikvu4w",
            "body": "Let Darwinism do its thing I really dislike these coddling LPTs smh. *super* common sense",
            "polarity": 0.07777777777777778,
            "subjectivity": 0.45555555555555555
        },
        {
            "comment_id": "hikupur",
            "body": "And oo yeah and do that also with other unreachable ETAs the rest of your life too, ppl like heads ups",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hikumye",
            "body": "This is a good tip for the working world too",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hikuhne",
            "body": "First, please learn how to properly write an even semi-professional sounding email. \n\nThere is nothing that irks me more than a student sending, “i need more time on x. I was sick this week” and that’s it. The whole email. 11 words. No introduction, no conclusion, punctuation out the friggen door. Ugh.",
            "polarity": 0.12261904761904763,
            "subjectivity": 0.4484126984126984
        },
        {
            "comment_id": "hiksebc",
            "body": "My wife is a professor. Can confirm.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikq85w",
            "body": "As a teacher, I can confirm this! A *handful* of my old school colleagues die on the hill of turning things in on time, but most push honest and early communication. If a student reaches out to me early for help, I give an extension with no penalty. If they reach out last minute (morning of or later), I stick with the standard late work policy. \n\nIt’s so much more important to be dependable, self-sufficient, and communicative than to have a few math problems done 😂",
            "polarity": 0.15,
            "subjectivity": 0.37222222222222223
        },
        {
            "comment_id": "hikpy3q",
            "body": "Alternative LPT for highschoolers: get a GED. It's a diploma equivalent and staying in high school can do far more damage to your mental health than a GED will do you to your future employment.\n\nSource: Struggled with depression, anxiety, and undiagnosed ADHD throughout high school. This was a last resort but it saved what little I had of my mental health during family trauma.",
            "polarity": 0.05916666666666667,
            "subjectivity": 0.407962962962963
        },
        {
            "comment_id": "hikpmo9",
            "body": "But that’s take time away from me trying to finish it!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikohk4",
            "body": "One of my teachers this term said \"If you are going to be late on an assignment, the difference between a reason and an excuse is usually when you tell me about it. Tell me you're going to be late before it's due, that might be a reason, if afterwards, it's usually an excuse.\" I liked that way of phrasing it.",
            "polarity": -0.06785714285714285,
            "subjectivity": 0.3892857142857143
        },
        {
            "comment_id": "hiko9lw",
            "body": "If you’re a teacher and encroach on the home life of children you are a failure as well as a creep.",
            "polarity": -0.3166666666666667,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hiko2m1",
            "body": "To make it unethical, you can just generate a random file that has approximately the right amount of bytes and the right extension. It cant be opened then. It will give you more time to finish it.\n\nAct surprised that it wont open and have it finished by the time it is checked by the teacher.",
            "polarity": 0.03877551020408162,
            "subjectivity": 0.5816326530612245
        },
        {
            "comment_id": "hiknwxz",
            "body": "And as a matter of fact, bad news ages like wine as a general rule. I used to always put off bad news. But then I had a coworker who literally didn't hesitate. Phone call with bad news - BAM phone call letting the boss know. I do that from now on. Less anxiety. And more time for them to make a decision.",
            "polarity": -0.286111111111111,
            "subjectivity": 0.5111111111111111
        },
        {
            "comment_id": "hikn64i",
            "body": "I always give students that ask me before extensions, whereas I penalize those that don’t hand in the work after the due dat. You are correct!!!!",
            "polarity": -0.30517578125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hikmwvb",
            "body": "This is legit and worth a try. I had situations arise when I was in college and an email to my instructor saved my ass multiple times.",
            "polarity": 0.15,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikmo60",
            "body": "As a prof, yes. Also short and sweet “I got behind and just need more time” is always preferable to long excuses. I will always assume you’re lying anyway and needing more time is better than no paper/bad one!",
            "polarity": 0.21785714285714283,
            "subjectivity": 0.5071428571428571
        },
        {
            "comment_id": "hikjwrt",
            "body": "The problem is that I don't know when I'm gonna turn something in late. I go home and be like \"okay let's do homework\" and then I fall asleep. And then I wake up and it's like, \"what homework? I've never had homework in my life.\" And then I only remember that I had homework at the beginning of class and I'm like \"oh shit oh shit\" and then it's late. And because it's late, now there's no point to me doing the homework, because it'll be just as late in a day as in a week as in a month, right? And then I just never turn in my homework.",
            "polarity": -0.09047619047619049,
            "subjectivity": 0.6706349206349205
        },
        {
            "comment_id": "hikjirm",
            "body": "I got really sick once and I couldn't really work on a project. There was still almost a week to the deadline, so what I did was email my professor and ask him If I could hand in my project a bit late and just focus on recovery for the moment. He agreed, I handed it in a couple days late, got great marks, that was that.",
            "polarity": -0.06285714285714286,
            "subjectivity": 0.6014285714285714
        },
        {
            "comment_id": "hikj95j",
            "body": "If you are a teacher/professor, please don’t assume that every student is neurotypical or that non-neurotypical students are all diagnosed and communicating to you about it. As much as possible, please make accommodations for them.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hikj2r3",
            "body": "LPT: This is HORRIBLE advice. Most professors (unless it's a *real* emergency) are going to respond to you saying \"You've known about this assignment and it's due date since the first day of class, it's in the syllabus, there is no reason you shouldn't have been able to get it done on time\". *Best* case scenario using OP's advice is your professor will allow you to turn it in late and get 50% instead of 0%. \n\nIdk maybe OP just has really lax professors but in my 4 years EVERY professor made it very clear their policy for late work and there were no excuses, except emergencies, that work could be turned in for full credit past it's due date.",
            "polarity": 0.07357142857142855,
            "subjectivity": 0.4647619047619047
        },
        {
            "comment_id": "hikhrbb",
            "body": "Did you just copy paste Gohar Khan’s YouTube video : How to get away with late assignments ?",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hikgmhe",
            "body": "Terrible LPT. Pet insurance doesn’t cover shit",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikglc1",
            "body": "If your an anyone who can’t get something done on time email before it’s due. \n\nThis will win you unimaginable prizes in life I assure you.",
            "polarity": 0.3375,
            "subjectivity": 0.3875
        },
        {
            "comment_id": "hikgbd0",
            "body": "Trying smelling the bottom of a filled pool. It’s crazy what oxygen can do!",
            "polarity": -0.175,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikekf8",
            "body": "Don't want to sound obvious, but being honest is always better in these situations.",
            "polarity": 0.375,
            "subjectivity": 0.575
        },
        {
            "comment_id": "hikdq8b",
            "body": "It's possible but not for major projects that are assigned well in advance. I hate when I assign something and give 3 weeks for it and a student emails with an \"emergency\" the night before. In my opinion, you should be 99% of the way done the night before something is due.",
            "polarity": -0.215625,
            "subjectivity": 0.69375
        },
        {
            "comment_id": "hikc2x8",
            "body": "Absolutely. You tell me ahead of time, I’ll absolutely work with you.",
            "polarity": 0.2,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikan1s",
            "body": "Hell nah. All you gotta do is save a blank Microsoft Word document and name it after the assignment. Email that shit and when they get it, they gonna think there was an error and tell you to resend. Now all you have to do is ignore that email all weekend and turn the project in on Monday!",
            "polarity": -0.125,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hikadth",
            "body": "Works for job stuff too",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikabqf",
            "body": "This is all well and good, but the procrastination that prevented me doing the work on time also prevented me asking for an extension in good time.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hik9k5z",
            "body": "Good advice when dealing with English courts as well. If you are going to miss a deadline, write to (or otherwise contact) the court beforehand not afterwards. That's written in the rules in various places, but even where it is not, it is still good advice.",
            "polarity": 0.35,
            "subjectivity": 0.42500000000000004
        },
        {
            "comment_id": "hik8x6g",
            "body": "Former teacher here. This is good advice. If someone was willing to be honest about why they needed more time and let me know a day or two in advance I almost always let them have an extension. I would rather read something with some effort involved and not some crap you rushed because you were running out of time.",
            "polarity": 0.2083333333333333,
            "subjectivity": 0.5916666666666667
        },
        {
            "comment_id": "hik8py2",
            "body": "This is in like every syllabus. Why is this a lifeprotip? Tell people to read and pay attention",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik8c0t",
            "body": "This is good, and typically works. Never guaranteed though. Narcissism runs rampant throughout many professors. In my experience, there are many who try to fail some students every quarter. I've had many classes where work is not an acceptable excuse. \n\nA particular example is that my boss had a heart attack and could not work a Friday through Sunday in another state ( was doing events on the weekends). I emailed my professor and he said it wasn't acceptable reason to take the test early, thus I took half of the final exam (knowing above 50% would pass me). Handed him the exam and sprinted to the train station. \n\nCollege honestly sucks especially when you are working even part-time. But you will get through it and understand that any setback in your classes is not permanent. You can always transfer / retake classes. Just make sure you're taking care of yourself and you will eventually get there. It's never a race.",
            "polarity": 0.11888888888888888,
            "subjectivity": 0.4692592592592592
        },
        {
            "comment_id": "hik893n",
            "body": "That's a great tip and all, but do you think I would be in this situation in the first place if I didn't put off painful situations as long as possible?",
            "polarity": 0.06000000000000002,
            "subjectivity": 0.6766666666666666
        },
        {
            "comment_id": "hik80pn",
            "body": "A lot of unis punish professors for passing too many people. Usually your professors are already going to be forgiving one way or another regardless of when you ask. Sure it looks better but especially after this last year the people who are going to be understanding about life happening and how pointless it is for them to gate keep your life moving forward would/wouldnt do it either way.",
            "polarity": 0.14285714285714285,
            "subjectivity": 0.5293650793650794
        },
        {
            "comment_id": "hik80ae",
            "body": "How the fuck is this a pro tip....",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hik7ru0",
            "body": "Don't do something that's NOT common sense, but do something that IS common sense!\n\nThere we go, can I have 20k upvotes now?",
            "polarity": -0.1125,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik7nnv",
            "body": "Wait people email the teacher afterwards? What kinda logic is that\n\n”Hello Mrs Olsson, as you may have realised, i have not turned in my english essay that was due last thursday. Before you fail me, i just have to tell you now, half a week later, that it is because i’m lazy, too lazy, infact, to tell you before it’s  consequences have likely occured",
            "polarity": -0.1435185185185185,
            "subjectivity": 0.43425925925925923
        },
        {
            "comment_id": "hik7e3r",
            "body": "LPT: Manage your time and get the job done on time. Things like bereavements and life events that are out of the ordinary are a different kettle of fish",
            "polarity": -0.125,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hik7b6c",
            "body": "i´ve only ever had hard deadlines, 1 minute over 00:00 and auto fail...",
            "polarity": -0.2638888888888889,
            "subjectivity": 0.6138888888888888
        },
        {
            "comment_id": "hik74vg",
            "body": "Also, ensure that you A) have a legitimate reason for being late and B) have a target completion date THAT YOU WILL HIT.  This and OP advice gives you the best odds and shows a professional mindset.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hik6pja",
            "body": "This is great advice for all things.  Rather than avoid the uncomfortable thing, deal with it head on. Great adulting 101.   👍",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment_id": "hik65z1",
            "body": "Haha as if any Prof would care (except if you are sick). In what dream world do you live?\n\nEdit: Ah for high school it might work. My bad.",
            "polarity": -0.18358441558441554,
            "subjectivity": 0.5727619047619047
        },
        {
            "comment_id": "hik60sq",
            "body": "If you didn't accomplish this LPT and it's still possible, complete the assignment within a reasonable amount of time, and politely email the instructor, explain the situation honestly, and ATTACH THE COMPLETED ASSIGNMENT",
            "polarity": 0.225,
            "subjectivity": 0.725
        },
        {
            "comment_id": "hik5yl5",
            "body": "High school teacher here. This LPT is correct. Ex post facto excuses reek of bullshit but saying something beforehand usually works for me to allow more time.",
            "polarity": 0.1366666666666667,
            "subjectivity": 0.43
        },
        {
            "comment_id": "hik5icj",
            "body": "How the fuck is this not common sense and therefore a violation of rule 4 on the sidebar?",
            "polarity": -0.125,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hik5f24",
            "body": "Still statin' the bleedin' obvious on here, I see.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik5ckh",
            "body": "Same with work projects!",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hik55gi",
            "body": "Depends how much time you need. If the deadline is to email in at midnight then just finish it in the next few hours and then set your computer’s clock to before midnight and send it with your computer’s mail program (not webmail).",
            "polarity": 0.0,
            "subjectivity": 0.10000000000000002
        },
        {
            "comment_id": "hik5090",
            "body": "How is this a LPT this is just common fucking sense.",
            "polarity": -0.44999999999999996,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hik4qrd",
            "body": "One Friday I had two exams and a paper due so I asked my teacher for an extension to Monday for the paper abd he said ok",
            "polarity": 0.1875,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hik4ns6",
            "body": "As a teacher, can confirm! We generally want people to do well and we know how hard it to be a student. Be communicative and honest, treat us like people, and we'll do the same in return.",
            "polarity": 0.08958333333333332,
            "subjectivity": 0.5166666666666666
        },
        {
            "comment_id": "hik4iyx",
            "body": "This is my biggest pet peeve as a teacher. We have a test. You’ve know about said test for weeks. Then you wait until I’m passing it out to make a case that you should take the test on a later date. \n\nEven if it’s a legit reason I seriously doubt you just realized your dilemma right now.",
            "polarity": -0.015873015873015872,
            "subjectivity": 0.40079365079365076
        },
        {
            "comment_id": "hik3mt8",
            "body": "Can confirm. Lecturer here.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik3ava",
            "body": "Oh my god, finally, a good LPT.\n\nHowever, emailing THE day before still makes you look irresponsible, and thanks to the pandemic, teachers/professors spend more time answering emails than ever. We get a FLOOD of emails on the day before an assignment is due. \n\nTherefore, email at least TWO DAYS before the due date and you will be given significantly more benefit of the doubt.",
            "polarity": 0.19285714285714284,
            "subjectivity": 0.42142857142857143
        },
        {
            "comment_id": "hik2aeu",
            "body": "Am teacher. This is the way.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik1wpk",
            "body": "This applies to almost all things in life. It’s called being pro-active. Very good advice in general!",
            "polarity": 0.48624999999999996,
            "subjectivity": 0.6400000000000001
        },
        {
            "comment_id": "hik15q2",
            "body": "Weird, I've usually gotten \"Did you read the Syllabus\" or \"You have a few late days you can use/have already used\". \n\nTo be fair, i was always a procrastinator and everyone else in class seemed to get things done on time, sometimes days ahead. So making an excuse for one dude was probably considered \"too generous\".",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "hik0xpd",
            "body": "This really is a great tip that saved my bacon for uni dissertation in 2001. - Lecturer was off sick after a hospital op and recovering at home. She received my email, invited me round to her home to give extensive advice, coaching (three times!) and I received a first for the piece. Submitted on time too. All thanks to her. She was a real hero.",
            "polarity": 0.07653061224489797,
            "subjectivity": 0.4534013605442177
        },
        {
            "comment_id": "hik0sl0",
            "body": "NO fucking SHIT bro",
            "polarity": 0.1,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hik0qv7",
            "body": "Isn't this common sense..?",
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik0jma",
            "body": "Consider this a tip for anything in life with a due date.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hik09pi",
            "body": "This really depends on the field of study. I’m in the arts so they are pretty chill with extensions but I know for a fact my friends in law or the sciences do not have that privilege.",
            "polarity": 0.225,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hik00p7",
            "body": "This is more likely to work for general assignments than take-home tests. If you are given advance notice of take-home tests and how much time you're allocated for them (usually a day or more), then you should be asking about alternate arrangements before the test is actually made available, not after it's been distributed. Also, your instructor may make solutions available soon after the due date so that students who submit on time can compare their solutions immediately. Don't expect to get extensions after the solutions have gone up.",
            "polarity": 0.15227272727272725,
            "subjectivity": 0.38409090909090904
        },
        {
            "comment_id": "hijzmww",
            "body": "As a teacher, I am a lot more lenient with students who email before hand since I then think those that email after are just being lazy and didn’t do the work on time",
            "polarity": 0.25,
            "subjectivity": 0.7999999999999999
        },
        {
            "comment_id": "hijzgvl",
            "body": "Secondarily to this, email what you *have* got done in the email to prove you're not lying and just haven't started yet.",
            "polarity": -0.3,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hijz2dk",
            "body": "But I don't know if it will be on time until after!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijyk6l",
            "body": "This carries forward to your working life. Any issues which affect your ability to deliver on time need to be brought up immediately.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijyiip",
            "body": "Teachers want you to learn and succeed. However, also need to hold you accountable for deadlines and establish clear expectations. In general, open and honest communication will go a long way in many areas of life. Teaching and learning is no exception.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.5305555555555556
        },
        {
            "comment_id": "hijyh87",
            "body": "This carries forward to your working life. Any issues which affect your ability to deliver on time need to be brought up immediately.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijydpd",
            "body": "Stupid tip, it’s common sense",
            "polarity": -0.5499999999999999,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hijx0dx",
            "body": "WHat about when you have an assignment due in 2h and 30m and you havent even started yet? What are you supposed to do then? Feels kinda rude asking for more time this late",
            "polarity": -0.056249999999999994,
            "subjectivity": 0.51875
        },
        {
            "comment_id": "hijwxyq",
            "body": "Goes for absolutely every deadline or appointment of any kind in all walks of life. It’s common courtesy…gonna be late for lunch, let them know, gonna miss a tee time, let them know.",
            "polarity": 0.05,
            "subjectivity": 0.725
        },
        {
            "comment_id": "hijwriw",
            "body": "Minimum 2 days before. Ideally three. Or a week if it’s something really big.",
            "polarity": 0.45,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hijwqz2",
            "body": "Idk where y'all are studying but if I fail to turn in an assignment, I get a 0 and that's it. Doesn't matter if I send an email before or after the due date lmao",
            "polarity": -0.00833333333333334,
            "subjectivity": 0.5583333333333332
        },
        {
            "comment_id": "hijvqzt",
            "body": "Student? \n\nFollow this advice at work too. \n\nAnd at home.\n\nAnd with friends.\n\nAnytime you made a promise and can't fulfill it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijvqme",
            "body": "It makes me a little sad that this isn’t common sense.",
            "polarity": -0.32916666666666666,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hijvb89",
            "body": "This applies to work as well (notifying boss about unfinished project before rather than after)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijvb28",
            "body": "This is true for work deadlines too by the way.",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hijvatw",
            "body": "Teacher wanna smash now. What do?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijuwv8",
            "body": "Professor here. I tell my students they can have an extension for any reason (and I don't need to know the reason) as long as they ask before the deadline because this is how the work world works: it's about regulating and being responsible for yourself.  \n  \nAnd to the people offering the unethical LPTs of turning in a corrupted file or the wrong file instead of asking for more time: that shit don't fly, homie. All of the course management sites allow students to preview their submissions and I tell my students that's part of their responsibility as well, to ensure that what they've submitted is correct and readable, because, again: that's how the work world works, if you don't make sure what you're sending your boss is correct, that's laxity on your part.",
            "polarity": 0.17857142857142858,
            "subjectivity": 0.7055555555555557
        },
        {
            "comment_id": "hijurcv",
            "body": "Did other college kids regularly email AFTER the due date? I thought it was common sense that it looks better as a pre rather than post.",
            "polarity": -0.010000000000000009,
            "subjectivity": 0.36538461538461536
        },
        {
            "comment_id": "hijukpc",
            "body": "Nah man , my professor is a weirdo psycho bitch, she would roast me infront of the whole class next day.",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hiju2lc",
            "body": "Do this **all** the time. Not just at school",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiju0zm",
            "body": "I’m in my last year of Uni, and from high school on have regularly asked teachers and Professors for extensions if I felt I genuinely needed them and the quality of my work would suffer if I didn’t get one. I have literally never been told no before. As long as you have a genuine reason for it, 95% of educators would rather see you do a good job on your work then get something not indicative of what you can do.",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.3833699633699634
        },
        {
            "comment_id": "hijtmeq",
            "body": "How is this not common knowledge? \n\nYou always let people know before you miss an appointment, class, meeting, anything planned or scheduled.",
            "polarity": 0.15,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijtlb1",
            "body": "Yes this is a lpt but why is it necisary this should be obvious",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijsif4",
            "body": "Literally just did this. Emailed my TA a week before a paper was due and they gave me 3 extra days. This is good advice.",
            "polarity": 0.19166666666666665,
            "subjectivity": 0.3583333333333334
        },
        {
            "comment_id": "hijsha9",
            "body": "My friend did this a lot when she was struggling with mental health issues. She was honest with her teachers got extensions on dozens of assignments. She graduated with a 4.0.\n\n\nStruggling with life doesn’t mean you have to fail your classes. Teachers understand the struggles too",
            "polarity": -0.078125,
            "subjectivity": 0.521875
        },
        {
            "comment_id": "hijsfb0",
            "body": "As a high school teacher for the past decade, 99% of the time I will give an extension if it is brought to my attention before the due date. \n\nMost teachers I know share a similar philosophy.",
            "polarity": 0.05700000000000001,
            "subjectivity": 0.413
        },
        {
            "comment_id": "hijs6yu",
            "body": "If it’s a file submission, open up a file in notepad, and delete a few lines from the top. Then save it. Try to open it again and it should fail as a corrupted file. Then submit as normal. Your teacher will write you back saying they are unable to open the file and can you resubmit. By that time you should have had plenty of time to finish it. Don’t forget to change the last modified field of the meta data to the same time you saved the first version.",
            "polarity": -0.025000000000000005,
            "subjectivity": 0.33958333333333335
        },
        {
            "comment_id": "hijs4uy",
            "body": "Is this not common sense? In what world would you think of asking for an extension AFTER the fact?",
            "polarity": 0.15,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijrsfh",
            "body": "Ive always asked for extensions in university when needed, even if the excuse is that i just didnt get around to doing it. Every teacher has given it to me, even if grudgingly. There is NO harm in asking. Ask all the time! Whether its extension, or just help. The worst is that they say no, and you can ask someone else. In fact, i love when people ask me for help. It makes me feel better about myself. So ask kindly, and reciprocate later",
            "polarity": -0.02857142857142858,
            "subjectivity": 0.5785714285714285
        },
        {
            "comment_id": "hijrry0",
            "body": "Back in my day we either crunched to complete it or turned in what we did complete. No email required",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "hijrreq",
            "body": "Doubt it works anymore, but when I was in college from 2002-2006 emailing assignments was fairly new. If I wasn't finished with a paper that I had written, I would email the professor as if it was finished then just not attach anything. They would reply saying how I forgot the attachment. This would buy me a few hours to work on it longer and send it in.",
            "polarity": -0.03181818181818183,
            "subjectivity": 0.2772727272727273
        },
        {
            "comment_id": "hijrqw1",
            "body": "Most obvious universally known \"pro tip\" I've read in a while! Great job.",
            "polarity": 0.325,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hijrqdg",
            "body": "Hi everyone! \n\nPast college student here that messed up a lot due to being depressed, fucking myself over stupidly, and just being so down on myself I didn’t care. \n\nI straight up told my professors I was having a tough time through email, and they almost always gave me extensions if I asked beforehand. A lot of them also have me a message of encouragement and let them know they would help if I came for it. I wish I took them up on the offer since I was so distracted by others thing back then. \n\nIt’s gonna feel awkward but damn if it ain’t true “the squeaky wheel is the one that gets fixed”.\n\nMake some noise and make sure they know you need it =)",
            "polarity": -0.09764957264957265,
            "subjectivity": 0.5912393162393162
        },
        {
            "comment_id": "hijrnmz",
            "body": "ULPT: send them a corrupted a file. Most likely they don't evaluate right away. It will give you 2 or 3 days to finish the assignment. When they ask you to send them again, send them the completed one",
            "polarity": 0.2619047619047619,
            "subjectivity": 0.6785714285714285
        },
        {
            "comment_id": "hijrfim",
            "body": "It's true that you may have a better chance of getting extra time if you ask ahead, but it's like moving your chance of approval from 0% to 1%. Most professors are pretty clear about deadlines in the syllabus exactly so students can't claim they weren't aware. Unless of course you have a legitimate reason then they might work with you.",
            "polarity": 0.275,
            "subjectivity": 0.45416666666666666
        },
        {
            "comment_id": "hijrcyh",
            "body": "they won’t they’ll just say you wasted time emailing them rather than doing it.",
            "polarity": -0.2,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijq52y",
            "body": "Bold of you to assume I have that kind of forethought considering I didn’t have the time management to finish the assignment",
            "polarity": 0.4666666666666667,
            "subjectivity": 0.7833333333333333
        },
        {
            "comment_id": "hijpnpt",
            "body": "Talking to the professor under any circumstance is the biggest college hack there is.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijpkdx",
            "body": "Better yet, corrupt a word doc and send it in.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hijp268",
            "body": "This is true. I manage a few large university classes and am kinda a dick.\n\nI don't care what your sob story is, if you e-mail me after the due date you are completely fucked. If you e-mail me before the due date I will extend it for you 9 times out of 10.\n\nAgain I really don't care about your fuckin sob story. It's not fair to Billie who got in a car wreck and still e-mailed before the deadline. It's not fair to Susan who got strep and still managed to hand shit in on time.\n\nAlso you are an adult, act like one.",
            "polarity": -0.09870129870129869,
            "subjectivity": 0.5207792207792208
        },
        {
            "comment_id": "hijowln",
            "body": "It’s ok to feel anxious about deadlines. Your school may offer services to help mitigate that anxiety while helping you to complete that assignment.",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hijohnl",
            "body": "Lmao no sht. There’s a difference when you call off sick than skipping the work",
            "polarity": -0.05714285714285716,
            "subjectivity": 0.9285714285714286
        },
        {
            "comment_id": "hijo5b4",
            "body": "Good advice. Not always realistic for those struggling with unforeseen or untreated mental health issues",
            "polarity": 0.25555555555555554,
            "subjectivity": 0.37777777777777777
        },
        {
            "comment_id": "hijnzi1",
            "body": "I wish I learned sooner to not see my college professors as this “absolute stoic authoritarian figure.” \n\nIt helps to build an early rapport with them and see them as a person who wants to help you pass his/her class. They’re more likely to cut you so e slack too ;-)",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hijnwxk",
            "body": "All of my teachers take points off of your stuff is late, even if your sick they take points off if you email them after because your extension is from the date you email them",
            "polarity": -0.5071428571428571,
            "subjectivity": 0.7285714285714285
        },
        {
            "comment_id": "hijnqd3",
            "body": "I was a first generation college student, and the LIGHTBULB that went on for me in my junior year when a professional casually mentioned that a student had emailed because they were going to miss class could have knocked me out of my seat. It turns out a lot of professors who grade attendance will even not take points off your grade if you just notify them before class in a professional manner.",
            "polarity": -0.012500000000000032,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment_id": "hijnikv",
            "body": "Can confirm. Am teacher. I tell my students this explicitly. Multiple times.\n\nDoesn't seem to help a lot of them!\n\nOh well. It is learning experience in itself.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijndw9",
            "body": "Last resort, send a corrupted file",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment_id": "hijn38v",
            "body": "\"I'm sorry Mrs. Shannon.\n\nUnfortunately I will be unable to complete the current assignment. I can only apologize. I just feel a week is too short a period to finish this one page paper about what I would like to be when I grow up. \n\nThere are many reasons that caused this delay. Not withstanding is my inability to decide on whether I want to be a fireman or a policeman.\n\nI am hopeful that, should the decision be made, I can complete what you wanted of me.\n\nYour favorite first grade student,\n\nSnote\"",
            "polarity": -0.004545454545454539,
            "subjectivity": 0.6212121212121212
        },
        {
            "comment_id": "hijmz5r",
            "body": "I tried that once.\n\n\"Sorry, but I do not offer extensions to assignments for any reason. Please consider managing your time better in the future.\"\n\nSo, yeah I failed his class.",
            "polarity": -0.125,
            "subjectivity": 0.48125
        },
        {
            "comment_id": "hijmy9m",
            "body": "As a teacher, I can say that this is 100% how I run my class.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijmshq",
            "body": "LPT: corrupt an empty file on purpose and email that over. You get a few extra days until they check it and email you back asking you resend the file",
            "polarity": -0.16,
            "subjectivity": 0.34
        },
        {
            "comment_id": "hijme42",
            "body": "who knows one misses the deadline before the deadline? :)",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hijly4c",
            "body": "This is true for all human interaction.  Let them know before you're late.",
            "polarity": 0.016666666666666663,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hijltx9",
            "body": "This can potentially work with skipping for the first 6 weeks of class as well. I reached out to my professor and told him I meant to drop the class but didn't complete the process, and was now very far beyond being able to drop the class. This was a lie, but he was very understanding and offered to let me come to his office to work out a plan to catch me up. Obviously I never went to do that either, but I could have gotten away with it.",
            "polarity": 0.16857142857142857,
            "subjectivity": 0.594047619047619
        },
        {
            "comment_id": "hijlrfm",
            "body": "Can confirm. Teachers like and appreciate the proactive communication.  And they're on your side... they WANT you to succeed.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijlimi",
            "body": "I did this and asked for more time once based on the syllabus policy of being able to turn things in late for 20% off the grade and the prof arbitrarily said I couldn’t do it and I had to turn in what I had done, got an F on the homework, then I failed the class because of that one assignment, following the semester I had to open a case with the grad school office to argue with this professor saying he had violated a policy and essentially gotten me kicked out of my financial aid program due to a failing grade I didn’t deserve, lost thousands of dollars paying for classes out of pocket while resolving the situation, he was completely unreasonable even though I had reached out before the deadline. Some professors are just pricks and there’s nothing you can do",
            "polarity": 0.006818181818181817,
            "subjectivity": 0.3909090909090909
        },
        {
            "comment_id": "hijlgtf",
            "body": "Open the file in a hex editor and change the first 8 digits. Then turn that in. Congrats, you have until your prof asks you to resubmit it.",
            "polarity": 0.125,
            "subjectivity": 0.41666666666666663
        },
        {
            "comment_id": "hijld80",
            "body": "Do what I did. If you’re not gonna make the submission date, submit what you have, finish the rest, and then email the teacher telling her you submitted the wrong version (an earlier draft from when you worked on it) and submit the final completed one\n\nResults may vary",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.7999999999999999
        },
        {
            "comment_id": "hijlcqt",
            "body": "Story time.\n\nWe had to complete a 2 page preliminary write up of our paper. Not hard.... but it required most of our research being done, and our structure loosely organized.  It was worth 10% of our *total* mark.  He had the due date smack dab in the middle of mid-terms, so he told us if we couldn't complete it on time to e-mail him and we were allowed extensions.  No big deal.\n\nI e-mailed him 4 days before the due date letting him know it would likely be late.  I had finished my research just a matter of writing it up... and did that on same day it was due (had 2 mid-terms that same morning).  Was due by 9 am, and went to his office after 6pm.\n\n2 days later in class he asks me to come to his office.  He returns it to me incomplete, because... it was late.  I told him I emailed him, and he told me he got the email, but I needed to let him know even further in advance.  Apparently others had asked for extension as far as a month ahead of time.  I pointed out that's just people not even trying to get the work done.  How could I possibly know a month ahead of time I wouldn't have my work done.. unless I knew I was going to procrastinate on it?  Why not just give everyone an extended due date if he was giving extension that far out?  He didn't care, called me privileged and told me where he came from there was no such thing as late penalties.  That's that.\n\nEnded up going to another professor and he helped me go to the Dean to get my paper accepted (the school charter(?) clearly states work will be accepted past the due date with a late penalty, unless other wise stated... and my prof hadn't stated otherwise).  Inital Prof did not take it well, and he took off 20% a day and marked it 2 days late (despite the charter clearly stating 5% a day, and the paper was only a 'day' late)\n\nSo sometimes, they don't give a shit and are just dicks.",
            "polarity": -0.020668967784352395,
            "subjectivity": 0.4923734385272847
        },
        {
            "comment_id": "hijlbst",
            "body": "And don't faint out and make excuses. I always preferred a 'to be honest I am having a huge melt down' so we could sort the problems out and move on rather than lose someone who wanted to succeed.\n\nSimilarly; don't be afraid if you realise the course isn't for you. Talk to your tutor and work out how to shift to a different one with as little damage to your progress as possible. A good tutor will be fine with letting someone move on rather than watching someone fuck up their fortunes",
            "polarity": 0.024873737373737378,
            "subjectivity": 0.708080808080808
        },
        {
            "comment_id": "hijl5xi",
            "body": "Another pro tip, if the submission system is automated a lot of these types of places have a \"if file is corrupt you have 24-48 hours to re submit a working file\" which means you can submit a corrupt file on purpose just to buy time.\n\nHad a friend irl thst did this because he had to and it worked out",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hijl4fu",
            "body": "But I don't know how much I'm going to procrastinate yet!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hijl2ji",
            "body": "Yes!!! This! - college professor",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijkve7",
            "body": "Pro tip: When you email, call then Professor if that is their title... My wife gets so many student emails that just say \"hey I'm going to be late with this\" or calling her by her first name.  Be professional in the email!",
            "polarity": 0.14375,
            "subjectivity": 0.38333333333333336
        },
        {
            "comment_id": "hijktq9",
            "body": "Can confirm. Got my laptop with a half done math assignment(for uni) stolen something like a half a week, maybe a week before due date, while I had it half way done. Asked for a week's extension and explained the circumstances. Got told to take however much time I need.",
            "polarity": -0.08499999999999999,
            "subjectivity": 0.215
        },
        {
            "comment_id": "hijk5kr",
            "body": "&gt; you ~~may~~ will definitely come across as irresponsible",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijjo66",
            "body": "Everyone will have that professor who pretends that life isn't a factor in completing your assignments and says that you should have planned ahead.\n\nMost will absolutely work with you. I've heard multiple professors say \"grading is an artform, not a science\".",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "comment_id": "hijjdbr",
            "body": "Spot on!\nTeachers are human, we understand that sometimes things don't go to plan. We just appreciate being kept in the loop.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hijj96c",
            "body": "I did this once, but I went to him in person to ask.\nHe said no.\nAnd then another teacher chipped in to also tell me I had to manage my time better.\nTurns out the homework was too difficult for me anyway so he just believed I didn't even try.\nSo the lesson I learned was that the right thing to do can sometimes be the wrong thing to do, especially when dealing with a dickhead and their dickhead teacher friend.",
            "polarity": -0.04285714285714286,
            "subjectivity": 0.7871428571428571
        },
        {
            "comment_id": "hijiwl5",
            "body": "Green teen LPT subreddit when?",
            "polarity": -0.1,
            "subjectivity": 0.15
        },
        {
            "comment_id": "hijipah",
            "body": "If you know you wouldn't have time to finish something, and you somehow still have more than a day left... you'd be the kind of person to have already completed the assignment. This is a paradox.",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.4666666666666666
        },
        {
            "comment_id": "hijimfn",
            "body": "Same as you're going to be late for work and know it.\nText beforehand you will be late rather than after saying you're late",
            "polarity": -0.22499999999999998,
            "subjectivity": 0.48124999999999996
        },
        {
            "comment_id": "hijihv9",
            "body": "Common sense isn't so common.  I have to put rules like this in my syllabus.",
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijicff",
            "body": "I'm 34 and wish I went to college.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijhxdf",
            "body": "Oh, so actual being a grown up and responsible?",
            "polarity": 0.1,
            "subjectivity": 0.325
        },
        {
            "comment_id": "hijhhxk",
            "body": "Wow. What a break through.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hijhe0f",
            "body": "Who is actually asking for more time *after* the due date?? Come on now, people. Use your brains a little.",
            "polarity": 0.046875,
            "subjectivity": 0.36875
        },
        {
            "comment_id": "hijgvtu",
            "body": "Google \"Commitment Based Management\"\n\nThere is a specificly understood commitment between yourself and another party. When that commitment is at risk of not being met, you should communicate this with the new expectation as soon as this is known, the other party can negotiate/consider options, and you can come to a new agreement. Don't just say \"I'll be late\", say \"I'll be late, I'll be there at about 9:30 instead of 9:00\". Set the new, realistic expectation. \n\nThis works for hanging out with friends, projects at work, personal goals, etc.\n\nThis method also helps avoid the 'yeah I'll do it soon' messaging. You're leaving interpretation open to the audience of that message, and creating issues almost immediately (two sets of 'understood' commitments).",
            "polarity": -0.014924242424242427,
            "subjectivity": 0.41969696969696973
        },
        {
            "comment_id": "hijgtp8",
            "body": "LPT: If you are a student and have an assignment you know you can't finish on time, just copy somebody else's assignment.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijgtam",
            "body": "This is a good tip. Always have clear and fast communication with your teachers/bosses/superiors.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5277777777777778
        },
        {
            "comment_id": "hijgszy",
            "body": "If I had the foresight to know I wasn’t going to get it done on time, I would have gotten it done on time.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijgd8t",
            "body": "Also, include a salutation in your email (e.g dear / hi professor)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijfyqa",
            "body": "I had a brush fire breakout in my backyard (neighbor's fault) while working on my final paper of the term. I emailed my professor the photos a few hours before it was due. He gave me all the time I needed to complete it and told me to stay safe. I couldn't re-enter my house again for 2 days because of the smoke. Thankfully no property damage happened. Speaking as a former TA as well, be nice to us.  We grade everything and the professors are usually hands off other than inputting the final grades. We've also hear tons of excuses from relatives dying, food poisoning, and even Blackboard causing a laptop battery to erupt in flames \"erasing\" the HDD.",
            "polarity": 0.05,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijftce",
            "body": "As a teacher myself I 100% agree with this. \n\nI don't care what the reason is. Even if you just forgot. Just ask for an extension and about 95% of the time I'll say yes. \n\nNothing annoys me more than having to chase my students up for their work they hadn't submitted",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijfrjd",
            "body": "Depends. This only works on some professors. One student wouldn’t cut it, but multiple students would.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijfp2b",
            "body": "This also applies to career work in an office environment.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijf7tg",
            "body": "I always preferred to beg for my life after while the professor is chilling in office hours",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hijf5is",
            "body": "This LPT applies to everything you do in life. Including work. \n\nProject running late? Tell the client earlier than later. \n\nOpen like of communication is your best friend.",
            "polarity": 0.13999999999999999,
            "subjectivity": 0.38
        },
        {
            "comment_id": "hijeqs0",
            "body": "\"sir, I don't think I'll be able to finish it on time.\"\n\n\"Well yeah it was due last week\"",
            "polarity": 0.125,
            "subjectivity": 0.35555555555555557
        },
        {
            "comment_id": "hijejie",
            "body": "ULPT : If it's an email submission, send a corrupted file with the same extension and a valid name.\n\nThe teacher is more likely to email you when they're evaluating",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.5416666666666666
        },
        {
            "comment_id": "hijdfvn",
            "body": "As someone who works in higher education, the sooner you let me know a deadline won't work for you, the sooner we can figure out an alternative. If you try to address a deadline after it's passed, then I assume you forgot and are trying to cover it up and now I am much less likely to grant an extension.\n\nI also make sure my syllabus is very clear that communication is super important and it's much easier to address concerns that are well-documented and brought up in advance.\n\nTo be honest though, due dates are a real interesting topic... Enforcing them doesn't really do much for students (and can be detrimental to alternative students or students from disadvantaged backgrounds) but without enforcement, some students will never submit anything. It's a weird spot where now we have new conversations about ungrading and alternative approaches to assessment. I'm really curious to see where education is in 10 years and what the new approaches to these situations are.",
            "polarity": 0.1715246212121212,
            "subjectivity": 0.6221654040404041
        },
        {
            "comment_id": "hijctrs",
            "body": "I literally tell my students and put it in the syllabus that I will ALWAYS grant the extension if they ask for it. I don't even need a reason. Just ask before it's due and I'll say yes. Tell me how long you need and I'll say ok. \n\nHardly any of them do it though\n \nI dunno why.  I recently went and got a grad degree. You better believe I emailed my professors and asked for extensions wherever I needed them... It worked every time.",
            "polarity": 0.08888888888888889,
            "subjectivity": 0.42777777777777776
        },
        {
            "comment_id": "hijckrg",
            "body": "As a teacher I fully endorse this. The more notice you can give the better.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijcih4",
            "body": "I am a teacher and I can confirm, I am very flexible when you ask before the assignment is due. I will offer an extension. If you wait until after the due date, I am inflexible and will say, “tough shit”",
            "polarity": -0.17314814814814816,
            "subjectivity": 0.5472222222222222
        },
        {
            "comment_id": "hijcg7h",
            "body": "This likely won't work in college but in high school I was notorious for slacking off and not turning in homework assignments. Most classes the homework was like 5-10% of the grade so fuck it. One class the homework was 20% of the grade and I didn't do any assignments. Of course near the end of the semester it just so happened to work out that I'd need to ace the final to get a C. I asked the teacher if I could turn in the late assignments I had missed, and he refused. I did the assignments anyways, brought them into class and set them on his desk and said \"I know you said you wouldn't give me credit for these late assignments, but I did them because I figured I had to study anyways for the final\" he was impressed that I did the assignments despite being told I wouldn't get credit, and did end up giving me partial credit and I finished the class with a B.",
            "polarity": 0.060000000000000005,
            "subjectivity": 0.6854545454545454
        },
        {
            "comment_id": "hijcd9k",
            "body": "Throughout all my schooling, I never once was rejected when I asked in a polite and timely manner for an extension.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijc5h9",
            "body": "It is better to ask for forgiveness than permission. A teacher can say no to an extension if you give them the opportunity, then you won’t be able to hand it in late since you already knew you couldn’t.",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.5750000000000001
        },
        {
            "comment_id": "hijbz2l",
            "body": "Another tip: if it’s a paper that has to be submitted online, copy a random .exe file, and change its extension from .exe to .docx. \n\nThis will create an unusable document and it will appear corrupted. This will grant you an extra day, but you HAVE TO HAVE a complete document when they ask.\n\nAddendum: I never tried this before so use at your own risk. I read it before, but was out of school by the time I learned of it.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijbtx6",
            "body": "Unless you are a student of Southern New Hampshire University, online you'll never receive a response to any email.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.22727272727272727
        },
        {
            "comment_id": "hijbslt",
            "body": "Seems like common sense to me... Be proactive, not reactive.\n\nAsk for additional time before missing your deadline.\n\nDon't complain afterwards if you didn't mention the risk ahead of time.\n\nEtcetera...\n\nIf there's are people who don't get this concept then I suppose it's a good LPT, but I see this more as a friendly reminder than anything.",
            "polarity": 0.215,
            "subjectivity": 0.43000000000000005
        },
        {
            "comment_id": "hijbqoe",
            "body": "Or do what I do and put a staple in the corner of the assignment cover sheet, then tear the staple out, and then put the cover sheet in the assignment drop box so it looks like the assignment got separated and it buys you like a week extra for them to notice the \"accident\" and ask you to resubmit it.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hijazv5",
            "body": "This is a new account made to farm karma by reposting. Please report it.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "comment_id": "hijaj7a",
            "body": "As a general rule I give out extensions no questions asked if a student emails me before the deadline, but won't give out extensions if a student emails me after the deadline. It's just courtesy; marking assignments takes time, and I'm not on-call, so knowing reliably when I can expect assignments helps me schedule my own life.",
            "polarity": 0.325,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hijahjk",
            "body": "I'm a college professor and I totally follow this policy. It's the one case where it truly is easier to get permission than forgiveness.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hijagei",
            "body": "College professor here:\n\nPlease do this. I am much more inclined to work with you if you are on the level. Giving me advance notice shows that you care.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hija3sx",
            "body": "You never know you can't finish it on time when you start the night before it's due...",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hij9xh5",
            "body": "I usually just submit what I have. I'll stay up all night until I'm done, and the resubmit it again. They usually don't do anything about it. I have a few other secrets as well, but I will not discuss them until I am finished with college.",
            "polarity": -0.20625,
            "subjectivity": 0.24375
        },
        {
            "comment_id": "hij9kzx",
            "body": "My god, I wish this was the norm.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij9jdx",
            "body": "As a teacher, this is 100% true",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hij9bpu",
            "body": "That's the biggest thing I've learned at my current job.\n\nAsk for help WHILE you're falling behind, not after you've missed a deadline.\n\nNobody wants to be surprised after they've been expecting something to be done this whole time.",
            "polarity": 0.02,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hij8x80",
            "body": "This is also exceptionally useful for a job as well. There is nothing wrong telling your boss that \"shit aint gonna be on time, here is why and here is what I am doing about it\".\n\nIf you have a hard boss you need to also keep this line in mind \"I have responsibilities xyz, which one should I put on the sideline to get job x done\".",
            "polarity": -0.17291666666666666,
            "subjectivity": 0.5604166666666667
        },
        {
            "comment_id": "hij8sio",
            "body": "I'm a professor and can agree with this. If someone reaches out before, it speaks if someone taking initiative and trying to get ahead of it. I RARELY get these emails, and they are almost always mature and well crafted. The emails post due date always feel hasty and hustling.",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.4583333333333333
        },
        {
            "comment_id": "hij8osg",
            "body": "I’d just rename a random small jpg file to a .doc and then use the extra time waiting for the professor to email me saying the file didn’t work.",
            "polarity": -0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hij8ir9",
            "body": "This goes for work too.   Let your boss/project manager know if you're going to not hit a deadline.   Gives us time to mitigate the blowback from above.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hij7a2q",
            "body": "My experience with that was always \"well you've still got 12 hours, best get on it\"\n\nWhile emailing at the last possible second with a \"sorry [extenuating circumstances] prevented me from completing this, can I have another day or two?\" Usually worked because \"you've got 5 minutes\" isn't even a statement.",
            "polarity": 0.041666666666666664,
            "subjectivity": 0.4361111111111111
        },
        {
            "comment_id": "hij70uy",
            "body": "Haha I just sent a screenshot of this to my GF and asked what she thought of it lol.  She teaches some biology courses out here at the community college.  She'll rant to me about some of the more pretentious and irresponsible cases she has.  I wonder though how exactly much leeway she is allowed to give in order to make shit more fair and amicable to everybody as a whole.  That could be the only thing I could see getting in the way of what this LPT is saying.  I know her bosses look at shit like that.\n\nBut fuck it, if you're gonna ask then I still agree you probably have better chances speaking up earlier rather than too late.",
            "polarity": 0.14666666666666667,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hij6k9b",
            "body": "Same thing with a job, lets say your boss gives you a project and you think you can do it so you accept. Then you start working on it and you realize that you dont know enough yet to be able to do it, dont sit and struggle with it until its already too late.\n\nJust talk with your boss and tell him or her that you are not up to the task and you wont be able to complete it in time. You dont even have to say why. This will actually make your boss a lot less unhappy with you, then if you dont say anything and have an unfinished project when the deadline arrives.\n\nI know how it can feel, your boss have trusted you with a project and now you can do it, it sucks. But tell your boss as soon as possible so that he or she can give it to someone else instead. He or she will actually like you more because you arent causing any unnecessary problems. He or she will even trust to give you more projects in the future because if you cant do it you dont cause any problems.",
            "polarity": 0.020833333333333332,
            "subjectivity": 0.4604166666666667
        },
        {
            "comment_id": "hij6ggf",
            "body": "Or, send the assignment and \"forget\" to attach the document.  Boom: extra day to work on it",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hij6ep1",
            "body": "This is huge! I had an interview lined up and realized two hours prior I would be late. Always always always email them. Worst case scenario you don't get the interview, but it's so much better than seeming like you don't care.",
            "polarity": -0.05999999999999996,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hij63hx",
            "body": "We didn't use emails at school. There was 0 way to contact any teachers, unless you had their phone number but that was for parents. Generally, if you had a good reason, they'd give you a new deadline, if not, you'd just get an F.\n\nAnd at uni the rules are clear. The dates are specified at the very beginning, at my uni you could get a 2 week extension but you had to ask before (usually 1 week before). Any other options only if you had a good reason with proof, e.g. a doctor's letter, but they'd usually give you a completely new assignment, or even make you repeat a year.\n\nAnd I'm 22 so it's not like I went to school 50 years ago... Just graduated uni this year.",
            "polarity": 0.1270661157024793,
            "subjectivity": 0.46976584022038564
        },
        {
            "comment_id": "hij5s6s",
            "body": "Overall talking to the teachers, asking questions, asking for guidance shows initiative and makes big difference",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hij5jvm",
            "body": "Yes! Do this! I teach at a uni and actively tell my students this. We understand you’re an adult with a ton of responsibility. Part of that responsibility is time management. Understanding there’s too much on your plate, coming up with a game plan, and pitching a solution to the prof looks a lot better than turning in either a) substandard work on time, or b) good work that’s late.",
            "polarity": 0.09523809523809522,
            "subjectivity": 0.4571428571428572
        },
        {
            "comment_id": "hij5clc",
            "body": "Better yet, email your teacher/professor/boss as soon as you realize you will not be able to make the deadline. The more time before the deadline you give notice, the more options that become available.",
            "polarity": 0.48,
            "subjectivity": 0.505
        },
        {
            "comment_id": "hij5ca1",
            "body": "As a professor I agree with this statement",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij3pya",
            "body": "College Prof here. The LMS also tells us WHEN you open the assignment.  Don't expect mercy if you read the assignment for the first time ten minutes before it's due. \n\nGrandmas have a tendency to die around 11:30 PM on due dates.",
            "polarity": 0.0,
            "subjectivity": 0.31666666666666665
        },
        {
            "comment_id": "hij3e17",
            "body": "Just be aware this has diminishing returns if you do this more than a couple two or three times.",
            "polarity": 0.375,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hij340f",
            "body": "This doesn’t just work for students but anyone. Give people a heads up about just about anything will help them get ready for what will occur and help plan for things.",
            "polarity": 0.2,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hij2se5",
            "body": "I never understood teachers that ask you to let them know BEFOREHAND that you can't finish an assignment. Unless I had some ongoing condition, then there would be no way for me to know! Things usually come up ALONG the way that prevent you from completing an assignment, and if you're gonna give us extra time anyways what's the big deal about asking after? It's like asking for an extension, but I obviously want an extension on every assignment so how would I know when to ask? There are a lot of times when I think there is an assignment that will take a bunch of time and I probably won't finish but it's actually really easy. There are also times when I think an assignment is super easy but it actually takes the whole day. There's just no way to know",
            "polarity": 0.12777777777777777,
            "subjectivity": 0.42037037037037034
        },
        {
            "comment_id": "hij2qzk",
            "body": "If I'm not organised enough do finish the assignment, do you really think I'm gonna be organised enough to email them beforehand?? Get it together.",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hij2p0u",
            "body": "This doesn't work if you are in any higher learning like a masters in STEM. Asking for any leniency in any way will probably not even result in a reply from the examiner.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hij2lzz",
            "body": "This applies to work too. As a manager, I'd throw out target dates and ask my staff to take a day and get back to me if the target seemed unreasonable. Finding out 24 hours later that a 2 week project would take 4 weeks is way better than finding out after two weeks that the project will take another two weeks.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "comment_id": "hij2jsb",
            "body": "I made the mistake of walking up to my professors lectern and advised him sheepishly that I was absent the day before due to illness. He replied rather loudly that this is not high school if you miss a class I don't care you paid for it not me. Just one of my embarrassing moments in college.",
            "polarity": -0.034999999999999996,
            "subjectivity": 0.5716666666666667
        },
        {
            "comment_id": "hij2b6h",
            "body": "I work in university level education. You'll be asked for proof of why you can't make the deadline. A doctor's cert for sickness, death notice if it is a funeral etc. Solid LPT though.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hij287y",
            "body": "Most professors will be understanding if you communicate with them beforehand.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hij221o",
            "body": "Good advice, won't always work.\n\nI gave the heads up to my employer that I couldn't make it in tomorrow. She gave a huge rant about how I needed to give more notice and she wouldn't approve it. I told her I literally found out a minute ago and I was telling her, not asking her.",
            "polarity": 0.5333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hij1j1n",
            "body": "This is one of those things you learn in school that ACTUALLY is very useful later on in life.    \n\n\nWhether you're working in an office setting or plumbing a house, let folks know early if you're not going to make a deadline.",
            "polarity": 0.16333333333333333,
            "subjectivity": 0.09999999999999999
        },
        {
            "comment_id": "hij1ehs",
            "body": "Email with \"corrupted file\" assignment.. then the teacher may ask you again to resend the file. If you are lucky. But be ready to get zero score, too..",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.6666666666666667
        },
        {
            "comment_id": "hij1cvj",
            "body": "100% this. I work in administration for an educational institute. We are 100% behind our students and want them to be as successful as they can be in their studies and happy during their time with us. There are proceedures in place for students that need support. If you need help don't hesitate to fire out an email or two. Also, don't forget that if your school/college/uni has support services they aren't just for students with learning difficulties/disabilities etc. Our support services will help with life coaching. Tips and tricks on time managment, budgeting, transport etc.",
            "polarity": 0.35,
            "subjectivity": 0.725
        },
        {
            "comment_id": "hij1ckk",
            "body": "College TA here—unless explicitly directed not to, I will always grant my students an extension if they email me ahead of time. Do it!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij10v9",
            "body": "College professor here. I have this as part of my syllabus but I'll say it here because it's relevant: if you have things come up that are challenging your success (e.g. death in the family, sickness, depression or anxiety, etc.) **tell us that you're having trouble ASAP**. I don't need to know the nature of the problem, but if you tell me that *something* is going on then I can help figure out accommodations!\n\nWhat I can't do is just make up a grade for you at the end of the term after you fail multiple assignments or fail to even show up to the final exam (which has happened). I think most of us are pretty accommodating if we know in time that you need help.",
            "polarity": 0.06999999999999999,
            "subjectivity": 0.5199999999999999
        },
        {
            "comment_id": "hij10so",
            "body": "If you email after, all they’ll be able to say is “We do not negotiate with terrorists.”",
            "polarity": 0.5,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hij0fif",
            "body": "My uni course for my masters had 6 people on it, often doing group projects... If we were running behind due to unforseen bugs (it's a VR game dev course) we got extensions pretty often, I think one project was extended like 3 times",
            "polarity": -0.16875,
            "subjectivity": 0.61875
        },
        {
            "comment_id": "hij0aty",
            "body": "epic life pro tip moment",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hiizz8o",
            "body": "This is actually not a bad advice. I'm gonna email my professor right now and do this. \n\nUpdate: Didn't work. He said the assignment was given to my class in October of 2016 and that he retired last year from teaching.",
            "polarity": 0.2119047619047619,
            "subjectivity": 0.423015873015873
        },
        {
            "comment_id": "hiizt8p",
            "body": "Honesty and showing you care about not having something done can get you pretty far, which I think this post pretty much means. \n\nThe thing I noticed myself is a lot of people who get written up for being late or not making assignments is that they don't even act like they care or just don't even try to talk about it. The teachers will in that case just assume laziness. \n\nPersonally I always tried to explain why I couldn't make something on time, or when I was late for class. It got me out of quite a few punishments even with really strict teachers. If you're honest with them and show you have valid reasons (even if sometimes exaggerated a little 😉) they will genuinely just start to like you more and let you slip up every once in a while.",
            "polarity": 0.07232142857142858,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hiizmo9",
            "body": "This LPT is also true of work quality, both in academia and the world of work. I would much rather have someone come to me and say, \"I have not had time to fully develop this project. Would you rather I hand in what I have or take another few days to finish it to a higher standard?\"\n\nSome projects are better off being done *right* instead of *right now*",
            "polarity": 0.2089285714285714,
            "subjectivity": 0.3776785714285714
        },
        {
            "comment_id": "hiizggn",
            "body": "Being married to a teacher there is one vital part that's being left out. This needs to be a rare exception, not the rule on assignment submissions. \n\n&amp;#x200B;\n\nIf you turn in every assignment on time and make a good faith effort then life happens once, it's going to get some leeway. If every assignment can't be completed on time, you really are just planning and allocating your time poorly then expecting the teacher to compensate for it.",
            "polarity": 0.16428571428571428,
            "subjectivity": 0.42142857142857154
        },
        {
            "comment_id": "hiiypgi",
            "body": "Related to this: I once had an exam essay question for a Shakespeare unit that was something like \"discuss the feminist elements of 'The Winter's Tale' - only the week we read that one I had been slammed finishing a final project for a course in my major and didn't read it. I figured leaving it blank was a bad plan so I wrote, \"I admit, I did not read The Winter's Tale but feminism is a key theme of Much Ado About Nothing exemplified by...\"\n\nI think I got a 6 / 10 because at least I could show that I could write about the topic on some level. \n\nBetter to try it than skip it!",
            "polarity": -0.011249999999999982,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "hiiypbo",
            "body": "Even then show that you're planning it out and making your best effort to get it done on time. Say \"I'm not sure if I will need the extra time, but could I have an extension just in case?\" Once in undergrad I was just having a generally rough time and asked that to a professor when I needed just an extra day, and he gave me an extra week!",
            "polarity": 0.10833333333333334,
            "subjectivity": 0.3148148148148149
        },
        {
            "comment_id": "hiiyg87",
            "body": "I wish it was true.. \n\nI had to babysit my invalid grandmother one weekend and ask for an additional 24 hours as she lived with parents 4 hours away. Professor basically told be to fuck off. This was with me going to school FT and working 40 hours a week.\n\nYou can ask, but be prepared to get told no.",
            "polarity": -0.025000000000000022,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hiiy040",
            "body": "Or suck it up and finish it on-time.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiixig9",
            "body": "Why did you capitalize before and after?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiixfaz",
            "body": "I can vouch for this LPT! I remember doing my first-ever late assignment and emailing my teacher as a last resort at like 11 PM.\n\nHe responded a few minutes later and I got an extension. Don't recommend doing it often, though. And the fact that you need to be in the teacher's good graces to pull it off.",
            "polarity": 0.039999999999999994,
            "subjectivity": 0.2733333333333333
        },
        {
            "comment_id": "hiix7fz",
            "body": "\"You can hand in the assignment after the due date, but you'll receive a 0.\"",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiix1nx",
            "body": "Great advice beyond just school. For me it's a respect thing. I know everyone has shit on the go, and due dates get missed non stop. Taking the time to lay out everything in front of you and say, \"there's no way I'll get this done on time\" is the kind of behaviour and thinking that teachers, managers etc should foster. You then have to think about how you got too much on your plate, can you give this task your full attention etc, but when I'm leading people I have little tolerance (0 tolerance, really, barring something like death/illness) for excuses after the fact. The difference between a note 48 hours in advance vs 4 is staggering and it's the fastest way to accelerate your career. \n\nMost leaders (read, good ones) don't care about due dates as much as you taking their ask seriously.",
            "polarity": 0.19839743589743591,
            "subjectivity": 0.508974358974359
        },
        {
            "comment_id": "hiiwujg",
            "body": "As a teacher-type I've found the best approach is to be friendly and extend any and every grace within my power for all my students, whether they have the courage to contact me ahead of time for problems or not.\n\nBut yes, it *is* nice to get a heads-up on things.",
            "polarity": 0.6583333333333333,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hiiwj22",
            "body": "Or manage your time better rather than work on perfecting excuses.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiiwfmn",
            "body": "Teacher here. I ONLY accept late work if the email arrives before the due date.",
            "polarity": -0.14166666666666666,
            "subjectivity": 0.6583333333333333
        },
        {
            "comment_id": "hiiwb8e",
            "body": "Unpopular opinion: make sure you have it done on time.\nUnethical opinion: submit a completely different assignment and say it was a mistake",
            "polarity": 0.25,
            "subjectivity": 0.7444444444444445
        },
        {
            "comment_id": "hiiwa4k",
            "body": "This also is helpful in the career world.  Renegotiating before the due date is huge.  Very important skill that not many people have.",
            "polarity": 0.13625000000000004,
            "subjectivity": 0.69375
        },
        {
            "comment_id": "hiiw8jr",
            "body": "Y'all spelled \"cool under pressure\" wrong!\nPerspective.",
            "polarity": -0.1375,
            "subjectivity": 0.775
        },
        {
            "comment_id": "hiiw52p",
            "body": "I am a teacher (24 years), agree 100%. You struggle with an assignment, lemme know. Not 2:30 Am bullshit, but just getting thru stuff. And, as an educator of 24 years, why in the fk are we still giving homework? Two, maybe 3 times *a year* I give \"homework\", or what it's supposed to be called, *PRACTICE*. It's fucking *PRACTICE*, my fellow teachers. If you'd ever coached you'd know how important the mistakes are, and how important it is for them *to correct themselves.*",
            "polarity": 0.0666666666666667,
            "subjectivity": 0.9333333333333332
        },
        {
            "comment_id": "hiivyj9",
            "body": "This! It is also much harder for a teacher to make allowances after the submission deadline because it's not fair to other students who may have worked hard to submit by the deadline. Ask early. Most teachers are human they understand life happens.",
            "polarity": -0.038095238095238106,
            "subjectivity": 0.38809523809523805
        },
        {
            "comment_id": "hiivsrr",
            "body": "This is totally something I would do so I could procrastinate longer",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hiivp7d",
            "body": "I've completed 3 college degrees while working full time and I don't think I've ever had a professor deny me an extension on anything as long as I asked in advance. I'm not saying there aren't professors who would, or that it'll work if you do it every time for every assignment, but most of them are pretty good about knowing that life happens, and that communication is what seperates \"life happens\" from \"I'm a dirt bag.\"\n\nI'm the same way with my employees at work. As long as they communicate with me about what's going on, there's very little I can't/won't work with.",
            "polarity": 0.18203124999999998,
            "subjectivity": 0.5281250000000001
        },
        {
            "comment_id": "hiiv3co",
            "body": "This is a great skill to learn. It’s easier said than done. I am an executive function/ADHD coach, and teaching students to reach out proactively and self advocate with their teachers is one of the biggest things we do. They usually require tons of support in this aspect.",
            "polarity": 0.275,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiiuy9n",
            "body": "As an 11th grade teacher, I build incentive to do this into my courses. Email me for an extension before the due date with a reasonable timeline and I’ll work with them to get the work turned in despite it being late.",
            "polarity": -0.075,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hiiuw6j",
            "body": "This goes for work as well. Anything with a due date can generally be pushed a couple days if needed and you communicate in advance that there are delays or issues. The farther out in advance you communicate, the more likely you are to get an extension because it shows that you are actively working on the task in advance and there simply is not enough time to complete it.",
            "polarity": 0.05595238095238096,
            "subjectivity": 0.5535714285714286
        },
        {
            "comment_id": "hiiuhlj",
            "body": "If you're an adult, also do this. \n\n&amp;#x200B;\n\nIn the law, it's actually codified into different standards if you ask for more time before a deadline as opposed to after.  BAsically, a very liberal standard if you ask before, and higher standards like good cause, excusable neglect, etc if you ask after.",
            "polarity": 0.21875,
            "subjectivity": 0.3625
        },
        {
            "comment_id": "hiiua91",
            "body": "How is this a life changing tip? Next you’re going to tell me I’m supposed to take my pants off before taking a shit?",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hiisp9l",
            "body": "This applies to workplaces as well. I can’t tell you how many people don’t show up or come in late that make excuses after the fact.  Just call me and tell me you can’t come in, that you’re running late, that you’re struggling with your mental health today, whatever, just don’t do it after the fact.",
            "polarity": -0.049999999999999996,
            "subjectivity": 0.47500000000000003
        },
        {
            "comment_id": "hiisoyd",
            "body": "As a teacher I endorse this message. Same if there's something you don't understand or aren't sure about.",
            "polarity": 0.25,
            "subjectivity": 0.5069444444444444
        },
        {
            "comment_id": "hiisecx",
            "body": "“Did you read the syllabus?”",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiis9uh",
            "body": "If you are a teacher, stop giving extensions to idiots while the rest of the class manages to complete the assignment on time.",
            "polarity": -0.35000000000000003,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hiis2ma",
            "body": "This reminds me of a situation from school. \n\nWe had had an assignment but neither me nor my friend had it. We were sitting together before class and I went to the teacher telling him that I don't have the assignment. He said to have it ready until next time. Then class started and immediately my friend was asked to present his assignment. Well he didn't have it either but didn't tell the teacher beforehand. The teacher wasn't having any of it and gave him a 6 (worst note). Funniest thing is that the teacher is the father of my friend.",
            "polarity": -0.2,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiirdzr",
            "body": "LPT: This is called expectation management, and is a life skill you need in all aspects of life. Do this for EVERYTHING you have a deadline on and can't follow through on in time. Be that for work or friends/family.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiirb19",
            "body": "SLPT: if you need a few extra hours to finish an assignment and it's a word/excel/PowerPoint file, make a copy of the file, right click and open in notepad, and then delete a block of text in there. It will show up as being corrupt when someone tries to open it and as long as you have the actual assignment done by the time they ask about it you're in the clear",
            "polarity": -0.04642857142857144,
            "subjectivity": 0.4019047619047619
        },
        {
            "comment_id": "hiir1df",
            "body": "LPT: This isn't exclusive to students",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiiqu2t",
            "body": "I'm an editor who hires freelance writers, and it's exactly the same for them. I make it very clear when I give them their first assignment: If they email me before the deadline to ask for more time, they get it no questions asked. If they email me after, or don't email at all, I will never work with them again.",
            "polarity": 0.22599999999999998,
            "subjectivity": 0.3413333333333333
        },
        {
            "comment_id": "hiiqr5h",
            "body": "Gotta be honest, it most likely won’t work both ways so you better be working for your assignments.",
            "polarity": 0.4,
            "subjectivity": 0.725
        },
        {
            "comment_id": "hiiqo29",
            "body": ".... do people actually not email their teacher when they know their assignment is going to be late? God damn no wonder why so many people struggle with college",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hiiqk9s",
            "body": "This goes for anything with a deadline. Just be honest, and you’ll go a lot further",
            "polarity": 0.3,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hiipyqv",
            "body": "That would require me to remember I had an assignment due before the due date.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiipq90",
            "body": "As a  professor, I approve of this tip!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiipgzj",
            "body": "As a teacher, I approve this message.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiip96u",
            "body": "Wow, I didn't know common sense could be lpt nowadays.",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hiip33z",
            "body": "Also include what you have completed so far.  This will show you are working on it.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hiiorte",
            "body": "In general, people should provide an explanation for unexpected or unwanted behaviour rather than waiting to be asked and it looking like an excuse. Never assume because people don't say something that they didn't notice.\n\nAs a manager you see this a lot at work. I don't want to be having a conversation with a worker because there are problems, only to find out there's an issue they have let fester for ages that could have been easily resolved or was a misunderstanding.",
            "polarity": 0.10666666666666666,
            "subjectivity": 0.6766666666666666
        },
        {
            "comment_id": "hiinssy",
            "body": "I tell my students this! They are basically guaranteed an extension if they contact me before the due date and still, no one does.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiino30",
            "body": "Why not follow a real tip- Don't wait until the last minute, instead start working on the assignment when you get it.",
            "polarity": 0.1,
            "subjectivity": 0.18333333333333335
        },
        {
            "comment_id": "hiimn5f",
            "body": "Indeed.  Fact is, your teachers want you to pass. They're on your side. Most of them, at least. Even from a cynical standpoint that drop-out rates and failure rates don't look good in league tables. It's in nobody's interests for you to struggle, fail, or drop out. Reach out early and let them help you if they can. And if you're unlucky enough to have an unhelpful teacher/tutor/supervisor, and you really care about your education, ask someone else. Don't panic, or stew in your worries.",
            "polarity": -0.02407407407407408,
            "subjectivity": 0.4555555555555555
        },
        {
            "comment_id": "hiimf1s",
            "body": "In my experience, teachers lay out their policy on late work at the beginning of the semester. Im also assumign were talking about college and not anything prior to that. \n\nThey either accept late work or they dont. None of my professors that have said they will not accept late work have made exceptions unless its something catastrophic that happens like a death in the family. So if you just dont have time, I dont see it making a difference that you emailed them when their policy is no late work. Manage your time better, push out a half-assed assignment and turn it in. Its better than nothing.",
            "polarity": 0.03571428571428573,
            "subjectivity": 0.4857142857142857
        },
        {
            "comment_id": "hiilqg3",
            "body": "What happened to \"it is easier to ask for forgiveness than permission\"?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiiljl1",
            "body": "This is just common sense...",
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiilgrr",
            "body": "also if you need to send a pdf just send a corrupt pdf, you can corrupt any pdf on some webs so easy",
            "polarity": -0.18888888888888888,
            "subjectivity": 0.9444444444444445
        },
        {
            "comment_id": "hiikuei",
            "body": "I feel like teachers in my life have never been lenient. That being said, professors seem to be more considerate, maybe cause they are adults working with adults and not an adult with kids? Idk the exact science but our school basically forced teachers to allow late credit, and kids exploited it or were thankful for it depending on their situation. \n\nI’ve had to do this only once, it was because of a group project and someone was refusing to finish the rest of the work.",
            "polarity": 0.10714285714285714,
            "subjectivity": 0.5357142857142857
        },
        {
            "comment_id": "hiijoof",
            "body": "This applies to life in what working world.  If you tell you boss in advance of your delays, you two at least have some time to mitigate expectations or shuffle resources around.",
            "polarity": -0.3,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hiijjqz",
            "body": "That's when you submit a corrupted word file and claim you had no idea.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiienxp",
            "body": "What if its 4am, you're out of coffee and you still got 3000 words to write before 9am?\n\n(people don't plan to be late, is all im sayin)",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hiidneu",
            "body": "As someone who teaches at an Australian university, due date extensions are handled by the student office, and we have no control over whether to grant extra time or not. Nor do students get granted it based purely on a plea of \"I don't have enough time.\" There must be legitimate, unforeseen grounds.\n\nIs this not common practice in US colleges?",
            "polarity": 0.03988095238095238,
            "subjectivity": 0.32916666666666666
        },
        {
            "comment_id": "hiideyr",
            "body": "This works for being sick as well. This year I have missed a class due to just getting bombarded with staph, strep, and now something else… I have missed probably 1/3 of my classes. \n\nI was super anxious about emailing professors out sick, but what I’ve learned is just be upfront and honest, and participate when you are in class, and they don’t care if you miss a lot. Just email them before you miss the class.",
            "polarity": -0.14503968253968255,
            "subjectivity": 0.7759920634920635
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hii3xr3",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hii9zu6",
            "body": "I think if one were to make a Venn diagram of people who are frequently late with school work and people who can proactively consult with the teacher, that Venn diagram would look like sunset on Tatooine.",
            "ups": 3249,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hiideyr",
            "body": "This works for being sick as well. This year I have missed a class due to just getting bombarded with staph, strep, and now something else… I have missed probably 1/3 of my classes. \n\nI was super anxious about emailing professors out sick, but what I’ve learned is just be upfront and honest, and participate when you are in class, and they don’t care if you miss a lot. Just email them before you miss the class.",
            "ups": 2841,
            "downs": 0,
            "polarity": -0.14503968253968255,
            "subjectivity": 0.7759920634920635
        },
        {
            "comment_id": "hii528i",
            "body": "LPT: If you’re going to be late for work, call your boss BEFORE you arrive late, not AFTER.",
            "ups": 654,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hiimn5f",
            "body": "Indeed.  Fact is, your teachers want you to pass. They're on your side. Most of them, at least. Even from a cynical standpoint that drop-out rates and failure rates don't look good in league tables. It's in nobody's interests for you to struggle, fail, or drop out. Reach out early and let them help you if they can. And if you're unlucky enough to have an unhelpful teacher/tutor/supervisor, and you really care about your education, ask someone else. Don't panic, or stew in your worries.",
            "ups": 425,
            "downs": 0,
            "polarity": -0.02407407407407408,
            "subjectivity": 0.4555555555555555
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hii3xr3",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hiideyr",
            "body": "This works for being sick as well. This year I have missed a class due to just getting bombarded with staph, strep, and now something else… I have missed probably 1/3 of my classes. \n\nI was super anxious about emailing professors out sick, but what I’ve learned is just be upfront and honest, and participate when you are in class, and they don’t care if you miss a lot. Just email them before you miss the class.",
            "ups": 2841,
            "downs": 0,
            "polarity": -0.14503968253968255,
            "subjectivity": 0.7759920634920635
        },
        {
            "comment_id": "hiimn5f",
            "body": "Indeed.  Fact is, your teachers want you to pass. They're on your side. Most of them, at least. Even from a cynical standpoint that drop-out rates and failure rates don't look good in league tables. It's in nobody's interests for you to struggle, fail, or drop out. Reach out early and let them help you if they can. And if you're unlucky enough to have an unhelpful teacher/tutor/supervisor, and you really care about your education, ask someone else. Don't panic, or stew in your worries.",
            "ups": 431,
            "downs": 0,
            "polarity": -0.02407407407407408,
            "subjectivity": 0.4555555555555555
        },
        {
            "comment_id": "hii9zu6",
            "body": "I think if one were to make a Venn diagram of people who are frequently late with school work and people who can proactively consult with the teacher, that Venn diagram would look like sunset on Tatooine.",
            "ups": 3248,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hii528i",
            "body": "LPT: If you’re going to be late for work, call your boss BEFORE you arrive late, not AFTER.",
            "ups": 657,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hii3xr3",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hiideyr",
            "body": "This works for being sick as well. This year I have missed a class due to just getting bombarded with staph, strep, and now something else… I have missed probably 1/3 of my classes. \n\nI was super anxious about emailing professors out sick, but what I’ve learned is just be upfront and honest, and participate when you are in class, and they don’t care if you miss a lot. Just email them before you miss the class.",
            "ups": 2840,
            "downs": 0,
            "polarity": -0.14503968253968255,
            "subjectivity": 0.7759920634920635
        },
        {
            "comment_id": "hiimn5f",
            "body": "Indeed.  Fact is, your teachers want you to pass. They're on your side. Most of them, at least. Even from a cynical standpoint that drop-out rates and failure rates don't look good in league tables. It's in nobody's interests for you to struggle, fail, or drop out. Reach out early and let them help you if they can. And if you're unlucky enough to have an unhelpful teacher/tutor/supervisor, and you really care about your education, ask someone else. Don't panic, or stew in your worries.",
            "ups": 427,
            "downs": 0,
            "polarity": -0.02407407407407408,
            "subjectivity": 0.4555555555555555
        },
        {
            "comment_id": "hii9zu6",
            "body": "I think if one were to make a Venn diagram of people who are frequently late with school work and people who can proactively consult with the teacher, that Venn diagram would look like sunset on Tatooine.",
            "ups": 3252,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hii528i",
            "body": "LPT: If you’re going to be late for work, call your boss BEFORE you arrive late, not AFTER.",
            "ups": 654,
            "downs": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        }
    ]
}