{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=4bEpJNejSu0",
    "time_now": "2021-11-01 05:46:47",
    "ups": "5018",
    "downs": "240",
    "views": "364414",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "why this guy gives  \n\nme lil nas vibes.... shit is weird",
            "polarity": -0.35,
            "subjectivity": 0.9
        },
        {
            "body": "NEW #shorts Video! Subscribe!! ✨❤️ https://youtube.com/shorts/4q9FTTMAtZQ?feature=share",
            "polarity": 0.26633522727272724,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Real Talk Wale on some wierdo type ish ! I don't mind his music but he act like he bigger than what he is and not just a intervert he wierdo goofy ish lacks respect he trying act too cool on sum Kanye steez!! Was funny interview thou they all drunk as fuck but Wale \" YOU GOTTA RELAX\" #FACTS🤘💯",
            "polarity": 0.09241071428571428,
            "subjectivity": 0.7214285714285714
        },
        {
            "body": "this show is so damn weird",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Versuz wit Wale v. Lupe make sense but Wale v. Royce or Banks could work",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why tf is wale so paranoid? It made the interview so awkward. Like nigga calm tf down",
            "polarity": -0.15185185185185182,
            "subjectivity": 0.6796296296296296
        },
        {
            "body": "Ayyye the 2nd half of this interview is bugged out. Only time I may have seen Nore more fried than this was the Lamar Odom interview 😂😂😂\n\nJokes aside, Wale my favorite artist of all time & I'm glad he gave HIMSELF flowers on this album. #FolarinII is a classic 🌹",
            "polarity": 0.21428571428571433,
            "subjectivity": 0.5476190476190477
        },
        {
            "body": "Those tiny ass shots dude taking are a good reflection of his character!!!",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "This gotta be the first Quick Time without asking Jay Z or Nas",
            "polarity": 0.29166666666666663,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "Now this is a drink champs combo I like! Wale always gives it up during an interview, haven’t watched yet but I’m surprised this wasn’t longer",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "body": "Wale corny as hell up there acting bougie like a girl straight female bruh",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.18888888888888888
        },
        {
            "body": "Wake definitely stamped pg county appreciate him 💯",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "This interview is making me cringe. Wale was saying a lot of hurtful shit that no one really understood why he was saying it? He was very paranoid and made unnecessary comments on the show. I feel like when you’re a guest on Drink Champs you should be more respectful. He used this for a press run. Just use Breakfast Club and Hot 97 only next time bro.",
            "polarity": 0.11666666666666667,
            "subjectivity": 0.5833333333333334
        },
        {
            "body": "Wale, T-pain, and Jack Thriller same time!",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Wale was hella spicy during this interview. Borderline flamboyant 🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please get Camp Lo on drink Champs!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wale too jaded bro. He reminds me of the QB who has been sacked so many times that they just decide to scramble every play. Wale gotta relax bro. Let your o line block for you some time. 🤦🏾‍♂️ he obviously wanna be there because if he didn't want to, he wouldn't have come. But to come and then have your guard up like it's 2013 again... Gotta relax. Everybody ain't out to use and abuse",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "This is why nobody like his ass,you on Drink Champs acting hella funny style",
            "polarity": 0.125,
            "subjectivity": 0.5
        },
        {
            "body": "Fat trel let that thang go 😅",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "WALE not a legend yet",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}