{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=4bEpJNejSu0",
    "time_now": "2021-11-04 20:18:35",
    "ups": "7148",
    "downs": "396",
    "views": "615038",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Wale a legend you can tell shit is going thru his mind a million miles a minute and he can’t always contain his thought and emotions EFN was getting so annoyed at times😂😂 this was classic",
            "polarity": -0.1444444444444445,
            "subjectivity": 0.5888888888888889
        },
        {
            "body": "At the end of this interview, when Freddie Gibbs was on FaceTime, that stroke a nerve with NORE, something only Wale & NORE them no! I wanna no what’s really going on",
            "polarity": 0.1,
            "subjectivity": 0.6
        },
        {
            "body": "EFN was getting annoyed Wale kept checking his phone lol",
            "polarity": 0.2,
            "subjectivity": 0.75
        },
        {
            "body": "Wale was hella hard to watch at first but as the liquor started flowing he loosened up. He's socially awkward and an introvert, seems like he needs to be comfortable for his personality to flow, dude is actually funny. I get it now.",
            "polarity": 0.001666666666666683,
            "subjectivity": 0.735
        },
        {
            "body": "It’s definitely some personal issues sensed in this interview.. Secret beef and Wale put him on the spot with putting Freddi on the phone.. Nore ain’t feel this episode",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "Yess! Best interview ever! Wale knows how to put people in their place",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "🔥🔥🔥🔥🔥",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That shot (pause) was nothing. They can’t assume someone has to be an alcoholic bc of a double shot 🤦🏾‍♂️",
            "polarity": -0.125,
            "subjectivity": 0.25
        },
        {
            "body": "NORE tried to dip off early! HAHAHAHA 2:09:08",
            "polarity": 0.1625,
            "subjectivity": 0.4
        },
        {
            "body": "@50:48 \"I'll stab you and go play basketball\" 😂😂😂 Nore can get away with that joke",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wale is annoying ,interview could’ve been better moments like these hurt wale’s career. Didn’t really get anything from this interview it was low key wack",
            "polarity": -0.020000000000000007,
            "subjectivity": 0.58
        }
    ]
}