{
    "post_url": "https://www.reddit.com/r/politics/comments/qircr7/tucker_carlson_draws_bipartisan_backlash_for/",
    "time_posted": "2021-10-29 21:44:39",
    "time_now": "2021-10-30 16:49:17",
    "ups": 1608,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hilau3l",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hins0as",
            "body": "I think we cal these type of films mockumentories.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinrdgn",
            "body": "Dude is continually using racist and all around terrible talking points that somehow make sense to terrible people.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hinqf8y",
            "body": "I was going to watch the documentary but I decided to live my life instead.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hinays2",
            "body": "Not in the conversations I'm seeing. Conservatives are latching on to that story like a life raft.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinajnk",
            "body": "I don’t get it… are Tucker Carson’s parents proud of him spreading harmful lies and throwing his credibility down the toilet like this?",
            "polarity": 0.20370370370370372,
            "subjectivity": 0.42962962962962964
        },
        {
            "comment_id": "hin7i8u",
            "body": "There is a \"false\" flag.  It has a thin blue line on it",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.5166666666666667
        },
        {
            "comment_id": "hin4fvj",
            "body": "Someone better punch the pompous mug he has. He is a literal demon that owns the attention of the American public in viewership.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.18888888888888888
        },
        {
            "comment_id": "hin3sn6",
            "body": "We don’t need to investigate these heroic patriots! Trump says we love them! They were almost entirely peaceful, and Ashli Babbitt was a martyr! Investigating what happened is just a form of persecution!\n\nBut here’s a vivid portrayal of the insidious violent terrorist attack of Jan 6 that was planned and launched by government officials we refused to investigate.",
            "polarity": 0.24312499999999998,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hin36sg",
            "body": "Tucker + Karen = trump",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin2nmk",
            "body": "People really think Republicans have no chance at winning 2024. But if Tucker and desantis run together, We would need a turn out like never seen before to defeat them. We are honestly pretty lucky as a country that he is content on grifting senior citizens on fox or he'd make Trump look like a moderate and fair man.",
            "polarity": 0.33055555555555555,
            "subjectivity": 0.7305555555555556
        },
        {
            "comment_id": "hin1fat",
            "body": "is anyone surprised by this? he was spewing this lie by jan 7th.",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hin15k4",
            "body": "We all saw Trump delivering the speech, dude!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin02sb",
            "body": "The heir to the fish sticks fortune is probing the limits of our tolerance for fascism, and his choice of using a streaming service to embed the mother-of-all-whoppers into mainstream discourse is a small but important, thrust.  \n\nThe USA is a police state^(\\*) and The Tucker know it.  He also knows the the majority of us don't really care.  Expect him to make a run for the GOP nomination in 2024.\n\n^(\\*) 4% of the world's population lives in the USA.  24% of the world's incarcerated population lives in America, too.",
            "polarity": 0.17,
            "subjectivity": 0.72
        },
        {
            "comment_id": "himzrve",
            "body": "Murdoch give him a raise?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himzdp9",
            "body": "A Tucker Carlson \"Documentary.\"  \n\n\nYeah, sure. We'll all learn a lot.",
            "polarity": 0.25,
            "subjectivity": 0.4444444444444444
        },
        {
            "comment_id": "himyere",
            "body": "Put a muzzle on it !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himvzgq",
            "body": "Tucker is a wimpy little rich kid",
            "polarity": 0.09375,
            "subjectivity": 0.625
        },
        {
            "comment_id": "himvuok",
            "body": "This is actually terrifying. The amount of lies and misinformation that will be told to try a justify and downplay these acts will lead to another insurrection. How can they allow this to happen. These people we’re clearly committing illegal acts.",
            "polarity": -0.4666666666666666,
            "subjectivity": 0.6277777777777778
        },
        {
            "comment_id": "himqfme",
            "body": "&gt;Carlson has previously suggested that the federal government was in on the attack, arguing on his show in June that individuals referred to as “unindicted co-conspirators” in government charging documents were likely “FBI operatives.” Late last month, Carlson had a slightly different take, arguing on his show that the Jan. 6 rioters “don’t look like terrorists — they look like tourists,” charging again that “they were not insurrectionists.”\n\n&gt;Carlson betrayed no doubts about the veracity of the claims made in the series. “We’re proud of it,” he said on Wednesday night. “It’s the best thing we’ve ever done.”",
            "polarity": 0.1904761904761905,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "himqee9",
            "body": "Fuck him. I’m so sick of 1/6 being normalized",
            "polarity": -0.5571428571428572,
            "subjectivity": 0.7285714285714285
        },
        {
            "comment_id": "himq532",
            "body": "Tucker believes that the more ridiculous his comments are the more followers he will have.  GOP seems to believe the same thing.  A direct reflection on the weakness of those that believe all the crap they pitch out.",
            "polarity": -0.005555555555555554,
            "subjectivity": 0.5541666666666667
        },
        {
            "comment_id": "himozpu",
            "body": "Fox News is one big false flag.",
            "polarity": -0.20000000000000004,
            "subjectivity": 0.35
        },
        {
            "comment_id": "himo4em",
            "body": "Okay, who’s worse: Tucker or Hanity?",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.55
        },
        {
            "comment_id": "himnajc",
            "body": "Since the doc is not yet released , maybe they did not watch it yet ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himmn9e",
            "body": "Yeah we should stick with proven false flags like the one that just happened in Virginia with the bus and election.",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.6
        },
        {
            "comment_id": "himmgo9",
            "body": "Please let this be the downfall of him",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himm1u0",
            "body": "Schroedinger's Insurrection.\n\nIt was both \"just a peaceful unguided tour of the Capitol by patriots\" and a \"false flag operation by Antifa\" at the same time.",
            "polarity": -0.050000000000000024,
            "subjectivity": 0.4083333333333334
        },
        {
            "comment_id": "himlgpv",
            "body": "Tucker Carlson is correct.\nThis “capital riot” nonsense is a clear false flag if there ever was one.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.49166666666666664
        },
        {
            "comment_id": "himk60m",
            "body": "Tucker Carlson has no moral. social, or political redeeming value.",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.22916666666666666
        },
        {
            "comment_id": "himjofj",
            "body": "We have seen zero consequences for the top people that planned and gave money to attack our own Capital. \n\nWhy would any of this stop? These people make money and have enormous power. They love every moment. They have zero consequences.",
            "polarity": 0.4,
            "subjectivity": 0.75
        },
        {
            "comment_id": "himhdnl",
            "body": "Is it really a documentary if it is filled with verifiable lies?",
            "polarity": 0.2,
            "subjectivity": 0.45
        },
        {
            "comment_id": "himgot1",
            "body": "Fox News has been banned in the UK from 2017. \nThe US-made show was largely pro-Trump and did not sufficiently reflect alternative viewpoints.\nTucker Carlson Tonight was also found in breach for a broadcast in May following the Manchester terror attack.\nRegarding Hannity, Ofcom said they had taken into account \"that Fox News is a US news channel, directed at US audiences, which is available in the UK. The people who watch it in the UK are aware that it is a US channel and their expectations are different.\n\"It is not a main source of news in the UK. However, we were also mindful that, in our view, this particular programme dealt with major matters relating to current public policy that, as well as being of international significance, were of particular relevance and significance to UK viewers.\"\n\nThe programme also criticised public leaders, saying that \"their inaction was motivated by political correctness; they valued how people saw them over the lives of children; and they were forcing an 'official lie' on citizens, which was 'totalitarian' and 'wicked'\".\nOfcom said there was no reflection of the views of the UK Government or any of the authorities or people criticised, \"which we would have expected given the nature and amount of criticism of them in the programme\".\nThe media watchdog also noted that \"the presenter (Carson) did not challenge the views of his contributors, instead, he reinforced their views\".",
            "polarity": 0.07178571428571429,
            "subjectivity": 0.2874603174603175
        },
        {
            "comment_id": "himgnm5",
            "body": "[deleted]",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himg612",
            "body": "I watched the trailer for this \"documentary\" and it looks pretty damn insane. I've been watching FoxNews for over 15 years and every so often, they hit a new low. Glen Beck was one of those. Tucker is plainly stating here that the American troops who were in Afghanistan are now going to hunt down and detain conservatives in an \"American Guantanamo Bay.\" \n\nSo he's literally saying the American government is coming to get you because you don't like Biden -- that you're at war with the government. If enough people believed this and they had some leader they could rally behind...",
            "polarity": -0.11528980278980279,
            "subjectivity": 0.3833814333814334
        },
        {
            "comment_id": "him79vh",
            "body": "\"Documentary\" my ass.\n\nDocumentary implies *documentation,* that there is propaganda.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.03333333333333333
        },
        {
            "comment_id": "him71vg",
            "body": "That trailer is very concerning. Literally showing people being murdered and tortured and saying this is what the left is doing to the right…",
            "polarity": 0.1,
            "subjectivity": 0.15
        },
        {
            "comment_id": "him4kl7",
            "body": "Tucker Carlson is a wanna be Goebbels.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilye6z",
            "body": "Tucker Carlson reminds me of the ending of \"Plan 9 from Outer Space\"\n\n[\"CAN YOU PROVE IT DIDN'T HAPPEN!?!\"](https://www.youtube.com/watch?v=51nceHeO0tE)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilyd4p",
            "body": "Among the many problems with this trailer, it was sickening to me to see the live death of Ashley Babbitt played as part of their action sequence. A real person dying, just uploaded to your Twitter like it means nothing. Normally that at least gets a graphic content warning.\n\nI guess they don't really care about their martyr as much as they care about the points she scored by dying.",
            "polarity": 0.028636363636363637,
            "subjectivity": 0.425
        },
        {
            "comment_id": "hilpmxn",
            "body": "That doc looks like it wants to tear the country apart.  It’s just hate speech and supposed to enraged the followers.",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiloigu",
            "body": "Meh. Fuck Tucker TV Dinner Carlson. This guy is a leech of the worst kind. If you didn't think he would use the current environment to push some white nationalist propaganda, you obviously gave him to much credit.",
            "polarity": -0.0875,
            "subjectivity": 0.4625
        },
        {
            "comment_id": "hiloaoo",
            "body": "“Documentary”",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilnroi",
            "body": "Does anyone else think he looks like he’s rotting from the inside out? In 10 years he will look like Steve Bannon.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilnflu",
            "body": "douch",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilm9xd",
            "body": "Give it time. First, the white supremacist fringe will embrace it, then the pseudo-right-wing journalists will headline it,  then CNN and MSNBC will both side the issue and they'll invite GQP Congressmen and Senators to neatly wrap a pile of shit to further confuse the American public. The Democrats? Stuck in Trump is evil. Clueless.",
            "polarity": -0.1357142857142857,
            "subjectivity": 0.38571428571428573
        },
        {
            "comment_id": "hillp5i",
            "body": "Oh shit. Backlash? ... Damn take it easy guys.",
            "polarity": 0.11666666666666667,
            "subjectivity": 0.8166666666666667
        },
        {
            "comment_id": "hill3xd",
            "body": "I mean Tbf we can’t pretend the US hasn’t at least planned false flags in our country (the Us govt was willing to bomb Americans and blame it on the Cubans) during the Cold War so it’s not an absurd thought especially with the heightened political climate that one side of the isle would use this opportunity execute a false flag demonizing a group of people and the person they voted for especially considering how hell bent Dems were about removing trump from office and the fact that people are comparing this to 9/11 is straight weird  considering democrats stormed the Wisconsin capitol building in 2011 (I know ur gonna say it’s not the same) ....I’m not saying it was a false flag but there was definitely a motive to do so\n\nedit: then to blame Trump for the whole thing to get him indicted so he can’t run again is just sus...the motive and hatred for the right and Trump is there to pull off a false flag especially when 95% of major media is liberal",
            "polarity": -0.1407142857142857,
            "subjectivity": 0.6399107142857143
        },
        {
            "comment_id": "hilktt7",
            "body": "So the guys outside the capital building chanting fuck antifa, were really antifa all along. Mind blown.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.2833333333333334
        },
        {
            "comment_id": "hilkeaa",
            "body": "If it was a false flag operation, why not investigate it? And why is mango Mussolini and his merry band of sycophants claiming these Jan 6 participants are political prisoners?\n\nAll you have to do is ask a single question to unravel the bullshit, but unfortunately 40 percent of the country likes having bullshit dumped on them, no questions asked",
            "polarity": -0.24285714285714288,
            "subjectivity": 0.47857142857142854
        },
        {
            "comment_id": "hiljsix",
            "body": "Fucker Carlton should ask Alex Jones how lying about his \"ideas\" about false flag operations worked out for him.   WOULD LOVE to see the 1/6 cops sue the living fuck outta Fox News over this.",
            "polarity": -0.10000000000000003,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilj27l",
            "body": "Stop giving this douch so much attention. You know his doc is a stupid piece of fiction taylored for his vile knuckle dragging fans",
            "polarity": -0.29999999999999993,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilivwc",
            "body": "False flag?\n\nYeaaaah, I'm sure that the very people who complained since the start of Covid; to wear your fucking mask because it shouldn't be THAT hard of a task to do were literally the ones who went straight to **Trump**'s insurrection.\n\nThey spent $**hundreds and hundreds** on super tacky Trump gear and **in unison** decided \"*nope, we're* ***not going to wear masks at all, we gotta make it look authentic!****\" (look at the pics from that horrific day. You can count the number of people wearing masks on 1 hand....there were* ***hundreds of people there***).\n\nYes, I am *SO sure, POSITIVE even....that Democrat-voting citizens and/or government entities, infact, threw out every single thing they'd been discussing and exhaustively getting the entire nation to* ***think for a second and at LEAST wear a MASK....yeah, that it was \"clearly\" those people who showed up. Sure. Thing. You. Jackass*** *(Tucker not the OP)*",
            "polarity": -0.0060709132137703615,
            "subjectivity": 0.5758606472892187
        },
        {
            "comment_id": "hili5ur",
            "body": "Travesty that they let him make this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilhev9",
            "body": "Why is it being called a documentary?  It's my understanding that it is anything but.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilgsp5",
            "body": "I feel like this is his exit strategy. He's going to go full on white supremacist conspiracy theory peddler until Fox is forced to take him off the air and then he'll say he got canceled and grift on that.",
            "polarity": 0.016666666666666646,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hilgdii",
            "body": "It's a cry for help. I think in his own way he is really asking to be canceled and taken off the air. He hates his job and himself so much he's taken to lashing out at anything and everything around him.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "comment_id": "hilfzi9",
            "body": "aint no bipartisan",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilfeyr",
            "body": "[deleted]",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hild70l",
            "body": "If it's made up, is it still a documentary?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hild5xk",
            "body": "These muppets love claiming ‘false flag’ operations. No credible evidence whatsoever to corroborate their lies.",
            "polarity": -0.03333333333333336,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hilby2f",
            "body": "&gt; Carlson said the three-part series will air as a “Tucker Carlson Original” on the streaming service Fox Nation starting Monday. “We believe that it answers a lot of the remaining questions from that day,” he said, arguing that the U.S. government has “launched a new war” on American citizens by prosecuting participants in the insurrection who ransacked the building and attacked law enforcement officers.\n\n...\n\n&gt; Asked about the criticisms from Cheney, Kinzinger and Rivera, Fox News representatives did not respond. A Twitter spokesperson confirmed that Carlson’s tweet containing the trailer did not violate the platform’s civic integrity policy.\n\n- it probably had so many lies  fox news decided not to air it.",
            "polarity": 0.23522727272727273,
            "subjectivity": 0.46742424242424246
        },
        {
            "comment_id": "hilbn6n",
            "body": "Yeah Liz Cheney and Adam Kinziger don’t really count but glad to have them onboard",
            "polarity": 0.35,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilazuv",
            "body": "\"Bipartisan\" my ass. \n\nRepublicans tacitly endorse every fucking thing tucker carlson days and does. He is the epitome of the republican party. Frankly, he is the logical conclusion of conservatism.",
            "polarity": -0.175,
            "subjectivity": 0.525
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hilau3l",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hilazuv",
            "body": "\"Bipartisan\" my ass. \n\nRepublicans tacitly endorse every fucking thing tucker carlson days and does. He is the epitome of the republican party. Frankly, he is the logical conclusion of conservatism.",
            "ups": 416,
            "downs": 0,
            "polarity": -0.175,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hilkeaa",
            "body": "If it was a false flag operation, why not investigate it? And why is mango Mussolini and his merry band of sycophants claiming these Jan 6 participants are political prisoners?\n\nAll you have to do is ask a single question to unravel the bullshit, but unfortunately 40 percent of the country likes having bullshit dumped on them, no questions asked",
            "ups": 150,
            "downs": 0,
            "polarity": -0.24285714285714288,
            "subjectivity": 0.47857142857142854
        },
        {
            "comment_id": "hild5xk",
            "body": "These muppets love claiming ‘false flag’ operations. No credible evidence whatsoever to corroborate their lies.",
            "ups": 134,
            "downs": 0,
            "polarity": -0.03333333333333336,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hilgsp5",
            "body": "I feel like this is his exit strategy. He's going to go full on white supremacist conspiracy theory peddler until Fox is forced to take him off the air and then he'll say he got canceled and grift on that.",
            "ups": 60,
            "downs": 0,
            "polarity": 0.016666666666666646,
            "subjectivity": 0.25
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hilau3l",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hilkeaa",
            "body": "If it was a false flag operation, why not investigate it? And why is mango Mussolini and his merry band of sycophants claiming these Jan 6 participants are political prisoners?\n\nAll you have to do is ask a single question to unravel the bullshit, but unfortunately 40 percent of the country likes having bullshit dumped on them, no questions asked",
            "ups": 152,
            "downs": 0,
            "polarity": -0.24285714285714288,
            "subjectivity": 0.47857142857142854
        },
        {
            "comment_id": "hilazuv",
            "body": "\"Bipartisan\" my ass. \n\nRepublicans tacitly endorse every fucking thing tucker carlson days and does. He is the epitome of the republican party. Frankly, he is the logical conclusion of conservatism.",
            "ups": 416,
            "downs": 0,
            "polarity": -0.175,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hild5xk",
            "body": "These muppets love claiming ‘false flag’ operations. No credible evidence whatsoever to corroborate their lies.",
            "ups": 134,
            "downs": 0,
            "polarity": -0.03333333333333336,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hilgsp5",
            "body": "I feel like this is his exit strategy. He's going to go full on white supremacist conspiracy theory peddler until Fox is forced to take him off the air and then he'll say he got canceled and grift on that.",
            "ups": 59,
            "downs": 0,
            "polarity": 0.016666666666666646,
            "subjectivity": 0.25
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hilau3l",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "ups": 1,
            "downs": 0,
            "polarity": -0.02916666666666667,
            "subjectivity": 0.5291666666666667
        },
        {
            "comment_id": "hilkeaa",
            "body": "If it was a false flag operation, why not investigate it? And why is mango Mussolini and his merry band of sycophants claiming these Jan 6 participants are political prisoners?\n\nAll you have to do is ask a single question to unravel the bullshit, but unfortunately 40 percent of the country likes having bullshit dumped on them, no questions asked",
            "ups": 151,
            "downs": 0,
            "polarity": -0.24285714285714288,
            "subjectivity": 0.47857142857142854
        },
        {
            "comment_id": "hilazuv",
            "body": "\"Bipartisan\" my ass. \n\nRepublicans tacitly endorse every fucking thing tucker carlson days and does. He is the epitome of the republican party. Frankly, he is the logical conclusion of conservatism.",
            "ups": 412,
            "downs": 0,
            "polarity": -0.175,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hild5xk",
            "body": "These muppets love claiming ‘false flag’ operations. No credible evidence whatsoever to corroborate their lies.",
            "ups": 133,
            "downs": 0,
            "polarity": -0.03333333333333336,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hilgsp5",
            "body": "I feel like this is his exit strategy. He's going to go full on white supremacist conspiracy theory peddler until Fox is forced to take him off the air and then he'll say he got canceled and grift on that.",
            "ups": 60,
            "downs": 0,
            "polarity": 0.016666666666666646,
            "subjectivity": 0.25
        }
    ]
}