{
    "time_posted": "2021-10-30 14:00:13",
    "url": "https://www.youtube.com/watch?v=5E97BY6E--k",
    "time_now": "2021-11-01 14:01:55",
    "ups": "9482",
    "downs": "237",
    "views": "118955",
    "top_comments": [
        {
            "comment": "The major challenges investors face may range from controlling impulsiveness to the frail of compulsion. Most newbies and investors often undermine and most often neglect the importance of technical analysis with regards to trading. Technical analysis overly predicts the movement of asset prices regardless of what is happening in the wider or broader market. Essentially, the process involves studying the paths of a particular asset movement in the past so as to establish a sustainable pattern that can be used to predict future movements. Permit me to say that, it’s is best advice you find a working strategy/daily signals that works well in other to accumulate and grow a very strong portfolio ahead. I have been trading with DR Benjamin Edginton's daily signals and strategy, him guidance makes trading less stressful and more profit despite the recent fluctuations. I was able to easily increase my portfolio in just 4weeks of trading with Benjamin Edginton''s daily signals growing 1.5 BTC to 6.7 BTC. His daily signals are very accurate and yields a great positive return on investment and is available to give assistance to anyone who love crypto trading, you can contact him on WhatsApp:+ 447-883-171-286 and Telegram @ BenEdginton * for inquires and profitable trading systems...",
            "likes": 35,
            "number_of_replies": 11,
            "polarity": 0.2452575757575758,
            "subjectivity": 0.38921818181818174
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Nice",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Asian paints",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Your choice is an excellent.... In my opinion, Happiest mind, Bara, Relexo foot wear, Asian Paint and Berger... Please provide your guidance on these... 🙏🙏",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Your choice is an excellent.... In my opinion, Happiest mind, Bara, Relexo foot wear, Asian Paint and Berger... Please provide your guidance on these... 🙏🙏",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Asian paint dmart titan missing.",
            "polarity": -0.1,
            "subjectivity": 0.025
        },
        {
            "body": "plz can anyone tell me ....... idealy how many shares should be in holdings ?\n\ni know it sounds stupid ... just want to know the range ... A rough estimate !",
            "polarity": -0.14166666666666664,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "good stock",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Sir wat about tech biggie Dixon Technologies..:) please suggest",
            "polarity": 0.5,
            "subjectivity": 1.0
        }
    ]
}