{
    "time_posted": "2021-10-30 10:58:46",
    "url": "https://www.youtube.com/watch?v=5kE9PacqtUw",
    "time_now": "2021-11-01 05:47:19",
    "ups": "1514",
    "downs": "308",
    "views": "114464",
    "top_comments": [
        {
            "comment": "Fu**ck you G20 hhhhhhhh",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "How about inviting those WHO make those countries INDUSTRIALIZED! Those from which raw materials are exploited!",
            "polarity": -0.2884615384615385,
            "subjectivity": 0.46153846153846156
        },
        {
            "body": "Bunch of cheapskate,most of them,,,where is that fella down under moronson,,kangaroo😉",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "Arrest all LEFTIST members they are china's sponsormember",
            "polarity": -0.05,
            "subjectivity": 0.3
        },
        {
            "body": "So Joe biden wants to save the environment for the unborn? \nBut on the other hand claims that the unborn don't have any rights and can be terminated? \n\nI will never go along with this bs.",
            "polarity": 0.037500000000000006,
            "subjectivity": 0.2375
        },
        {
            "body": "They r politicians or actors",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "With US's slipping leadership and flip-flopping policies in \"Rules Based Order\" world on many international affairs like trade, foreign intervention, climate change agreement, hypocrisy like rules based order, etc the position of President in to he group photo truly tells us about the performance and current position as compared to many previous submits.  Surprisingly, many MSM deliberately not to take note there is already a great blessing and face saving gift.",
            "polarity": 0.21203703703703705,
            "subjectivity": 0.337962962962963
        },
        {
            "body": "China should never attend the G20 summit, since the European didn't invite China Russia to the G7 and only except in favor of theirs. Let them have their own problems and say whatever they like. Instead, Russia China should form another summit which in favor to the world and ban those G7/20 countries. Split is what the better way, since it's the west who want to split with their own. Then those like Iran North Korea Venezuela will be welcome to our summit.",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "We're not meeting our climate change goals because companies greenwash (a marketing scheme) instead of actually being and selling sustainable products. Politicians will never acknowledge this because these companies have lined their pockets.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "G 20 summit? more like G 16.5 summit! Mighty Russia and virus spreading china showed middle finger while laughing out loud to rest of the attending fools! G 16.5 summit packed with naïve mini dictators, pathological liars and corrupt politicians lost its prestige forever!!",
            "polarity": 0.07374999999999998,
            "subjectivity": 0.64
        },
        {
            "body": "Fu**ck you G20 hhhhhhhh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yeah mf leaders for nothing discuss discuss until global temperature increases by 2 3°C. They have been discussing about this since decades but still not a single thing has been implemented. We are still using fossil fuel for energy when we already have different alternatives.",
            "polarity": 0.011904761904761904,
            "subjectivity": 0.2714285714285714
        },
        {
            "body": "Proverbs 14: 12👍💋!!! \n\n\nPeople (Galatians 5: 19 - 21) - (bitterly) impatiently insecure (2 Timothy 3: 1 - 9).\n\nPlanet (James 3: 14 - 16) - (toxic) sowing pollution (Revelation 11: 18).\n\nProsperity (James 5: 1 - 6) - (toilsome) gratifying greed (1 Timothy 6: 9 - 10).\n\n\nIt (reaps) is what it (sows) is (Galatians 6: 7 - 8🔥).",
            "polarity": -0.5,
            "subjectivity": 0.875
        }
    ]
}