{
    "time_posted": "2021-10-30 10:58:46",
    "url": "https://www.youtube.com/watch?v=5kE9PacqtUw",
    "time_now": "2021-11-01 01:40:16",
    "ups": "1479",
    "downs": "302",
    "views": "112094",
    "top_comments": [
        {
            "comment": "Good evening puppet politicians and pseudo aristocrats.  Instead of telling the nonsense that you are rationalizing for us to our community of ordinary people, can you finally reveal your principals?  We know your plans.  We do not know which barons commission this to you, and above them what the lords of inclusive feudalism are like.  Do you really think we humans are so naive?  Do you think you will go unpunished?  What will happen to you as the principals will abandon you and the citizens will overtake you?",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.05833333333333332,
            "subjectivity": 0.5666666666666668
        },
        {
            "comment": "The things you can do to stop climate change are stop developing and stop progress. By means of stop building houses skyscrapers and factories, stop using gasoline and using cars, stop developing machines or technologies. Stop eating and stop everything. But who would do that? Who would care that? Businesses or anyone would never do that. Until there’s human on earth you cannot stop climate change.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.1
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Drama Queen, Trump, Runs around the dinning room to grovel at Putin's feet. That Trump sure was special! 🤮",
            "polarity": 0.4732142857142857,
            "subjectivity": 0.7301587301587301
        },
        {
            "body": "Love the youths standing up!! That's the way!!",
            "polarity": 1.0,
            "subjectivity": 0.6
        },
        {
            "body": "Meeting of g 20  of delusional  individuals",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It is actually G19. Mexico has no leadership and Mexico's president did not participate. Better for the group, as Mexico's government is actively promoting fossil fuels and the destruction of rain forests. Furthermore, Mexico's government is also actively discouraging investment in renewable energy. So, what can Mexico's clown, I mean president, contribute to the summit other than populist BS?",
            "polarity": -0.034027777777777775,
            "subjectivity": 0.4770833333333333
        },
        {
            "body": "Celestial Dragons meet for the Reverie.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The fact is that most of Billionaires hide their money in \"Charity\" Foundations they found, and which they totally control, meaning they can use money from their Foundation as they please! We need to come up to a solution to prevent such tax frauds! \r\nAnd talking about Climate Action without agreeing on quotes of trees planting is pure Demagogy! African Green Wall should be one of Global Climate priorities!",
            "polarity": 0.08348214285714287,
            "subjectivity": 0.33125
        },
        {
            "body": "Wait, the pope doesn't speak English? I was under the impression they were all ultrapoliglots haha",
            "polarity": 0.1,
            "subjectivity": 0.15
        },
        {
            "body": "THERE'S G-20 CLIMATE CHANGE PLAN 2 PETER CHAPTER 3 VERSES 5 TO  10👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂👂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Did you guy pour coca cola over the blood stains of the sacrificed kids of Allah?  OMGosh, I hear they're pissed off.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}