{
    "time_posted": "2021-10-30 10:58:46",
    "url": "https://www.youtube.com/watch?v=5kE9PacqtUw",
    "time_now": "2021-11-02 18:52:28",
    "ups": "1717",
    "downs": "352",
    "views": "134049",
    "top_comments": [
        {
            "comment": "The Climate Waits for No One\nThirty years ago, a friend of mine got into the green energy business and tried to pull me into it. I asked him what for, it isn’t serious. He said, “You have no idea how much money is being poured into it. Everyone wants in on it, politicians, financiers, businesspeople, the lot.” He was right, of course. Yet, no one wants to promote green energy in order to save the planet, but only to swell up their pockets even more. The declarations, therefore, remain in the assembly hall where they are stated, necessary actions are ignored, and the climate waits for no one: It will keep deteriorating.\nThis week in Glasgow, Scotland, the 26th UN Climate Change Conference is taking place. Officially, it aims to “bring parties together to accelerate action towards the goals of the Paris Agreement and the UN Framework Convention on Climate Change.” In reality, the countries plan to do the exact opposite. This year’s UN Production Gap Report, which tracks the discrepancy between governments’ planned fossil fuel production and actual global production levels, states the following: “Despite increased climate ambitions and net-zero commitments, governments still plan to produce more than double the amount of fossil fuels in 2030 than what would be consistent with limiting global warming to 1.5°C [2.7°F].”\nEnergy sources and technologies do change, but not according to what is best for the planet. It changes according to the interests of politicians and money moguls, and it never benefits the planet or the majority of its inhabitants, namely all of us.\nSince the climate waits for no one, eventually, it will catch up with us. Earth is a closed system, and in a closed system, there are consequences to exploitation: it hurts the abuser as well as the abused.\nI don’t know when or at what cost, but eventually, we will all have to realize that we cannot take beyond what we need. We cannot keep exploiting Earth selfishly and thoughtlessly because it will turn against us.\nEarth is like a submarine: there is only so much oxygen on board. If some crew members take more than their quota, the rest will not have enough, they will die, and the submarine will sink along with those who exceeded their quota.\nWe need constant reminders that we are one system, and we are all dependent on each other. We need to genuinely grasp that selfishness hurts us just as being exploitative hurts others. If we constantly remind ourselves that we are interdependent, we will behave with more consideration, and we will avoid the punitive impact of climate change.\nThe other option is to keep working as the UN’s Production Gap Report states that we are planning to work, and suffer nature’s unforgiving response. I hope we wise up in time because everyone will pay the price for this mistake.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.10562169312169312,
            "subjectivity": 0.36997354497354495
        },
        {
            "comment": "italy had one of the highest covid cases last year. This year they gonna break that record with this superspreader event. Ciao italia!!!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment": "The people will reject your Red green communist totalitarianism.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.15
        },
        {
            "comment": "Without China it is not interesting kk 😅. From Korea 🇰🇷🇰🇷",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Jokowi ga ada yg bahas di luar, di indo pada heboh wkwk\nMalu maluin",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That's mean USA is not about climate change",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "body": "Joe Biden 🥱🥱🥱🥱",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All the do at the G20 is pick their noses and stick their fingers up their arses. Nothing gets done!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Without China it is not interesting kk 😅. From Korea 🇰🇷🇰🇷",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Chuckle. Without the world's largest economy by ppp and industrial producer in this discussion, this is just one fancy photo op.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}