{
    "time_posted": "2021-10-30 10:58:46",
    "url": "https://www.youtube.com/watch?v=5kE9PacqtUw",
    "time_now": "2021-10-31 21:32:48",
    "ups": "1449",
    "downs": "293",
    "views": "108399",
    "top_comments": [
        {
            "comment": "The things you can do to stop climate change are stop developing and stop progress. By means of stop building houses skyscrapers and factories, stop using gasoline and using cars, stop developing machines or technologies. Stop eating and stop everything. But who would do that? Who would care that? Businesses or anyone would never do that. Until there’s human on earth you cannot stop climate change.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment": "Good evening puppet politicians and pseudo aristocrats.  Instead of telling the nonsense that you are rationalizing for us to our community of ordinary people, can you finally reveal your principals?  We know your plans.  We do not know which barons commission this to you, and above them what the lords of inclusive feudalism are like.  Do you really think we humans are so naive?  Do you think you will go unpunished?  What will happen to you as the principals will abandon you and the citizens will overtake you?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.05833333333333332,
            "subjectivity": 0.5666666666666668
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Unlike Trump and his Republican supporters in Congress, Biden understands that the climate crisis can no longer be ignored and wants to speedup the transition to carbon free energy and transportation.",
            "polarity": 0.30000000000000004,
            "subjectivity": 0.45
        },
        {
            "body": "I sow a just bounch of slaves so called liders",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Taliban attack wedding for playing music!\nTwo people were killed and 10 others were injured when a Taliban attacked a wedding party in Sarkhrood, Nangarhar province, Afghanistan.\nThe Taliban group has banned music and is attacking artists!\nAfter Biden's donation of Afghanistan to the terrorist Taliban, most Afghan singers and artists fled the country, and some of these singers hid.",
            "polarity": 0.125,
            "subjectivity": 0.25
        },
        {
            "body": "You can't save the climate if you take a private jet to a climate summit and drive 100 cars as security instead of just attending a Zoom Meeting.",
            "polarity": 0.0,
            "subjectivity": 0.375
        },
        {
            "body": "Good evening puppet politicians and pseudo aristocrats.  Instead of telling the nonsense that you are rationalizing for us to our community of ordinary people, can you finally reveal your principals?  We know your plans.  We do not know which barons commission this to you, and above them what the lords of inclusive feudalism are like.  Do you really think we humans are so naive?  Do you think you will go unpunished?  What will happen to you as the principals will abandon you and the citizens will overtake you?",
            "polarity": 0.05833333333333332,
            "subjectivity": 0.5666666666666668
        },
        {
            "body": "Hello guys. Soon you will be praying for blessings on my happy marriage to the former Deputy Minister of Finance of Mexico Dr. Andrea David. After the divorce proceedings are completed from her ex-husband, General Sonny Drago, who works as the Army's aviation commander in the States. I welcome the men of Lazar and the Egyptian advisor. Dakour after the burial and may the Lord bless me with blessings General Richard R Neely United States Air National Guard United States Air Force",
            "polarity": 0.34,
            "subjectivity": 0.58
        },
        {
            "body": "Joe Biden cancels US oil production to save the planet.  gas prices triple.\nThen Biden OKs Putin's oil pipeline to Europe.\nThen Biden begs OPEC to increase oil production.\nThen Biden uses 85 SUV/limo motorcade to get to the Vatican.\nNow Biden jets off to Glasgow to lecture Europeans on \"fighting\" climate change.\n\nThis is our president (sigh).\nGod help America.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is a Global Holiday for these world leaders, since they were together in Rome, why didn't they do the global warming talks there, but no next holiday place for this year is Glasgow, where for 2022?  They are all hypocrites, they could have done it all with a video link up, instead of pollution the planet by flying in airplanes, for them and for all their services, including security and reporters. Then there is the hotels, big banquets and a list of other things..Shame on them, while people less well off are told to lower their heat and switch off lights.",
            "polarity": -0.048611111111111105,
            "subjectivity": 0.09027777777777778
        },
        {
            "body": "'what happened was clumsy...i was not aware that some things had happened' . clumsy uh? what about afghanistan you hypcrite, that wasn t clumsy? or maybe it s just that you don t like afghanistan as much as france, so you re not going to spend any words of excuse about it? freaking bully",
            "polarity": -0.11499999999999999,
            "subjectivity": 0.26
        },
        {
            "body": "The things you can do to stop climate change are stop developing and stop progress. By means of stop building houses skyscrapers and factories, stop using gasoline and using cars, stop developing machines or technologies. Stop eating and stop everything. But who would do that? Who would care that? Businesses or anyone would never do that. Until there’s human on earth you cannot stop climate change.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "the  ` climate change `  is highly  overrated , relax globalists, and take the chill pill .",
            "polarity": 0.16,
            "subjectivity": 0.5399999999999999
        },
        {
            "body": "there saying the economical deficit is not affecting eco-system with the G20 is showing but the deficit of irrigation if too much pressure is placed upon a pipe line or the wrong people find out where the pipeline is",
            "polarity": 0.0,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Man, where's a natural disaster when you need it",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "non sense meeting ….",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This summit is described as the last, best hope to screw over the working class and middle class with an increase in taxes and pointless regulations.",
            "polarity": 0.1875,
            "subjectivity": 0.21666666666666667
        },
        {
            "body": "Why didn't they use public transportation?",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "6:13 lidahnya kesleo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How much did it cost Russia to organise that protest? 😄",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Summits are bad for nature !",
            "polarity": -0.8749999999999998,
            "subjectivity": 0.6666666666666666
        }
    ]
}