{
    "time_posted": "2021-10-30 10:58:46",
    "url": "https://www.youtube.com/watch?v=5kE9PacqtUw",
    "time_now": "2021-10-31 17:25:33",
    "ups": "1411",
    "downs": "277",
    "views": "101831",
    "top_comments": [
        {
            "comment": "It's like watching game of throne's waiting who's going to bend the knee..",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.4,
            "subjectivity": 0.4
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "A 15-year-old boy was shot and killed by the Thai military dictator.  in front of the police station  You shouldn't be silent anymore.  the bad things caused by  mission failed cia  In the past, it caused the military dictatorship to kill people.  in school uniform in Thailand",
            "polarity": -0.2642857142857143,
            "subjectivity": 0.2166666666666667
        },
        {
            "body": "China is gonna put a pipeline right through Iraq. Old Joe didn’t dig any trenches he has the slave Afghans and Americans left behind doing that. Joe Biden left thousands behind In Afghanistan. Think of all the women and children little girls, all the taliban are having their way with them.",
            "polarity": -0.08596938775510206,
            "subjectivity": 0.376530612244898
        },
        {
            "body": "i'm so glad i decided to not have children",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Dünya lideri RECEP TAYYİP ERDOĞAN  dır ❤🤍❤🤍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I hope all country in the world Will be safe and this pandemic Will be gone.. biggest love from Indonesia 🤗🥰",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "I like how not even 10% of the world leaders are present, pathetic.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Buy new expensive products, save the planet.",
            "polarity": -0.18181818181818182,
            "subjectivity": 0.5772727272727273
        },
        {
            "body": "我也是无语了，没有普京和习主席，你们就开不了会了？",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Revelation 13",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Climate Change and Corona Virus:\nTheir favorite rabbit holes….🐰",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "They all travel, take group photos, have nice dinner and waste taxpayers money, they will never do anything tangible for their own citizens nor global citizens. Useless leaders.",
            "polarity": 0.1,
            "subjectivity": 0.44000000000000006
        },
        {
            "body": "🤙👍🏻 obat 19 covid 🤙👍🏻😃😅😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Mr Jokowi 🙏🏽",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Even we achieve target of 0% omissions of carbon sudden climate change such as heavy rain, droughts, tsunami, earthquake, volcanic eruption, cyclones, forests fires etc;  not going to reduce at all. We should understand that our earth has its own life cycle- duration. It was wtihout us and could be without us, in future, like planet Mars. We should respect nature, thus remove human population from sea- river- mountain; plant trillions of trees mainly in desert  areas, start use of sea water at large scale, invest in water management and agricultural etc .",
            "polarity": 0.09761904761904762,
            "subjectivity": 0.43586309523809524
        },
        {
            "body": "궁금해요.G20과 G7의 차이를 솔직히 설명 가능하시면 아픔도 치유되죠.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "HUMAN MATURE IS TO DESTROY PLANETS AND MIGRATE TO OTHER ..",
            "polarity": -0.05625,
            "subjectivity": 0.14375
        },
        {
            "body": "China doesn't speak, China just does and later speak if it is really necessary.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "What are the numbers again in terms of the CO2 emitted by all the travelers to this waste-of-time-and-money conference? Why couldn’t everyone have a big Zoom meeting?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Politicians nowadays act like clowns.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's like watching game of throne's waiting who's going to bend the knee..",
            "polarity": -0.4,
            "subjectivity": 0.4
        }
    ]
}