{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qiydff/lpt_never_buy_items_advertised_on_social_media/",
    "time_posted": "2021-10-30 06:00:38",
    "time_now": "2021-10-30 16:49:48",
    "ups": 7159,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "himjx2d",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hint48l",
            "body": "Bro I bought this little pyramid thingy which I got for 20 bucks, it looks cool but I wouldn't have ever paid 100+ for it.",
            "polarity": 0.08124999999999999,
            "subjectivity": 0.575
        },
        {
            "comment_id": "hinsxwo",
            "body": "My buddy started a drop shipping company that started putting ads on Facebook. He and so both knew the products were Garbo, but super inexpensive… so you kind of get what you pay for. Regardless… he made some real buko bucks doing that business",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.6222222222222222
        },
        {
            "comment_id": "hinsvhu",
            "body": "This.  My mom thought she was buying some kind of electric snowblower, and received a useless plastic cone thing instead.  The ad was on Facebook.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hinstpl",
            "body": "Holy shit this is terrible advice. Do a tiny bit of research on ANYTHING before you make a purchase. If you see an ad too good to be true, yeah, probably a scam. Those are more often than not actual scams instead of advertising though, and it's not hard to tell the difference.",
            "polarity": 0.06197916666666667,
            "subjectivity": 0.5864583333333333
        },
        {
            "comment_id": "hinsplj",
            "body": "A lot of those ads are Shopify drop shopping setups. They get their stuff direct from Alibaba and ship it to you at a 80% markup. I used to do it",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hinsjcx",
            "body": "This is the shittiest LPT I've seen yet. Like any advertising platform there is a mix of shitty, good, and ok products. OP is generalizing their own shitty experience and lack of judgement",
            "polarity": 0.6,
            "subjectivity": 0.7000000000000001
        },
        {
            "comment_id": "hins5cv",
            "body": "I bought some cool rainbow lights from a FB ad last August, tracking said they arrived at the end of November but I never got them and it was too late to contact PayPal for a refund. I contacted the company and they said they resent the items but I never got the replacement and they stopped responding. It was only $30 but a lesson learned for sure. Lol It’s also entirely possible they actually were delivered but to the wrong address and that person kept them. Every delivery service except UPS has issues delivering to the proper address in my neighborhood. They were too big for the USPS mailbox/package boxes so they went to someone’s door.",
            "polarity": 0.07727272727272728,
            "subjectivity": 0.5550505050505049
        },
        {
            "comment_id": "hins1vj",
            "body": "&gt; **Never** buy items advertised on social media\n\nThis is the very definition of a SHITTY pro life tip.\n\nA tremendous number of merchants advertise only on social media, and many are mom and pop operations, often local. They sell great products.\n\n&gt; Social media sites almost never provide resolution\n\nNo shit? why on earth would they. The company involved or law enforcement can provide resolution.\n\n&gt; buy from legitimate vendors.\n\nSo from Amazon? \n\nThe real LPT here is OP is too dumb to spot obvious scams.",
            "polarity": 0.142948717948718,
            "subjectivity": 0.45000000000000007
        },
        {
            "comment_id": "hins0ux",
            "body": "This is patently false. I work in the advertising industry.",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hinrwkf",
            "body": "This LPT is simply wrong. Plenty of legitimate businesses advertise on social media.",
            "polarity": -0.23333333333333334,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "hinrnpg",
            "body": "Popular Science has these constantly.",
            "polarity": 0.3,
            "subjectivity": 0.6166666666666667
        },
        {
            "comment_id": "hinriow",
            "body": "My girlfriend bought that thing where you can scrape pet hair off different surfaces and I assure you it’s one of the best $10 purchases I’ve ever used",
            "polarity": 0.5,
            "subjectivity": 0.44999999999999996
        },
        {
            "comment_id": "hinrgrt",
            "body": "Related to this, maybe some of you saw that reddit ad from \"spookyseason\" with merchandise of like sweatshirts for seasons and stuff. I usually never ever even glance at ads but the sweatshirt was a white color With \"pumpkin season\" and a pic of a cute pumkpin and I though it would be a cute gift. I bought it for like 16 dollars and had it shipped to me, except right after i got the confirmation email from \"spookyseason\" I went to the link to check the status and the whole site was shut down... Waited a week and then emailed the address attached to the confirmation email asking what's up. Never heard anything so i disputed the charge with my bank and they immediately gave it back to me. To this day I can't find any mention of this \"spookyseason\" brand or site or whatever even though i scoured lots of places. Can't tell if it was a fake site to scam me out of 16 dollars or if they legitimately shut down right after i ordered the shirt. Needless to say i will never buy anything from reddit ads ever again.",
            "polarity": 0.04502442002442,
            "subjectivity": 0.5153235653235653
        },
        {
            "comment_id": "hinrf2s",
            "body": "Wish I saw this yesterday before I bought 4 plushies from mypokeplush. They seemed legit and said they were a mom and pop business so I tipped them $5 :(",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hinrcox",
            "body": "Just as scammy as the \"We're going out if business adverts\" but our shit will still at be same price as before and you think you're getting a massive discount",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.6416666666666667
        },
        {
            "comment_id": "hinrc4q",
            "body": "I kept seeing ads on Facebook for these beautiful silk skirts made from old Indian saris for $50, but it was a random pattern and I'm picky. I looked them up on eBay and I can pick the designs I want for $12, plus they ship from India so hopefully the money is going directly to the crafter and not the retailer. I'm so glad I never bought them from Facebook, the eBay one I got is currently my  favorite skirt.",
            "polarity": 0.2583333333333333,
            "subjectivity": 0.6833333333333332
        },
        {
            "comment_id": "hinr9ka",
            "body": "I bought a backpack off an Instagram ad about 5 years ago, still waiting...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinr97g",
            "body": "Just like those ads saying they’re selling the latest iPhones with 90% discount because they’re ex-demo or open box stock.\n\nAny business will know that even the worst trade-in places will pay 80-90% of retail for the latest iPhone.\n\nSeriously, who believes this stuff?",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.7933333333333332
        },
        {
            "comment_id": "hinr7ns",
            "body": "Go buy all the wish products so my stock goes back up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinr3mn",
            "body": "this is the most boomer post i have ever seen",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinr15x",
            "body": "One of my favorite shirts I ever bought was from a Facebook ad. Plus, if the Ridge wallet keeps advertising as much as I want to hate it I might buy it",
            "polarity": -0.03333333333333336,
            "subjectivity": 0.7000000000000001
        },
        {
            "comment_id": "hinqze2",
            "body": "Without thinking about it, I have always done this!  It kinda happens by default tho, because I always check Amazon reviews if I can.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinqyw6",
            "body": "I saw two items I did not even know existed advertised, clicked on the links checked them out. Then searched online to see if there were similar items, there were. So I bought those at a fraction of the price. But the initial ads were making them out to be one of the kind and that they were the first inventors of the products.",
            "polarity": 0.2125,
            "subjectivity": 0.4083333333333333
        },
        {
            "comment_id": "hinqwcn",
            "body": "Some FB ads are generic Chinese drop ship companies is what OP probably means. These have really odd names and have really cool things at a huge markup. OR some store of theirs is \"closing\" so its marked down from like $200 to $150. \n\nThose are the scammy things that you can get for cheap on AliExpress.",
            "polarity": 0.11597222222222223,
            "subjectivity": 0.42361111111111105
        },
        {
            "comment_id": "hinqjki",
            "body": "This is truly great LPT. I was scammed once since then I have checked online first as suggested. Recently there has been Holee website scamming with really cheap deals. Checked online - reviews say it all.",
            "polarity": 0.36250000000000004,
            "subjectivity": 0.5083333333333333
        },
        {
            "comment_id": "hinqito",
            "body": "The quality of the products I buy from Instagram ads is far higher than the quality of the products I purchase from Amazon 🤷🏼‍♂️",
            "polarity": 0.175,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hinqiob",
            "body": "That goes for any ad, in any platform, not just social media.",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment_id": "hinqdg6",
            "body": "Somebody is shorting WISH",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinqa7v",
            "body": "Google the thing they are selling and find the *real* product they’re ripping off. I’ve snagged some cool Xmas/birthday gifts this way for my kids and stuff and the real items are usually pretty nice, although a little more expensive.",
            "polarity": 0.1765625,
            "subjectivity": 0.61875
        },
        {
            "comment_id": "hinpxt5",
            "body": "Outdated Boomer Pro Tip",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.6333333333333334
        },
        {
            "comment_id": "hinpsi5",
            "body": "I’ve bought a few things I’ve seen from Instagram ads, but only after thoroughly going through both their Instagram page and their website. Basically, if it’s too good to be true, and/or you don’t do a little bit of research, you’re setting yourself up for a scam",
            "polarity": 0.13249999999999998,
            "subjectivity": 0.5700000000000001
        },
        {
            "comment_id": "hinpmk7",
            "body": "Bought a pair of headphones from an Instagram ad. They stopped working after 2 months and weren't very comfortable. I learned my lesson",
            "polarity": 0.52,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hinphl4",
            "body": "What is wish quality?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinp8ml",
            "body": "I normally would 100% agree; however, I got this incredible pokemon anatomy book from a social media ad and its actually really well made and worth the price. Other than this rare instant, yea normally theres a high shipping fee that makes up for the \"deal\" you think you're getting.",
            "polarity": 0.20683333333333334,
            "subjectivity": 0.5048333333333332
        },
        {
            "comment_id": "hinp1yi",
            "body": "And look for the actual product from the company website.  Don’t buy things from an affiliate link.  I would rather buy directly than go through a third-party affiliate to get something.  And don’t buy things that some YouTuber is selling either, especially paying money for Super Chats, etc.",
            "polarity": 0.10833333333333334,
            "subjectivity": 0.5416666666666666
        },
        {
            "comment_id": "hinoybj",
            "body": "Yo but how do I get my independent webshop any attention? I have some products that don't even show up if you Google the exact name that I gave it",
            "polarity": 0.125,
            "subjectivity": 0.1875
        },
        {
            "comment_id": "hinotjh",
            "body": "I took a risk on a frontier gaming painting carry case for way more than i should paid for something online and i love it.  Now i get tons of ads for things like it.  \n\nMade mistake and bought a jacket for cheap and it was garbage.   Bought dress shirts and they were trash.  So my first experience set some unreasonable expectations but I’ve since learned.",
            "polarity": 0.4125,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "hinoajd",
            "body": "TinEye Reverse Image Search is the best way to find the item through a legitimate seller. I have to do this for my wife all the time and I can usually find the exact item by searching the image.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "hino8mx",
            "body": "If someone is dumb enough to fall for that shit I really don’t think this will be a sufficient wake up call, those people have zero taste and they will suffer for it",
            "polarity": -0.09374999999999999,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinnwkk",
            "body": "I've bought a handful of things that I found via Instagram ads (including an engagement ring!). Just have to be diligent with your research before buying anything and make sure to not overlook red flags just because something looks cool. If it sounds too good to be true, it probably is.",
            "polarity": 0.38,
            "subjectivity": 0.5577777777777777
        },
        {
            "comment_id": "hinnb04",
            "body": "Well I buy things through instagram all the time and it’s always worked out so far.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hinn9p7",
            "body": "Companies like Facebook have 10 million active advertisers all over the world ranging from your local auto dealer all the way to the largest, publicly traded companies in the world. There are plenty of ads on Reddit that are also mostly legitimate. The LPT should be \"be sure to visit their website to confirm they have basic items like terms of service, privacy policies, and active employees on LinkedIn\".",
            "polarity": 0.10476190476190476,
            "subjectivity": 0.3972222222222222
        },
        {
            "comment_id": "hinmuar",
            "body": "Still boggles the mind, the lakers will be forever associate with wish for the 17 ring",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinmpln",
            "body": "While not scams directly, but any products advertised on podcasts, YouTube videos (Via ad reads and not actual ad breaks on YouTube) like Raycons, Meundies and such are all crap. Same issue as Beats By Dre headphones where advertising is where most of the money is spent instead of the product or any QA.\n\nEspecially with VPNs, I think ExpressVPN was just sold to a malware company and I'd abandon ship if you subscribe to them.",
            "polarity": -0.037500000000000006,
            "subjectivity": 0.440625
        },
        {
            "comment_id": "hinmnwf",
            "body": "Terrible LPT. Pet insurance doesn’t cover shit",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hinmeyn",
            "body": "Or just order it on AliExpress for $5, and wait three months to receive it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinm8a3",
            "body": "Also run their address through google.  Had a friend who wanted to get some \"custom\" artwork done on facebook, and after going through everything, we found out their office uses a virtual address in Delaware, along with hundreds of other companies.  Pretty eye opening.",
            "polarity": 0.0625,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hinm20f",
            "body": "I usually get ads for luxury watches and name brand bicycles.  Used to get Grindr ads after doing searches for Miata parts.",
            "polarity": -0.25,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hinlzjx",
            "body": "for real. saw a mechanical robot cat. 25 dollars. i said... gamble time. i got a bronze engagement ring from china. \n\ndouble drat.",
            "polarity": 0.1,
            "subjectivity": 0.15000000000000002
        },
        {
            "comment_id": "hinlz7z",
            "body": "My wife does this all the time. \n\nHalf of the time they are just drop shippers. A few days later it shows up in an Amazon package.",
            "polarity": -0.12222222222222223,
            "subjectivity": 0.08888888888888889
        },
        {
            "comment_id": "hinlolo",
            "body": "I also love the complete shitshow of reddit ads currently. due to the rise of wallstreetbets and creation of superstonk, in combination with all the cryptocurrency subs taking off, I've seen a absolute bonkers amounts of sketchy financing and cryptomining/investment ads here on reddit.  \n\nFor fun I've wrote some of the names and domains of the ads down months back, and about 1/3 of them don't even exist anymore.",
            "polarity": 0.11706349206349208,
            "subjectivity": 0.3948412698412698
        },
        {
            "comment_id": "hinlcwu",
            "body": "Also they’re ALWAYS more expensive than you can find elsewhere. Sometimes significantly so.",
            "polarity": 0.125,
            "subjectivity": 0.6916666666666668
        },
        {
            "comment_id": "hinlaqv",
            "body": "I just won't buy stuff from social media with C.C because I don't want my social media to have my financial account. So I just buy local distance where I can meetup.",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.03333333333333333
        },
        {
            "comment_id": "hinl51h",
            "body": "You're just a $WISH shorty in disguise",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinl42o",
            "body": "Even if they're not a scam, they're drop-shipping from other places you could access and marking them up.  You can find the same product for 20-40% less from the source or another major shipper.",
            "polarity": -0.05729166666666666,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "hinl3br",
            "body": "ITT: \"don't worry I'm a smart shopper, I only buy *good* products that I wouldn't have if not for the ad.\"",
            "polarity": 0.30476190476190473,
            "subjectivity": 0.7476190476190476
        },
        {
            "comment_id": "hinl2lx",
            "body": "Paypal helps these assholes scam you. Wife wanted a doll she saw on facebook, Thought it was a bit of a scam so I  used paypal cause I didn't want to give my credit card info out.\n\n2 months later I still don't have the doll and all I am getting is \"we are shipping next week\" So I tell them to cancel the order. No response so I contact paypal  and file a claim. Paypal took 3 months to refund the money. The company responded to paypal that they had shipped the order and provided a tracking number. Took a month for the package to arrive, the package was the size of a letter envelope, no way a 18 inch doll would fit. Opened it up and it was a micro cloth for cleaning glasses.  Paypal was so bad to deal with I quit them.",
            "polarity": -0.07499999999999996,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "hinky9a",
            "body": "Does not apply to dr squatch soap. That shit is 🔥. To date this is the only product I’ve bought off of Instagram.",
            "polarity": -0.1,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hinky6o",
            "body": "I fell for number 3. There was an advertisement for a hoodie but when I got it, the quality was trash. It was the same material used to make cheap Halloween costumes. I'm never buying from an online ad ever again unless it's a well known seller.",
            "polarity": 0.2,
            "subjectivity": 0.4125
        },
        {
            "comment_id": "hinkudd",
            "body": "Over exaggerating quantity. Isn't majority probably not even half. At least from my feed.",
            "polarity": -0.23333333333333334,
            "subjectivity": 0.2833333333333333
        },
        {
            "comment_id": "hinkfss",
            "body": "100% agree. I see all these stupid accounts on Instagram of all these fake people with tons of makeup, stupid videos, videos that drag out the point, or just stupid dances. All this to just get you to view their profile and go to their links or other people's pages and see their links and buy their discount products or companies discount products. I look at these videos because it's addicting and interesting and I need to stop. Sometimes I just view these videos because I want to complain about them and also because i don't get how people are like this, but it's just to get views. It's all fake as can be, plastic people.",
            "polarity": -0.39062499999999994,
            "subjectivity": 0.7432291666666666
        },
        {
            "comment_id": "hinkc4l",
            "body": "I saw an ad on fb for a camping store going out of business and selling \"a random tent for $25\". Obviously showing $200 tents. I thought sweet, even if it's not great,  I'll have another backup tent\n\nWhat I received was a $3.99 piece of aluminum foil(space blanket) and a string... I guess I knew it was probably gonna be cheap but I figured it would at least have a door! 😂\n\nSometimes you just gotta cut your losses",
            "polarity": -0.08750000000000001,
            "subjectivity": 0.5833333333333333
        },
        {
            "comment_id": "hink3to",
            "body": "I got some Simpsons themed merch from The Best Damn Petshop In Town. \n\nVery satisfied.",
            "polarity": 0.825,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinjxy9",
            "body": "Not really that true anymore. Definitely true for anybody old enough to still be on facebook, but most other sites this just isn’t true beyond the obvious “hot girls near you” shite",
            "polarity": 0.16136363636363635,
            "subjectivity": 0.4977272727272727
        },
        {
            "comment_id": "hinjw7x",
            "body": "This is partially true. I ordered a titan chair from a fb ad and it’s the best “gaming” chair I’ve had.",
            "polarity": 0.675,
            "subjectivity": 0.475
        },
        {
            "comment_id": "hinjvoz",
            "body": "But, I'm literally wearing the boxers I bought from a Facebook ad.  They're great, I bought them 3x",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hinjr8s",
            "body": "I typically won't buy items based on social media advertisements.  BUT, I do love me some Wish (direct from the site). I expect garbage and am pleasantly surprised about half the time.",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.43888888888888883
        },
        {
            "comment_id": "hinjp53",
            "body": "This is a pretty classic Life Pro Tip. It holds some aspects of truth, but in reality a lot of legit companies advertise on social media. Like anything, if it seems to good to be true then it probably is. No one is selling you a garden shed for $59 for instance.\n\nOne of those mini projectors, yeah it’s probably legit, but you can also get it cheaper direct from the manufacturer in China if you go looking for it. It’s also not nearly as good as they make it seem because we’ll, it’s a mini projector. \n\nJust don’t be an idiot and you’ll probably do fine. One final note, steer clear of products that are free but you pay the shipping, or are under $20. Most credit card companies won’t let you file a dispute/chargeback for less than $20. If you do get scammed you probably won’t get your money back through your credit cards fraud protection.",
            "polarity": 0.11333333333333333,
            "subjectivity": 0.5022222222222221
        },
        {
            "comment_id": "hinjmk0",
            "body": "This is probably good advice most of the time. \n\nBut, social media ads for Huel are what made me try it like 5 years ago.\n\nI've been using it fairly regularly ever since.",
            "polarity": 0.30833333333333335,
            "subjectivity": 0.3108974358974359
        },
        {
            "comment_id": "hinjghb",
            "body": "I got some good eals from instagram adds.\n\n[https://kirikomade.com/](https://kirikomade.com/)\n\n[https://www.baseblocks.fit/](https://www.baseblocks.fit/)  \n\n&amp;#x200B;\n\nAre two examples, just do your research.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hinjefo",
            "body": "Might be a good time to re evaluate being on said social media platform in the first place.",
            "polarity": 0.3277777777777778,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hinjbxt",
            "body": "FB and IG ads are sketchy AF. Follow the names and search for the companies, and many will lead to the same fake front business in a sketchy building that doesn't have a business name on it. \n\nThen 60 later when the shit never arrives or it's horrible, you have no recourse.",
            "polarity": -0.19999999999999998,
            "subjectivity": 0.5708333333333333
        },
        {
            "comment_id": "hinj207",
            "body": "I wish I could upvote this multiple times. This is so true. I once ordered a survival shovel off Insta (mall ninja shit, yes, but thought might be handy for camping). Promised to be American made high quality. Showed up and it was cheap Chineseum crap from a shell corp warehouse. Returning it was a nightmare as the company was unresponsive and after over a month with the PayPal dispute, wanted me to return it to an address in Australia (the shipping alone would have been half the cost of the item). Only a dispute and chargeback through my bank got me a resolution. Never again",
            "polarity": 0.03433333333333334,
            "subjectivity": 0.5556666666666666
        },
        {
            "comment_id": "hiniyfu",
            "body": "Ya, I got scammed on some IG clothes.  I ordered two, men's large, sweaters.  about 2 months later one of them came in the mail.  It was marked 2X on the tag, but wasn't large enough for a child.\n\nI am not a  fat ass, I literally couldn't fit my arm in the sleeve.  The premium looking pieces from the picture were not present, and the whole thing was like a cheap knock off (if I could wear it).\n\nThe other item never came.\n\nFortunately, the bank reversed the charge, but the whole process lasted at least 4 months.  Super fucking irritating.\n\nBasically what they are doing is sourcing cheap Chinese sweat shop bullshit, then the shop some nice photos and create appealing IG/FB ads that are hard to ignore (as they are designed to micro-target you specifically).\n\nThen, when they get enough payments from us suckers they drop ship them from China (which is why you never get anything within 6 weeks, no storage costs for sellers means more profits off their junk).  They, however, are not telling you you are signing up for a mass drop, so it comes as a surprise that a couple months can go by before you get your stuff.\n\nI followed up with the company by email and they were responsive for the first few weeks, although they never said anything useful, just false promises that my stuff was on the way.  After a month they stopped responding to my emails, which is probably why the bank gave me my money back.\n\nAvoid at all costs.",
            "polarity": 0.10697278911564626,
            "subjectivity": 0.44192176870748306
        },
        {
            "comment_id": "hiniydk",
            "body": "My husband drunkenly bought something one night from a company like this. He used PayPal so he figured he was good for a refund if it was a scam. They never delivered and when he opened a claim with PayPal they submitted a tracking number for some random item that was delivered in the same city as mine (addresses aren’t listed on tracking just the city). Since it was marked delivered PayPal closed the claim as fulfilled. It wasn’t until I contacted ups and they confirmed the tracking number was not delivered to my address that I was able to get PayPal to reverse the claim.",
            "polarity": 0.15714285714285717,
            "subjectivity": 0.5071428571428572
        },
        {
            "comment_id": "hinixtv",
            "body": "Unless you're Drew Gooden. Then keep buying things in groups of five and making videos about it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinir48",
            "body": "I bought a laptop bag off an Instagram post. It came and was super nice.",
            "polarity": 0.4666666666666667,
            "subjectivity": 0.8333333333333333
        },
        {
            "comment_id": "hiniqec",
            "body": "Pretty sure most of those are just people dropshipping stuff off of aliexpress. It's relatively low-effort easy money. Good for a side hustle.  \n\n\nInstead of advising people not to buy these, advise them not to waste their money on stupid things that they're impulse buying and don't really need. Because that's the real problem here. Not the fact that there are people trying to make a little extra money on the side because the economy is shit.",
            "polarity": 0.10737179487179487,
            "subjectivity": 0.5170940170940171
        },
        {
            "comment_id": "hiniosh",
            "body": "Normally I’d agree but I’ve found some quality items from my Instagram ads.",
            "polarity": 0.15,
            "subjectivity": 0.6499999999999999
        },
        {
            "comment_id": "hinill7",
            "body": "I understand where you are coming from but this post is bad for for the real guys trying to promote their items/stores on social media. Tell people to be careful, but don’t tell them to never buy it either",
            "polarity": -0.14166666666666664,
            "subjectivity": 0.5083333333333333
        },
        {
            "comment_id": "hiniehk",
            "body": "And please support your local business!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinib51",
            "body": "What I would like to know is: why does Facebook keep giving me ads for radar identification guides and similar products? Is this some sort of weird scam, and if so why? If I was in a field or hobby that required something as complex as radar identification, I'm pretty sure I would know where to find something like that.",
            "polarity": -0.010000000000000009,
            "subjectivity": 0.7377777777777778
        },
        {
            "comment_id": "hiniave",
            "body": "At least research the company. I found out about Thursday boots from Instagram and they’re pretty great not gonna lie.",
            "polarity": 0.25,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "hini3jl",
            "body": "I'm convinced that 95% of clothes advertised online don't exist and they're all cheap Asian knockoffs",
            "polarity": 0.2,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hini2wf",
            "body": "just made this mistake with some fitness app. garbage. fitcoach?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinhxqi",
            "body": "I had an issue with a social media product that was approved by ‘healthcare experts’. My own healthcare expert disagreed. I left a bad review (only customers could review) and they didn’t post it - when I enquired about the healthcare experts that endorsed the product it turned out to be the owner.",
            "polarity": -0.013333333333333308,
            "subjectivity": 0.5466666666666666
        },
        {
            "comment_id": "hinhugn",
            "body": "This is not true for small businesses who rely on social media ads to bring in new customers. Small business can set to have ads come up locally to people with similar interests. \n\nMost ads that appear for me are from small businesses. Possibly because I interact more with them, and will check out their pages",
            "polarity": 0.022245179063360876,
            "subjectivity": 0.4337465564738292
        },
        {
            "comment_id": "hinht45",
            "body": "Your ads are geared to YOU. Mine tend to show me products I am investigating, and eventually I will buy one of them. Im currently wearing a shirt that is advertised to me on fb. It is a good shirt, i moght buy it again",
            "polarity": 0.35,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinhst3",
            "body": "Never have, and never intended to do so.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinhmyj",
            "body": "I just bought 4 t-shirts of an FB add. They arrived yesterday and the quality was very good",
            "polarity": 0.9099999999999999,
            "subjectivity": 0.7800000000000001
        },
        {
            "comment_id": "hinhe2u",
            "body": "I fell for this twice.... didn't learn my lesson the first time.",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hinh4y9",
            "body": "This isn't always the case. I don't usually get ads like that anymore.",
            "polarity": -0.25,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hinh2j4",
            "body": "As a small farmer this post hurts me. How am i supposed to advertise outside of social media. Go ahead and be wary of social media advertising but dont write me off because i dont sell on amazon.  I just want to sell you some nice handspun yarn and tomatoes im not a scammer i promise.",
            "polarity": -0.026190476190476198,
            "subjectivity": 0.3547619047619048
        },
        {
            "comment_id": "hingg66",
            "body": "Singlehandedly DESTROYED legitimate small ecommerce businesses trying to reach customers on social media /s",
            "polarity": -0.10833333333333334,
            "subjectivity": 0.23333333333333334
        },
        {
            "comment_id": "hing7w3",
            "body": "I've seen lots of stuff advertised on Facebook that looked cool, so i ended up buying.  But not from the advertiser.\n\nGenerally the way it goes is that the ad will say it's regularly $80, marked down to $40.  So I search Amazon, and find it for $20.",
            "polarity": 0.08611111111111111,
            "subjectivity": 0.5097222222222222
        },
        {
            "comment_id": "hing0f7",
            "body": "Learned this the hard way recently. \n\nThought I was buying a cool corner lamp for the living room ended up supporting a scammer *facepalm*",
            "polarity": 0.07708333333333332,
            "subjectivity": 0.42291666666666666
        },
        {
            "comment_id": "hinfx2p",
            "body": "I can vouch for that dope sweatshirt ad....Fresh Hoods.  The products are top notch and the designs are hype.  Expensive (to me) and take quite awhile to get to you but worth the wait imho.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hinfuf4",
            "body": "I will vouch for those popfit leggings. I saw the ad for 3 years, and the chick kept putting a wine bottle in the pocket, and I had to try. Love them. Just don't become a salesperson, it IS a MLM.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hinfsao",
            "body": "Huh I bought stuff from that bee kind store on fb and gotta say I’m super happy with it, so YMMV.",
            "polarity": 0.5777777777777778,
            "subjectivity": 0.8555555555555555
        },
        {
            "comment_id": "hinfqxk",
            "body": "I dont get how this is a good LPT when OP doesn't even specify 'social media sites'",
            "polarity": 0.36666666666666664,
            "subjectivity": 0.33333333333333337
        },
        {
            "comment_id": "hinfqjw",
            "body": "Please inform my wife of this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinfpbb",
            "body": "Much better LPT: **block ads** you fools!\n\nEdit: Okay after reading a few comments I am absolutely *horrified* at the number of people who not only don't block ads, but actually click on them and buy things!  What is wrong with you people?",
            "polarity": 0.08928571428571429,
            "subjectivity": 0.5714285714285714
        },
        {
            "comment_id": "hinfn29",
            "body": "I just saw an ad for a \"portable synthesizer\" for $50. A reverse image search revealed that the site had just taken the images of several made to order $1500 synthesizers and put them on their site.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinfmi6",
            "body": "For items I'm interested in but the company looks sketchy, I do a Google reverse image search to find a legit company selling it. Many times, it's something AliExpress is selling for pennies and they are marking up 100+%.",
            "polarity": 0.375,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinfktb",
            "body": "But... How are idiots supposed to buy things then?",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hinfdrf",
            "body": "Wish products have actually significantly increased in quality over the years, and their shipping times are way down. They're still not as good as regularly priced items, but for the cost it's not bad at all. If you're getting things that don't really need to be super sturdy(dice, niche cooking products like a sushi bazooka, miniatures) it's alright, and if not it's still going to be way cheaper than local shitty products.",
            "polarity": 0.2253472222222222,
            "subjectivity": 0.4217681623931624
        },
        {
            "comment_id": "hinfdot",
            "body": "My grandmother has twice fallen for Facebook ads like this.\n\nThe first was supposed to be a Realistic Newborn Baby that was supposed to be the look and be the size of a normal newborn baby. The quality was like a Dollar Store toy and the baby was the size of ypur hand.. We now have it at my work where we hide it for somebody to find it as a joke.\n\nThe second was a Christmas wreath that was supposed to be about 2ft across. Yeah no it was about 6in across. Paid a good amount for it too!\n\nSo yeah definitely don't buy things off Facebook...",
            "polarity": 0.24027777777777778,
            "subjectivity": 0.40277777777777773
        },
        {
            "comment_id": "hinfbwj",
            "body": "Unless they are bootyshorts for men imo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinf6bp",
            "body": "I got scammed on a Facebook ad for a toolbox in the shape of a barrel. The barrel opened to display the tools. Like $40.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinet0e",
            "body": "This is horrible advice. I manage Facebook ads for a clothing company and we run exclusive promos only available for those clicking through the ad links.\n\nObviously make sure the website is legit, but being afraid to click on ad links is some boomer shit.",
            "polarity": -0.12857142857142856,
            "subjectivity": 0.7841269841269841
        },
        {
            "comment_id": "hinerue",
            "body": "What about Reddit ads?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hineiwd",
            "body": "Learned this the hard way a few years ago. I love space and a little star projector lamp thing came across my feed. The reviews on the site from the ad (likely faked) enticed me to pull the trigger for 20-30$. A few weeks later it arrived from China and only had instructions in a little pamphlet in what I assume was Mandarin. \n\nI wouldn't be deterred though as I badly wanted to see some stars in my room that night! So I spent a few hours fumbling with it and managed to get it put together using the pictures, only to plug it in and the little lightbulb instantly blew out.\n\nThrew it in the garbage and learned my lesson about acting on emotional response to ads on social media",
            "polarity": -0.10532407407407406,
            "subjectivity": 0.44953703703703707
        },
        {
            "comment_id": "hinehij",
            "body": "I've bought lots with no issue.  The issue is with people being shocked when they find out that their $18 item that you by in stores for $90 isn't rhe beat quality.  You get what you pay for.",
            "polarity": -0.7,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hineftr",
            "body": "I signed up for a monthly d&amp;d book subscription for hosting games with my kids, done by a family out of Portland. They are well made and the people who make them are super nice. Was made aware through a FB ad. So id say it’s not all bad.",
            "polarity": 0.12083333333333338,
            "subjectivity": 0.6458333333333333
        },
        {
            "comment_id": "hine3gx",
            "body": "Items? Hell no.\n\nServices, maybe. I was already looking for a new gym now that things are slowly reopening here and an ad for In-Shape came up and had zero sign up fees and some other discounts. Currently dealing with lots of lactic acid as a result.",
            "polarity": -0.07215909090909092,
            "subjectivity": 0.4073863636363636
        },
        {
            "comment_id": "hinduq7",
            "body": "always reverse image search images from a sketchy ad. in my experience 90% of time it will take you to the actual maker who is selling their products for a much more realistic price.  \n\n\nsometimes chinese scam sites just copy paste cool things from maker groups (not even products for sale) and try to scam people with them. facebook doesnt care about you, they just want money.",
            "polarity": 0.2033333333333333,
            "subjectivity": 0.3166666666666667
        },
        {
            "comment_id": "hindpur",
            "body": "Also any deal that is to good to pass up on sites like offer up will usually be stolen merchandise. \n\nSource I work in loss prevention.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.42500000000000004
        },
        {
            "comment_id": "hindg3e",
            "body": "Why would you expect the social media site to \"provide resolution\"?  If you used the Classifieds Ads in a newspaper to buy a car, and it turned out to be a lemon, would you expect the newspaper to \"provide resolution\"?",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        },
        {
            "comment_id": "hind2we",
            "body": "I would also add the product could also be outsourced from a site like Aliexpress, where it was \"cheap\" to begin with, but now relatively pricey. In other words, dropshipping.",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.35833333333333334
        },
        {
            "comment_id": "hinczfa",
            "body": "While I do agree in general. I have actually made out like a goddam bandit at least three times.\n\nI ordered a socket set that was INSANELY too good to be true. Husky brand sockets in every drive size, short and deep, 6 and 12 point. I think I paid 49.95 or something completely unrealistic like that. They showed up and were real husky sockets. I've paid more for a single ratchet.\n\n\nI ordered my son a bunch of tacti-cool clothing from a place saying it was a going out of business sale. Got him a vest, gloves, and I think even a helmet? For literal pennies on the dollar. It all showed up, better quality than some airsoft gear, not cheap garbage at all. \n\n\nI ordered Bandai drawing models for I think 89 for two. They're more than that for one at most retailers. Both showed up, totally legit Bandai products, my daughter has been using them for 3 or 4 years.\n\nI have absolutely no idea how I managed to get lucky but, the ads seemed shady in every case. The ONLY reason I ordered the first two things was they were so cheap I wasn't even worried if they didn't show up or were junk. The Bandai thing was a little more stressful, but I had the built trust from the two previous purchases.",
            "polarity": 0.07722069597069597,
            "subjectivity": 0.5566391941391942
        },
        {
            "comment_id": "hincjsq",
            "body": "Speak for yourself dude. Just coz you got scammed doesn't mean everything on there is a rip off, it just means you're too credulous to sort the wheat from the chaff. I've bought a bunch of really good shit off social media adverts.",
            "polarity": 0.05520833333333332,
            "subjectivity": 0.5385416666666668
        },
        {
            "comment_id": "hincegq",
            "body": "Those ads are targeted, by the way. So if they’re funneling shit products your way, it’s likely to do with your habits on social media and similar profiles engaging with the content.",
            "polarity": 0.04666666666666667,
            "subjectivity": 0.5933333333333334
        },
        {
            "comment_id": "hincebt",
            "body": "Kind of weird, but I think this may be region specific. Where I'm from most ads are by small time stores and brands, often sustainable or ethical.\nMaybe it's just me",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.5875
        },
        {
            "comment_id": "hince0x",
            "body": "Oh man, I had this happen to me. I bought a BEAUTIFUL dress from online to wear to a wedding. I received it timely and it looked just like the picture! When I tried it on it was the scratchiest material I have ever worn and was pretty wrinkled. I popped in in the wash on gentle cycle and allllll the seams came apart. \n\nI also bought one of those cat toys that is a ball that lights up and moves around on its own for my bored cats before I worked from home. Didn’t work well on carpet and the batteries died after about a week AND the cats couldn’t care less. \n\nI have bought some nice things online but I try to be less impulsive now.",
            "polarity": 0.22708333333333328,
            "subjectivity": 0.7416666666666666
        },
        {
            "comment_id": "hinc6hh",
            "body": "It's best to take a screenshot of an item then put it in Google lens or directly in AliExpress app so you will find those items from FB and others",
            "polarity": 0.55,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hinc36s",
            "body": "As a Social Media advertiser, I find this an interesting post to see what some people think about their online shopping experience.\n\nAs far as the the sentiment expressed, I feel like it is way exaggerated and over the top. There are scams out there, but I would like to see any data that attempts to quantify what percentage are scams, to support what is claimed by OP that it is the majority. Is this really a Life Pro Tip or an opportunity to vent about something annoying?\n\nSocial Ads have been great for small, local, independently owned businesses who can advertise without having the large promotional budget of your average corporation. Facebook may be evil, but the advertisers are often just regular people, like me and you, trying to make a living. Mega-corps advertise online too of course, as do scammers. Practice common sense and due diligence just as you would in any other setting and you will likely have fewer bad experiences. For example, as others have mentioned, some payment options have better refund protection than others.",
            "polarity": -0.048593073593073584,
            "subjectivity": 0.4922952047952048
        },
        {
            "comment_id": "hinc0r3",
            "body": "Also, to add, it is frequently someone who is buying items from Amazon and reselling them with a huge markup. It's a big strategy from those \"you want to make $14,432 a month?!\" kind of people",
            "polarity": 0.275,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hinbwod",
            "body": "There are plenty of legitimate small businesses that advertise clothing on IG, can’t speak for other platforms.",
            "polarity": -0.1875,
            "subjectivity": 0.3875
        },
        {
            "comment_id": "hinbpqv",
            "body": "Generally speaking, if it's advertised on a website it's a scam.",
            "polarity": 0.05000000000000002,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinblxz",
            "body": "UnethicalLifeProTip: social media is good for picking up stolen goods, but as OP said be careful because you could get scammed. This is the black market life.",
            "polarity": 0.11666666666666667,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hinbj1w",
            "body": "Hey, this is not necessarily true. While some products are own and pushed by large companies giving bad items. A lot of fb ads are ran by small companies supplying very niche items to customers. As with all things investigate, but don’t judge before you know.",
            "polarity": -0.018452380952380932,
            "subjectivity": 0.574206349206349
        },
        {
            "comment_id": "hinbhab",
            "body": "Exact opposite has been true for me. I’ve stumbled across some really cool shit on Facebook ads. I understand that I may be the exception, but I’ve definitely found some really badass companies/products on Facebook. I definitely read through hella comments and reviews prior to ordering anything, though.",
            "polarity": 0.10555555555555556,
            "subjectivity": 0.3944444444444445
        },
        {
            "comment_id": "hinbfcf",
            "body": "This depends entirely on your profiles on these social media sites and whether the algorithms decide that you are a good mark for each ad.\n\nPersonally I have never had this problem at all. I buy things advertised to me on social media often and have yet to be ripped off.",
            "polarity": 0.15333333333333332,
            "subjectivity": 0.33166666666666667
        },
        {
            "comment_id": "hinbepk",
            "body": "I got some of the most comfortable t-shirts from a Facebook ad and sunglasses that were inexpensively replaced by the company after I broke a pair.",
            "polarity": 0.45,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hinbdpj",
            "body": "I got an ad from Shein on facebook in which they had stolen one of my artworks, and in the ad promoted it on halloween shirts!! :)))) Took a couple of weeks and a complicated legal process with the help of a lawyer to get them to take down the artwork stolen from me (I've yet gotten no compensation and doubt it will happen). Found out during this process that this has happened to many artists with Ali Express, Asos and other big resellers commonly advertised on facebook :/ \n\nIf something is advertised on facebook, surprisingly cheap, and comes from a company that releases over a hundred new products daily, I'd be very suspicious. Google stores in facebook/instagram ads before you buy from them!",
            "polarity": 0.05044677544677545,
            "subjectivity": 0.4937257187257187
        },
        {
            "comment_id": "hinb7gs",
            "body": "If you get an immediate \"omg that's so cute\" or \"omg I need this NOW\" impulse it's probably a dropshipper who bought it off alixpress / alibaba and is reselling at a huge markup.",
            "polarity": 0.45000000000000007,
            "subjectivity": 0.95
        },
        {
            "comment_id": "hinb74i",
            "body": "This is so untrue",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinakon",
            "body": "When Facebook first done advertising like that, saw the lightsabres for cheap and went for it.\n\nNever buying anything from Facebook or Instagram adverts again.\n\nAt least it was a cheap lesson to learn.",
            "polarity": 0.1875,
            "subjectivity": 0.5333333333333332
        },
        {
            "comment_id": "hina9zj",
            "body": "Yes I made this mistake recently with some XL stretchy lockdown pants. What arrived two months later was a tiny (like toddler sized) pair of wish quality linen pants.",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hina4mo",
            "body": "You know what, instinctively I’d agree with you 110%, but, my little temperature colour changing sakura and peach tree cups work really fucking well, as does my magnetic levitation speaker, the origami set, and the glass ball with the solar system somehow inscribed inside. Maybe I have been *insanely* lucky.",
            "polarity": -0.15138888888888888,
            "subjectivity": 0.7111111111111111
        },
        {
            "comment_id": "hin9zon",
            "body": "I've been pretty happy with the few little things I've gotten.   However I have a larger order coming in soon and now Iam less excited.  Granted larger to me is like 80 bucks so I won't be hitting a huge debt if it's not great.   \n\nWould it not depend on kind of the things you're browsing / getting targeted for?  I can imagine dinner interests lead to more scammable potential than others - but then why even bother with that thought given you will never know till it arrives?  I'm rambling again",
            "polarity": 0.15160256410256412,
            "subjectivity": 0.6512820512820514
        },
        {
            "comment_id": "hin9r8i",
            "body": "All web ads including Google have this problem. Anyone can create an ad. Try [ads.google.com](https://ads.google.com) if you want to see for yourself. You can point to any URL, create any headline, and set your budget. There's virtually no policing of it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin9b64",
            "body": "I saw these coffee mugs with wooden handles pop up that looked kinda neat. Clicked through the ad and they where $50-70! They showed up later on Amazon for $20 and had bad reviews.",
            "polarity": -0.23333333333333328,
            "subjectivity": 0.2222222222222222
        },
        {
            "comment_id": "hin8yqu",
            "body": "Yea, my gf likes to try stuff off of tiktok sometimes.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin8i2p",
            "body": "I bought my lotion from an Instagram ad. It's from a small black owned buisness, got delivered to me, and lasted me months. [here's the product if anyone wants to try](https://urbanbodyskin.com/products/bodysouffle)\n\nSimilarily I found the toothpaste BITE from insta ads and those have been pretty good.\n\nYes, do research on the product. But social media ads arent inherently untrusteorthy",
            "polarity": 0.1277777777777778,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hin8diq",
            "body": "...except Dagne Dover. Found the brand via instagram and I LOVE those bags.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hin7vfk",
            "body": "I was stupid and bought a really cheap adjustable dumbbell set from one of these sites. There were dozens of legitimate looking reviews, the website looked legit, etc.\n\n4 weeks later they sent me two face masks in a small envelope...",
            "polarity": -0.16249999999999998,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hin7o7x",
            "body": "Thank you for letting me know about this, I would see some nice items on Snapchat and save them, maybe I'll just look for the items independently now",
            "polarity": 0.3,
            "subjectivity": 0.5625
        },
        {
            "comment_id": "hin7gir",
            "body": "Only good thing I ever bought from a Facebook ad was a pair of Allbird shoes. Kind of expensive, but decent shoe and doesn’t stink that bad",
            "polarity": 0.04444444444444443,
            "subjectivity": 0.7555555555555555
        },
        {
            "comment_id": "hin6v81",
            "body": "Like the Astronaut light that projects a planetarium in your bedroom? \n\nSo tempting tho",
            "polarity": 0.4,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hin6fwf",
            "body": "A notable exception is the Flat Iron Pepper Company. Their pepper flakes are incredibly delicious 😋 🌶",
            "polarity": 0.4916666666666667,
            "subjectivity": 0.5416666666666666
        },
        {
            "comment_id": "hin5tg0",
            "body": "Bought some inexpensive puzzles from a FB ad click. They are really cool! But I'll admit my risk was pretty low because I was buying a simple, inexpensive product.",
            "polarity": 0.171875,
            "subjectivity": 0.5767857142857142
        },
        {
            "comment_id": "hin5iwb",
            "body": "That is an overly generalised statement. I have bought several things based on ads I’ve seen on social media platforms and have never had any issues. Never been charged more than once, never weird random charges for things I haven’t purchased, what arrived was what was advertised and better than expected quality.",
            "polarity": 0.09761904761904762,
            "subjectivity": 0.42380952380952375
        },
        {
            "comment_id": "hin4w5w",
            "body": "[deleted]",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin4o3y",
            "body": "Is this why i got an electric toothbrush instead of the roller skates i ordered lol? I go to an actual site if i want to order online now. Fool me once or whatever.",
            "polarity": 0.4,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hin4nne",
            "body": "To add to this, if you do take the risk of buying something off of Facebook and the seller does not send you the item after you’ve already paid them via Venmo, Cash App, etc, I promise that you will NOT get that money back by disputing it with your bank.\n\nWhat the bank looks at with money transfer app disputes is did you initiate the transaction and did the recipient receive it. There is no expectation of a transfer of goods/services- that is what Visa is for.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin4fja",
            "body": "You mean we shouldn’t buy tshirts on Facebook, even if we have DALMATIONS and were born in MAY.  Yes, my Dalmatian bought me this shirt.",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hin49ss",
            "body": "Remember anything advertised is being pushed or promoted since it’s not selling well in the first place",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hin48xg",
            "body": "Reverse image search on AliExpress…pay a few bucks for shipping instead of taking the free option. Done.",
            "polarity": 0.1,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hin3xof",
            "body": "There is a YouTube or whom analyze that kind of stuff usually you will get something totally different for example instead of a laptop you will receive chips and glasses or a flash drive",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.5833333333333334
        },
        {
            "comment_id": "hin3shz",
            "body": "I started a small business pre-pandemic and advertised on Facebook and Instagram for my Etsy store. It wasn’t a scam and I sold hand made wreaths. I think if it seems too good to be true, ok, but real businesses advertise on social media.",
            "polarity": 0.25555555555555554,
            "subjectivity": 0.4194444444444445
        },
        {
            "comment_id": "hin3foj",
            "body": "I bought 2 pair of shoes from an Instagram ad and they arrived way too small and were cheap looking. Could not get any info to return them - email did not work, google did not find the company. Luckily used PayPal and was refunded the money through them. Did not have to return the shoes either. I’m going to drop them off at a thrift store. They are such crap that I I would throw them away, but hopefully someone will be able to wear them.\n\nLesson learned.",
            "polarity": 0.030555555555555548,
            "subjectivity": 0.6430555555555556
        },
        {
            "comment_id": "hin2led",
            "body": "Wish is a scam site overall",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin23ks",
            "body": "This is not true at all- I’ve bought plenty of as advertised products via social media ads. Mostly clothing.",
            "polarity": 0.11944444444444445,
            "subjectivity": 0.4055555555555556
        },
        {
            "comment_id": "himz4rd",
            "body": "For bourbon, this is especially true. No, you didnt stumble upon legit 23yr pappy for $150. At best you're getting a pappy bottle that was refilled with trash bourbon",
            "polarity": 0.5499999999999999,
            "subjectivity": 0.46666666666666673
        },
        {
            "comment_id": "himz03d",
            "body": "&gt; search for the item independently\n\nHonestly this goes for \"recommended\" content as well, like YouTube videos and Instagram accounts that you don't follow but that pop up in your feed. *Never* click from the recommendation, they're trying to game your feelings and manipulate you to staying on longer.\n\nIf you see something legitimately interesting, put the keywords in the main search and find it there. You'll see a wider range of content in context as well as other positions/opinions, and you'll tend to avoid echo chamber rabbit holes.",
            "polarity": 0.14833333333333332,
            "subjectivity": 0.5016666666666667
        },
        {
            "comment_id": "himxr30",
            "body": "Don't use vanilla gift cards , company is a  scam",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himvp0v",
            "body": "I'm dealing with this now, got chinese knock off product which I wouldn't care if it at least did what it was supposed to but it's not even close to the same.  It was supposed to be an animated / speaking harry potter sorting hat, what i got is a resin static ornament.  Trying to dispute with paypal first.  Vendor wants me to ship back (to china) prior to refund which would cost more than the initial order.  Said I would be happy to send back if they provide pre-paid shipping.  Hoping paypal resolves, step 2 will be trying with CC.",
            "polarity": 0.1625,
            "subjectivity": 0.2798611111111111
        },
        {
            "comment_id": "himvojs",
            "body": "Why is it legal for facebook to advertise fake and copyrighted products?",
            "polarity": -0.15,
            "subjectivity": 0.6
        },
        {
            "comment_id": "himvlgw",
            "body": "*runs ads for lab grown diamonds* yeah I guess you’re right.",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "comment_id": "himugl1",
            "body": "But I’m seeing several FB ads for companies who have lost their warehouse leases and are selling $1500 Dell laptops for $79 each!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hims3ds",
            "body": "I've learned this the hard way. 😑 Damn you Facebook.",
            "polarity": -0.2916666666666667,
            "subjectivity": 0.5416666666666666
        },
        {
            "comment_id": "hims23n",
            "body": "You are an idiot",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "comment_id": "himr7in",
            "body": "Some of my best purchases have come from my newsfeed.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "himqxfa",
            "body": "I’ve found lots of great products on my social media feeds. A few bad hits though, credit card company takes care of them and I occasionally have to write something off as life tuition.",
            "polarity": -0.013333333333333308,
            "subjectivity": 0.3416666666666667
        },
        {
            "comment_id": "himo99t",
            "body": "Same goes for a majority of YouTuber sponsors.       \nI get that they need a side income as youtube pays most creators not enough but If they ever recommended Raycons they lost all my trust.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.375
        },
        {
            "comment_id": "himo87e",
            "body": "I just bought something from Facebook ads..... \n\n.... ads done by a completely reliable known store I like to buy clothes from because the quality is amazing, it's not overpriced, and so on.\n\nNot every ad is a scam (I wouldn't even say the majority is), but you really do have to be careful with *where you buy from*. Reasearch the store first before you order. BUT this goes for any store, not just Facebook ads.\n\nEdit because of typos.",
            "polarity": 0.21000000000000005,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "himntkk",
            "body": "The best swim trunks I ever bought were a social media ad. Also, I think I first saw the Ooni pizza oven in a social media ad. Do not regret.",
            "polarity": 0.3291666666666667,
            "subjectivity": 0.19166666666666665
        },
        {
            "comment_id": "himmmmf",
            "body": "I don’t agree, the ads i see on social media are curated to my interests. I’ve seen some brands pass by my feed that were legit. And I own some of it now. For context: I only buy sustainable and traceable clothing.",
            "polarity": 0.2111111111111111,
            "subjectivity": 0.6888888888888888
        },
        {
            "comment_id": "himlxjc",
            "body": "The real life pro tip here should be don’t buy things with a debit card. Credit cards are much more secure and it’s significantly easier to get the money back if you’ve been scammed.",
            "polarity": 0.29500000000000004,
            "subjectivity": 0.45499999999999996
        },
        {
            "comment_id": "himlwth",
            "body": "I got duped recently thinking I was buying crocs when it was actually a sneaky ip that looked just like crocs. Chinese bastards sent me a $50 pair of plain white crocs lower quality than Walmart crocs.",
            "polarity": -0.04285714285714286,
            "subjectivity": 0.1414285714285714
        },
        {
            "comment_id": "himlq4v",
            "body": "You shouldn't use your debit card for purchases online. Credit cards have much better fraud protection and are more likely to reimburse you.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "himks55",
            "body": "I look at the comments and if they are positive I order the item directly from Ali Express.",
            "polarity": 0.16363636363636364,
            "subjectivity": 0.4727272727272727
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "himjx2d",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himugl1",
            "body": "But I’m seeing several FB ads for companies who have lost their warehouse leases and are selling $1500 Dell laptops for $79 each!",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himlq4v",
            "body": "You shouldn't use your debit card for purchases online. Credit cards have much better fraud protection and are more likely to reimburse you.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hin3shz",
            "body": "I started a small business pre-pandemic and advertised on Facebook and Instagram for my Etsy store. It wasn’t a scam and I sold hand made wreaths. I think if it seems too good to be true, ok, but real businesses advertise on social media.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.25555555555555554,
            "subjectivity": 0.4194444444444445
        },
        {
            "comment_id": "himo87e",
            "body": "I just bought something from Facebook ads..... \n\n.... ads done by a completely reliable known store I like to buy clothes from because the quality is amazing, it's not overpriced, and so on.\n\nNot every ad is a scam (I wouldn't even say the majority is), but you really do have to be careful with *where you buy from*. Reasearch the store first before you order. BUT this goes for any store, not just Facebook ads.\n\nEdit because of typos.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.21000000000000005,
            "subjectivity": 0.5666666666666667
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "himjx2d",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himugl1",
            "body": "But I’m seeing several FB ads for companies who have lost their warehouse leases and are selling $1500 Dell laptops for $79 each!",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himlq4v",
            "body": "You shouldn't use your debit card for purchases online. Credit cards have much better fraud protection and are more likely to reimburse you.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hin3shz",
            "body": "I started a small business pre-pandemic and advertised on Facebook and Instagram for my Etsy store. It wasn’t a scam and I sold hand made wreaths. I think if it seems too good to be true, ok, but real businesses advertise on social media.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.25555555555555554,
            "subjectivity": 0.4194444444444445
        },
        {
            "comment_id": "hindg3e",
            "body": "Why would you expect the social media site to \"provide resolution\"?  If you used the Classifieds Ads in a newspaper to buy a car, and it turned out to be a lemon, would you expect the newspaper to \"provide resolution\"?",
            "ups": 1,
            "downs": 0,
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "himjx2d",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himugl1",
            "body": "But I’m seeing several FB ads for companies who have lost their warehouse leases and are selling $1500 Dell laptops for $79 each!",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himlq4v",
            "body": "You shouldn't use your debit card for purchases online. Credit cards have much better fraud protection and are more likely to reimburse you.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hin3shz",
            "body": "I started a small business pre-pandemic and advertised on Facebook and Instagram for my Etsy store. It wasn’t a scam and I sold hand made wreaths. I think if it seems too good to be true, ok, but real businesses advertise on social media.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.25555555555555554,
            "subjectivity": 0.4194444444444445
        },
        {
            "comment_id": "hindg3e",
            "body": "Why would you expect the social media site to \"provide resolution\"?  If you used the Classifieds Ads in a newspaper to buy a car, and it turned out to be a lemon, would you expect the newspaper to \"provide resolution\"?",
            "ups": 1,
            "downs": 0,
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        }
    ]
}