{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-03 11:21:04",
    "ups": "16605",
    "downs": "174",
    "views": "365763",
    "top_comments": [
        {
            "comment": "Never get bored watching these vids, the way Jon is able to marry his love of firearms with a genuine liking of video games is so charismatic.  Would be awesome to see a 'reacts to' the DayZ guns albeit there's a lot to get through. Many thanks.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3875,
            "subjectivity": 0.678125
        },
        {
            "comment": "I like how much detail he goes into on this one compared to other games",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.037500000000000006,
            "subjectivity": 0.2875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "A gun you could have a look at is the redeemer from dead by daylight aka the death slingers gun",
            "polarity": -0.2,
            "subjectivity": 0.4
        },
        {
            "body": "\"Perhaps converted to full auto.\" The Tec-9 was more or less designed to be converted at home. The ATF always frowns on open-bolt designs so they made it fire from closed. I don't know the specific process to convert one but I'm sure you'd be banned for discussing it.",
            "polarity": 0.18055555555555558,
            "subjectivity": 0.3717592592592593
        },
        {
            "body": "I see some of these comments mention the hip fire method may bring about the sideways twist, while I don't know the game yet, I think it might have to deal with overall accuracy? Sort of an accuracy check to make sure you know you cannot physically fire these guns for 30-45 minutes straight without damaging your shoulder extremely so the 'actor' or character is repositioning the gun to the hip or other should to spread wear. On average in dead 4 life your firing thousands of rounds for about an hour without any physical support. So maybe they added this as a hidden mechanic to shift unseen damage points to your personal body.",
            "polarity": -0.03888888888888889,
            "subjectivity": 0.3985780423280423
        },
        {
            "body": "GameSpot is about to rename into JonathanSpot. Literally the main reason I'm here",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Never get bored watching these vids, the way Jon is able to marry his love of firearms with a genuine liking of video games is so charismatic.  Would be awesome to see a 'reacts to' the DayZ guns albeit there's a lot to get through. Many thanks.",
            "polarity": 0.3875,
            "subjectivity": 0.678125
        },
        {
            "body": "I would love to see him react to this games inspiration: Left 4 Dead's guns.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "I remember FPSRussia dual wielding the AA-12 and the thing just seems to have no recoil at all",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I like how much detail he goes into on this one compared to other games",
            "polarity": 0.037500000000000006,
            "subjectivity": 0.2875
        },
        {
            "body": "Found this series and been binge watching it, I'm honestly surprised that Johnathan hasn't been exposed to the lunacy of Killing Floor 2 weapons like the DoomStick or Vlad The Impaler or the very real physics of the RPG7 in there",
            "polarity": 0.18,
            "subjectivity": 0.645
        },
        {
            "body": "I had no idea a deagle can sound so weak",
            "polarity": 0.012500000000000011,
            "subjectivity": 0.5125
        },
        {
            "body": "My Ithaca 12ga can slam fire :3",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "receiver 2 \nkilling floor 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That Remington 870 didn't have Magpul furniture on it. It was the Express model which comes with cheaper, plastic furniture.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "S.T.A.L.K.E.R. game series also has SUSAT sights on ar-platforms. It is actually the only sight you can fit in the game.",
            "polarity": -0.08,
            "subjectivity": 0.45999999999999996
        }
    ]
}