{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-10-31 05:04:42",
    "ups": "9241",
    "downs": "88",
    "views": "171740",
    "top_comments": [
        {
            "comment": "i find it amusing how utterly disgusted Jonathan looks when he notices the magical beretta slide lock",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.033333333333333326,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "1:22 what is that 50 cal behind him >. > looks cool",
            "polarity": -0.025000000000000022,
            "subjectivity": 0.675
        },
        {
            "body": "If anyone decides to show Jonathon more of the interesting stuff in Insurgency Sandstorm, show him gameplay from the Zombies co-op :V",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Magic slide pulling back is a quirk of most Fallout 4 mods too, as the reload is designed around a fully empty mag and whatever mechanism holding open.\nYou can make animations for both last round fired AND tacticool reloads (USP mod in particular but it's temperamental) but it requires more work and scripting support...most don't bother or care!",
            "polarity": 0.16916666666666666,
            "subjectivity": 0.42000000000000004
        },
        {
            "body": "for my honeymoon i want to come see you!!\nLove your stuff.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I knew this was coming.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "@gamespot do all weapon from scum plss next time",
            "polarity": -0.15,
            "subjectivity": 0.2
        },
        {
            "body": "it is an m9. you cant just say \"its a baretta\" this why this guy frustrating",
            "polarity": -0.4,
            "subjectivity": 0.9
        },
        {
            "body": "Surprised that he didn't have anything to say about the ranch rifle",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "body": "Killing Floor when?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i find it amusing how utterly disgusted Jonathan looks when he notices the magical beretta slide lock",
            "polarity": 0.033333333333333326,
            "subjectivity": 1.0
        },
        {
            "body": "Another thing about blood on the weapon - it starts off wet and film-y, which is easy to clean off, but with time and/or heat (such as the pressure-baring parts of a weapon under heavy use) - it will sinter and coagulate on the surface very quickly. When also combined with other viscera, you've got a recipe for making your gun only good as a barbecue.",
            "polarity": 0.1675925925925926,
            "subjectivity": 0.6175925925925926
        },
        {
            "body": "i would very much love to see Ghost Recon Wildlands here",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "truth be told the M249 is the best on hordes and the big guys, it just mows them down. But you really want to have a good secondary when running it, the Tec-9 being my favorite for it.",
            "polarity": 0.2777777777777778,
            "subjectivity": 0.3984126984126984
        },
        {
            "body": "\"if you were trying to deliver slugs at 50 metres or more\"\n*BF3 flashbacks of being called a hacker and getting kicked from servers*\nI miss you old friend, those were good times.",
            "polarity": 0.4333333333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "The whole turn the gun to side is odd to me.",
            "polarity": 0.016666666666666677,
            "subjectivity": 0.325
        },
        {
            "body": "The tilt is as you said nothing bar a tacticool choice, Ive seen some guys do it with the IR laser modules attached on the right side of the fire arm to I guess centre it and probably where cod got that from but otherwise its a bit pointless.",
            "polarity": 0.01785714285714285,
            "subjectivity": 0.5178571428571428
        },
        {
            "body": "0:10 Damn did they hire a high school kid to do that animation? That looks awful.",
            "polarity": -0.42,
            "subjectivity": 0.77
        },
        {
            "body": "We really need Jonathan to look at Payday 2 weapon, anyone with me?",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "The beretta in this game makes me so salty. The animations are just so strange! For example, the hammer doesn't move at all!",
            "polarity": -0.2390625,
            "subjectivity": 0.275
        },
        {
            "body": "I think the idea of the tilt is to make it easier to aim without using the sight and instead the character looks down the side of the gun in paintball the way we aim is we  turn the gun and look down the side of the gun and align people with the end of the barrel",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        }
    ]
}