{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-01 01:40:00",
    "ups": "12851",
    "downs": "133",
    "views": "269666",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Akm gamg",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Mad that you didn’t include the god awful ump reload",
            "polarity": -0.8125,
            "subjectivity": 1.0
        },
        {
            "body": "Something he missed was that the AA-12 is an open bolt firearm and utilizes constant recoil which lends itself to being very controllable despite full auto fire. In the game the gun is depicted as a close bolt firearm",
            "polarity": 0.030000000000000006,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "In the us we call the “slam fire” a hammer follow, because the hammer follows the bolt forward",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Do Warframe next? Some of the guns are absolutely ridiculous",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.5
        },
        {
            "body": "Jolly good show but my friend ive a request can you review the weapons of enlisted ?",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Luckily AK platform doesn't care about guts and brains flying around.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "I's like to see him talk about the weapons in the original half-life",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "When Vanguard comes out and he will see Gunsmith in that game. He will probably die because of heart attack",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "Still waiting for the TABG video",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Let Jonathan breakdown Killing Floor 2, Thanks",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "What was the game at 0:28 ?",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "While the tilted over firing doesn't make a lot of sense for real world, I like it in games as it gives you a chance for slightly more accurate aiming at close range without the sights getting in the way of your camera\nOne thing I find amusing about it though is you're ejecting nice hot cartridges straight up in the air and likely having them rain down on top of you and burning your head",
            "polarity": 0.3094444444444445,
            "subjectivity": 0.6472222222222223
        },
        {
            "body": "I personally prefer pull-racking over slam firing. She doesn’t buck as much, there’s less chance of a user generated misfire and it just looks cooler (to me.)",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.19166666666666665
        },
        {
            "body": "The M4 tactical reload is dumb. Its like the Beretta. The bolt for no reason locks to the rear when changing a half empty mag. It's wasted time and animation to hit the bolt release for no reason when not needed.",
            "polarity": -0.21041666666666664,
            "subjectivity": 0.29166666666666663
        },
        {
            "body": "I feel like if I was ever in the position of making a game with guns (real or otherwise) I would just get in contact with Johnathan or someone like him and just ask if he could take a look over the weapons for me. Maybe even ask him if there's any particularly interesting guns that could be used to model off of, I'm sure he'd be able to find some that have never really been in many games before",
            "polarity": 0.24285714285714285,
            "subjectivity": 0.48769841269841274
        },
        {
            "body": "Jonathan sure knows his onions.",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "Do left 4 dead 2",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "This guy thinks hes an expert cuz hes the only british person that can have guns. Every american is an expert if he is.",
            "polarity": 0.0,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "he didnt mention that the AA12 with a drum mag should hold more than 12 rounds. afaik the standard boxmag for the aa12 hold 12 rounds and the drum mag around 30",
            "polarity": 0.25,
            "subjectivity": 0.25
        }
    ]
}