{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-02 02:23:35",
    "ups": "14839",
    "downs": "148",
    "views": "320180",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "the 50 sniper also has rounds in the magazine when you are out of ammo during the reload",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "React to the guns from Blood and Truth and Shooty Fruity",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "22:35 You'd be.. left for dead...",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "One thing that really annoys me is how the M16 is 3 round burst, but holds 20 rounds, meaning you'll always get a final 2 round burst. I was complaining about some of the gun stuff in the game to my girlfriend, and told her \"There are 20 round mags for M16s. But the model has a 30 rounder, and 30 rounds would give you a proper amount of bursts\". I get that its for some balancing reason, but if they insist on not giving the M16 30 rounds, could they maybe at least do 21 for a full set of bursts, and change the mag model?",
            "polarity": -0.08333333333333334,
            "subjectivity": 0.42777777777777776
        },
        {
            "body": "Please review Dayz",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Oh, huh, turning the gun when you're crouched is a clever bit of UI design. I hate in games where I can't tell if I'm crouching or not until I hit the crouch button and see if I go up or down.",
            "polarity": -0.262962962962963,
            "subjectivity": 0.674074074074074
        },
        {
            "body": "\"[Incorrect reload animations] would distract nerds of a certain ilk\"\n\nUnfortunately the problem is universal and the action is manipulated on every weapon after a reload which has kept me away from the game primarily.",
            "polarity": -0.030952380952380953,
            "subjectivity": 0.4285714285714286
        },
        {
            "body": "I'm honestly shocked he didn't talk about the closed-bolt on the AA-12.",
            "polarity": -0.7,
            "subjectivity": 0.8
        },
        {
            "body": "Hey, idk if the captured gameplay doesn't match up to your description of the rem 870 since I haven't played the game yet but that stock and forend isn't Magpul. It's just the bone stock of the express tactical line. Always look forward to your vids.",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "My theory for the cantered aiming when crouched is because there are a few card effects in the game that give benefits for being crouched, and it's a very simple visual indicator to let you know that you are crouching. Not that you really NEED one but still.",
            "polarity": -0.08000000000000002,
            "subjectivity": 0.23285714285714287
        },
        {
            "body": "Review the guns from Deadside please! Deadside has some solid gunplay and I  would think it would make for some interesting stuff.",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "note not all the guns were covered",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "At this point this is Jonathan’s channel now",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "do cruelty squad! so many cool gun prototypes from history its fasicinating!",
            "polarity": 0.46875,
            "subjectivity": 0.575
        },
        {
            "body": "I wish more games pay more attention to realistic reloads.\nNot just having 1 animation to represent the perfect \"wick flick\" either, but ones where the user makes tiny mistakes, and several different animations so there's a bit of variation. Plus slower and even less slick ones for when the player is supposed to be fatigued or highly stressed where a real person is likely to fumble reloads.",
            "polarity": 0.17583333333333337,
            "subjectivity": 0.47625
        },
        {
            "body": "One of the dumbest things the game has done was giving certain guns with standard 30 rounds only 20, completely idiotic \nAlso the sawed off should be shot one at a time",
            "polarity": -0.17047619047619048,
            "subjectivity": 0.560952380952381
        },
        {
            "body": "i loved the tilt of the guns in titanfall2 while crouching and i love it here tbh\nalso, the beretta being 3 round burst and not glorious modeled after the 93r was a missed opportunity",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6
        },
        {
            "body": "The M1A is not a box Magazine M1 Garand. A M1 Garand shoot 30-06/7.62x63 and an M1A shoots 7.62 NATO/308/6.5creedmoor.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "13:19 every gun in the game acts as if it’s empty when you reload, regardless of how much ammo is left in the mag. Drives me nuts",
            "polarity": -0.075,
            "subjectivity": 0.275
        },
        {
            "body": "Please do l4d2",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}