{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-03 19:36:01",
    "ups": "16986",
    "downs": "177",
    "views": "374376",
    "top_comments": [
        {
            "comment": "You should make him review weapons from payday 2",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "id love to see you talk about dayZ",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "can you do half life 2 and maybe even 1 aswell?",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "Damn, Jonathan's back must be pretty sore from carrying the GameSpot channel for so long",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "Ah the m14 the evolution of the m1 grand",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "You should make him review weapons from payday 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I can't help but feel that we willfully ignored discussing that there are NO SEPARATE RELOAD ANIMATIONS for weapons that still have a round in the chamber. Speaking from the perspective of a first person animator/nerd/someone who thoroughly enjoys immersion, I can't help but think that this held the game back in a real way. I even messaged Turtle Rock and WB at various points throughout development to at least consider adding separate reloads for some of the more iconic weapons but...no answer whatsoever. Still hoping this will be delivered in the form of DLC at some point.",
            "polarity": 0.061111111111111116,
            "subjectivity": 0.3703703703703704
        },
        {
            "body": "I know it’s not first person, but I’d love to see him review Synthetik",
            "polarity": 0.1875,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "Would love to See Jon Look over some of the Weapons within Destiny (yes some of the weapons can be Sci FI Some using Liquid, battery as ammo)",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I've gotten way more enjoyment out of this series than I expected to... excellent work!",
            "polarity": 0.4666666666666666,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "That is definitely not magpul furniture on that 870",
            "polarity": 0.0,
            "subjectivity": 0.5
        }
    ]
}