{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-10-31 00:57:50",
    "ups": "8242",
    "downs": "83",
    "views": "145719",
    "top_comments": [
        {
            "comment": "The thing about the AA-12 is that it has a recoil damping mechanism. Makes the thing quite heavy, but it's astonishingly effective. \n\nI've seen a video of a guy firing one one handed, and it barely moved.\n\nSo when I saw it here, my immediate reaction was \"that's way too much recoil\". Which must seem so weird to those of you unfamiliar with the thing.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.02999999999999998,
            "subjectivity": 0.52
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "*looks over at my M1A* idk man, i really like my scout scope on that forward rail",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "The thing about the AA-12 is that it has a recoil damping mechanism. Makes the thing quite heavy, but it's astonishingly effective. \n\nI've seen a video of a guy firing one one handed, and it barely moved.\n\nSo when I saw it here, my immediate reaction was \"that's way too much recoil\". Which must seem so weird to those of you unfamiliar with the thing.",
            "polarity": 0.02999999999999998,
            "subjectivity": 0.52
        },
        {
            "body": "Great as always... Please do PUBG!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "Review guns from mw2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "DO ZERO HOUR",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "22:06\nThat's a programming / animation thing. They tied the case eject animation to the ''fire'' input without having the animation play after release.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This might have already occurred, but can we get a Jonathan discussion of his favorite video game guns ever?",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.7
        },
        {
            "body": "If anyone knows about it. Would love for him to check out the guns in scum there super detailed.",
            "polarity": 0.23333333333333334,
            "subjectivity": 0.6041666666666666
        },
        {
            "body": "make part 3 video for team fortress 2 guns",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I have pointed out the reloads being messed up since the closed alpha and they simply dont care. The reloads being that way is entirely intentional. I dont know why but makes little sense to me. I seriously hope they decide to change that because even if you know nothing about guns or own them or have fired them you know that the reloads are blatantly just wrong it doesn't take a genius to see that. But yeah they've been made aware of it since closed alpha and it seems they don't care.",
            "polarity": -0.08708333333333335,
            "subjectivity": 0.4998809523809523
        },
        {
            "body": "Man I can't wait for Jonathan to see Call of Duty: Vanguard's abominations",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey Jonathan, where is your YouTube play button? Your input in these videos are deserving",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "Please let Johnathan react to the large amount of firearms in Payday 2",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.42857142857142855
        },
        {
            "body": "I'm fairly surprised, he said nothing about the rounds staying in the empty magazine in the Barrett M95, 10:45",
            "polarity": 0.0,
            "subjectivity": 0.7
        },
        {
            "body": "Have him do cod vangaurd",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The C8-IUR is my service rifle (AR-15 variant) and in my experience it's much faster to hit the bolt release with your thumb, instead of smacking it with your entire hand. The thumb is faster and you also don't destabilize yourself briefly by slapping the gun out of your own hand almost. \nHowever, in certain stressful situations I have for some reason resorted to the Val Kilmer approach, but usually I have instantly regretted it.",
            "polarity": 0.10918367346938775,
            "subjectivity": 0.5209183673469387
        },
        {
            "body": "That diagonal aiming looks stupid when there is no 45 degree iron sights. Next we'll probably see this game doing it with an RPG or a minigun. 🤨",
            "polarity": -0.39999999999999997,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "All I can say for the gun tilt being used, is that canting the gun like that is usually far more comfortable to shoot with due to how arms like to move and such...And the fact that it's only used when you're crouching in the game, I figure it's probably for clearance from the body, so your elbows aren't hitting your own body.",
            "polarity": 0.15357142857142855,
            "subjectivity": 0.725
        },
        {
            "body": "I'd like to see Jonathan tackle things like Command and Conquer Renegade's guns, maybe even Goldeneye's guns, and if he feels adventurous, maybe some of the weapons from one of the Star Trek Elite Force games.",
            "polarity": 0.5,
            "subjectivity": 0.9
        },
        {
            "body": "at 15:00 my chimp brain went \"haha but what if...\" now I'm sitting here with my Benelli M4 with a vortex LPVO 1-4x on it.",
            "polarity": 0.2,
            "subjectivity": 0.3
        }
    ]
}