{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-02 10:37:42",
    "ups": "15274",
    "downs": "156",
    "views": "332461",
    "top_comments": [
        {
            "comment": "I'm surprised that he only noticed the slide magically locking back on the Beretta. One of my biggest gripes with B4B is that all of the weapons have only one reload animation, regardless of whether or not they are empty.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.08333333333333333,
            "subjectivity": 0.7333333333333334
        },
        {
            "comment": "I wish I see him react to MGS series weapons. It has great selections of unique weapons",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5875,
            "subjectivity": 0.875
        },
        {
            "comment": "I am once again asking to see Jonathan react to some guns from Killing Floor 2.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Th sideways leaning for hip fire is purely gameplay focused. Your weapon model takes up less middle area of your screen, which helps when you're not scoping. I love that it also is borne from something from reality.",
            "polarity": 0.13690476190476192,
            "subjectivity": 0.29166666666666663
        },
        {
            "body": "Mgs and apex legends franchises",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If you have it paused at 20:10 you can spot that the holes are very much there. So not sure what that is about.",
            "polarity": 0.0050000000000000044,
            "subjectivity": 0.5744444444444444
        },
        {
            "body": "Please do killing floor 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This game does the same thing L4D does.. dude cycles the bolt even on partially empty mag changes",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.3416666666666666
        },
        {
            "body": "Johnathan,isn't it better to say \"I don't know!\" than comment on something you don't understand or ever came acrtoss! I am talking about AA12!\nThe gun is absolutely phenomenal! It looks like a prototype but it can fire anything from the lightest load birdshot to the buchsot and special amo like fin opening Shape Charge mini grenades with EASE and recoil on all of those is barely noticable! IDK why or how,but we were not allowed to field strip it,which was kinda weird since gun is \"self cleaning\" (bullshit explaination from superriors) but that thing MUST HAVE some kind of BARS system like AEK-971 since recoil is allmost non existent for the shotgun!",
            "polarity": 0.3785342261904762,
            "subjectivity": 0.5952380952380952
        },
        {
            "body": "Something they messed up that wasn't shown is when you finish a magazine on the Barrett and reload, you pull the bolt back and can see there are still rounds in the mag, so they didn't model/animate an empty mag reload any differently from a partially used mag reload",
            "polarity": -0.05,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Still desperately want to see Johnathan react to the weaponry from the Killzone games!",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "body": "I'm surprised that he only noticed the slide magically locking back on the Beretta. One of my biggest gripes with B4B is that all of the weapons have only one reload animation, regardless of whether or not they are empty.",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "Would really like to see him react to the exotic weapons from the division 2.",
            "polarity": 0.35,
            "subjectivity": 0.6
        },
        {
            "body": "I am once again asking to see Jonathan react to some guns from Killing Floor 2.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}