{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-05 00:26:07",
    "ups": "17857",
    "downs": "183",
    "views": "398774",
    "top_comments": [
        {
            "comment": "he should try look at guns from Enlisted i think that would be fun",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.2
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Actually the AA-12 tames and handles recoil extremely well (watch the old episodes of FPS Russia for an example), thanks to it's internal recoil system it can go full auto using slugs with little to no recoil.",
            "polarity": 0.048214285714285716,
            "subjectivity": 0.36428571428571427
        },
        {
            "body": "Killing floor 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I knew someone with an M14 with 3 rd burst and full auto. Very fun to shoot, not very controllable. It was a transferable machinegun btw.",
            "polarity": 0.21333333333333335,
            "subjectivity": 0.37000000000000005
        },
        {
            "body": "Paladins next please",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "the M1A is using a 'scout scope rail'. it clamps around the barrel so it is solid and has a special upper handguard with a cutout for it. while you can put the mount on pretty much any M1A with the appropriate handguard, they were usually found on shorter barreled rifles like the SOCOM and Scout models, not usually found on full sized rifles. also it being mounted forward makes the eye relief too far for most optics. but it does allow the use of stripper clips to be used unlike other optics mounting options.",
            "polarity": 0.16726190476190475,
            "subjectivity": 0.44136904761904755
        },
        {
            "body": "On the M1A’s Rail system, that’s the standard setup. The hand guard has been trimmed away to allow the rail to be welded to the barrel or sometimes you’ll find they’ve got a Clamp Mount that wraps the barrel.  although the one in B4B appears to be welded. My M1A had this type of rail when I bought it. You can buy  them now from Springfield  with the rail screwed to the barrel via hex screws",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "he should try look at guns from Enlisted i think that would be fun",
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "body": "Is it me, or at 19:20 someone was getting scolded in the background? Maybe too much milk in their tea and not enough scones?",
            "polarity": 0.1,
            "subjectivity": 0.35
        },
        {
            "body": "Did not expect to be taught a lesson about what zombie brains do to feeding mechanisms. Obligatory \"10 out of 10 would learn again\" comment here.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The M16 & Scar are fantastic in the game. Especially with the added sights and mods. Also the M1A can also be quite powerful as well but it takes a bit longer to get that ready for battle.",
            "polarity": 0.1,
            "subjectivity": 0.76
        },
        {
            "body": "I pay internet bills for that kind of content! 😂👍",
            "polarity": 0.75,
            "subjectivity": 0.9
        }
    ]
}