{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-10-31 21:32:32",
    "ups": "12278",
    "downs": "127",
    "views": "254540",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Game recomendation for gun coverage the original Soldier of Fortune",
            "polarity": -0.012500000000000011,
            "subjectivity": 0.575
        },
        {
            "body": "Ok, so please don't crucify me, commenters, but this is actually the first time i have to disagree with Jonathan on one small thing. The AA-12 was specifically engineered as an automatic combat shotgun to the point where it almost completely nullifies the recoil of even the heaviest shotgun rounds (which was demonstrated by, among others, FPSRussia, don't know if that video can still be found), so if there is any automatic shotgun that would actually be useful in a situation like this, it would be that thing.",
            "polarity": 0.15,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "the fact you have to cycle the gun again after reloading a non empty mag is aggravating",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "body": "So glad that John noticed how pistols are reloaded in the game, believe me John you're not the only one that noticed and every single pistol does that animation.\nEdit: Just as a comment on the reload animation for the \"M4\" one of the Cleaners (yes that's what their called John) was a soldier so he likely had enough training to be able to perform that kind of reload fluently and likely passed this training down to the other Cleaners.",
            "polarity": 0.07709235209235209,
            "subjectivity": 0.6639249639249639
        },
        {
            "body": "the AK-47 in this game looks like it has Plum furniture but with weird rails in the bottom hand guard",
            "polarity": -0.45,
            "subjectivity": 0.7
        },
        {
            "body": "The HK UMP in the game doesn't lock open when empty and even worse on reload the changing handle magically flies backwards for the reload animation.",
            "polarity": -0.08,
            "subjectivity": 0.6
        },
        {
            "body": "Not gonna lie....I really dont like the weapon handeling/reloads animations in this game.... They are not even satisfying, more then anything they are unsatisfying for me.",
            "polarity": 0.2,
            "subjectivity": 0.525
        },
        {
            "body": "That mount  is the one originally used in the socom 16, it's more of a \"scout mount\" designed for no magnification or long eye relief optics.",
            "polarity": 0.27499999999999997,
            "subjectivity": 0.5499999999999999
        },
        {
            "body": "Next game should definitely be Killing Floor 2. The attention to detail is as underated as the game itself.",
            "polarity": -0.2,
            "subjectivity": 0.325
        },
        {
            "body": "Have Jonathan review the guns from the resistance fall of man series",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "had the pleasure of firing the M1A in Guam a few years ago. What a kick. \n\nAlso fired the Thompson....that was also firing full auto (or slam firing) when it should have only been single only!",
            "polarity": 0.01571428571428571,
            "subjectivity": 0.5728571428571427
        },
        {
            "body": "Where can I find more photos of SUSAT m16?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Still waiting for Jonathan to get a look at Killing Floor 2 weapons. Great mix of Real Life and Wacky Post- Apocalypse. It would probably be a 2 part video given all the weapons the game has. Also, each weapon has reloads for when being empty, with bullets still inside and a tactical reload aka \"Sleight of hand\". Here's hoping...",
            "polarity": 0.2,
            "subjectivity": 0.59
        },
        {
            "body": "Day 1 of asking for either Enter the Gungeon or Doom Eternal",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I mean it’s a pretty diverse arsenal for an small middle America town \n\nAs they say for every blade of grass is an American with a 🔥arm",
            "polarity": -0.0625,
            "subjectivity": 0.4175
        },
        {
            "body": "RIP, no comment on the magical UMP45 bolt handle.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Am I the only one that actually really enjoys the angled firing while crouched? I  know it's not realistic but it's quite cool.",
            "polarity": 0.11666666666666667,
            "subjectivity": 0.5458333333333333
        },
        {
            "body": "I am once again asking for a Borderlands 3 episode",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "War of Rights video",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I want that Jonathan see's the cursed Guns of vanguard",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}