{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-02 18:52:10",
    "ups": "15779",
    "downs": "160",
    "views": "343487",
    "top_comments": [
        {
            "comment": "Fine amped up weapons",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4166666666666667,
            "subjectivity": 0.5
        },
        {
            "comment": "Well maintained too",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "this man is the reason why i donated 20 bucks to the royal amories jonathan keep it goiong man hope ill visit that museum once in my life",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "could you make Jonathan react to the guns in DayZ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Do the Borderlands series",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As an American, I find it extremely offensive that he referred to us as \"AR-15 enthusiasts...\"\n\n\nEveryone knows we only have sex with remington 870's, smh, get your facts straight.",
            "polarity": 0.018750000000000003,
            "subjectivity": 0.6
        },
        {
            "body": "23:34 The original Super Shotgun did have a buttstock. It was based off of the shotgun from Evil Dead 2.",
            "polarity": -0.12291666666666669,
            "subjectivity": 0.7041666666666666
        },
        {
            "body": "9:39 \"For those of you wishing to enter the zombie apocalypse for real... don't do that.\"\n\nI like the implication here that anyone can just sign up to participate in the zombie apocalypse.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "On the M1A Scout, which is the version used in the game, the rail is bolted to the barrel and sticks through a cut-out in the handguard. Not as good as dovetailing it directly into the receiver and bolting it in to the tapped hole for the M15 Grenade Sight or mounting it on the chassis, but better than just slapping rail onto the detachable handguard.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.475
        },
        {
            "body": "I’d like to know John’s top 5 choice for a zombie apocalypse",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "What about payday 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "he should take a look at payday 2 next. there's a snub-nosed 50 caliber.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jonathan needs to do Homefront's guns, if only to prepare him for Vanguard",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "20:13 There was a cool scene in the Hurt Locker that showed what Jonathan is talking about there, where a Barrett .50 failed to fire because there was blood in the magazine which jammed the feed.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "That is true Lad, constant blood brains and skull pieces,that just puts a damper on the whole thing all together,when you look at the realistic side to a Zombie horde,I guess one can start seeing how so many people actually died in zombie movies,apart from the plot sorta calliing for it.",
            "polarity": 0.2027777777777778,
            "subjectivity": 0.3861111111111111
        },
        {
            "body": "can you do dying lights guns and melees?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "@15:30 = you would see the wisp of smoke and likely the wad.\n\nEDIT: I was a skeet shooter, and regularly saw the wads from my birdshot (i know this is likely buckshot - but regardless, the wad is quite noticeable)",
            "polarity": 0.0,
            "subjectivity": 0.6923076923076922
        }
    ]
}