{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-02 14:44:47",
    "ups": "15513",
    "downs": "157",
    "views": "336676",
    "top_comments": [
        {
            "comment": "Well maintained too",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Fine amped up weapons",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4166666666666667,
            "subjectivity": 0.5
        },
        {
            "comment": "Back 4 unrealistic weapons.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Have him do enlisted!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well maintained too",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fine amped up weapons",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.5
        },
        {
            "body": "The \"tild you are talking about only happens when you are crouching ingame",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Something I haven't seen mentioned before but what if instead of a game itself, you guys could collate the animation work of a lot of people and make Jonathan react to those. Animators like Hyper, Sully,  Ha-ru, etc. Use especially the wacky ones!",
            "polarity": 0.075,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "Thanks finally someone besides me who recognizes (AK 47:s) as AKM:s",
            "polarity": 0.1,
            "subjectivity": 0.6
        },
        {
            "body": "I personally own an M1a, I love it and I love that this game has it.",
            "polarity": 0.30000000000000004,
            "subjectivity": 0.65
        },
        {
            "body": "Back 4 unrealistic weapons.",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "He doesn't know about 3gun competition. Usually with an AR platform rifle turning the rifle off vertical allows you to use a different set of sights for switching between long and close ranges. Never seen it done with a kalashnikov though.",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "Anybody notice if you reload when you still have a round in the chamber you loose the round and recock the gun...that annoys me so much.. So much time wasted",
            "polarity": -0.09538461538461539,
            "subjectivity": 0.2538461538461539
        },
        {
            "body": "6:45\n\nFPS russia: holds AA12 perfectly still with one hand while firing",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "The m1A is available with a mount in that position that mounts to the barrel",
            "polarity": 0.4,
            "subjectivity": 0.4
        },
        {
            "body": "Oh boy. Considering how the Vector doesn't have 25 rounds and can't have 25 rounds… this is gonna be a treat.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"Brains are not a test medium for military rifles\" \n\nWell, add another point to the list of \"sentences I didn't expect to hear today....\"",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "I vote Killing Floor 2\nThe sawn off shotgun he has was seized in a \"criminal\" context. In the UK that could just be simple ownership of this antique by an old old man. While he's technically correct - or maybe completely, as he could know the full context - it's sad how many essentially deactivated weapons (too old to fire) are taken from citizens.",
            "polarity": 0.031818181818181815,
            "subjectivity": 0.3961038961038961
        },
        {
            "body": "jeez, the animations are so rigid and wobbly",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "An interesting tidbit that wasn't mentioned during the bit on blood and gore getting into the action, is that an AR-15 or M-16 rifle would probably be the most likely weapon to continue to operate if you got gunk in the ejection port.\n\nSee, the semi-DI operating system on the AR dumps gas out ports in the bolt and through that ejection port, quite literally blowing any dirt, mud, sand, or even brains that may have gotten in the way well clear of the action just before it opens.\n\nThis is why piston uppers like the HK 416 are a tradeoff rather than a straight upgrade. The piston uppers don't get as much powder fouling inside the action, but they are more likely to die of mud ingestion than a traditional DI upper.",
            "polarity": 0.17692307692307693,
            "subjectivity": 0.4256410256410256
        },
        {
            "body": "When he says that's a Model 01 lower, it's actually an XM16E1 partial fence lower. Still makes me want to cry 😭",
            "polarity": -0.05,
            "subjectivity": 0.2
        }
    ]
}