{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-01 05:47:03",
    "ups": "13243",
    "downs": "139",
    "views": "281294",
    "top_comments": [
        {
            "comment": "Would love to see Jonathan take a look at the detailed pistols of Receiver 2.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.45,
            "subjectivity": 0.675
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "It would be better if he was shown the default guns without attachments",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "10:00 the reason he's holding the AK in a \"gangster\" style is just to show the player at he is crouching, has nothing to do with practicality etc its just a visual que to the player that he isnt standing up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "5:12 lmao!",
            "polarity": 0.75,
            "subjectivity": 1.0
        },
        {
            "body": "What's that little subgun hanging out with the Barrett?",
            "polarity": -0.1875,
            "subjectivity": 0.5
        },
        {
            "body": "Please! Make a Halo gun reaction! Halo was one of the pioneers of FPS games! Please make a video making a reaction to the guns of the Halo universe especially now with the soon release of the new Halo game. I am honestly surprised not to have found videos like this made by you guys yet. :( even if it just is the UNSC weapons. Any halo video would be great.",
            "polarity": -0.01893939393939394,
            "subjectivity": 0.7507575757575756
        },
        {
            "body": "Please do Killing Floor 2",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "3:13 me when I home alone and wanna do that yoinky sploinky",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "yt thinks this is cod mw lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Hmm.... You are a smug little fellow aren't you?",
            "polarity": -0.1875,
            "subjectivity": 0.5
        },
        {
            "body": "Would love to see Jonathan take a look at the detailed pistols of Receiver 2.",
            "polarity": 0.45,
            "subjectivity": 0.675
        },
        {
            "body": "9:49 The firing tilt when crouched would probably be to get a better, more stable rest on one's knee/thigh, hence the slight tilt where the elbow goes for the knee/thigh. And I'd like to point out when it tilts, it's in the Hip-fire mode, so they're more trying to fight the kick of the 5.45x39mm Cartridge than use the sights.",
            "polarity": 0.33333333333333337,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "This is a bit of a stretch but could you show Jonathan the weapons of Deep Rock Galactic? There are 4 new ones coming out soon so I hope it's possible!",
            "polarity": 0.04545454545454545,
            "subjectivity": 0.6181818181818182
        },
        {
            "body": "The sexual innuendo in this video is off the charts",
            "polarity": 0.5,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "The forward picatinny rail on the M1A scout and Socom models is mounted as a clamp to the barrel and protrudes through a cut-away in the heat shield. It's sturdy, but could cook your optics if you're maintaining sustained fire for long enough",
            "polarity": -0.025,
            "subjectivity": 0.45
        },
        {
            "body": "Love the videos, maybe a metal gear solid guns clip.",
            "polarity": 0.25,
            "subjectivity": 0.35
        },
        {
            "body": "I don't even own the game but every one of these videos makes me want to look into them. For the M1A Jonathan is absolutely right, mounting pic rail to the tp cover would be a bad idea. Some searching shows me that the model shown in the game has a \"scout\" style top cover with a cutout for mounts that attach directly to the barrel.",
            "polarity": -0.002040816326530601,
            "subjectivity": 0.5574829931972788
        },
        {
            "body": "The idea behind the gangster hold in unconventional situations I feel is the blind spot of the optics when aiming in first person. If you hip fire, the gun’s optics, if any cover a section of your right side, holding the gun tilt for this purpose is to switch the blind spot, but now, your aiming down the sights functionally, with the scope now resting on the left. Depending on the situation, you may favor doing so in right hand corridors or approaching enemies. Practically, holding the gun at a tilt alters the direction of recoil force, tilting the gun also sprays your ejected cartridges so you gotta be careful not to waterfall hot brass casings onto yourself. Doing this creates a horizontal sweep the urges your recoil bounce horizontally instead of vertically. Although not commonly used for normal combat situations due to there not usually being groupings of indiscriminate, undead targets. In standard combat scenarios you’re taught to keep your grouping tight and on single targets, mag dump isn’t standard op, whereas zombie training probly requires you to shoot a line of zombies with great speed. Multiple headshots for similarly tall targets, potentially.",
            "polarity": 0.011559696342305036,
            "subjectivity": 0.43486887508626637
        },
        {
            "body": "As an aside, I own an original Intratec Tec-9.  It's equally accurate at 100 yards as my model 92.  Stupid iron sights, horrible magazine, yet it's accurate.  A 10 inch paper target, from a prone position.  Both get hits, and the Beretta is far better, the stupid Tec-9 still makes most of the same shots even with it's awful sights.",
            "polarity": -0.060416666666666646,
            "subjectivity": 0.7618055555555555
        },
        {
            "body": "Payday 2 guns",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "God, those weapon animations are terrible. Are they being played at double speed for some reason?",
            "polarity": -0.5,
            "subjectivity": 0.5
        }
    ]
}