{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-01 09:53:56",
    "ups": "13518",
    "downs": "141",
    "views": "290188",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Due process would be cool",
            "polarity": 0.11249999999999999,
            "subjectivity": 0.5125
        },
        {
            "body": "Please do insurgency sandstorm!!! I beg",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Considering how few weapons exist in civilian life here in the UK, it seems so strange hearing one of us discuss ranged weaponry at such length.  I don't think I heard this level of detail back in the army :/",
            "polarity": -0.1,
            "subjectivity": 0.35
        },
        {
            "body": "Anothet game that utilizes the tilting is Insurgency Sandstorm when you're using night vision with IR Laser attachments using NVG point firing.",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "lol why b4blood? I am waiting on bf 2042",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "It could be insanity, but I swear weapons perform so much better with semi-auto in S.T.A.L.K.E.R Shadow of Chernobyl",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "the ar-reload in regards to the thumb position and the bolt release is not just doable, its best-practice. Its easier to do consistently than to slap the bolt-release. Usually hold a bit higher on the mag, so you dont even have to move the hand further up, it just goes in and the thumb is already there.",
            "polarity": 0.0625,
            "subjectivity": 0.375
        },
        {
            "body": "Nothing about the Vector?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He should look at chernobylite",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "IGI 2...when?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No me interesa lo que opine un experto en armas, solo quiero saber si el juego es divertido, tenga una buena jugabilidad, con una buena ambientación y nivel de dificultad del platino",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wish he had covered the ranch rifle, it's my favorite weapon to use.  I also hate that there is no select fire in game.  If I could rock and roll with the SCAR I'd be golden.",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.7
        },
        {
            "body": "Now hold on, he talks about how the Tec-9 is technically accurate for being closed-bolt, but no mention of Back 4 Blood's AA-12 and possibly M249 appearing to be closed-bolt when they should be open-bolt?",
            "polarity": 0.13333333333333336,
            "subjectivity": 0.5444444444444444
        },
        {
            "body": "respect on serving in the british army, jonathan",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Doesn’t mean he’s a expert",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "body": "The hold of the weapons is for the game to keep the screen clear I think",
            "polarity": -0.15,
            "subjectivity": 0.39166666666666666
        },
        {
            "body": "can you do a video about Metal gear solid weapons? because there are few nice and uniqe ones , like moded 1911 or the patriot (mgs3) famas G1( mgs1 , really rare and hard to get), mgs4 has lots of guns also.",
            "polarity": 0.08166666666666665,
            "subjectivity": 0.5283333333333333
        },
        {
            "body": "11:08 - he needs to see the 50 cal in Killing Floor 2. They give the appropriate weight to the bolt.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "I won't stop asking: have Johnathan react to Destiny exotic weapons",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I love how comfy he is getting on camera.",
            "polarity": 0.5,
            "subjectivity": 0.6
        }
    ]
}