{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-01 18:08:42",
    "ups": "14142",
    "downs": "141",
    "views": "303797",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Anyone else hoping he did the submachine guns",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Anyone else notice almost all the weapons reload incorrectly except the revolver?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"Brains are not a test medium for military rifles\" is now my favourite Jonathan quote.",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "dont do cod vanguard , john wil have a stroke",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "5:08 I love how Jonathan is just describing How the gun works but then you see the gameplay and see a chick just slide. Not walk just slide in",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "The thing he noticed about pistols magically locking their slide open when reloading... bad reloads are in the entire game. You reload a partially spent shotgun, your character always pumps it afterwards. You reload a partially spent automatic weapon, your character always cycles the bolt. There aren't distinct animations between partially and fully spent weapons. All reloads are handled as if the chamber was empty before reloading (except shotguns. The character never directly loads one into the chamber in that case).",
            "polarity": -0.07083333333333332,
            "subjectivity": 0.4159722222222222
        },
        {
            "body": "Check out Enlisted's weapons please!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I bet the tilting of the gun is a stylistic choice because they want to show off the animations of the gun more. You normally don't see too much of the right side of the gun while it's in use so you wouldn't have to focus too much of the animation there, but these devs obviously wanted to do that. And to be able to show it to us, all guns are therefore fired \"gangsta style\" while crouching.",
            "polarity": 0.26224489795918365,
            "subjectivity": 0.4586734693877551
        },
        {
            "body": "2 minutes in and he already messed up. Every gun in the game is automatic except a shotgun. The M14 is semi automatic 1 trigger pull = 1 shot. He meant to say fully automatic. Then he calls slam fire a malfunction when most fully automatic guns made pre 1970 including the british sten were slam fire by design.",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.3
        },
        {
            "body": "Can't believe he didn't talk about the 9mm Sig55x hanging out in the background :(",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "body": "Ooooooooo do the division series I’ve been playing that a lot lately",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "body": "Dude should look at killing floor 2 guns  or some of the guns from payday 2 since some of the old guns in payday 2 are actually pretty good in terms of reloads and killing floor has one of my favorite snipers which is the last one with it being a one shot on almost everything",
            "polarity": 0.30999999999999994,
            "subjectivity": 0.5733333333333334
        },
        {
            "body": "@7:46 It's mentioned that this gun is better on semi-automatic, and that games have a hard time achieving that. In Killing Floor 2, the AA-12 is wayyyy better in semi-auto mode.",
            "polarity": 0.23611111111111108,
            "subjectivity": 0.5138888888888888
        },
        {
            "body": "God, I love this man.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I think the side tilt is just to free up space in the middle of the screen.",
            "polarity": 0.2,
            "subjectivity": 0.4
        },
        {
            "body": "The reason they had the scope on the Super 90 I believe is because the scopes give weak spot damage bonus and you don't aim down sight with shotgun anyway so you might as well get the bonus. I know this because I only use the shotguns in B4B and that's what I do. I actually use a perk that doesn't allow me to aim down sight at all. lol",
            "polarity": 0.06388888888888888,
            "subjectivity": 0.5242063492063492
        },
        {
            "body": "It would be awsome to have Jonathan reviewing the guns on Squad",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please react to freefire guns as well",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Little upset he missed the opportunity to say \"nerds of a certain caliber\" on his Beretta breakdown",
            "polarity": 0.013392857142857137,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "I know a guy who edc'd a Deagle. He was also 6'8 and 480lbs. So it just looked like he was carrying a Glock 17.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}