{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-10-30 20:51:29",
    "ups": "6551",
    "downs": "59",
    "views": "102348",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Holding a gun \"on the wonk\" is really good and I'm gonna start using it.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Could you do Max Payne 3?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "1:42 What's the point of holding it cockeyed if it's not set up with combination sights? Let me guess. Combination sights exist in-game, but instead of reserving the cocked stance specifically for use with offset backup sights, they made you able to turn all two-handed guns cockeyed even though it's pointless. Is that about the size of it?\n2:20 Why doesn't your right-handed character just use their left hand for both reloading and operating the charging handle? It's not hard, yet very few games depict the proper \"underhand\" technique. Can we please have some left-handed or ambidextrous characters already?! Sure, there's John McClane in Die Hard: Nakatomi Plaza, but we need more, and in modern games.\n4:35 How does it hold 12 rounds?! Doesn't everyone know by now how mag tubes work?! Sheesh! This far into the 21st century and they're still getting that wrong! And no chamber-load animation even though Killing Floor 2 has exactly that and came out some years ago.\n5:05 Is that cockeyed thing something they added to all weapons for no reason? Combination sights are only useful on rifles, not shotguns. One magnified optic on top, one backup sight for close-quarters (reflex, dot, or offset irons). The backup sight would be offset to the right for a right-hander. Contrariwise, Ir0n sights are all you need on a shotgun. Ghost ring or rifle sights, ideally. Plain ol' beads are obsolete but better than nothing. Reflex or dot sight? Sure, but you'd do better to save those for something else like a rifle or SMG. Unless you're the type who feels the need to put reflex or dot on absolutely everything because you're spoiled by modernity to use perfectly serviceable Ir0n sights.\n5:10 Why doesn't your character chamber-load?! We're too far into the 21st century to not depict chamber-loading!\n6:01 Notice how you pump at the end of the reload animation no matter how many rounds you've loaded, even if there's already a round chambered. We're too far into the 21st century for that to still be a thing. That goes all the way back to the '90s. It's time to move forward and start doing things right. They've had literally decades to this right and they're still getting it wrong. It's disgraceful and insulting!\n6:15 And cockeyed with an AA-12. Guess I called it on the sighting incompetence.\n6:25 We've only recently been seeing it in action movies. Guess that means the tired, old, clunky, bulky, unreliable, obsolete SPAS-12 can finally retire.\n6:26 Imagine it with an underslung grenade launcher! *}:-D*\n7:46 It has no selector switch. It's full-auto-only. You control your fire entirely with your trigger discipline. Also, it fires from the open bolt.\n8:02 If we're talking traditional Romero/Fulci-style zombies, then full-auto is entirely pointless. All you need is a .22 (preferably something durable and reliable with high capacity) and you can annihilate entire hordes and still have plenty of ammo left over that won't weigh you down. But we have yet to see a zombie game that accurately follows Romero/Fulci rules (or lore) and also has fun gameplay. 'Road to Fiddler's Green' doesn't even come close.\n8:16 Why can't they just call it an AKM? All Kalash-pattern rifles in games like this are called \"AK-47.\" It's insulting! People know the difference by now, so why can't they get it right?! In Killing Floor 1, there's a PM Mod.90 (the basis for the Draco) and it's referred to as \"AK-47\" for no reason! And it also has its tantal stock permanently folded for no reason! When I play Commando, I never use it for exactly those reasons. Well, mostly because of the stock. It's just too insulting.\n*Note:* S.T.A.L.K.E.R. mods designate various AKs with proper nomenclature.\n8:43 Again with the use of both hands, thereby over-complicating the reload and cocking process. Just reach under the receiver with your left hand to work the charging handle. We southpaw shooters don't have to worry about that. Not with AKs, that is.\n9:15 Whoever's doing this gameplay isn't bothering to show us actual combination sights. Modern AKs are often set up with those. The Russian Army doesn't bother with that (not regular infantry, correct me if I'm wrong). They use the AK-74M in 5.45x39mm, which has been in service since the early '90s, and they use them with iron sights. Also, their grenadiers use rocket launchers (RPG-7) and their senior riflemen use underslung grenade launchers (GP-25, never fully replaced by the GP-30 or GP-34). Only officers carry pistols. Regular soldiers don't bother with them. The idea of carrying a personal sidearm for actual D-FENS, rather than for the purpose of executing subordinates, is almost a uniquely American concept.\n9:17 Killing Floor 1 got that right over a decade ago, so how it's possible to get it wrong in games that came out after that is beyond comprehension. It's like people don't learn things. Like they have no powers of observation whatsoever. So they just keep regurgitating the same mistakes until they become tired old tropes. So by now, doing things wrong out of negligence or incompetence is practically a tradition. Movies and TV shows are even worse about it, and video games get a lot of their bad habits from movies.\n9:27 Notice how it's pulled out wrong but inserted correctly. That makes it even more baffling! If yer gonna screw up, at least screw up consistently!\n9:39 Ackchyually, the word \"Apocalypse\" means \"Revelation\" in the original Greek, so what people mean to say is \"zombie cataclysm.\" Also, the word \"Armageddon\" means \"war at Megiddo,\" so people need to quit misusing that word too. These words have misused so often and for so long that even dictionaries define them incompetently since dictionaries define words according to how plebs use them, not according to their original definitions. The fact that civilization hasn't already fallen apart completely is truly miraculous.\n9:52 My assessment was that it was for combination sights like in \"(No) Escape from Tarkov(sky).\"\n11:13 Non-magnified sights would actually be preferable against these types of enemies since a lot of them are fast and evasive.",
            "polarity": 0.022903613199665836,
            "subjectivity": 0.49242519760940806
        },
        {
            "body": "Please don't show him the war crime that is the UMP's reload animation. *Please.*",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Those plebeian crap Chinese optics tigger me more than they should. It’s based on a Japanese competition red-dot but it has no business in a tactical scenario",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.325
        },
        {
            "body": "Appreciate the attention to detail regarding reload times, and the necessity that they’re quick to keep up with the fast pace of the game. You’d think the same logic would apply to the animations: as your character will always cycle the action of any firearm in this game regardless of if there’s still ammunition in the chamber.",
            "polarity": -0.027777777777777787,
            "subjectivity": 0.3541666666666667
        },
        {
            "body": "i kind of want him to react to valorant guns.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "I just really love this man. Every damn video with him is interesting and funny. He just comes across as so down to earth and its awesome.",
            "polarity": 0.4188888888888888,
            "subjectivity": 0.6777777777777778
        },
        {
            "body": "24:00 Ah, a Cinematic Mod fan, I see",
            "polarity": 0.1,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Week 4 of asking for Killzone",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "grr I hate how fun the shooting looks in this gameplay footage\nI've really wanted to get into B4B but the card system and hero shooter ish mechanics of the different characters really put me off",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.4833333333333334
        },
        {
            "body": "I'm just sad that some attachments to the guns in this game doesn't physically show like the long barrels or extended magazines",
            "polarity": -0.23750000000000002,
            "subjectivity": 0.48571428571428565
        },
        {
            "body": "firearm experts react to guns that exist already in the real world.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "I am a bit surprised he missed the mini-14.\n\nI think I know why the game used a canted sight for some animations.  Well I think I know the idea of where it came from.\nThere are canted red dot sights, and they are often attached with scopes so that if the operator needed to switch from magnified optic to not at a moments notice, all they have to do is cant the weapon 45 degrees.  Without the red dot it does not make sense.",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.325
        },
        {
            "body": "The m9 burst is just a variant of the m9",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Empire total war would be good",
            "polarity": 0.35,
            "subjectivity": 0.675
        },
        {
            "body": "Do Bullet Girls Phantasia. I want to see Jonathan Ferguson comment on the length of pull of a roughly 5 foot tall schoolgirl.",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "body": "The fact that this guy is a gun expert who is also aware of games and certain aspects of their designs is refreshing. He mentions the oddly quickly loading of the 870 then shortly after acknowledges that they likely needed to make it that simple to keep up with the games' pacing. Someone like this can give a quality judgement of the game and hold less bias than some random gun nut who's never touched a piece of technology in their life",
            "polarity": 0.023095238095238103,
            "subjectivity": 0.4945238095238095
        },
        {
            "body": "the M1A still comes with an M14 user manual, and in addition, a flyer is included warning of the possibility of accidental slamfire and what to do should it happen. I would bet that the company name is a tongue in cheek reference, or maybe I'm reading too far into it.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "I've always dismissed the crouch stance change as the character trying to aim via the barrel of the gun",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}