{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-02 06:30:36",
    "ups": "15071",
    "downs": "153",
    "views": "327320",
    "top_comments": [
        {
            "comment": "I wish I see him react to MGS series weapons. It has great selections of unique weapons",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5875,
            "subjectivity": 0.875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The whole tilt shooting seems to come from John Wick, or having seen others irl tilt it that way to shoot.  However, when in real life I've seen shooters tilt their rifle like that, it was because they had off set iron sights to the side to complement their ACOG or whatever optic they had on the top rail.",
            "polarity": 0.3,
            "subjectivity": 0.4000000000000001
        },
        {
            "body": "you should do enter the gungeon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "12:30 I feel like this is the most legitimately confused and offended I have ever seen Jonathan get XD",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.6
        },
        {
            "body": "Please do a hunt showdown 2 episode.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Could we see Jon review some Destiny/ Destiny 2 guns? He’d have a wonderful time with all the wonky space magic going on in those!",
            "polarity": 0.44166666666666665,
            "subjectivity": 0.7666666666666666
        },
        {
            "body": "I wish I see him react to MGS series weapons. It has great selections of unique weapons",
            "polarity": 0.5875,
            "subjectivity": 0.875
        },
        {
            "body": "Jonathan Ferguson you are awesome dude! i love watching these videos keep it up! \\o/",
            "polarity": 0.8125,
            "subjectivity": 0.8
        },
        {
            "body": "do killing floor 2 please!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm surprised Jonathon didn't say anything about the 30-round magazine only having 20 rounds 18:20",
            "polarity": 0.05,
            "subjectivity": 0.95
        },
        {
            "body": "My \"can I keep up with the expert\" score was doing pretty good up to the Barrett (in the \"Oh, yeah - I recognize that from Forgotten Weapons, and I think I might get the name if he doesn't say it too fast\" sense.) But once he started critiquing the M9, I was like \"OK, these are some deep cuts.\"",
            "polarity": 0.32999999999999996,
            "subjectivity": 0.62
        },
        {
            "body": "1. Why are there numbers popping up when shooting\n2. Why are there crosshairs and hitmarkers \n3. Why do they not call the guns what they are called \n4. Why do they make stuff up",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "the m14 shown here compared to the one in game the one in back 4 blood is a M1A the civilian version of it what hes showing is the m14 the u.s  military version of it hint why theres a mounting scope on m1a not m14 like he mentions",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "Firearms and UK. Sounds like an oxymoron of titanic proportions.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "my experience, is firing hip fire its more confortable to tilt the gun. like they did with the AK",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "We need him to react to the weapons of Wolfenstein",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "10:44 watch the magazine...oof",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "10:06\n\nActually speaking of this, I've certainly seen this firing position in a decent handful of games, as the 'hipfire' while crouched. I'm sure there has to be some \"reason\" for it, though I really can't place what. It might link back to making the ejected casings look more eye-catching possibly.",
            "polarity": 0.1976190476190476,
            "subjectivity": 0.4908730158730159
        },
        {
            "body": "You need to get Jonathan to check out the guns in Stalker Anomaly.\nThere are many many many guns and I think he would have a lot of helpful and perhaps might shred a tear for how beautiful they look.\nPlease please GameSpot get the good ol English Man to review that masterpiece.\nThank you\n-Will",
            "polarity": 0.5083333333333333,
            "subjectivity": 0.5166666666666667
        },
        {
            "body": "probly m16a4 cause the a3 is full auto and its seems to be burst in the game\nfun fact the full auto m16 in lfd2 is a m16a2 model",
            "polarity": 0.14999999999999997,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "The 870 does not have magpul furniture",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}