{
    "time_posted": "2021-10-30 14:00:02",
    "url": "https://www.youtube.com/watch?v=6C2NSRtvkm8",
    "time_now": "2021-11-06 05:17:11",
    "ups": "18401",
    "downs": "189",
    "views": "415754",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Putting the comment on his presentation and commentary on the technical aspects aside (which is undoubtedly phenomenal), Jonathan's presence alone is so wholesome. The guy is  such a joy to watch. His enthusiasm shows while he is talking and I love it. \n\nMORE JONATHAN PLEASE. \n\nAlso despite all these positive words for him, I want him to react to Vanguard guns. :D",
            "polarity": 0.44090909090909086,
            "subjectivity": 0.49318181818181817
        },
        {
            "body": "see i've always thought the Deagle was thought up as a side arm for the very rare person who is a literal giant. people like Andre the Giant or hafthor bjornsson for example, people who are about 2 or more meters tall, are as strong as an ox and probably weigh about the same as an ox. it may look ridiculous in the hands of your average person but not those Icelandic strongmen giants.",
            "polarity": 0.105,
            "subjectivity": 0.7197916666666667
        },
        {
            "body": "Please have this man do COD Vanguard. He’ll have a heart attack when he sees those guns.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Have y’all done 7 DAYS TO DIE??? I’d like to see that and HALO would be nice thanks :) I love the job you do! Keep it up!",
            "polarity": 0.5203125,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "If only the would take more time to fix this game up...",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "LOVE this series. Please keep making more",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "That M16 in the armory sorta resembles the canadian C7 which we use with a 3.4x scope as well",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "In the AK portion the can't in the rifle is to essentially look over the sights it is for very close quarters and to not obstruct vision it is not very accurate obviously but makes for quick target acquisition",
            "polarity": 0.07589743589743589,
            "subjectivity": 0.4174358974358975
        }
    ]
}