{
    "time_posted": "2021-10-30 16:00:05",
    "url": "https://www.youtube.com/watch?v=6dOqeFBvvZs",
    "time_now": "2021-10-31 21:32:21",
    "ups": "32227",
    "downs": "231",
    "views": "423323",
    "top_comments": [
        {
            "comment": "you could add an enchanted water fall going down each of the terraces.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "No terve! 😁",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I wonder if the old trick of magma blocks under trap doors (or in this case, moss carpets) would work to make a mob-killing barrier around the entrance.",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "Am I the only one seeing a cat with glowing purple eyes for over the tunnel",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Eventually this biome is gonna be a bi-home",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "u should maybe add spore blossoms or buildings or ruins",
            "polarity": -0.15,
            "subjectivity": 0.2
        },
        {
            "body": "You should hire Gem to build a custom enchanted tree ☺",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love those thinking moments and I have adopted it myself!!! Walking around everywhere going \"Hmmmmm\"",
            "polarity": 0.9765625,
            "subjectivity": 0.6
        },
        {
            "body": "you could add an enchanted water fall going down each of the terraces.",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "Iskal is lorax confirmed",
            "polarity": 0.4,
            "subjectivity": 1.0
        },
        {
            "body": "Love the vid",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "You know you can use glow lichen",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm absolutely loving the plateau area!! its so pretty! especially with the new gate!!\nI think it could be really cool to add some lights and plants in the dark pond outside the gate. It could really add to the enchanted mystical feel. Great episode! I've really been loving this season :]",
            "polarity": 0.34692234848484854,
            "subjectivity": 0.6337121212121213
        },
        {
            "body": "Diorite diorite make a big bas out of it",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "I am sure he playst glostnone through glass",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "There is always a reason to come to Finland :D",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "@10:05 I believe the word you're looking for is \"monochrome.\" The term \"monotone\" usually refers to sound, while the term \"monochrome\" is usually used with color. Sorry if I'm being a bit nitpicky, and hope this helps!\n\n(Also, I really love the gradient and I think it turned out well. One thing I think you could do is add some sort of ruined walls/structures in the area around the path, to fill up some space and to give the base a bit of 'history' or 'lore.')",
            "polarity": -0.1708333333333333,
            "subjectivity": 0.5833333333333334
        },
        {
            "body": "Suomi Finland!🤍💙",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I have an idea and people might have given it before me but where you have the moss cliffs above the part you just did to the grand entrance can´t you make like houses and such where more villagers can live? that way you can also make like bridges or such connecting to each house or something.",
            "polarity": 0.18939393939393936,
            "subjectivity": 0.5166666666666667
        },
        {
            "body": "Who else watched the 5 seconds again to check if it was grian's voice at \"back in london\" 😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}