{
    "time_posted": "2021-10-30 16:00:05",
    "url": "https://www.youtube.com/watch?v=6dOqeFBvvZs",
    "time_now": "2021-10-30 20:51:20",
    "ups": "15094",
    "downs": "81",
    "views": "134353",
    "top_comments": [
        {
            "comment": "OMG YOUR DESKTOP IS THE SAME AS MINE",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.125
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I like these episodes very much keep up the work but take pauses if you need",
            "polarity": 0.26,
            "subjectivity": 0.26
        },
        {
            "body": "general area",
            "polarity": 0.05000000000000002,
            "subjectivity": 0.5
        },
        {
            "body": "He turned that Biome into a BiHome",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "To make more diamonds from your guardian farm, you could build like smaller shops near the different group areas like boatem and such.",
            "polarity": 0.12,
            "subjectivity": 0.5
        },
        {
            "body": "What enchantments do you have on your noob sword??",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Has no one told Iskall that he can turn Diorite into Moss? He doesn't have to dig it up or anything, just bone-meal a moss block next to the Diorite and it's gone!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The \"enchanted part\" looks to me like a cat with purple glowing eyes 🐱",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Gem has a custom Tree shop may want to give a try?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I gotta say, there are many \"only problems\" in this episode",
            "polarity": 0.25,
            "subjectivity": 0.75
        },
        {
            "body": "You could use green concrete powder in the path too!",
            "polarity": -0.006249999999999992,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "SUGGESTION:\nHey how about making the elevator into a waterfall like area with a lake down with the trees with the waterfall coming from the side near the mountain like inside the mountain but just enough to be poking out with the elevator inside the waterfall or behind it if you want it to be in the middle, then add a little doc with a couple villagers around and you got yourself a little village, oh and don't forget the iron Golems that will get rid of the mobs for you oh and put the houses in the walls might i add. Just so it looks like an elf village type of thing.",
            "polarity": -0.11865079365079366,
            "subjectivity": 0.4126984126984127
        },
        {
            "body": "9:00 I like how Iskall is replacing the stone with moss by hand…",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "do string in place of buttons less noticeable at a distance",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Cyan or mint would be an accurate name for the other color of copper.",
            "polarity": 0.13750000000000004,
            "subjectivity": 0.5041666666666667
        },
        {
            "body": "OMG YOUR DESKTOP IS THE SAME AS MINE",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "I have a suggestion. Have you thought about using melons to make the moss more interesting?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Magical monster entrance needs redstone mouth",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Iskall I have a cool idea for your water elevator, you could incorporate a pond or lake so it’s a bit hidden",
            "polarity": 0.09166666666666666,
            "subjectivity": 0.4916666666666667
        },
        {
            "body": "Hmm, maybe to make it more \"enchanting\" you could add vertical veins of amethyst behind the tinted glass...  Kinda like the entrance, but more organic",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "Order a gem tree it would look so nice!",
            "polarity": 0.75,
            "subjectivity": 1.0
        }
    ]
}