{
    "time_posted": "2021-10-30 14:00:13",
    "url": "https://www.youtube.com/watch?v=6hXEZysidiU",
    "time_now": "2021-11-01 18:09:12",
    "ups": "3582",
    "downs": "41",
    "views": "57604",
    "top_comments": [
        {
            "comment": "According to my belief, Brahma was a prophet that established the worship of One Supreme CREATOR for the land of Vindiyu  or modern day India, Pakistan, Nepal and other surrounding areas. During his time, in the land of Arabiniya, the man called Abraham was raised for the people of modern day Iran, Arabia, Israel to also establish the worship of One Supreme CREATOR. Also for  the land of North and South America , prophet Ewatan was raised for the people of that area for the same purpose. The CREATOR also raised Po for the land of China and the rest of Japhet for similar purpose.\nOne of Brahma's sons called Veda, and he was the one who wrote the Vedic texts. \nAll of these great prophets established the worship of the All Person CREATOR, non-resistance, communal living, vegan-diet, daily bath and many other things that are absolutely essential for healthy spiritual and corporial life.\nOther subsequent great prophets such as Chin of China, Moshe, Capiliya, Sakaya A.K.A Gatama Budha and Yahusha A.K.A Jesus all reinstated what Brahma, and his counterparts thought for their respective regions.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.15441176470588236,
            "subjectivity": 0.3431372549019608
        },
        {
            "comment": "Really fortunate enough to listen and feel this knowledge by Gurudev 🙏🏻🙏🏻🙏🏻❤️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2,
            "subjectivity": 0.6
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Wow",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Really fortunate enough to listen and feel this knowledge by Gurudev 🙏🏻🙏🏻🙏🏻❤️",
            "polarity": 0.2,
            "subjectivity": 0.6
        },
        {
            "body": "God = God",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All music and cinematography are  taken from Hollywood commercial films",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Contact me  I am a film maker and spiritual too",
            "polarity": 0.0,
            "subjectivity": 0.13333333333333333
        },
        {
            "body": "Cinematography too bad",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "What is the range of vibration of God?  Guruji..is the resonance feeling with any vibration can be experienced as exsistance of GOD.",
            "polarity": 0.8,
            "subjectivity": 0.9
        },
        {
            "body": "Ashadharan",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}