{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qiclsp/lpt_if_you_are_ever_a_manager_dont_message_or/",
    "time_posted": "2021-10-29 09:17:04",
    "time_now": "2021-10-30 16:50:39",
    "ups": 21285,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hiic05s",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hinm771",
            "body": "My boss will send emails and delay delivery till Monday morning !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin8e7u",
            "body": "Does \"hey, rando is sick and can't work. Can you cover the shift\" Count? Or do I work 9 to 9, 4 days a week",
            "polarity": -0.7142857142857143,
            "subjectivity": 0.8571428571428571
        },
        {
            "comment_id": "hin1n39",
            "body": "I got a call while on vacation to tell me I got a promotion and my previous stress-inducing boss was being laid off. I didn’t mind that call.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "comment_id": "hin1ctt",
            "body": "I mean, would this count the usual \"Can you come in?\" messages?\n\nLike if you get a text 2hrs before openning saying someone can't come in to open. Can you contact someone else to do before opening time?\n\nOr is scheduling another matter in this regard?",
            "polarity": -0.1875,
            "subjectivity": 0.4791666666666667
        },
        {
            "comment_id": "hin15su",
            "body": "Me and my employees communicate regularly outside work hours. I feel that it strengthens our relationship because they know they can rely on me whether we're being paid or not. It's  rarely about work, but in the instance it is, they don't think twice about it because they know I'm ALWAYS on the clock - for them and for the business. However,  we're a pretty small corporation of only 20 +/-..",
            "polarity": 0.06000000000000001,
            "subjectivity": 0.67
        },
        {
            "comment_id": "himytq3",
            "body": "My manager would call me multiple times a day on each and every of my days off for 15-20 minutes each to walk me through tasks he didn’t know how to do because they were a part of my job.\n\nFor some reason I was cool with it because he was significantly younger than me, it was his first management gig and he was having a tough time of it and I’d been doing this for almost 10 years\n\nThen my shifts started getting a lot shorter, got an extra day off a week, the calls became even more frequent (Now I’d get at least one call a day on days I worked-a couple hours after I clocked out-to walk him through something-In addition to the sometimes 5x daily calls on my days off) and it was at that point I remembered it was common practice to minimize labor costs to get that sweet sweet bonus and he wasn’t even trying to hide it anymore. \n\nFound a new job, left with no notice after he called me into his office to congratulate me and share the wealth-I was going from 10.75/hr to 10.90/hr",
            "polarity": 0.06983164983164983,
            "subjectivity": 0.35808080808080806
        },
        {
            "comment_id": "himxb70",
            "body": "I literally can't go a day off without someone from my job trying to call me in. I use to go but then I felt taken advantage of working 11 days in a row I tell them no now pretty much always. Nobody comes in to help when I'm working and we are understaffed. Maybe not the best attitude to have but it's exhausting.",
            "polarity": 0.26249999999999996,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himvn01",
            "body": "Ah crap. I send my sous chef funny gifs at all hours of the day.",
            "polarity": -0.275,
            "subjectivity": 0.9
        },
        {
            "comment_id": "himrwzs",
            "body": "I recently had an employee leave our company because I contacted them outside of normal working hours. But it was always when they had already signed on to do some paid overtime because we have a deadline that needed to be met and I’m checking in on the status of the project and they have gone silent. \n\nIt was a real eye opener when they left. I felt bad in hindsight but I also didn’t because we needed to hit the deadline, they were being compensated and had agreed to do the extra work, and I was stressed out wondering wtf was happening and if we were going to hit it or miss it.  I try more now to communicate how I will approach it when it’s happening.",
            "polarity": -0.03499999999999999,
            "subjectivity": 0.3616666666666667
        },
        {
            "comment_id": "himqoh4",
            "body": "Most managers don't understand that contacting your staff outside working hours is a toxic work habit. There was a time that I was so stressed at work because they kept increasing my workload, I did not respond to their messages nor answered their calls on a weekend. And when we returned to the office, I was scolded for not responding to their calls and messages. I'm planning to hand in my resignation next month.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.18333333333333335
        },
        {
            "comment_id": "himoqo2",
            "body": "You do you. If my manager wants something from me during my off hours then I'd just be happy to help. Maybe I screwed something up that they have to fix or whatever.\n\nI have also had to work with people who argue just like this and let me tell you how incredibly frustrating this can be. Colleagues that never do more than they have to or put in those extra hours as they are needed.\n\nOfcourse, you don't want to get taken advantage upon either. Just be reasonable alright? You giving your boss 30 seconds of your weekend is not the end of the world.",
            "polarity": 0.21666666666666667,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "himnt6x",
            "body": "I work in a big corp. My manager calls me regularly outside work hours. He wants to play call of duty together. We bros.",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.08333333333333333
        },
        {
            "comment_id": "himn5d0",
            "body": "Yea tell that to my boss LMAO",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himltyf",
            "body": "Strictly forbidden in France, law have been passed. Fuck that \"constant available\" policy, get you life back people!",
            "polarity": 0.0,
            "subjectivity": 0.33333333333333337
        },
        {
            "comment_id": "himkre2",
            "body": "It works the other way around as well. Don't call /text your manager in his/her off time.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "himixt8",
            "body": "I would just say it does depend on the established connection between you. My boss messaged me about five minutes ago to let me know that Dream Theater and Limp Bizkit both have new releases out. Nothing to do with work and neither of us are on socials so if easy to miss out on releases.",
            "polarity": 0.12323232323232323,
            "subjectivity": 0.595959595959596
        },
        {
            "comment_id": "himia5l",
            "body": "This goes the other way too. Don't message me on a Saturday morning asking for time off. I'll reply politely telling you to contact the manager on shift through the correct contact method. Then I will wish a firey painful death on you for fucking with my weekend chill.",
            "polarity": -0.4749999999999999,
            "subjectivity": 0.6916666666666668
        },
        {
            "comment_id": "himg7xe",
            "body": "I contact my team every weekend.\nI tell them how proud I am of them and how they are crushing it and what legends they are and how much I value what they do and I reflect their trials and triumphs back to them.",
            "polarity": 0.35000000000000003,
            "subjectivity": 0.525
        },
        {
            "comment_id": "himfpdv",
            "body": "Worst life tip ever.\n\nAll of my team were incredibly happy to come to the lab even after the work and on holidays. There were two particular reasons to do so:\n\n1) Money. The got double the average of their normal hour income.\n\n2) They loved their job more than anything. All of them professionals on the level where their job is not only the job, but their life's passion. Scientists and researchers as they should be.",
            "polarity": 0.12962962962962962,
            "subjectivity": 0.6314814814814815
        },
        {
            "comment_id": "himejrt",
            "body": "I'm a manager and I wish that worked both ways. I'd love to have my staff not contacting me after hours.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "comment_id": "himed6d",
            "body": "Thus is not an LPT.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himbfb2",
            "body": "It's on a case to case basis.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "himb11e",
            "body": "Nah real LPT is don’t answer your work phone/bosses number outside working hours.",
            "polarity": 0.1,
            "subjectivity": 0.17500000000000002
        },
        {
            "comment_id": "himarr0",
            "body": "If it is to pick up a shift then that is the only acceptable time imo.  If you say no there's nothing they can do, you weren't scheduled and have no obligation.  If you are free and want to work for extra money then go for it.",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.6333333333333334
        },
        {
            "comment_id": "him9htw",
            "body": "I will alway adjust my teams time cards with OT if I call them after hours and it has to be an emergency.  Being in IT sometimes I have team members that are subject experts and I have to call them to get production systems going.  My last job we had a hard stop at 6pm for the whole company so it was not an issue most of the time. Now I am at a manufacturing company that is 24/7 so sometimes stuff breaks so calls happen. I am lucky our team is super brilliant so if I can’t fix it with documentation my team can fix it in minutes.",
            "polarity": 0.22604166666666664,
            "subjectivity": 0.5427083333333333
        },
        {
            "comment_id": "him97zc",
            "body": "LPT: Don't text your manager at 0200 on a Saturday to tell them you're not going to make your 0600 shift.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him8kgp",
            "body": "I do get it but my manager and me have casual contact outside of work. It's a small store in a larger chain of liquor stores (3 people).\nIts alwas nice to see a picture of something he had to drink wich we were talking about the day before.\nBut ofcourse in larger more professional workspaces this should not be the norm.",
            "polarity": 0.05624999999999998,
            "subjectivity": 0.48958333333333337
        },
        {
            "comment_id": "him83xd",
            "body": "As a manager, I'm the one receiving messages 24/7. Everyone go away!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him5bx2",
            "body": "To keep it a buck, it goes both ways. \n\nAs a previous manager I built good relationships with the employees, we spoke several times in out of “business hours” and surprisingly on weekends or “non business hours” they reached out to me more often than vice versa.",
            "polarity": 0.3466666666666667,
            "subjectivity": 0.35333333333333333
        },
        {
            "comment_id": "him55c8",
            "body": "r/shittylifeprotips\n\nIf you’re that soft that you can’t handle your boss calling you outside of work. Then you’re beyond childish. Oh no! My boss needs t talk to me for a few minutes! My entire night is ruined! Noooo!",
            "polarity": -0.08,
            "subjectivity": 0.385
        },
        {
            "comment_id": "him4pqw",
            "body": "LPT don’t answer unknown numbers, work numbers or people from work unless you’re getting paid to be on call.",
            "polarity": -0.1,
            "subjectivity": 0.6
        },
        {
            "comment_id": "him436e",
            "body": "Went to court because of this (and other things too obviously but it was not well-perceived by the judges) (I live in EU)",
            "polarity": 0.0037878787878787845,
            "subjectivity": 0.4583333333333333
        },
        {
            "comment_id": "him250a",
            "body": "Why would I be working outside working hours? Your LPT makes barely any sense :D\n\nTbf, I have contacted teammembers during vacation (when I know they are available) a few times in emergencies. Double free time back for that though.",
            "polarity": 0.20625000000000004,
            "subjectivity": 0.30625
        },
        {
            "comment_id": "him1sde",
            "body": "I think it depends on the workplace culture. When I was a manager I always let my staff leave early or come in late if their kid had a ball game or they wanted to see an eclipse or an anniversary came up but it's fair they can answer a 15 minute call if something comes up. It's all about balance.",
            "polarity": 0.024999999999999994,
            "subjectivity": 0.5499999999999999
        },
        {
            "comment_id": "him18oh",
            "body": "For a lot of jobs that's still damn near all hours. For the restaurant industry, that's 6-7am to 12-2am. Appreciate the 4 hours of solitude.",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "him0wjh",
            "body": "How is this a pro tip? Real tip is don't answer emails after hours.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "him0di3",
            "body": "My boss contacts me and my team a lot off work hours. To be fair, we're a pretty close knit team who shares a boatload of memes. Boss is no exception.",
            "polarity": 0.475,
            "subjectivity": 0.95
        },
        {
            "comment_id": "hilz4kj",
            "body": "And if you're an employee, never answer a managers contact outside working hours",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hilyzbm",
            "body": "I think it depends on your relationship to the person you're contacting and what it's about, if it's work stuff yeah probably hold back, but my poss and I talk on fb all the time, usually memes or about 4wd and stuff, we also have a work group chat just for playing CoD with each other",
            "polarity": -0.125,
            "subjectivity": 0.20833333333333334
        },
        {
            "comment_id": "hilxq5c",
            "body": "I don't mind them contacting me if its quick things. But if they ever pull me up on arriving a tiny bit late for a desk job then we gonna have issues",
            "polarity": 0.011111111111111108,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "hilxirx",
            "body": "I am a manager of more than 100 people. Some only work 2 or 3 shifts per week. However sometimes important information needs to be communicated immediately. This is ALWAYS, done via email though. \n  I always struggled with how to make people feel it was OK not to respond until they were working again.\n \n I now use an email signature which firstly states my own working days followed by \n\" while it sometimes suits me to email outside these hours, I don't expect a response outside your own\"",
            "polarity": 0.31666666666666665,
            "subjectivity": 0.6037037037037037
        },
        {
            "comment_id": "hilw0vd",
            "body": "It's also annoying for the manager who has to try to fix the issue the staff left behind without telling anyone.",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "hilvsgy",
            "body": "“We’re going to be closed tomorrow, you can have the day off”. Hmm… I probably shouldn’t bother Jim while it’s outside of working hours.",
            "polarity": -0.05,
            "subjectivity": 0.07500000000000001
        },
        {
            "comment_id": "hilvmux",
            "body": "How to efficiently generate resentment towards you and the workplace you manage, 101:\n\n* Frequently contact employees out of work hours\n* Change rostered shifts less than 12 hours before said shifts\n* Deny time-off requests\n* Disregard employee availability\n\nIf you have done all of these things, well done! You have become a shitty person!",
            "polarity": -0.08020833333333331,
            "subjectivity": 0.18333333333333332
        },
        {
            "comment_id": "hilvg3t",
            "body": "Can confirm that this does not apply to all fields.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilurmm",
            "body": "I work nights so my assistant manager will text me a brief, \"Hey, make sure not to fill x tonight\" at about 6 in the afternoon so I will wake up to it, which I don't mind at all. My *manager* however will text me while I'm at work, on the sales floor, and keep texting me personal stuff that doesn't need to be said. That's super uncomfortable and annoying. Please don't get personal in your texts if you're a manager, unless you're an actual friend outside of work and have conversations mutually.",
            "polarity": -0.051851851851851864,
            "subjectivity": 0.5043209876543209
        },
        {
            "comment_id": "hiluhii",
            "body": "Per my union contract if I get called it's a minimum 2 hours overtime even if it took only 5 minutes.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilu2mu",
            "body": "If your salaried it’s different. Some managers I have to email. And they will have a outlook message saying they are out of the office fine. But when every other temporary contact you have me call is either off or out of the office as well. Well to bad since I’m only given your email and nothing else.\n\nLike for me if it’s like a 10 minute call 30 minutes after my shift it’s fine. Rather deal with that then a massive pain on Monday where one manager did something and another employee did another thing. \n\nIt really comes down to your job.",
            "polarity": 0.005864197530864217,
            "subjectivity": 0.5700617283950618
        },
        {
            "comment_id": "hilu1lx",
            "body": "Tell that to the military.",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hiltlcb",
            "body": "I once had a phone call from my manager 3 days into my week holiday. She asked me something that a. She should have already known the answer to and b. If she didn’t, she could have asked literally anyone else who worked in the same area as me.\n\nI also had constant phone calls one night from a duty manager. I finished at 4.30.. the first phone call came at 5, it was about some lost property that had been locked in the office because the guy said he was going to come the next day to pick if up, changed his mind and rang to say he was going to get  it that night. \n\nThe first call was to ask where it was. The second call was to ask where the key for the office is ( on the managers keys) the third was to ask if I could go into work and get this guys phone, then it was to ask where the key is again. At 11.30, the duty manager drove to my house to get my keys because they had lost their set. He didn’t tell me he was coming. Just started banging on my door while I was in bed. I was not happy and filled in an overtime form. \n\nA week later, the same manager ran a meeting on “time theft” and how people are stealing from the company by not doing work when they’re being paid to. He refused to answer me when I asked about people phoning workers when they had clocked out. Prick.",
            "polarity": 0.038461538461538464,
            "subjectivity": 0.3961538461538462
        },
        {
            "comment_id": "hilt6ec",
            "body": "Applies to hourly only. As a software engineer sometimes there are emergencies when you need to be alerted outside of normal hours to resolve something.",
            "polarity": 0.049999999999999996,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "hilt5qd",
            "body": "It really depends on the reason. I don't call anyone to follow up on job performance outside of work hours but I do call to verify scheduling changes/time off requests because I'm not putting the whole schedule on hold to wait until Tom's next shift on Thursday.",
            "polarity": 0.1,
            "subjectivity": 0.1625
        },
        {
            "comment_id": "hilsyyr",
            "body": "Awesome, Now managers worldwide aren’t going to tel employees they don’t need to come in! They’ll wait till they show up instead.\n\nGreat advise!",
            "polarity": 1.0,
            "subjectivity": 0.875
        },
        {
            "comment_id": "hilsy11",
            "body": "Yep. Whenever I managed I would try and not to. But if I needed a shift covered I would make sure to say \"it's alright if you can't\". Because I knew it was their day off and I doubt they would want to work.",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "comment_id": "hilst59",
            "body": "As a retail manager I do contact my employees outside of work hours if needed to cover a shift. I always apologize and I never beg or demand. I ask one simple question. Yes or no. Yes, awesome thanks and details given. No, thank them and tell them to enjoy their day.",
            "polarity": 0.32,
            "subjectivity": 0.4214285714285714
        },
        {
            "comment_id": "hilsnmc",
            "body": "Or use an app like Slack. Notifications turn off after work hours. Text to your heart’s content (so you don’t forget), but they won’t see it til work the next day",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilsin4",
            "body": "I agree but this feels very situational. In fields with possible emergencies during off hours and such. In my case all off hours calls are time and a half. Plus if the call only takes 5 minutes you are automatically comped the hour. But maybe I'm going outside the applicable scenario. Probably that",
            "polarity": 0.005555555555555559,
            "subjectivity": 0.5027777777777778
        },
        {
            "comment_id": "hilsgim",
            "body": "I'm a general manager of a very fast paced, high volume quick service restaurant. We have recently been achieving new record sales and performance and I often group text my supporting management team to express my appreciation of them and to thank them and commend them on a job well done. It is often too busy at work and we may not know the results of our hard work until the end of the day. All of them have often said that those texts are meaningful and they appreciate not just the update, but the recognition. They feel like they are included in management process and that their contributions are recognized.\nWhile I somewhat agree with this LPT, I think it's important to specify what it is you are communicating to your staff rather than making an all inclusive statement like this.",
            "polarity": 0.17254820936639123,
            "subjectivity": 0.510564738292011
        },
        {
            "comment_id": "hilrabm",
            "body": "So just don't call anyone if there's an emergency and you need their help? I don't understand.... That's legit part of the job, no?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilr6k6",
            "body": "As a manager, this is nonsense.  Sometimes you have to contact your employees for information and it can't wait till the next time it comes in.  Plus, huuuuge double standard here as well, because will contact me all hours of the day.  I can't just turn off my phone and say good luck.",
            "polarity": 0.175,
            "subjectivity": 0.15000000000000002
        },
        {
            "comment_id": "hilqwex",
            "body": "Wait, you guys get non-working hours?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilqhk3",
            "body": "I'd do this, as I find I'm uncomfortable with answering and sending work text messages and emails outside of work hours.",
            "polarity": -0.25,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hilq9sn",
            "body": "I'm personally okay with a simple message if I'm allowed to respond the next morning. Like \"Can you find this for me tomorrow morning?\" \n\nI'm not okay with having to respond at 11pm.",
            "polarity": 0.0625,
            "subjectivity": 0.3392857142857143
        },
        {
            "comment_id": "hilq8lv",
            "body": "My boss and his boss (my director) are very adamant about this. They only ever call us outside of work hours if there's something pertinent. For example, my boss called me one evening because he needed me to drive to one of our remote sites the following morning (2 hour drive) in time for our usual start time.\n\nMy coworker who recently retired told me that in his entire career the only time he ever got reprimanded was for responding to an email outside of work hours at our company. That's how serious my boss and director are.\n\nOne time I got called by a coworker on another team because I was on emergency pager that week. He called me at like 5AM telling me not to worry if I got any emergency pages because he was restarting a server. My boss got mad and said that that needed to be considered an emergency page (automatic 2 hours overtime) and for that to be straightened out to not happen again.",
            "polarity": -0.09819444444444443,
            "subjectivity": 0.5084722222222222
        },
        {
            "comment_id": "hilq6zn",
            "body": "all this subreddit is now is advice on how to not be a dick. they should rename it r/popularopinion",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilq08r",
            "body": "Ummmm, you called in sick so we need someone to open on Monday. Better to be during a decent time of day so the new opener can get to bed when they need to and not feel stressed out with a 5AM call/text.",
            "polarity": 0.017748917748917743,
            "subjectivity": 0.5956709956709957
        },
        {
            "comment_id": "hilpwgm",
            "body": "I have been told to keep track of any work I do outside of the actual facility still. Calls, emails, etc. Honestly if someone calls me from work I'm just writing that down as 15 min and if they want me to email something it's 30 min.",
            "polarity": 0.1111111111111111,
            "subjectivity": 0.33472222222222225
        },
        {
            "comment_id": "hilpu62",
            "body": "I wish society would go back to 2000 when it comes to work expectations. Having the expectation to be available or accessible 24/7 is one of the most insidious things to come with cell phones. You're so right, leave people alone after hours. However most companies/industries don't",
            "polarity": 0.3434523809523809,
            "subjectivity": 0.3851190476190476
        },
        {
            "comment_id": "hilppnd",
            "body": "Wish this were true in consulting/finance. Work culture is to work through the weekend and outside of business hours no matter what",
            "polarity": 0.175,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment_id": "hilpb5c",
            "body": "Bwahahaha pretty sure you don’t get to be a manager otherwise.   \n\nAlso to be fair to those managers it’s usually some shithead district manager or owner or higher up asshole putting the screws to them that makes them make those calls",
            "polarity": 0.29,
            "subjectivity": 0.7077777777777777
        },
        {
            "comment_id": "hilp4y2",
            "body": "Damn this sub is hot fucking garbage get new mods",
            "polarity": -0.07121212121212121,
            "subjectivity": 0.7015151515151515
        },
        {
            "comment_id": "hiloydu",
            "body": "As far as I’m concerned my workplace doesn’t exist when I’m off the clock.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilo2i9",
            "body": "Lol this isn’t even close to a life pro tip. But alas it’s a popular sentiment on Reddit so it is being upvoted at light speed",
            "polarity": 0.35,
            "subjectivity": 0.825
        },
        {
            "comment_id": "hilnf91",
            "body": "Sweeping generic statement that applies to very little management situations. I'm available for my staff 24/7 365 days a year. I'm well within my right to send the odd txt message now and again about things that will directly effect their work and therefore effect the place they spend the majority of their time. I don't demand an answer and often I will say, call me once you've clocked in.",
            "polarity": 0.06254960317460317,
            "subjectivity": 0.3726190476190476
        },
        {
            "comment_id": "hilmvck",
            "body": "Harsh clock-in/clock-out schedule.  For those keeping a job for the check, their job is NOT their life.",
            "polarity": -0.2,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hilm3hn",
            "body": "It also may violate union rules and/or the Fair Labor Stabdards Act if the email could reasonably be understood as paid work for the recipient and is sent outside their paid working hours. Obviously not applicable for employees who are neither union nor covered by FLSA.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.5125
        },
        {
            "comment_id": "hillww7",
            "body": "In my experience, it only works the other way round.",
            "polarity": -0.10833333333333334,
            "subjectivity": 0.5916666666666667
        },
        {
            "comment_id": "hill7q9",
            "body": "This is a great rule of thumb but sometimes it’s just not something you can follow.\n\nYou might have to text folks if:\n* More than one person calls out and you literally can’t  operate without reaching out for more staff. You can at least request they come in, offer overtime, and most importantly be grateful that they came. Never be salty if people turn you down.\n\n* there’s a critical problem in a system that they understand the best, and other attempts have failed. This happens a lot in IT- someone just is better,\nOr has more background about a technology. There’s a solution for this problem in having better documentation, and having a proper escalation, but there’s still occasionally going to be a situation that calls for someone really good at one thing, where serious money is on the line.\n\nThat said, fuck you if you text me about non-critical shit after hours.",
            "polarity": 0.19430555555555556,
            "subjectivity": 0.5052777777777777
        },
        {
            "comment_id": "hilkpue",
            "body": "Pretty much every job I’ve ever had would cease to function if the staff couldn’t be contacted outside of work. \n\nI think the trick is to just be a good boss, so when you have to be the “bad” boss and contact someone when they aren’t working, they know it’s out of necessity and not desire. I’ve always done whatever I can to make my people feel good. Big positive reinforcement boss here.\n\nAlthough, just got a job in IT and it doesn’t really matter in my personal life anymore! I don’t have to be the bad guy!",
            "polarity": 0.06384297520661159,
            "subjectivity": 0.4480716253443527
        },
        {
            "comment_id": "hilk7m3",
            "body": "Really?\n\nHow hasn't this post been removed if it is common sense?",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hiljrmy",
            "body": "These “pro tips” are so out of reality. There are a multitude of great reasons to message someone out of work hours jesu Christ hope you never become a manage with this attitude.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hiljfuu",
            "body": "This should apply on student too.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilj2y4",
            "body": "You have to “train” your coworkers on how available you are. I never respond after hours. I set a reminder for the morning. If someone insists on an emergency I tell Them I can get to it after dinner and kids bedtime (so a few hours away) I do it as fast as I can and then sit on it until im ready to go to bed. Then I send it out and let them know spent my whole evening on their  emergency and I’m going to bed . You get credit for a late night, they feel guilty and they can’t do any more revisions. \n\nIf you’re always available for a fire drill people will plan around that. You create your boundaries.",
            "polarity": 0.08000000000000003,
            "subjectivity": 0.4600000000000001
        },
        {
            "comment_id": "hiliy6g",
            "body": "Some things require an immediate response, sometimes you have to contact your employee when they aren’t working, it’s called communication. This post is a joke unless it’s trying to say something along the lines of “if you’re a manager, don’t make your employees feel required to pick up when not at work”",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hililki",
            "body": "Another reason not to contact me outside of work hours is that I'm sure as fuck not going to answer.",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.512962962962963
        },
        {
            "comment_id": "hililes",
            "body": "I turned off all notifications from slack on my phone told my boss is a glitch. \n\n“Sorry I can’t get it to work, slack is weird…no, it’s my personal phone so IT can’t help as per policy…it’s ok though we don’t have after hours emergencies.”",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hilhiyu",
            "body": "Hmmm I dont think that is a blanket rule. I manage people and will often tell them to leave early. I've booked meetings for a few hours of an afternoon and told them \"this was a fake meeting, just take the time now to be with family or have fun with friends\" as there are definitely times when I need them to work out of regular hours or call them on a day off so I try to balance it out as much as possible. I think it depends very much in the job you have, how much you get paid and how much your supported in your work life balance.",
            "polarity": 0.036000000000000004,
            "subjectivity": 0.3836923076923077
        },
        {
            "comment_id": "hilh9xx",
            "body": "My manager did a fantastic job in creating a friendly enviroment.We literally have a meme group where we share all the atupid memes we find.Not all managers are shitty dude",
            "polarity": 0.3875,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hilh4ro",
            "body": "Ah shit I just went drinking with my direct reports for six hours",
            "polarity": -0.05,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hilh014",
            "body": "We just should go back to no personal numbers for work purposes. If the workplace determines you to be on call for emergencies, they should provide an extra phone which you are only required to keep on during actual on call hours.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hilfr4e",
            "body": "In the corporate world you are always on the clock.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilfqvh",
            "body": "Now hold on just a second…. My manager and I both have pretty healthy life/work balances.  We forget all about work until we do some prep for the week on Sunday evening.  \n\nShe used to send out her weekly communication by email at around ten or eleven on Sunday night.  It didn’t require any response,  but it was often helpful to see it on Sunday night.  \n\nThen some busy body told her she should never send anything outside of working hours. So she schedules it to be sent on Monday morning.  It’s a pain in the ass.  Now I rarely get a chance to glance at it until end of business on Monday.",
            "polarity": 0.19166666666666665,
            "subjectivity": 0.4583333333333333
        },
        {
            "comment_id": "hilf30e",
            "body": "I feel like this is less applicable when you are A) Salaried, B) highly compensated, C) higher up the food chain. \n\nLike I am a people manager and my boss manages my peers and me. If we are walking into a presentation in the morning and something comes up that needs to be communicated after hours, especially of it's going to ensure I don't get egg on my face in the morning, then by all means message me.",
            "polarity": 0.060833333333333336,
            "subjectivity": 0.5266666666666666
        },
        {
            "comment_id": "hilf2lp",
            "body": "I am the CEO of my company, and I have always abided by this LPT.  The only exception being a customer emergency.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hildpes",
            "body": "I had a restaurant employee who consistently shirked her duties. Every single morning I would open and it was plainly apparent that she had not completed any of her duties, despite having an easy to follow check list, she would always claim to “forget”. She was just playing on her damn phone and having texting fights with her boyfriend and stealing stuff. The one evening I told her that she had “forgotten” to fill up XYZ and she snarled under her breath that she’s pretty sure she had done the thing. I immediately confronted her about it and told her that no, I don’t say these things just to “be a bitch” or anything like that. I explained to her that when she fails to do her job, then I don’t have the time to do my job, because I’m cleaning up after her. The next morning, surprise surprise, I come in to a filthy kitchen with nothing refilled, when she only cooked for like two tables the night before. So I took pictures of everything she failed to do and texted them to her. Later that day she came in (late again) and proceeded to scream at me. Fired her lazy ass on the spot. In hindsight it wasn’t the most professional move on my part but for Christ’s sake I was so far beyond frustrated and then to be accused of lying? Fuck her.",
            "polarity": -0.06690476190476191,
            "subjectivity": 0.5318253968253968
        },
        {
            "comment_id": "hilcmwl",
            "body": "I think it depends. My manager talked to people that enjoyed him being a manager, at one point when Avengers End Game came out, he invited all of us to go watch it in theaters and paid for all of our tickets, too. He never talked about work, unless it was for a joke. You can be friends with coworkers and bosses/managers, it's not weird, in fact, you'll enjoy work more by enjoying working with them.",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.6166666666666667
        },
        {
            "comment_id": "hilclok",
            "body": "As a supervisor in IT, I would only call someone on my team after hours if:\n\n1. There was an actual emergency/outage situation\n2. The current on-call was unable to resolve it on their own\n3. My team member's specific skill set is required to fix the issue.\n\nThey're all salaried, with a clear understanding that we may need to reach them in an emergency.  I also make sure to provide them with 1:1 comp time for any off-hours worked.  \n\nI do get on their case if I notice they haven't scheduled their comp time, as well.  I know having to work off hours sucks, and want to make sure they are taking their time back.",
            "polarity": 0.0818181818181818,
            "subjectivity": 0.5078282828282827
        },
        {
            "comment_id": "hilcjma",
            "body": "if i do its because i am sending memes or songs nothing work related",
            "polarity": 0.0,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hilcbkd",
            "body": "Can I message them if I'm looking for a buddy to brew beer with...?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilbrbf",
            "body": "When I think of random shit that I need to ask someone, I schedule a text to send to them at the start of the next working day.  That way I don't forget whatever it was and I also am not bugging them when they are not on the clock.",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hilb757",
            "body": "So, if there’s an emergency at work or something that would require your employees to NOT come in, we should wait until they show up for their shift before telling them. Great tip. Lots of common sense there.",
            "polarity": 0.25,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hiladni",
            "body": "What if I message them off hours on Teams and I say \"when you get in tomorrow\"? Then, if they respond off hours I teach them to turn on down time so they only get notifications during business hours? That okay?",
            "polarity": 0.11481481481481481,
            "subjectivity": 0.5962962962962963
        },
        {
            "comment_id": "hila8vx",
            "body": "If I ever contact my staff members outside their working hours, I make sure they are compensated for literally every minute we are speaking, and then I add some time on top of that for the disruption. \n\nBut no, it's not realistic in a modern tech job to be completely unreachable during unscheduled hours, particularly when we're dealing with project leads and time-sensitive deployments. Sorry. Not the same environment as a restaurant.",
            "polarity": 0.09814814814814816,
            "subjectivity": 0.4367283950617284
        },
        {
            "comment_id": "hil9qix",
            "body": "And don’t you fucking *dare* send pictures of trivial shit at 5’o clock in the middle of their one day off after working 80 hours a week. Fall right off a fucking cliff you garbage person. Yeah, I’m talking to you Eric.\n\nWhew, sorry about that.",
            "polarity": -0.26904761904761904,
            "subjectivity": 0.655952380952381
        },
        {
            "comment_id": "hil9dcy",
            "body": "Come work in home care as a CNA/Nurse….you can work all the hours you want and be called all the time! I went 21 days straight last month without a day off and then finally got one day off of work the next day was filled up with work related things. I’m a manager but still back when I was an hourly employee same thing. 🤦",
            "polarity": 0.07500000000000001,
            "subjectivity": 0.3614583333333333
        },
        {
            "comment_id": "hil970r",
            "body": "I once had a manager text me to ask if I knew where the lightbulbs were kept.  I did, but I told them no.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil8r42",
            "body": "As a former soldier LMAO",
            "polarity": 0.3,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil8ij1",
            "body": "Well shit, how do my staff and I share our kitty pics then?!\n\nSeriously though, we all get along well and every one of us has a torbie kitty and we group chat the prime cozy stripey girlkitty  pictures. (It’s retail and therefore it’s very rare I need to ask work related things outside of work, unless someone took some keys home, BROOKS.)",
            "polarity": -0.06555555555555553,
            "subjectivity": 0.611111111111111
        },
        {
            "comment_id": "hil7t2z",
            "body": "I have a job that requires me to be “on call” 7 days per week and 24 hours per day with a response time of less than 10 minutes. My boss tries to justify this by saying we have flexibility with our schedules and can pick when we start or end the day. However, what I am expected to do in a day does not allow “flexibility”. My Monday admin day which he calls a day to relax because I’m not on the road requires me sending long emails/reports that half the people I’m writing them to don’t even look at. I’m literally working nonstop 9am-7pm without lunch while responding to other “urgent” calls. I enjoy my job but the culture of my team is toxic and it definitely comes from the top.",
            "polarity": 0.021296296296296296,
            "subjectivity": 0.36759259259259264
        },
        {
            "comment_id": "hil7mgp",
            "body": "Also if you’re employee exhaust every resource before you call your manager on vacation (unless they do it to you)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil7l98",
            "body": "A sternly phrased in person Do Not Do That was sufficient for my purposes. During work hours of course.  One must be courteous.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hil7dg6",
            "body": "Welp...production servers are shitting the bed, website is down, company is hemorrhaging money, and the executives are apoplectic. But the guy from Reddit says I shouldn't contact any of my staff.  Oh well. We had a good run.",
            "polarity": 0.2722222222222222,
            "subjectivity": 0.44444444444444453
        },
        {
            "comment_id": "hil79i3",
            "body": "I guess I don't really get this one in the context of overtime and calloffs. I sit my staff down when hired and tell them I'm probably going to ask at some point if they can come in due to calloffs but they're always free to say no or just block my number if they really don't want that. \n\nI have a lot of staff who are looking for overtime, Ive had many staff members sleep in and if I hadn't called they would have been pretty upset with themselves on how many hours/money they would have missed. \n\nObviously I'd love to plan these things in advance but most of the time it's on the fly.\n\nLike I said I never try to guilt anyone into overtime, they have no obligation to respond, but in a job where people are comfortable picking up overtime as they have the spoons for it, it seems like a disservice to the rest of the team to not at least ask around to potentially cover the workload of the calloffs.",
            "polarity": 0.2621031746031746,
            "subjectivity": 0.5759920634920636
        },
        {
            "comment_id": "hil71wc",
            "body": "#laughs in network/server admin",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil6t28",
            "body": "Or.. be like my old boss at schlotzky's.  Get fired because you're too good of friends with the employees, then when you're fired, get caught removing a childs bikini from your office desk as you clean it out.\n\nBTW... it was his daughters, but our shock was immediate and everyone just assumed.",
            "polarity": 0.38888888888888884,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil6lny",
            "body": "That's a ridiculous statement. It might apply to like mcdonalds workers, but it doesn't apply to professional with salaried jobs. Obviously you should try to give them a headsup that you may  need them, but catagorically saying never contact them is absurd.",
            "polarity": -0.18333333333333332,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hil6es3",
            "body": "I'd add that \"on call\" should be paid the entire time they're on call. Cant do anything with your family or friends or drink cuz you might need to be in randomly. Fuck that",
            "polarity": -0.2,
            "subjectivity": 0.6125
        },
        {
            "comment_id": "hil6e3g",
            "body": "This is why The Right to Disconnect law is spreading to different countries.",
            "polarity": 0.14285714285714285,
            "subjectivity": 0.5678571428571428
        },
        {
            "comment_id": "hil646g",
            "body": "LPT: NEVER TAKE ADVICE FROM r/LifeProTips",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil5w4g",
            "body": "If you're a manager in IT, following this LPT is a great way to start applying for unemployment.",
            "polarity": 0.4,
            "subjectivity": 0.425
        },
        {
            "comment_id": "hil5s94",
            "body": "I used to have a manager do this. The thing that really infuriated me was there was usually no urgency about why they were contacting me and my shift was an early one starting at 4am and ending around 12/1pm. Whereas they worked a standard day ending around 6pm\nShe thought nothing of calling me around 6:30pm for whatever reason. It never occurred to her that because of my early shift it was the equivalent to calling a 9 to 5 worker at like 11pm at night. \nI would be trying to wind down and get ready for bed and suddenly have to have an in depth conversation about work.\nI think contacting en employee within an hour before or after their shift is fine if something can’t wait until they are in the workplace but anything outside of that is crossing the line. And texts or emails are far better than a phone call so the receiver can respond in their own time.",
            "polarity": 0.15615079365079368,
            "subjectivity": 0.39206349206349206
        },
        {
            "comment_id": "hil5nrp",
            "body": "Had to block two managers at my job only on weekends cuz of this",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hil5eb7",
            "body": "Manager here. \n\nI message my employees to let them know that they can wear jeans tomorrow, or don’t forget to wear a costume for Halloween (because we usually win a store lunch from corporate if we all participate) or stuff like that. Or if I’m on my day off and need to know something about a customer or if they need my help with something (I don’t mind, plus I’m salary). Or sometimes if someone is late I’ll check in via a cell call or text. I don’t ever message them outside working hours regarding work matters. So much like everything, it varies from person to person and situation to situation. I know my employees hang out together after hours (which is fine, and totally acceptable per company policy, it’s me who can’t fraternize with them), and they have their various group threads and fantasy football whatnot.\n\nNot saying this is bad advice, but every place of employment is different. But a general rule of thumb is don’t ask someone to perform work when not on the clock, which can be something as simple as asking a question or following up on something.",
            "polarity": 0.035897435897435916,
            "subjectivity": 0.4018315018315018
        },
        {
            "comment_id": "hil57iw",
            "body": "Guy doesn't understand management.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil4t2n",
            "body": "LPT: stop being a capitalist.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil4r6x",
            "body": "So yeah, maybe for certain jobs. White collar professional gigs, manager will be calling and texting 24/7.  Sucks, but that’s the way it is.",
            "polarity": 0.0035714285714285726,
            "subjectivity": 0.24285714285714283
        },
        {
            "comment_id": "hil4n1a",
            "body": "I supervise a few people and if I need something from them when they’re off, I’ll ask them just like when I’m off and they ask me for something, I’ll help out.\n\nObviously there are limits to what we’ll do and what we’ll ask of each other but it really doesn’t bother me if they ask me for help",
            "polarity": -0.03125,
            "subjectivity": 0.29375
        },
        {
            "comment_id": "hil4d7j",
            "body": "Not always true.  I leave my people alone and straight up tell them I don’t care if they fuck off most of the day as long as their job is done.  When I need a 30 second answer outside of work hours, best be replying.",
            "polarity": 0.2,
            "subjectivity": 0.36249999999999993
        },
        {
            "comment_id": "hil49a1",
            "body": "No.  This is actually horrible advice.  \n\nIf you’re an exceptional manager, and have a high performing team, they will fully understand that communicating about outside of work hours  may be essential to the success of the business unit.\n\nNow, with that being said… the manager of the team needs to be very selective when they contact their team outside of business hours.  if it becomes a regular thing, happening every evening or weekend, then it becomes a problem.",
            "polarity": 0.0362962962962963,
            "subjectivity": 0.3685470085470085
        },
        {
            "comment_id": "hil4728",
            "body": "Lmao this ain't a tip why you telling me WHAT to do instead of an actual tip",
            "polarity": 0.3,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hil3ut8",
            "body": "I have the opposite problem, staff calling me when they are off the clock. They get paid for every call, the vast majority are justified but once in a while I get an unimportant one and have to jump out of bed for some bullshit.",
            "polarity": 0.0,
            "subjectivity": 0.7124999999999999
        },
        {
            "comment_id": "hil3tpx",
            "body": "I manage a small company and I contact the guys I work with regularly after hours. Strickly to mess with them or send memes, never work related.",
            "polarity": -0.10625,
            "subjectivity": 0.26298076923076924
        },
        {
            "comment_id": "hil3p6h",
            "body": "Managers do that to other managers too. My husband is constantly bombarded by emails and phone calls after 5. I have an urge to just put his phone on Do Not Disturb but his Dad has cancer and we can’t risk missing calls from his family.",
            "polarity": -0.10833333333333334,
            "subjectivity": 0.25277777777777777
        },
        {
            "comment_id": "hil3f09",
            "body": "I work with a bunch of tree nerds and we text each other about trees a not outside of work hours",
            "polarity": -0.0625,
            "subjectivity": 0.2125
        },
        {
            "comment_id": "hil38u0",
            "body": "I butt dialed one of my workers the other day and felt terrible about it.",
            "polarity": -0.5625,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hil35lz",
            "body": "My manager never does. She says I can message her when she's off, but I avoid it like the plague.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil33aq",
            "body": "I send messages to my team during different time of day, but told them, they can ignore and don't have to answer or read unless it would star with \"!!!URGENT!!!\". It's been more than a year now with these guys and I haven't used that urgency a single time. But since they work different shifts through the day I still text them whenever because it's just easier. However reading through this thread I'm not sure any more, perhaps it's not the best call and I'll need to think of a different solution. Any tips?",
            "polarity": 0.20982142857142858,
            "subjectivity": 0.5253968253968253
        },
        {
            "comment_id": "hil2zns",
            "body": "Or just preface it with “hey this is not urgent, just sending you a note for tomorrow because I have different work hours”. How fucking hard is that",
            "polarity": -0.14583333333333334,
            "subjectivity": 0.5708333333333333
        },
        {
            "comment_id": "hil2z55",
            "body": "And again, like every LPT on here, this only applies to entry-level positions.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hil2msa",
            "body": "Unpopular opinion but this just sounds like you hate your job. \n\nIMO, if you enjoy your job and the team you worth with, you won’t care about being contacted outside of work hours. What is a 5 - 10 minute phone call?",
            "polarity": -0.02500000000000001,
            "subjectivity": 0.3875
        },
        {
            "comment_id": "hil2lhc",
            "body": "In theory yeah, but there's a difference between a job and a career. A job? Nope don't message. A career? Yeah, you're always on the clock.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil2jh4",
            "body": "In modern countries it is even illegal.\n\nSimple as that. Problem solved.",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.38571428571428573
        },
        {
            "comment_id": "hil1z7y",
            "body": "Does not apply to managers that run a 24/7 company involving mostly independent contractors. The phone never stops ringing, unfortunately.",
            "polarity": -0.25,
            "subjectivity": 0.5625
        },
        {
            "comment_id": "hil15vv",
            "body": "Just wanted to add schedule sent email and slack are your friends. If you are a manager and have a deep after hours thought sending it for the start of the next day is the correct answer. I live by this rule - at least as much as I can.",
            "polarity": 0.007272727272727275,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hil0yy2",
            "body": "Unless it's a high stakes startup and Sht breaks at 2am. Yeah good luck lol",
            "polarity": 0.5533333333333333,
            "subjectivity": 0.6133333333333334
        },
        {
            "comment_id": "hil0jqx",
            "body": "I do call my folks if I need them. And by that I mean *need* them. So that means, people won't get paid this month, product is rotting on the dock, or we can't process orders. That's it. It's doesn't happen often and I pay double time from the second they answer the phone - minimum of 2 hours.",
            "polarity": -0.10416666666666667,
            "subjectivity": 0.22916666666666666
        },
        {
            "comment_id": "hil069o",
            "body": "This is a quaint piece of advice. I’m the president of a company that operates 24/7. I don’t call outside office hours, but when I do it’s an emergency.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikzu4d",
            "body": "I have my own business and in my sign off I say that - my work hours may be different than your work hours so please respond only during your typical work hours.",
            "polarity": 0.10833333333333334,
            "subjectivity": 0.775
        },
        {
            "comment_id": "hikyn57",
            "body": "I am a manger of a team of software developers and I make it a point to tell me people to remember work/life balance. Don't over work, don't stress, work will always be here tomorrow, so go enjoy life, family, hobbies and anything that is NOT work related.  \nIt makes for a happier employee, a happier team, and because of that work ethic is strong, output is amazing , and people are happy and love their job.\n\nThis is the way for me and my team.",
            "polarity": 0.45555555555555555,
            "subjectivity": 0.6888888888888888
        },
        {
            "comment_id": "hikymzt",
            "body": "My messages always starts with  I'm only writing this when you start your work day, it's not something you have do now. \n\nThis is because some of the people I work with are in different timezones. I can't delay deliver messages in our chat app, so I have to write and send it before hand since they start work 3 hours before I do. I'm like still in bed sleeping.",
            "polarity": 0.0,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hikylte",
            "body": "That’s kind of not possible?",
            "polarity": 0.3,
            "subjectivity": 0.95
        },
        {
            "comment_id": "hikyhtc",
            "body": "As a supervisor, I always tried to stay on a friendly basis with the people I supervised even going so far as to hang out with them outside of work. Never really had it bite me in the ass yet.",
            "polarity": 0.09375,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hikygtu",
            "body": "A few things: if hourly then it’s illegal, if salary then it’s bad form. I almost never do it, but if I do I say I am sorry for contacting you, but I need x, I have never had a problem because of it.",
            "polarity": -0.475,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "hikybu8",
            "body": "Two caveats to this in my experience. \n\n* Working rotating shift work (DuPont 12s) I routinely have to call people at all hours to fill in for callouts. I do my absolute best to make calls at the most reasonable hours we can afford, but generally I’m trying to help my 12h shift guys from working 24-36h due to call outs. \n\n* Second, with a very small number of employees that I’ve bonded with on hobbies reaching outside of work I get absolute and express permission to contact them from my personal phone. In these cases I have an extremely rigid no work rule that I expect to work both ways. \n\nFor example, one employee runs a charter fishing business on the side and when I contacted him outside of work I insisted to pay full price plus gratuities to the crew. When he brought up a work situation during casual boat chat I declined any continuance of the conversation and moved subjects to outside interests. \n\n\nI lived a number of years with zero work-life balance and now that I’ve found a career with that balance life is so much better. I do all I can to help anyone in my power to enjoy that same (sadly) rare pleasure.",
            "polarity": 0.13124999999999998,
            "subjectivity": 0.47433333333333333
        },
        {
            "comment_id": "hiky3p6",
            "body": "Well this is definitely true of some industries but not for all. For example I work in the music business. I get 90% of my job offers while I'm not at work.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.325
        },
        {
            "comment_id": "hikxy3s",
            "body": "This is another ridiculous LPT. If you're a manager you can certainly message and contact staff outwith working hours. What a ridiculous notion.\n\nThe issue is that some people don't know where the line is.\n\nIf you are passing information, sending texts/emails is fine. If you are looking for a reply you should always call and be prepared for a negative reply.\n\nLike everything there are fundamental approaches that should be taken. The idea that it's something you shouldn't ever do is ridiculous.",
            "polarity": -0.11150793650793649,
            "subjectivity": 0.7452380952380953
        },
        {
            "comment_id": "hikxh4r",
            "body": "i will fix this: don't message or contact your staff outside of working hours unless you pay them those minutes/hours.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikxfun",
            "body": "My manager and I used to text after hours. A year down the line we have been in a relationship for 3 years now lol",
            "polarity": 0.32222222222222224,
            "subjectivity": 0.49444444444444446
        },
        {
            "comment_id": "hikx79c",
            "body": "Well one of my employee’s car appears to be on fire, but I guess I can wait until their shift tomorrow to tell them",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikwznl",
            "body": "Fancy telling my Boss this? \n\nOh Sorry my bad I mean soon to be Ex-Bosses who shout at me for having a second phone as directed by Dr’s because I'm contacted outside of work for work shit.",
            "polarity": -0.2854166666666666,
            "subjectivity": 0.5340277777777778
        },
        {
            "comment_id": "hikwxvb",
            "body": "What if I still call work when I'm off?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikwwgs",
            "body": "Unless you pay your employees six figures or more. In that case, have employees in speed dial",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hikwsmg",
            "body": "God, this was me at Bath and Body Works.  It was fine if it was like, several hours in advance, or even a day in advance or something (my good manager was on the ball with that, I was usually first on the list 'cause I wanted hours).  But when our managers got switched, everything went to hell, and she'd contact me just barely two hours in advance, and I'd already be compromised and unable to come in.  Aside other factors, this wasn't worth the hell.\n\nAlthough I don't mind being contacted, it better be in advance.  It's one thing if it's an emergency, but if it isn't, I don't wanna know anything.",
            "polarity": 0.17685185185185187,
            "subjectivity": 0.33425925925925926
        },
        {
            "comment_id": "hikwqnj",
            "body": "It’s fine to message as long as there is no expectation of a response outside of work hours. People have different schedules, especially in a pandemic. Don’t call someone at 2am, but an email or slack message that they can get to when they feel like it with no expectation doesn’t hurt anything.",
            "polarity": 0.07333333333333333,
            "subjectivity": 0.51
        },
        {
            "comment_id": "hikwjji",
            "body": "I was gonna give the staff off this weekend, but alright. Thanks OP!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hikwa3k",
            "body": "These seems like a very narrow, job dependent tip",
            "polarity": -0.26,
            "subjectivity": 0.52
        },
        {
            "comment_id": "hikvval",
            "body": "Eh this is a bit impractical - making your employees aware that they have no obligation to contact you back outside of working hours is better for everyone involved.",
            "polarity": 0.1875,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hikvlen",
            "body": "But what if it's bake off day and you know they're watching and you really need to send them a relevant meme about Paul Hollywood?",
            "polarity": 0.30000000000000004,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hikvetg",
            "body": "Those managers also have managers. Good luck with that.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hikv7th",
            "body": "I’ve only done this once, some gal that I worked with left $8500 of salmon out of the fridge after the last thing I said before I left the door was “hey, the salmon is gonna be here in a couple hours, make sure it goes in the fridge as soon as it gets here.”\n\nThen she signed for it, and it sat out until I got back the next morning. I was so flabbergasted that something like that could even be done that I texted the next day without even thinking because I was just…. Like, speechless. \n\nI felt bad after for managing during her day off, but it was a very impressive mistake.",
            "polarity": 0.08000000000000002,
            "subjectivity": 0.3622222222222222
        },
        {
            "comment_id": "hikv5ua",
            "body": "I've made a point to do this last year even i got a managerial position and i love it. I'm being the boss i wish i had before. I even defend my team from other members when they want to contact my team during off hours.\n\nWe have to understand off hours are there for a reason, respect people's personal time.",
            "polarity": 0.09375,
            "subjectivity": 0.33541666666666664
        },
        {
            "comment_id": "hikv2lk",
            "body": "I disagree with this one too. Me a mid level guy, my boss and my crew beneath me are in a group chat and will orchestrate who’s bringing in what for our snacks and coffee. We also give each other heads up if we’re not going to be in especially during COVID.\n\nEdit: also if there is anything that was missed for the next day that needs to get done or important to note. \n\nI work in a high stress environment so communication is a must.",
            "polarity": 0.07250000000000001,
            "subjectivity": 0.48583333333333334
        },
        {
            "comment_id": "hikuvwy",
            "body": "Can't say I've ever understood why people even respond to work communications outside of work hours - just ignore them unless it's an emergency, problem solved!",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikum1s",
            "body": "No they can just you decide when to answer",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikubce",
            "body": "But working non-hours are the only time I'm awake!",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hiku6i1",
            "body": "Listen if you fuck up and it causes an outage I’m going call you and feel no guilt. I agree calling all the time for things that can wait is cruel. I’ve only had to do after hours calls 3 times in 10 years.",
            "polarity": -0.4666666666666666,
            "subjectivity": 0.8666666666666667
        },
        {
            "comment_id": "hiktnwr",
            "body": "So, if you don't need to work the next day they shouldn't call to let you know",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiktlpq",
            "body": "Tell me you’ve never worked a blue collar job without telling me you’ve never worked a blue collar job.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hiktkwu",
            "body": "Early on as a supervisor I would remember something and send an email, figuring they’ll see it when they get to work and address it then. When someone replied to me that night I started sending the email to myself as a reminder for the morning.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hiktd5l",
            "body": "Healthcare worker here, so 24/7 employer with legit emergencies.\n\nWe have a policy that we can ignore our managers when they call or text, but if they call twice and leave two messages, then it's probably something important and we should answer.\n\nRespect is key.  They respect us and encourage work life balance.  We answer when they call, if we're free.  Easy equation.",
            "polarity": 0.30833333333333335,
            "subjectivity": 0.9083333333333333
        },
        {
            "comment_id": "hiktbc9",
            "body": "LPT: most email services let you schedule mails. If you realize Friday night that you need to send a message that you'll probably forget about over the weekend you can still write it then but schedule for it to be sent 9am the coming Monday",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hikt6q2",
            "body": "Fucking for real though! My last job, I was stressed to the max doing 3 other people's jobs for almost a straight month. Working from 5am-11:00pm, and eating on the go just to keep up. After that I HAD to take a 5 day vacation to get my sanity back, which unltimately amounted to me sitting in my house most of my time off because I was mentally drained. I turned off my work phone and computer and these motherfuckers blow up my personal phone to tell me some dumb shit about work. Fuck those kinda people! That's why I don't work there anymore, it's like I was a machine to them and not a person",
            "polarity": -0.07916666666666666,
            "subjectivity": 0.40347222222222223
        },
        {
            "comment_id": "hikt0m3",
            "body": "Irina a small business and I call or message my employees whenever I want. \nThe whole culture of having to hate your boss is idiotic.",
            "polarity": -0.37916666666666665,
            "subjectivity": 0.6333333333333334
        },
        {
            "comment_id": "hiksu32",
            "body": "This isn't a life pro tip. Man this subreddit sucks now.",
            "polarity": -0.3,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hiksgg4",
            "body": "This lpt lacks a fundamental understanding of how many different types of jobs there are. Not every job is retail or dining.",
            "polarity": 0.25,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hiksb6f",
            "body": "But my manager plays Borderlands with my husband and I online... Is that still OK? Lol",
            "polarity": 0.65,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hikrwj9",
            "body": "\"What kind of beer are ye drinkin this evening? My chickens are hiding them eggs again! If you get on the whiskey, let somebody else drive.\" I only discuss these super important issues off the clock with my favorite employee.",
            "polarity": 0.39666666666666667,
            "subjectivity": 0.9133333333333333
        },
        {
            "comment_id": "hikrvtq",
            "body": "When i didn't have a family of my own, working overtime rocked.\n\nIt meant that i didn't have to sit alone in that forsaken chair in front on my forsaken computer.\nDoing something that actually helped someone in the day (elderly care) and coming home being tired, and not having to wrangle around in bed for 5 hours in the middle of the night was the best feeling ever.\n\n\nBut now i have a family, with a lovely fiance, and every hour at my job is grueling compared to cuddling with my fiance.\n\nAnd i have one of the slackest jobs around.",
            "polarity": 0.2833333333333333,
            "subjectivity": 0.47500000000000003
        },
        {
            "comment_id": "hikrqdo",
            "body": "I'm not a manager but that's terrible advice. Sometimes youre short staffed and usually when setting up job interviews employees are asked to fill out a time sheet saying whether or not they can do overtime if required or asked. If you gotta close up shop every time half your crew bails mostly because they are lazy than a lot of places would be shut down.\n\nI don't like to be called often but if I'm not busy I don't mind coming in to help fir a few hours or a full shift. Plus some people may want the extra money",
            "polarity": -0.11111111111111112,
            "subjectivity": 0.41414141414141414
        },
        {
            "comment_id": "hikrmov",
            "body": "I dunno if my manager hadn’t have messaged me on my day off I wouldn’t have known the roof had collapsed and we got three days off.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikre8u",
            "body": "But what if it's to let me know I've been exposed to Covid-19 and need to stay home the next day?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikr691",
            "body": "From the perspective of someone that has been in management for a long time, absolutely, don’t do this to your staff.\n\nConversely, if I’m respectful of your off time, be respectful of mine. Don’t call me at 11pm on a Saturday asking me where your business cards are that you just asked for at 4:59 on Friday. We’re probably out getting twisted and clapping cheeks just like you. \n\nThe exception is of course emergencies. Shit happens and everyone (management especially) need to understand that.",
            "polarity": 0.06428571428571427,
            "subjectivity": 0.7857142857142857
        },
        {
            "comment_id": "hikr1tf",
            "body": "Message -- I'm ok. Leave the message there, I will read it first thing in the morning. Same with VM. \n\nCall? No problem -- it goes to my VM. See above.",
            "polarity": 0.1875,
            "subjectivity": 0.26458333333333334
        },
        {
            "comment_id": "hikqv5u",
            "body": "Because if you are working for a sole proprietorship, and that person contacts the owner with a complaint, you have just cost them their job.",
            "polarity": -0.15,
            "subjectivity": 0.225
        },
        {
            "comment_id": "hikqu2j",
            "body": "aw cmon, if i'm texting my staff its entirely social. The last thing i sent to one of my employees was a picture of my alcohol glass collection. you just have to remember to separate work from life. my employees are people, it's important to establish a rapport, and that kind of requires proving you yourself are a human and not a managementbot.",
            "polarity": 0.20666666666666664,
            "subjectivity": 0.42666666666666664
        },
        {
            "comment_id": "hikqp2i",
            "body": "Was in the military. Hated it when it happened. Became leader, never did it unless absolutely necessary. Don’t have a cot darn meeting when it coulda been an email.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hikqdda",
            "body": "My manager texts me kind of frequently. It’s quite annoying especially since it’s all really bad jokes. It doesn’t help that I try to one up him with worse jokes. We have a great relationship",
            "polarity": -0.05714285714285713,
            "subjectivity": 0.7309523809523809
        },
        {
            "comment_id": "hikpf5s",
            "body": "\"Why didn't anyone tell me the water lines busted and we were shut for the day?\"\n\n\n\n\n\n\"I was told it was a bad management practice to contact my staff outside of their scheduled hours. Sorry about the wasted hour long drive, but at least you got to spend your day off without your phone vibrating once. See you next Wednesday! Maybe! \"",
            "polarity": -0.24999999999999997,
            "subjectivity": 0.3595238095238095
        },
        {
            "comment_id": "hiknpaw",
            "body": "There are exceptions to this.\n\nLike asking me to cover for someone.  But dont give me static if I say no.  And i dont need to give you a reason why either.",
            "polarity": 0.5,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hiknkto",
            "body": "There’s rare exceptions that benefit the employee.  Last year our staffing needs were maybe 30% of normal but leadership new if they cut our hours/pay they would lose all of us and that business would go back to normal eventually.  Trying to restaff 50+ people when trainees are largely trained by experienced employees would be impossible.  \n\nSo we got paid leave days to not come in and were more or less put on different schedules so if a handful of us got sick the majority hopefully wouldn’t be.  Our management would occasionally call us and tell us not to come in on a scheduled work day.  We still got paid so that was a perfectly acceptable reason to call since it’s a bonus day off.",
            "polarity": 0.11353535353535354,
            "subjectivity": 0.5465728715728716
        },
        {
            "comment_id": "hikmvc2",
            "body": "I'm an assistant manager and I said my employees memes off the clock, is this acceptable? Srs question.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikmhts",
            "body": "If I were to become a manager how would I ask if someone could cover for an unexpected call out?",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hikm01g",
            "body": "Sigh…I hate things like this…shows a total lack of connect with reality…\n\nI’m a manager…an employee of mine had a family member die last week…wanted the day of service off, but work the rest of the week…\n\n10 minutes before I leave for the week and need next weeks schedule done, I haven’t heard from him…\n\nYour suggestion is to not schedule them at all, or potentially schedule them for the service…\n\nThose of us in the real world know shooting him a text asking what day he needed off was the proper thing to do…",
            "polarity": -0.08571428571428573,
            "subjectivity": 0.44523809523809527
        },
        {
            "comment_id": "hiklw60",
            "body": "I think there are tons of situations u need to contact ur managers outside of work lol..",
            "polarity": 0.4,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hiklqgq",
            "body": "my boss pays me a stipend so we can communicate outside work hours. i find it fair",
            "polarity": 0.35,
            "subjectivity": 0.47500000000000003
        },
        {
            "comment_id": "hiklnn0",
            "body": "I legit had to tell my supervisor to stop texting me about things outside of work unless it’s an emergency. \n\nThankfully, my request was actually listened to. If it wasn’t, oh man. My mood would’ve been killed instantly no matter what I was doing if I got work texts outside of work.",
            "polarity": -0.04,
            "subjectivity": 0.17333333333333334
        },
        {
            "comment_id": "hikl4ng",
            "body": "While I agree, the kind of managers who do this would never listen to this advice.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikl29x",
            "body": "Depends on the relationship with the employees and the period of time off/on.  \n\nWe do shift work (week on/week off) and occasionally need small bits of info from someone on their time off (where is this tool, have you guys ever seen this issue with such and such equipment)  \n\nOff shift crew are more than happy to provide bits of info or assistance here and there because they can do the same when we are off shift.  Helps make everyone's job easier.",
            "polarity": 0.15,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hikksy1",
            "body": "This isn't an LPT. I've had to contact employees many times after hours, on weekends and holidays, and even on their PTO for vital information and assistance. I let them know up front this will happen, I compensate them for at least their time if not extra, and if nobody else can feasibly go in, I get my ass up and go handle the issue. If you're employees feel like they have to bend over everytime you contact them, you're not managing anything and do not deserve the title nor salary.",
            "polarity": 0.075,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment_id": "hikki1c",
            "body": "I never answer that shit. Ever and if they make me I’ll say I’m drunk.",
            "polarity": -0.35,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikjeca",
            "body": "My current manager sometimes texts me privately to ask if I might be available to pick up a shift, but she isn't pushy about it at all. Never bothered me",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.39166666666666666
        },
        {
            "comment_id": "hikj1h9",
            "body": "I have the opposite problem. My staff are always teams messaging me outside of working hours since they are OT eligible.",
            "polarity": 0.0,
            "subjectivity": 0.025
        },
        {
            "comment_id": "hikixfe",
            "body": "Sounds like we need to learn how to manage our time better. Using the time we are actually paid lol",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.4333333333333333
        },
        {
            "comment_id": "hikisuq",
            "body": "Dang even if I wanna hang with one of them?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikin73",
            "body": "My wife's employer couldn't survive if he did this.  2-3 hours after she came out of surgery for an on-the-job injury guess who was on the phone asking her for help?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikih3l",
            "body": "I think it was an NPR radio story I heard a long time ago about people complaining about this and the growing concept of the right to not be contacted. If you’re off the clock, then your not getting paid and shouldn’t be doing work related things. That’s wage theft, right?",
            "polarity": 0.13035714285714284,
            "subjectivity": 0.46785714285714286
        },
        {
            "comment_id": "hikifqk",
            "body": "What if you wanna hang out with them?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiki02x",
            "body": "Isn't this what emails are for? You can contact people whenever you want, but don't expect an immediate answer.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikhssy",
            "body": "I worked in an department where many of my colleagues and my boss would communicate after work hours via email. I would always miss these because I had a busy long commute and little kids. I was exhausted. Not once was I ever expected to answer those emails or know what was going on. Thank goodness!!",
            "polarity": -0.032291666666666684,
            "subjectivity": 0.46666666666666673
        },
        {
            "comment_id": "hikho1q",
            "body": "Yeah, and what's up with people who have groups on messenger and whatsapp. There have been times where what's discussed in the thread was screenshot and repeated. Keep things separate you'll thank yourself later.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikhmc9",
            "body": "CEO here.  My email footer says \"My working hours may not be your working hours.  Please don't feel obligated to reply outside of your normal work schedule. And I mean it.  (I do try to use scheduled delay but sometimes I reply to a group email that includes external people and I want them to know I'm doing it after hours so they feel special.)",
            "polarity": 0.03892857142857143,
            "subjectivity": 0.4117857142857143
        },
        {
            "comment_id": "hikhjl8",
            "body": "All my guys are salary,  but I never email them off hours.\n\nI’ll write plenty of emails at odd hours,  but I time delay them to go out the next workday morning.\n\nIf I’m calling after hours,  it’s an emergency.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hikhgd7",
            "body": "The only time I reached out to my employees after hours was that “the snow is coming down too hard, please stay home and stay safe”",
            "polarity": 0.013194444444444425,
            "subjectivity": 0.5826388888888889
        },
        {
            "comment_id": "hikgyb7",
            "body": "what world do you live in cause it sure as heck ain't dystopian corporate hellhole usa",
            "polarity": 0.21212121212121213,
            "subjectivity": 0.46296296296296297
        },
        {
            "comment_id": "hikgd7e",
            "body": "Unless it is to inform them that the office is closed due to inclement weather and they should stay home.",
            "polarity": -0.1125,
            "subjectivity": 0.2375
        },
        {
            "comment_id": "hikg4sa",
            "body": "Unless the information you need to share is timely, benefits them, or is information needed for their next shift. And then make sure they get paid for any time they spend communicating with you.",
            "polarity": 0.25,
            "subjectivity": 0.4444444444444444
        },
        {
            "comment_id": "hikfwiq",
            "body": "My manager had sent me messages outside of working hours before and when I replied, also outside of working hours, they commented that they “didn’t expect me to answer them outside of work hours”. But why send the message at all?",
            "polarity": 0.0,
            "subjectivity": 0.05000000000000001
        },
        {
            "comment_id": "hikfve1",
            "body": "This is so absolute. I think a better tip would be for managers to be conscious about the behaviours they are role modelling. If as a manager it suits your lifestyle to send emails outside of core hours, make sure you let your staff know you don't expect them to do the same.  That way every gets to work how they want without any risk of misunderstanding.\n\nAll that being said our success as a species is built in part on people working \"too hard\" so maybe lets not try to discourage that too much.",
            "polarity": 0.16759259259259257,
            "subjectivity": 0.41172839506172837
        },
        {
            "comment_id": "hikfnsb",
            "body": "Nice try, Darren. I need you to come in tomorrow.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hikflcb",
            "body": "LPT: If you are ever an employee, do not for any reason short of a loaded gun to your head give your manager your personal phone number.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hikeyow",
            "body": "Thats a fine piece of advice. Bit as someone who manages an accounting team with sudden deadlines its a fairytale unfortunatly. You can so your best to do limit it as much as possible and be as flexible during working hours with your team regarding time off, remote working, etc.",
            "polarity": 0.2633333333333333,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hiket8y",
            "body": "My boss does this shit daily.",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hikedz5",
            "body": "The mark of a terrible or inexperienced manager. The two manager that did this are by far the worst mangers I've ever had. 🚩🚩🚩🚩🚩🚩🚩🚩",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hikebn3",
            "body": "I had a helicopter manager some years ago. She would not only ping people in weekends but would send a constant stream of rants at people if they don't meet her expectations at something she's checking at the moment.\n\nThe moment she left, we all felt a huge burden lifted and people actually sprang to life.",
            "polarity": 0.08000000000000002,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "hikdj0g",
            "body": " Don't ever, for any reason, do anything to anyone for any reason ever, no matter what, no matter where, or who, or who you are with, or where you are going, or where you've been... ever, for any reason whatsoever...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikdh63",
            "body": "Isn't it illegal? At least in advanced countries it is.",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hikce1r",
            "body": "I'm a manager and I only contact people outside of working hours for work related items if it's critical. Most of the people who work for me are salaried and work from home, so they know this comes with the territory. But I keep it very rare. \n\nOn the other hand, I'm good friends with many of the people who work for me, so I'm talking to them all the time about BBQs, playing pool, meeting for family dinners, and other stuff.",
            "polarity": 0.184,
            "subjectivity": 0.5599999999999999
        },
        {
            "comment_id": "hikcbbo",
            "body": "The one time I didn't mind getting contacted by my boss after hours went along these lines: \"Yea, so sorry to bother you but that storm last night took the roof with it. We will try to reopen next week\" \n\nBout the only caveat that's acceptable I think lol",
            "polarity": 0.06000000000000001,
            "subjectivity": 0.5533333333333333
        },
        {
            "comment_id": "hikca9i",
            "body": "There's a law that states anytime you go in to work you get a minimum 4 hours overtime when it'd not your normal working hours. That's due to employment in Ontario I don't know about other countries though.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "comment_id": "hikca6v",
            "body": "Sometimes you have to contact people to ask them to pick up a shift for a no call no show or last minute call in, but TAKE NO FOR AN ANSWER. Stop trying to guilt and passive aggressively threaten people into coming in. Hugest pet peeve. Makes me instantly hate a job. I'll pick up a shift as a favor to you if I can, but if I can't, I can't.",
            "polarity": -0.4,
            "subjectivity": 0.48333333333333334
        },
        {
            "comment_id": "hikbx7i",
            "body": "Yeah and same goes for employees",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hikbw0u",
            "body": "It really depends on the type of job you have and the reason for contact. Maybe I’m just lucky that my higher ups understand what’s actually an emergency and what’s not. I’ve never gotten a 3am call on a Saturday because someone found a typo in one of our applications. I’m sure those kind of people exist though",
            "polarity": 0.3138888888888889,
            "subjectivity": 0.5703703703703703
        },
        {
            "comment_id": "hikbg05",
            "body": "I get this from corporate but I can give two shits in my three man shop if my boss texts me about stuff. Half the time it’s about steaks. Sometimes work, I don’t mind",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.08333333333333333
        },
        {
            "comment_id": "hikb8rm",
            "body": "If you have to, you should put at the end “I am emailing after work hours, I do not expect you to take action until next working day”",
            "polarity": 0.05,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikb8hd",
            "body": "I don't know, I think if there's a blowout in one of Randall's wells then maybe I should call Randall to let him know instead of waiting until the next morning.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikb075",
            "body": "I worked as a Linux system administrator and database administrator for a company that provided services to cell phone companies. Services like web browsing, voice mail,  pretty much anything except voice traffic. We connected to the carrier's network and had racks of servers and storage that did the magic. \n\nOne night my boss called and said, \"I need your help.\" I answered with, \"I'm not on call.\" Then he went on to explain that we had been contacted by the US Marshall Service and they needed our help tracking down a fugitive who had already killed two police officers. That got my attention. \n\nI got the Marshalls on the phone and gathered the information I needed. When I found this bozo's social media post saying \"I'm on the run\", I realized we weren't dealing with a vast intellect. I provided the Marshall with the information he needed to locate the guy's phone (after seeing the court order) and they basically knocked on his door and took him into custody. \n\nSince then I have assisted law enforcement around the country in tracking down everything from lost children to serial rapists. These are things I didn't mind being called for any time.\n\nI have a particular set of skills 😉",
            "polarity": 0.07098765432098764,
            "subjectivity": 0.46419753086419757
        },
        {
            "comment_id": "hikas1v",
            "body": "Guys. There is this app, called Call Control. You can block a number and that number can't even leave a voice mail.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikajk2",
            "body": "Don't work in IT.😅",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikaj8g",
            "body": "This is very job dependent. Working in retail, my manager might ask me to work a certain day or to fill us in on something. It's literally 10 seconds and I move on with my day. Sometimes they can't wait for me to be in again just to ask me something. This might apply more for corporate jobs",
            "polarity": 0.22857142857142856,
            "subjectivity": 0.34285714285714286
        },
        {
            "comment_id": "hikaip6",
            "body": "I regularly message my associates outside of work, but usually to check up on them if they've called in sick or if they have any (work) anniversaries or birthdays but are not in. \nI don't think it's being annoying to them, I like to think that it's a nice gesture.",
            "polarity": -0.19404761904761902,
            "subjectivity": 0.5223443223443224
        },
        {
            "comment_id": "hika634",
            "body": "A Staples manager once called me at 3 am to see if I could cover for the opener that day. I had an exam at 9am.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hika44x",
            "body": "Sometimes shit needs to get done at 8 pm, depends on the field, but this should be communicated to you from the outset",
            "polarity": -0.2,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hik9znc",
            "body": "How about we just keep it simple and say \"don't work outside of working hours\" I feel like a lot of people need to hear that",
            "polarity": 0.0,
            "subjectivity": 0.20357142857142857
        },
        {
            "comment_id": "hik9gir",
            "body": "Yeah there a lot of jobs where this is necessary.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hik98ne",
            "body": "I would only contact employees when shift coverage issues arose and I would try to start with those who expressed that they wanted more hours. I know personally I would hate ever getting bothered on my day off for things that absolutely could wait until the next day.",
            "polarity": -0.016666666666666673,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hik94xp",
            "body": "I message them when I want.  They answer when they're at work.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik93p0",
            "body": "Not really realistic for most jobs i have worked. Sometimes i need information like \"Hey change of plans, meet at X jobsite on monday.\" Nice to know that beforehand.",
            "polarity": 0.33888888888888885,
            "subjectivity": 0.611111111111111
        },
        {
            "comment_id": "hik92rl",
            "body": "I'd just gotten married. My new boss, fresh out of Stanford MBA via way of a summer on Wall St. with Morgan Stanley, wanted to have weekly status meetings with me and the two other people who reported to him. \n\nAt his apartment. \n\nOn Sunday.",
            "polarity": 0.14034090909090907,
            "subjectivity": 0.39488636363636365
        },
        {
            "comment_id": "hik91o6",
            "body": "my manager profusely apologizes if i'm contacted outside of work hours, and i do the same to my reports. luckily this is very rare. maybe once a year kinda thing",
            "polarity": 0.18083333333333335,
            "subjectivity": 0.5020833333333333
        },
        {
            "comment_id": "hik8k4a",
            "body": "Same thing with employees messaging the manager to complain about another employee after hours which happened at my workplace.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hik8dab",
            "body": "Depends on level a pay.  If you're critical to the business operation and have a good salary you should be accessible outside of work hours.",
            "polarity": 0.26875,
            "subjectivity": 0.45625000000000004
        },
        {
            "comment_id": "hik8cmq",
            "body": "I'd like this to go both ways. Kind of sick of getting phone calls and text messages at 12am or later. Send an email, I'll get to it when I'm on the clock.",
            "polarity": -0.038095238095238106,
            "subjectivity": 0.5857142857142857
        },
        {
            "comment_id": "hik86tt",
            "body": "THANK YOU. I’ll get emails for the boss and I’ll like tf are you bothering me on a Saturday",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik7nvo",
            "body": "Depending on the role of the position and importance of the field, this is sometimes impossible. I could see drawing this line for hourly employees, but if you're salaried, \"overtime\" is sometimes just part of the job.\n\nThat said, it is important to put that in the position description, and when hiring, I will be clear that for important circumstances, we'll need to reach you after hours.",
            "polarity": 0.05833333333333336,
            "subjectivity": 0.8458333333333333
        },
        {
            "comment_id": "hik7he5",
            "body": "Same goes for contacting a manager. I don’t want to hear from work on the weekend.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hik7ahn",
            "body": "As a manager, this works both ways.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik6sf6",
            "body": "I was a supervisor/manager for about 2 years and would always get info from our customers after hours involving sites we needed to visit. I had a very clear rule with my entire staff that I will email/text them after hours when as soon as I get the info, but they don't need to respond/act upon/ or even pretend it existed until the next day.\n\nThis made my life way easier than trying to remember to get all that info out the next day on-top of everything else and also helped my staff feel like they aren't expected to work after hours.\n\nI eventually left the job due to the stress of it but I think I did well as a few of my old employees still call me to go out for wings and beer lol.",
            "polarity": 0.06050000000000001,
            "subjectivity": 0.28983333333333333
        },
        {
            "comment_id": "hik6pu5",
            "body": "Or on our lunch break, please",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik6kqe",
            "body": "I think this depends on the job.  My boss can message me if needed and it’s perfectly fine.  We are just trying to make sure we get our projects done.  I’m not asked to put in extra hours but maybe I can help by answering a question or knowing what should be priority in the morning.",
            "polarity": 0.3055555555555556,
            "subjectivity": 0.4962962962962963
        },
        {
            "comment_id": "hik6i8f",
            "body": "Someone send this to my workplace please. \n\nWe get calls, texts, and I've even received Instagram DMs off hours about work.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik6atu",
            "body": "Has your manager been messaging you at home? I know that can be stressful Dm if you need someone to talk to!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik5p7n",
            "body": "My manager's manager was the one who hired me so he has my personal email address and whenever he sends me a message it goes there.  My heart sinks a little each time I see a message from him.  I've asked him to stop but apparently he doesn't know how to assign a different address to my contact.",
            "polarity": -0.0475,
            "subjectivity": 0.35
        },
        {
            "comment_id": "hik5mzw",
            "body": "Lead by example. Don’t work outside business hours. That’s bad management trying to force their bad habits into you.",
            "polarity": -0.46666666666666656,
            "subjectivity": 0.4611111111111111
        },
        {
            "comment_id": "hik5lih",
            "body": "This goes both ways",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik5k6d",
            "body": "Lol. My boss ONLY contacts me when I’m out of the office.",
            "polarity": 0.4,
            "subjectivity": 0.85
        },
        {
            "comment_id": "hik4thh",
            "body": "This! After years of getting work calls on my days off, I’m finally a manager. I never, ever contact my staff outside of working hours since I know how annoying it is. Managers seem to forget sometimes that their staff are people too. They have families and lives outside of work.",
            "polarity": -0.2,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik4nsq",
            "body": "I'm a manager, for the next week at least, and I have reached out to people to see if they want to cover a shift or something. I also have staff texting me at all hours telling me how their day off is going, what's happening in Pokemon Go, a million random, silly things.\n\nIt all just seems to have gone too damn far, honestly. For 5 years now I've been available 24/7, coming in to give someone a half-hour lunch, etc. Getting calls from other departments for something at 2 in the morning on a holiday, etc. All my days off spent catching up on paperwork because my direct boss won't respect that the paperwork takes hours and hours and fills my days up with random bullshit like showing me family photos and getting coffee and such. Of course if I try to text her about something critical at an off hour I won't hear until the next day if at all. A luxury she can afford because I'm the office idiot everyone reaches out to.\n\nSoon I'm taking a $10 an hour pay cut to work from home, a straight 40 hour work week and that's it. It's going to be marvelous to not be terrified every time I try to sleep about what terrible news I'll get in the middle of the night.\n\n24/7 availability is the most toxic shit in the world, it really is. \n\nI know I brought a lot of this on myself by sucking at setting boundaries, but going back to an hourly job is my version of doing that.",
            "polarity": -0.013541666666666662,
            "subjectivity": 0.5145833333333334
        },
        {
            "comment_id": "hik4nno",
            "body": "Call? Never call me honestly. But I don't mind a text to verify something. Or a small reminder. I get those sometimes.",
            "polarity": 0.175,
            "subjectivity": 0.65
        },
        {
            "comment_id": "hik4ilu",
            "body": "This was a huge reason for me leaving my other job. \nI used to work in healthcare and medical field which was almost a solid employment stability for me during the pandemic.  Im not a doctor or nurse, more of an administrator and have contact with patients and doctors all the times.\n\nThen we began doing covid contact tracing, and we almost had exposures every week- always after 4PM.\n\nI lost several holidays, days off, lost work hours because NO ONE was available to do the numerous tracing besides me a a small team.\n\nWhat broke the camels back, I was finally able to secure a day off and be with family who I already have a strained rel with due to me working several jobs and not being with them in milestone days or just everyday....\nThey (office) called me after hours- and I mean 7PM, and I told them I was out of town and cant do the emergency calls for them- they though can do it offsite. I literally have the director tell me \" Well this is important, you have to do it. \" \n\nI put in my resignation a week later and informed the \"unassuming HR\" in my exit interview how unfair we are to be expected to be on call even on our days off.\n\n\nI work now as a supervisor that sometimes I do need to call my employees after shift for a quick question that happened in thier shift when Im not there. Its my last resort if it is an emergency. I try to be a nice, polite and mindful as possible",
            "polarity": 0.08003472222222224,
            "subjectivity": 0.4595486111111111
        },
        {
            "comment_id": "hik4cux",
            "body": "If you're an employee, don't message or contact your manager outside of working hours, unless it's to call out of work.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hik3v5d",
            "body": "Advanced LPT: If you are ever a manager, you will be responsible for building a healthy rapport with your staff and cultivating an atmosphere of mutual trust and respect so that, if you absolutely have to reach out outside of work hours, there is a clear understanding that you wouldn't be doing so unless it was necessary and there is no pressure on the employee to satisfy your needs. \n\nFor example:\n\n\"Hey, I'm really sorry to bother you. We've had a few call-outs. Are you interested in any overtime?\"\n\n\"Sorry, boss. I can't.\"\n\n\"No problem, I'll see you Monday.\" \n\nThen, on Monday don't be a dick about it.",
            "polarity": 0.04090909090909092,
            "subjectivity": 0.5984848484848484
        },
        {
            "comment_id": "hik3ro6",
            "body": "Unless your staff is salary",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik3o8q",
            "body": "There are exceptions:\n\n\"Production outage, you're on call so need you engaged.\"\n\n\"Thanks for your hard work recently, wanna come in a couple hours late tomorrow?\"\n\n\"I apologize, last minute schedule change. Need you to head to X instead of Y in the morning.\"\n\nI think *actual* emergencies and scheduling inquiries which usually can't wait until the next day get a pass.\n\nA good manager will be able to tell the difference between something that can wait and cannot.",
            "polarity": 0.05583333333333333,
            "subjectivity": 0.32333333333333336
        },
        {
            "comment_id": "hik3lx8",
            "body": "I can understand paying someone for their time on the phone with you, but there are a lot, like thousands of jobs out there where people are in contact with their managers all the time about things. In healthcare I get calls or texts all the time regarding extra hours I can choose to pick up, ways to shift my hours around, or sometimes clarification regarding patient care I gave. The LPT should be more like: if you don't like getting calls about work outside of your work hours, be sure to apply for a job where they are always fully staffed and don't need you for anything other than showing up.",
            "polarity": 0.175,
            "subjectivity": 0.3827777777777778
        },
        {
            "comment_id": "hik3ezk",
            "body": "This isn't an LPT, this is just complaining about a boss you don't like.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik3924",
            "body": "My contract specifies that managers are allowed to call us in whenever they want. If we say no they punish us next time we’re in by giving us the graveyard tables",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik2x0v",
            "body": "Then how will my manager tell me about his new pokemon in Pogo?/s",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "comment_id": "hik2olg",
            "body": "Ehhhh. I've gotten plenty of overtime (optional and not mandatory obviously) because I was contacted outside of working hours. Depends on the person really, but personally I love making that money",
            "polarity": 0.175,
            "subjectivity": 0.3375
        },
        {
            "comment_id": "hik2nc9",
            "body": "Unless you’re replying to their communication that they are unable to work for some reason.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik2hns",
            "body": "I will tell you though that it is perfectly acceptable for a manager to tell his/her staff to contact them outside of office hours if the offices are closed or if there is a delay of some sort.",
            "polarity": 0.3,
            "subjectivity": 0.38333333333333336
        },
        {
            "comment_id": "hik2fye",
            "body": "I agree as the default rule, but I don't see a problem with a team or individual having specific rules around this.\n\nSo long as my manager is considerate to the fact of whatever I'm doing or if I don't respond, he can contact me whenever he wants.",
            "polarity": 0.037500000000000006,
            "subjectivity": 0.25625000000000003
        },
        {
            "comment_id": "hik27bk",
            "body": "My manager and I became best friends and talk to each other all the time outside of work, hell we even play D&amp;D together.",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.2416666666666667
        },
        {
            "comment_id": "hik203a",
            "body": "I’m currently in around 12 work WhatsApp groups for various different things, fucking thing pinging off all day long",
            "polarity": -0.13,
            "subjectivity": 0.5399999999999999
        },
        {
            "comment_id": "hik1xn9",
            "body": "As a manager I 100% agree with this. I try to give the other managers the guidance but they just can’t. lol",
            "polarity": 0.3375,
            "subjectivity": 0.5375
        },
        {
            "comment_id": "hik1ucn",
            "body": "Welcome to salaried/exempt! Your cubicle awaits…",
            "polarity": 1.0,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hik1ix9",
            "body": "I usually shoot my employees one text every two weeks with just the schedule.  The exception being is if someone called off for a shift I need to get covered I usually text them so they can ghost me if they prefer (which I don't mind, and never give them shit about it), answer that they can't do it, or pick up the shift if they want moneys. They don't seem to mind that.",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hik126n",
            "body": "Place I work for (hospo) has a group chat that's active pretty much all day long with expectations that if you're mentioned in a message you should respond. Fuck that noise - muted.",
            "polarity": -0.026666666666666672,
            "subjectivity": 0.56
        },
        {
            "comment_id": "hik10vs",
            "body": "I'm curious how this goes down.\n\nSay it's the weekend, you're phone indicates a work email or, maybe a slack message.  For me, I use outlook on my phone for work, and gmail for non-work, and slack is 100% work.  So if I get a notification from outlook or slack, I ignore it.\n\nAnd I get lots of them.  I could set it up to sleep those notifications, but I find it simpler just to clear them periodically if I don't need them.\n\nAre we talking about someone being super-compulsive and they feel they have to read and/or respond?  Or is it the notifications are annoying?",
            "polarity": -0.2388888888888889,
            "subjectivity": 0.6430555555555556
        },
        {
            "comment_id": "hik0xj9",
            "body": "Also, if you're an employee, do not let them force you to have work email on your phone or require you to reply to text/Slack/etc outside work hours.\n\nIf they want you to have mobile access to work email, they can give you a work phone for that...a work phone you then don't have to watch or respond to outside of the hours they pay you for.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hik0v62",
            "body": "The owner of my company will randomly message to check in or just say hi. \n\nThere was a bad storm that produced a tornado near my house. When the warning went off my wife joked that my boss was going to call. Sure enough a couple of hours later he texted to make sure we were ok.\n\nHe texted me at like 2 am after the Wilder Fury fight to ask what I thought. \n\nWe got a puppy about a year ago. He texted a couple of times a week for maybe a month and asked for puppy pics. He also insisted on paying his vet bill when he learned that we took the dog in due to bloody stools.\n\nIt's not just me either, but he keeps up with all of us. \n\nOne of the ladies in the office went into labor unexpectedly and the dude (literally) nearly fell over himself rushing out of the office to the hospital. She later told me that he gave her almost a year's worth of diapers from newborn all the way up to large sizes (sorry I don't remember how diapers are sized).\n\nI know he pays for one of my coworker's newspaper subscription just so that he can discuss the paper with him in the morning. \n\nHe's old and rather lonely. He really does think of his employees like family and doesn't hesitate to contact us outside of work. He has never brought up work outside of work though. He really is a solid dude.",
            "polarity": -0.005032467532467522,
            "subjectivity": 0.44763708513708517
        },
        {
            "comment_id": "hik0u9z",
            "body": "Honestly I would've loved it if my manager gave me a call before work telling me I would need snow boots and an extra jacket when coming in. I got cold those days. Real cold",
            "polarity": -0.040000000000000015,
            "subjectivity": 0.76
        },
        {
            "comment_id": "hik0tce",
            "body": "As a small business owner with 6 employees, of which I consider friends, this is blanket statement that certainly doesn't fit everyone's situation.",
            "polarity": 0.12142857142857144,
            "subjectivity": 0.45714285714285713
        },
        {
            "comment_id": "hik0jvx",
            "body": "Unless you're exempt salary, then you're expected to answer your phone 24x7 because overtime is already baked into your salary and comp package",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hik0htm",
            "body": "But they always be contacting the manager when they off work tho.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik0gfv",
            "body": "Eh. Too broad of a generalization. \n\nI work in software and one of the responsibilities is to be be on call on a rotation for 2 weeks at a time.",
            "polarity": 0.0625,
            "subjectivity": 0.3125
        },
        {
            "comment_id": "hik0e9t",
            "body": "Should they wait until you're at the office and clocked in to tell you not to come to work today due to broken pipes? There are so many valid reasons to contact someone outside of work hours, just don't expect them to respond. \n\nIf they need you to do something sure, wait until work hours. But if they're just providing valuable information to you, I would hope they contact me.",
            "polarity": 0.095,
            "subjectivity": 0.4427777777777777
        },
        {
            "comment_id": "hik0cat",
            "body": "Ha does it work both ways?!\n\nI am a manager and never off clock to my workers it seems.\n\nEven on maternity I has people messaging me!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hik07o5",
            "body": "I don’t know. I’ll message them (Teams or email - I won’t text them) if I’m working OT and need some info. Big however though, they all know they are under no obligation to respond. We’re all trying to get jobs done and sometimes that requires OT and sometimes you need outside input during typically non-work hours. They do it to me as well yet we all know you may or may not get a response. \n\nI think the difference is in the tone behind it. We’re (my team and I) all pretty ambitious and enjoy what we do. It’s never done with the tone of “I’m working so you should too.” It’s almost always, “Fuck, sorry, but do you have an installation detail for xyz at xyz client?”\n\nWe’re all grown ups with our own lives to live. Full stop. It’s just so happens that sometimes that life is at work when others aren’t.",
            "polarity": 0.0433080808080808,
            "subjectivity": 0.6041666666666666
        },
        {
            "comment_id": "hik04rl",
            "body": "How do you call people in then? \nMost stores wouldn't function.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hik0440",
            "body": "This is so true. It feels like there is so much that is done by managers, owners, etc in general without thinking that I make it a point not to do as a manager.",
            "polarity": 0.20000000000000004,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hijzutx",
            "body": "I've made clear to employees, if it's an email, it's not something they need to reply to until they're on the clock again (we work in multiple timezones). For the very occasional critical incident, I shoot a text and nobody is bothered because it's for the collective good of our team/company, just like I'm flexible if they have to deal with some home/life emergency during work hours. Reasonable should- and can- work both ways.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.42430555555555555
        },
        {
            "comment_id": "hijzlbs",
            "body": "What, are you saying my former boss calling me at 11:00 PM to tell me she just sent me an email and expects a response before midnight is somehow inappropriate? /s\n\nBeing salaried management isn't worth it.",
            "polarity": 0.15,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hijzjws",
            "body": "I hate this attitude. Managers should make it clear to staff that they're not obligated to respond to messages or emails outside their working hours - whatever said person's working hours are. One's working hours might not be the same as another's working hours, especially for parents or care givers. Rather than be prescriptive around when staff should or shouldn't send emails, managers should instead empower their staff to determine how/when they work and balance their work vs personal life.",
            "polarity": -0.11666666666666668,
            "subjectivity": 0.45972222222222214
        },
        {
            "comment_id": "hijz4cl",
            "body": "Caveat being, you compensate a monthly portion of their cell phone bill and explain to the employee that you will text or call them from time to time. I do this with all my supervisors. They each get $25 a month for the off chance they'll be contacted. Some of them haven't been texted or called in 2+ years, others get a text or call every other weekend. Just depends whats happening. Regular employees that aren't supervisors? Rarely if ever reach out to them, unless its asking them to pick up a shift for an emergency or something.",
            "polarity": 0.05833333333333333,
            "subjectivity": 0.45064102564102565
        },
        {
            "comment_id": "hijz29u",
            "body": "get back to work.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijyqcb",
            "body": "And don't be the co-worker that emails co-workers outside hours (yes, your 6:00am email made a notification sound and woke me the fuck up unnecessarily early and I can't get back to sleep)",
            "polarity": 0.02,
            "subjectivity": 0.27
        },
        {
            "comment_id": "hijy5tp",
            "body": "I feel like it’s heavily context based lol. \n\nAs someone who does wedding cakes, I feel like there’s a lot of reasons for people to call each other and check in on very specific details. \n\nIt’s not like you can postpone a wedding cake or wing it. \n\nThankfully, everyone’s really good about being a solid team. Generally speaking, we’re somewhat aware of when big or important projects are up, so we double check our details to prevent calling people, lol. But sometimes you never know. \n\nI’m not the manager, but I’ve always been open to work calls for details. Making sure someone’s special day is gonna go smoothly is more important than random 5 min of my time. \n\nBut I also enjoy my job, and I’m compensated well (you see the price of wedding cakes?)\n\nIf I was working a job I hated, or it wasn’t incredibly detail oriented — I’d probably screen all my calls",
            "polarity": 0.20629251700680273,
            "subjectivity": 0.5260865457294029
        },
        {
            "comment_id": "hijxuyi",
            "body": "Also, if you're at a Slack-heavy company, scheduled send gives you no reason to contact someone after hours outside of some crazy, actual, emergency. I'm assuming other workplace chat services have this too, but I've only used Slack.",
            "polarity": -0.145,
            "subjectivity": 0.485
        },
        {
            "comment_id": "hijx782",
            "body": "Yes, and the opposite as well. I don't need the \"Guess who was slacking off again today\" texts on my day off. I don't care, we'll deal with it tomorrow.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijx72p",
            "body": "You should be getting paid for this. If it happens a lot, keep track of it and put it on your timesheet. Your boss talking to you about work counts as work.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijx5b2",
            "body": "I think it all depends on what exactly your messaging about. I get a heads up when the schedule is changed or if I’d *like to* get some overtime.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "comment_id": "hijwt6n",
            "body": "unless you pay your staff six figures and everyone knows its mission critical systems.",
            "polarity": 0.0,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hijwkqa",
            "body": "Oh, I get constant reminders and phone calls when I'm not at work, but I suppose it comes naturally with the military.",
            "polarity": 0.0,
            "subjectivity": 0.2777777777777778
        },
        {
            "comment_id": "hijwkbb",
            "body": "I don’t answer my work phone when I’m not at work, my boss knows he won’t get a reply until the next day or Monday lmao like people will try an end around and text my personal number but I just tap into the text to get rid of the notification thing and tap out while not looking at my screen, I’m not getting paid for that",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment_id": "hijwe01",
            "body": "When they phone you on Friday night and then tell you it can wait until Monday so you spend the entire weekend stressing about it.",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hijw7ze",
            "body": "Unfortunately I didn't push back and accepted the fact that my Managing Director calls and speaks for hours outside working hours. Doesn't help that he is completely boring to speak to and has extremely bad communication skills as well (if it's ur first time speaking with him, you wouldn't understand half of what he's saying).\n\nWhat boils my blood is that he's the biggest time waster I know - calls for a 1 hour meeting and takes 3. Answers random calls during meetings. MAKES calls to follow up on other matters during meetings. Doesn't read email so he only keeps tabs and follows up verbally. Is completely impractical and \"self proclaimed perfectionist\" - an internal 1 page non-issue memo will take 7-10 revisions by him to approve when he changes NOTHING of essence multiple of times. \n\n\nHe once called me over and over while my wife was giving birth even after I notified him. Safe to say I'm actively working towards getting away from him after that.",
            "polarity": -0.15166666666666664,
            "subjectivity": 0.43944444444444447
        },
        {
            "comment_id": "hijw7c8",
            "body": "I send emails after work hours. I tend to work late and a lot. I’ve made it clear to my team I don’t expect them to respond after hours and I’m not sending it then because I require a response. I’m explicit with every email after hours usually “do not respond until tomorrow”.",
            "polarity": -0.024999999999999984,
            "subjectivity": 0.41111111111111115
        },
        {
            "comment_id": "hijw25i",
            "body": "How is that possible lol. A manager needs to call people to ask if they can cover a shift. Or when a new rota is published there needs to be a communication if published are good, you can't just wait until your shift to tell people what n what.",
            "polarity": 0.40909090909090906,
            "subjectivity": 0.6886363636363636
        },
        {
            "comment_id": "hijvy3f",
            "body": "There is one exception to this, I think: if said manager is sick or won't be in to work the next day.  I suppose an email would also suffice.",
            "polarity": -0.35714285714285715,
            "subjectivity": 0.42857142857142855
        },
        {
            "comment_id": "hijvvqa",
            "body": "I mean, feel free to send it. Just don't have any expectations that I'm going to read it",
            "polarity": 0.04375000000000001,
            "subjectivity": 0.74375
        },
        {
            "comment_id": "hijvvnq",
            "body": "I recently left a management position after 5 years.  There was a distinct generational divide on providing contact info.  Younger employees shared it unprompted.  Older employees needed a reason which happened for all over time.  I only ever checked up for personal reasons not job related.  I just thought it was strange as I am fiercely protective of my personal privacy from my employer.\n\nOne time I was walking out the door to go on vacation and told my boss “Call me if you need to.”  He casually responded “I’d rather set myself on fire.  Enjoy your vacation.”  I’d still be a manager if he hadn’t risen faster than me through the ranks.",
            "polarity": 0.028787878787878782,
            "subjectivity": 0.3772727272727273
        },
        {
            "comment_id": "hijvrhx",
            "body": "Interesting. Maybe the dynamic is different for interns. Ive managed a couple interns every year. I found I had a really good relationship and I'm still friends with them. We would play league or something.",
            "polarity": 0.3,
            "subjectivity": 0.4666666666666667
        },
        {
            "comment_id": "hijvr5p",
            "body": "This is dumb, what are business that have hourly workers supposed to do when someone calls off sick? What happens if there's not enough people to properly run the business for the day? Shut down?",
            "polarity": -0.248968253968254,
            "subjectivity": 0.4492063492063492
        },
        {
            "comment_id": "hijvi78",
            "body": "\"Why did we have to come into work to be told we are now working from home\"?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijvf6c",
            "body": "I would say this isn't 100% true\n\nI will contact my staff on rare occasions.  Mainly if they screw up their time sheet.  I did this today.  One team member messed up her time card and had already clicked out for the day.  When I saw it,  I gave her a quick ring so that we could walk through her correct sign in/ out times.  Time sheets have to be approved on Fridays so it was time sensitive\n\n\nEdit: I email my team all the time after hours,  but never expect a response and fuss if they are online late",
            "polarity": 0.15833333333333333,
            "subjectivity": 0.6472222222222223
        },
        {
            "comment_id": "hijvdr4",
            "body": "Idk... I send emails when I can.  I don't want my staff members to have their work email on their personal devices.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hijv6zu",
            "body": "Bruh why? The earlier they know the better right? If someone needs a shift covered Tuesday but it's the weekend, no one's waiting until Monday morning to check.",
            "polarity": 0.2619047619047619,
            "subjectivity": 0.5119047619047619
        },
        {
            "comment_id": "hijv2b9",
            "body": "This might have already been said and I missed it, but I feel like an acceptable exception would be something along the lines of \"Hey we're closed today because of (insert valid reason). Enjoy your day off!\"",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hijuj1e",
            "body": "Did this Sub change to SLPT??  \n\nGood luck on your career progression if you follow this advice (either as the person refusing to answer a call when \"off work\" or refusing to call someone who is \"off work\").",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "comment_id": "hijueq1",
            "body": "But my employees are my tools that I use to solve my problems!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiju9sm",
            "body": "I would take this one step further. I have chastised my people for responding to emails while on PTO. I was cc’ed on emails and responded only to them stating this was not an emergency, to stop responding and that I had it. \n\nProtect your people.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hiju6o6",
            "body": "&lt;checks his notes for communication after hours&gt;\n\nLaughing at memes\n\nThanking them \n\nFollowing up on personal issues / family events / whatever they have going on they needed time or help with. \n\nAm I doing this wrong? Lol",
            "polarity": 0.07500000000000001,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijtxht",
            "body": "I am being contacted almost every day by my manager. I use this opportunity to upset him every day. Little primer before work.\n\nHe is stressed. I'm not. He'll learn eventually. \n\nI love UK employment law.",
            "polarity": 0.15625,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hijttz1",
            "body": "How about if you manage a team they shouldn’t contact you outside of your working hours?\nGet so fed up with my team messaging/calling constantly",
            "polarity": 0.0,
            "subjectivity": 0.19166666666666665
        },
        {
            "comment_id": "hijtrny",
            "body": "These tips are getting less and less \"pro\" and more about etiquette...which is subjective.",
            "polarity": 0.05555555555555556,
            "subjectivity": 0.2111111111111111
        },
        {
            "comment_id": "hijtir7",
            "body": "Too right - I never do this. And I tell my team not to respond if other staff contact them outside our working hours, and if they do it more than a couple of times, they're to report it to me and I’ll put a stop to it. It’s not on. People’s free time is THEIR FREE TIME. Ugh. I fucking HATE being contacted out of hours. So yeah, the golden rule applies.",
            "polarity": 0.12008928571428573,
            "subjectivity": 0.5575892857142857
        },
        {
            "comment_id": "hijtdyo",
            "body": "You are 100% right, it’s not cool. My old boss pulled this shit all the time. After hours, weekends, even during planned vacations. He even asked more than one of us to return from vacation early on multiple occasions…for a 60 minute meeting that easily could’ve been an email.",
            "polarity": 0.13050595238095236,
            "subjectivity": 0.4773809523809524
        },
        {
            "comment_id": "hijt1g7",
            "body": "also causes them to PANIC when they see your name come up",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijt1dk",
            "body": "If you ABSOLUTELY have to. You need to apologies at the start of the message/call, at the end of the message/call and as soon as you see them face to face.",
            "polarity": 0.2,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hijsyt3",
            "body": "Looking at you, Matt.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijsy5t",
            "body": "They only reasons I didn't have issues with some management reaching out was because they didn't always work the same hours I did and they would send me praise for my good work I did. Sadly they retired and the job went to shit. Best job I ever had.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.6375000000000001
        },
        {
            "comment_id": "hijst5k",
            "body": "Lol ... If you work at Walmart maybe.  Some of us have jobs that require a little more effort.",
            "polarity": 0.37083333333333335,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "hijsrh7",
            "body": "Military culture is so much more different. Because rank/promotion change occurs very frequently in the military, people who were peers can become you supervisors and vice versa, but you will still spend a lot of time together out of work. To be fair, when you are stationed somewhere unfamiliar to you, your coworkers are some of the only people you will really develop those friendships/bonds with.",
            "polarity": 0.16624999999999998,
            "subjectivity": 0.47375
        },
        {
            "comment_id": "hijsj9h",
            "body": "Manager here.\n\nIf you're in charge of professionals, instill a culture of \"you don't need to reply until your office hours\" and \"always record these hours if you reply off hours, and leave early if youd like\"\n\nYou can let them choose to be available on their own time with charged hours, or not and be normal.",
            "polarity": 0.3125,
            "subjectivity": 0.5874999999999999
        },
        {
            "comment_id": "hijsi4s",
            "body": "Or shit breaks and the client calls and only they can handle it. There is processes for this and monetary, time, or public recognition after the fact.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.6222222222222222
        },
        {
            "comment_id": "hijse27",
            "body": "When I was a contractor to a specific government agency, my customer made it clear that the only calls or emails I was supposed to answer outside of working hours were those regarding our special on call list.  He was perturbed that I answered an email from him at like 11 PM local time (I was doing school work and needed the printer).  He would call specifically to leave voicemails or send emails during the evening where he was, which could be almost anywhere in the world.  But his expectation was that I should never bother with them outside of business hours.  Partly because he knew my company was horrible with overtime rules, and partly because he wanted us to have a real work life balance.  \n\nWe once had an actual emergency requiring a lot of really long days, and he spent hours harping on my companies management to make sure I would get overtime pay for the time I was putting in.",
            "polarity": 0.0005494505494505561,
            "subjectivity": 0.3822039072039072
        },
        {
            "comment_id": "hijs8dk",
            "body": "Pro-tip, if you're not paid to be on-call, and it's not a work phone you're paid to carry, wait until the next morning to reply.\n\nMy managers have been good about this, but I had to bludgeon my parents a bit.   They couldn't seem to grasp that **I** am paying for a phone so I reach make calls if **I** need to.   I'm under zero obligation to answer their calls.",
            "polarity": 0.35,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment_id": "hijs49f",
            "body": "Situational advise at best, if you're working at a shitty company, with shitty people this could apply. However if you have a decent team with a good manager, I don't see why this is an issue. \n\n&amp;#x200B;\n\nOur team even goes for beer nights and we all get along just fine.",
            "polarity": 0.5708333333333333,
            "subjectivity": 0.5166666666666666
        },
        {
            "comment_id": "hijrczc",
            "body": "Absolutely, beside being annoying you would also cover an organizational flaw which is on the long term worse.",
            "polarity": -0.26250000000000007,
            "subjectivity": 0.7000000000000001
        },
        {
            "comment_id": "hijr66z",
            "body": "Not sure if this is a life pro tip per say, but as a manager who occasionally works nights it's nice to hear. One tip that I've been leveraging lately: you can schedule slack messages to send the next weekday morning. That way there's no stress for your employees to respond right away but you can still fire and forget messages.",
            "polarity": 0.05595238095238095,
            "subjectivity": 0.5249338624338624
        },
        {
            "comment_id": "hijr15g",
            "body": "So if you manage a crew that works outside. And work got canceled that day due to weather or something, you shouldn’t tell your crew to not come in that day?",
            "polarity": -0.0625,
            "subjectivity": 0.2125
        },
        {
            "comment_id": "hijqxhq",
            "body": "As the manager, I try hard not to even with my supervisors. However, sometimes that can’t be avoided in priority situations..\n\nWhat surprises the shit out of me is that I explain to every single employee that their supervisors are hourly, while I am salary. This means they need to prioritize contacting me, not their supervisor, when their supervisor isn’t at work. Especially late at night or early in the morning. Hardly anyone follows this request and my supervisors never ask me to address it (even when I’m the one that brings it up and asks if they would like me to address it).\n\nYes, my supervisors are amazing people.",
            "polarity": -0.10782312925170065,
            "subjectivity": 0.6139455782312925
        },
        {
            "comment_id": "hijqpkc",
            "body": "I think the last time my current manager(s) contacted me outside of my working hours were at the beginning of Covid, and it was to tell me to stay home and not come into the office.\n\nBack when I worked security, management was calling me at all hours asking me if I wanted to work, or where was this or that, and even had the gall to call me in the middle of my vacation to demand my return to town so I could cover a shift.....",
            "polarity": 0.0,
            "subjectivity": 0.10333333333333335
        },
        {
            "comment_id": "hijqhcx",
            "body": "I had a scheduler/manager who would contact me sometimes 2 hours before a shift that needed covering. *Once* I messaged her out of working hours and she snidely told me not to ever bother her outside of working hours. Never covered a shift again, the bitch.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hijqgnm",
            "body": "This isn’t a life too it’s just bitching",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijqfyv",
            "body": "I'm a sales manager at a car dealership.  My staff loves when I contact them after hours.  I send them internet leads and they make lots of money.  Their eyes light up when they get one after hours!",
            "polarity": 0.5,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hijqdrs",
            "body": "That funny from my work place, when we change start times everyone wants a reminder since people often forget. I love the people who don't want texts then get mad they get in trouble for being late. You shouldn't do it unless the employee wants it.",
            "polarity": 0.0035714285714285665,
            "subjectivity": 0.5142857142857143
        },
        {
            "comment_id": "hijptug",
            "body": "If you can handle a work question anytime maybe it you who is the problem. Answering a question over the phone  isn't challenging or stressful. If someone working is struggling because of a piece of info i know i see no issue.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hijpay0",
            "body": "I'm a software manager who values his free time so I value my employees free time just as much. After 5:30? I'm not messaging you unless I'm forced to. You're on PTO? You better ignore any questions I send you until you're back. This week I had to call someone in for a meeting while they were on PTO regarding one of their projects, they attended 3 minutes of the meeting answered the questions I had prepared in advance, and I had them put they worked the whole hour. Team members free time is theirs to spend away from work. It shocks me when managers don't respect that.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.4625
        },
        {
            "comment_id": "hijp9an",
            "body": "You read my mind.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijp3ub",
            "body": "*Laughs in academia....*",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijotbf",
            "body": "It’s sad this has to be a LPT; this is basic human decency.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.4083333333333334
        },
        {
            "comment_id": "hijonju",
            "body": "Sometimes it has to be done, i dont call them just for fun.",
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hijo4ke",
            "body": "What if your asking one of them to cover a shift or something?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijo2vy",
            "body": "My manager only contacts me outside of work if I’m on, which he then asks why am I still on?",
            "polarity": 0.0,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hijo2td",
            "body": "Why the fuck would you answer the phone?",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hijnulg",
            "body": "As a teacher, I cannot agree more. There is absolutely nothing important that anyone needs to be emailing me about during weekends / half term/ summer holidays. If you decide to spend your time off marking work and building PowerPoints that's up to you, but don't be emailing me asking me to look or adapt schemes of work ASAP because your unorganised arse couldn't speak to me about it BEFORE being on my time.",
            "polarity": 0.23333333333333336,
            "subjectivity": 0.6416666666666666
        },
        {
            "comment_id": "hijnrvq",
            "body": "Are you sure?\n\nNumber of years back, we had a sewer disaster where I was working.  We had to close for the day.   Everyone was pissed we didn't call them early in the morning g before we were open. (6 am) and tell them not to come in ahead of time.",
            "polarity": 0.15,
            "subjectivity": 0.4222222222222222
        },
        {
            "comment_id": "hijnqtr",
            "body": "As a manager, please don’t message me on weekends either. Shit goes both ways.",
            "polarity": -0.2,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hijnlzj",
            "body": "I would just say to the OP, that there are exceptions to everything, and a lot of companies that I have been around will only do it if absolutely necessary.  You don't call for something that can wait until the next shift, but depending on the job and the problem, a call may be warranted.",
            "polarity": 0.0,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hijn9lx",
            "body": "If you think you'll forget to tell your staff something and you have Slack, use Slack's scheduled messaging to send it out on Monday morning instead.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijn8tt",
            "body": "As a manager at Kennedy Space Center I have to say this is 100% wrong. A lot of jobs are performed over multiple days by one person. If that person is not there I might have to call to find out where they are on the job so I can catch up whoever is taking over. Most people called in and left a message before I get there that they wouldn’t be in so I wouldn’t have a chance to question them. Reading other comments we also pay people a minimum of 4 hours OT if they have to come in off shift.",
            "polarity": -0.0375,
            "subjectivity": 0.3125
        },
        {
            "comment_id": "hijmuho",
            "body": "I did this once at the beginning of Covid in the US to give an employee with a strange schedule a chance to come get WFH hardware before the weekend when I doubted anyone would be in the office. I felt bad but all things considered they could have just ignored it and senior leadership wasn’t doing a great job at getting entry level employees taken care of even though they were all already working from home.",
            "polarity": 0.01666666666666672,
            "subjectivity": 0.5222222222222223
        },
        {
            "comment_id": "hijli3m",
            "body": "Meh, I sometimes send my people texts outside of work hours with the idea that they can respond if/when they are able. If that happens to be during work hours later then fine. They contact me outside work hours too. There's no real animosity about it.   \n\n\nIf someone texts me, \"I'm not feeling well can I stay home/come in late tomorrow\" I will 100% respond to them the same night. Taking care of your team does not have a clock out time, the actual job does.",
            "polarity": 0.05740740740740743,
            "subjectivity": 0.2611111111111111
        },
        {
            "comment_id": "hijlhfs",
            "body": "but what about the managers",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijkvvm",
            "body": "&gt; ... and expect a reply.\n\nMy manager emails me outside of work hours because that's when he's working. He doesn't expect a reply, and most often, I don't give one. I get to work the next morning and send it first thing. No issues.",
            "polarity": 0.1875,
            "subjectivity": 0.22083333333333333
        },
        {
            "comment_id": "hijkrgy",
            "body": "\"Sorry Tommy you didn't need to come in today I was able to get you the day off you were waitlisted for.  I would have called you but you were off yesterday.\"   \n\nBasically the only time I would reach out outside of work hours was when it was really good news for them.  As a leader I am always doing things for my team and it is pretty easy to tell what is important to them that they would want me to reach out for.  (Shift swaps, PTO exception approvals, tuition reimbursement, voluntary time off).  Basically get to know your team and what is important to them so you know when you could reduce stress for them outside of work hours.  If it isn't going to help them don't call them.",
            "polarity": 0.21833333333333332,
            "subjectivity": 0.7158333333333333
        },
        {
            "comment_id": "hijjsau",
            "body": "White collar professional here… I’m on call 24/7, it’s the job",
            "polarity": 0.05,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hijjn92",
            "body": "Entirely circumstantial. If you work outside, it is greatly appreciated when you tell your crew tomorrow will be cancelled due to weather. Its way better than having them drive in to send them right home.",
            "polarity": 0.14345238095238094,
            "subjectivity": 0.36428571428571427
        },
        {
            "comment_id": "hijjfd8",
            "body": "The only time I ever did this when I was a boss was to let my employees know they could work from home on Monday when there were snowstorms on Sunday",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hijjevm",
            "body": "i leave messages and emails prefaced with clear expectations to address later.   im working late that doesnt mean you are!\n\n\nand fuck any manager who treats people differently...\n\n\nbut this.lpt is garbage.   i work 12h plus a day for my team and shit happens\n   would you rather know or havr me forget and spring it on you 4pm next day?",
            "polarity": -0.148828125,
            "subjectivity": 0.4588541666666667
        },
        {
            "comment_id": "hijjeue",
            "body": "My manager likes to talk shit about her employees to other employees. We are all so fed up with it we walk away and it makes her even more mad cause we don't allow her that power over us and she power hungry. Thankfully she has no power to fire anyone. Our GM doesn't even like her and is looking for someone to replace her on the DL.",
            "polarity": -0.1125,
            "subjectivity": 0.66875
        },
        {
            "comment_id": "hijipil",
            "body": "Yo the opposite needs to be true as well I get 6 texts per day about some dumd shit",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.4833333333333334
        },
        {
            "comment_id": "hijiez1",
            "body": "I'm not a manager, nor have I ever been one, but I don't see this advice being practical for retail/service positions. I had a pretty great manager when I was doing car rental but he still had to message us outside of work a decent amount to coordinate schedules, replace last-minute callouts, etc",
            "polarity": 0.3041666666666667,
            "subjectivity": 0.6166666666666667
        },
        {
            "comment_id": "hiji6fs",
            "body": "Sometimes I did. But to be fair it was mostly to shoot the shit and send memes",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.7333333333333334
        },
        {
            "comment_id": "hiji1b9",
            "body": "Maybe for some jobs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiji0a5",
            "body": "My current manager is amazing, he encourages (basically insisted) we completely sign off when not in normal hours.\n\nIn the 3 years I have been working with him, there was only one occasion he had to contact me at night. He warned me about it in advance (it was absolutely necessary) and he made it very clear this was a one off.\n\nThis along with his other positive traits are what make him a great manager, honestly it gets the best out of me and the team.",
            "polarity": 0.29018939393939397,
            "subjectivity": 0.6432323232323232
        },
        {
            "comment_id": "hijhxw9",
            "body": "Ok fair enough. Want to get micromanaged, try this one LPT! How about, instead of being petty like this, be an adult and establish professional boundaries. All it takes is a little bit of courage. Shockingly enough, there are some things that can’t wait until tomorrow.",
            "polarity": 0.17321428571428574,
            "subjectivity": 0.4714285714285714
        },
        {
            "comment_id": "hijhwbb",
            "body": "Let me guess... you're an employee, not a manager?\n\nLPT... generally the good LPTs come from people who have achieved more economic and career success in life, which often results in positions with more authority and autonomy, like management. Managers often get to that position \\*because\\* they're \\*always\\* working.\n\nBut honestly, it depends on the position. If you're retail sales - there should be very little reason that a manager is calling you in off hours. If you're in IT Systems support or critical health care - it goes with the job.\n\nIs your a job a \"9 to 5, when I'm off the clock don't call me,\" kind of position?\n\nOr is it a \"you get paid a salary to finish a job, and if it takes 30 hrs or a week or 80 hrs a week, you put in the time,\" kind of position?\n\nThere is a difference - and you get to pick which kind of career you want to pursue. They have different benefits and liabilities, and rewards.  \n\n\nAnd if you're in fast food and getting calls from your manager all the time outside of working hours - they need to hire a better manager.",
            "polarity": 0.319140625,
            "subjectivity": 0.5687500000000001
        },
        {
            "comment_id": "hijhvry",
            "body": "I’ve always had a policy of not contacting my staff after hours unless it is absolutely necessary.  They always respond because they know if I reach out, it is important.  Having a real “team” vibe helps.\n\nI’ve never objected to being contacted when needed, but that comes with the level of responsibility inherent in my roles, which are compensated well for that reason.  \n\nI don’t think every employment relationship has to be a trade of money for time, and that it is perfectly acceptable to trade money for acceptance of a level of responsibility.",
            "polarity": 0.4,
            "subjectivity": 0.825
        },
        {
            "comment_id": "hijhtvu",
            "body": "Yeah I leave my work laptop at work because I don't want managers to message me 10pm at night to do something he can easily do in 5 min",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment_id": "hijhmvk",
            "body": "Why are you guys receiving work emails after hours in any way that you even notice them? Don't log into your work email on your personal devices. If that's absolutely not possible then at the very least log out every day at the end of the workday. \n\nThe way I see it, my boss can email me whenever he wants. If it's after hours or on my day off I'll be none the wiser until 8 am the next work day.",
            "polarity": -0.038,
            "subjectivity": 0.384
        },
        {
            "comment_id": "hijhj9z",
            "body": "Company: We are closed today due to unforeseen circumstances managers please inform your employees.\n\nManager: Wait I saw on Reddit to not contact them outside of business hours.",
            "polarity": -0.075,
            "subjectivity": 0.17500000000000002
        },
        {
            "comment_id": "hijhivs",
            "body": "Im a manager and i talk to my staff over the weekends constantly. Dont follow broad advise, its dependant on your relationship. I swap nba memes with one guy, talk football with another and sometimes meet a few at the bar. Its all about what your talking about with them.",
            "polarity": -0.04583333333333334,
            "subjectivity": 0.2486111111111111
        },
        {
            "comment_id": "hijhin4",
            "body": "This is the stupidest LPT ever. How old are you u/dan-fdz? There’s always going to be reasons to contact someone outside of working hours",
            "polarity": 0.05,
            "subjectivity": 0.125
        },
        {
            "comment_id": "hijhfyt",
            "body": "Yeah, that depends on the situation/roles. This one is too general for an updoot.",
            "polarity": 0.05000000000000002,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijhdcq",
            "body": "The final straw at my last job was being hourly, but contacted constantly off the clock by people. Not even by my boss, which I could at least respect that something escalated enough to go to leadership, but from help desk or the supervisors in a certain area I covered. I worked in a children’s hospital and gave a damn about what I did but felt exploited and one Saturday I was a couple hours from home trying to enjoy the day with my then boyfriend and an incoming call insisting I fix an issue completely removed all my interest in staying in that position. Especially after I expressed concern and was told I could either try my best to be available, or be paid to be on call 24/7/365 and 15 minutes from a laptop forever. Nope. Started responding to recruiters immediately. \n\nI have a salaried job in a software company, so I text with people after hours sometimes but nothing is ever urgent and I’m so happy.",
            "polarity": 0.21785714285714283,
            "subjectivity": 0.5392857142857143
        },
        {
            "comment_id": "hijh8kr",
            "body": "This subreddit has really gone downhill. This is in no way a life pro tip.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hijh4ma",
            "body": "Or during lunch breaks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijgymw",
            "body": "Just turned down a job because they wanted 24/7 access to me for \"emergencies.\" They swore it would be rare, but work life balance is way too important to me for that. It would poison all my free time to know I could be dragged back into work at any time.",
            "polarity": 0.18888888888888888,
            "subjectivity": 0.5977777777777777
        },
        {
            "comment_id": "hijgw64",
            "body": "Literally Chiming (work messenger) my manager as I’m also typing this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijgvqs",
            "body": "The key is not contacting or not, but expecting a reply outside of business hours. I work with a team that is geographically distributed and there are not common office hours. And even when we were all in the same time zone, we would work flexible hours. It would be nonsense for me to hold back a message until the office hours of the receiver. And what if multiple receivers are in different time zones?",
            "polarity": 0.02142857142857143,
            "subjectivity": 0.325
        },
        {
            "comment_id": "hijgnz6",
            "body": "This is not a pro tip. Sometimes no one shows up for work and you need someone to fill in. Further, some employees like being called for extra hours, and the employees who don’t and always decline will stop being contacted for extra hour opportunities.",
            "polarity": 0.0,
            "subjectivity": 0.2333333333333333
        },
        {
            "comment_id": "hijgilk",
            "body": "My manager does this, we all close the kitchen of a huge hotel, and he comes in at 6am the next morning and starts calling ppl to bitch about what was or wasn’t done, before he even knows what happened the night before!",
            "polarity": 0.20000000000000004,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hijflry",
            "body": "I wish this worked in reverse too. As a manager, I’m always on call 24/7 never getting the chance to relax. Even if I take a vacation, I am still on call if something goes wrong.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hijffco",
            "body": "Obviously someone doesn't know how to make friends with coworkers",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijfcs4",
            "body": "Am manager. I try not to do this and give people their space, but thanks for the reminder.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hijeyzd",
            "body": "Ok Janet, I know you're at home having fun on Reddit but can you quick send me those tps reports Dave sent you?",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hijenju",
            "body": "An exception to this rule. My current manager messaged me asking about how I was doing. He knew something bad had happened to me that day and seemed genuinely concerned... But yes, I agree if the message is about work.",
            "polarity": -0.09999999999999994,
            "subjectivity": 0.5222222222222223
        },
        {
            "comment_id": "hijejcj",
            "body": "I work odd hours, so I will occasionally email late in the evening- but I have made it clear I don’t expect a response until they are back in work. Just cause I will work late sometimes doesn’t mean I expect anyone else to.",
            "polarity": -0.13988095238095238,
            "subjectivity": 0.3779761904761905
        },
        {
            "comment_id": "hijebo3",
            "body": "In the rare case where I want to send someone a message after work hours I always make sure they know that it’s not urgent and can wait. \n\nLike I literally start the message with “NOT URGENT. NO NEED TO RESPOND RIGHT NOW…”",
            "polarity": 0.36190476190476195,
            "subjectivity": 0.7748677248677248
        },
        {
            "comment_id": "hije9al",
            "body": "I think this is a know the situation. Out of my 4 last bosses only one would irritate me if they texted me outside of hours. My current one and I plus two other employees have a group text that we will send memes and jokes through all hours.",
            "polarity": -0.025,
            "subjectivity": 0.3783333333333333
        },
        {
            "comment_id": "hije2kp",
            "body": "that and excessive calls and texts during working hours is why I haven't had an active phone in 3+ years",
            "polarity": -0.19166666666666665,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hijdt8x",
            "body": "I work at a gas station and there are times when I have to contact the manager",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijdle3",
            "body": "What if it's about out fantasy football league?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijdgfd",
            "body": "Better tell my boss we can’t go hiking this weekend",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hijd81z",
            "body": "Management should not be on the staffs social media either. Personal gatherings outside of work are also a no go.",
            "polarity": 0.011111111111111112,
            "subjectivity": 0.13888888888888887
        },
        {
            "comment_id": "hijd5mo",
            "body": "At my old job my manager was the worst. I was at my best friend's wedding as his one of his best men. We were doing the setup and getting ready and my boss called asking if I could come in for a few hours. He knew about this event 4 months in advance. When I told him. Dude I'm in the wedding. He went.. so you can't come in?? I'm a freaking mechanic, I'm not getting greasy. F off",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hijd4ys",
            "body": "As a manager and now as an owner, I wait until several hours AFTER the shift, to text employees that they did a great job or had a great idea. Appreciation of employees need not happen only during business hours.",
            "polarity": 0.4,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hijctso",
            "body": "I’m a nurse at a rehab place and I asked for this weekend off because I was going to be out of town and I already received messages asking if I could come in for a full shift or even a couple of hours. I specifically told her I was going to be out this weekend, either she forgot or she doesn’t care. Anyway I said “no I can’t, sorry.”",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.775
        },
        {
            "comment_id": "hijcqex",
            "body": "I'd also suggest that this tip is for the manager's protection as well. \n\nWork relationships can lull people into a fall sense of trust with people, and what might be perceived as cool by both parties can quickly change, particularly if the business comes under pressure or performance issues start to occur.",
            "polarity": 0.2833333333333333,
            "subjectivity": 0.4944444444444444
        },
        {
            "comment_id": "hijcmpu",
            "body": "As a manager I completely agree! I discourage my team from working nights and weekends and am careful to assign them work that will fill but not exceed a 40-hr week. And I’m intentional about not messaging them after hours so they don’t feel pressure from me to work late/weekends.",
            "polarity": 0.012499999999999997,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hijcapd",
            "body": "This piece of advice is so general as to be worthless. If you work in high paying, competitive role proceed with caution here.",
            "polarity": -0.19666666666666666,
            "subjectivity": 0.6466666666666666
        },
        {
            "comment_id": "hijc7tl",
            "body": "I have been on call 3 years in a row 24/7/365- even on my PTO with no compensation. I have been called in the middle of the night or weekends at least 100 times. I am a software engineer and our jobs never stops as long as the computers are running.",
            "polarity": -0.11666666666666665,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "hijbucy",
            "body": "I agree, unless it's in their interest, i.e. \"clock in missed Friday morning, what time did you start/leave? So I can get you paid\".",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hijb7kd",
            "body": "This can vary, my manager texts me my shifts and to see if I can cover someone. But I agree unless they are on call there are limited reasons to message or call them",
            "polarity": -0.07142857142857142,
            "subjectivity": 0.14285714285714285
        },
        {
            "comment_id": "hijauru",
            "body": "Lame advice. \n\nFor larger companies, your HR policies and your terms of employment will dictate this, not some imagined form of social etiquette.\n\nFor smaller places, everyone's hiring - look elsewhere if you don't like this part of your job.\n\nThe OP comes off as upset this is happening to them, but without enough experience to know this is part of life, depending on your job specifics.\n\nAgain, don't like it get a different job. That's a much better solution than shaming them with a bad LPT.",
            "polarity": -0.08333333333333331,
            "subjectivity": 0.5104166666666666
        },
        {
            "comment_id": "hijat8l",
            "body": "I contact my team outside of work hours and on weekends.    On their personal phones too.  \nI want to know how Joey did in his baseball tournament.   I want to know how their day trip was    They contact me as well.   We care about each other and our respective lives.  \nHR found out and demanded that I stop.",
            "polarity": -0.03125,
            "subjectivity": 0.20625
        },
        {
            "comment_id": "hijaih1",
            "body": "I just never pick up if I see that it's work. I have voicemail for a reason and I will get back to you when I get to work. I can count on one hand with fingers left over the amount of times I was called about something other than an \"emergency\" shift coverage and they don't pay me enough to care that mary who calls out 4 of her 5 shifts weekly but we're so understaffed that we can't actually afford to fire her because she's the only person able to cover the one shift she actually shows up for has called out *again* and they need someone to cover for her.",
            "polarity": 0.046875,
            "subjectivity": 0.3375
        },
        {
            "comment_id": "hijae61",
            "body": "Caveat: emergencies are ok. Real emergencies, not \"I think this is important therefore emergency\".",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hijacag",
            "body": "So I was a high level programmer and system administrator 10 years back... One saturday, I went to the mall. Without realizing, my phone fell under my seat when i left the car to go in... Didnt realize i didnt have my phone on me... Well a server crashed, and nobody else was answering their phones. Obviously I didnt answer mine either since it was in the car.\n\nWhen I finally got back to the car and retrieved my phone, I had missed something like 50 calls, 20 voice mails, 15 emails and a ton of text messages... Owner and boss FURIOUS with me for not answering my phone.\n\nSo I went into the office, fixed the problem, and then got called into the owner's office with my counterpart and the owner/boss.. Everyone yelling at me about how it was my fault server was down for so long because i didnt pick up my phone nor come in for an emergency fix.\n\nI was very clear that since I bought my phone and I paid my bill, that i was able to decide when I wished to utilize said serviice. And that if they expected me to answer my phone outside of work or to fix server issues, that they had to 1) buy me a company phone and pay the plan and 2) provide me a laptop with data access. Other than that they had no right to demand anything from me.\n\nGot a new phone and laptop that i had to always have on me... but...",
            "polarity": 0.02830943362193362,
            "subjectivity": 0.36671762265512264
        },
        {
            "comment_id": "hija7a8",
            "body": "I do tend to call people who don't show up for their shifts,  especially purple who don't normally call in just to see what is going on. It's not too make them come in to work but more figuring out if they are okay and if we can mark it as an excused absence. My team is good at letting me know when they need time off and working with eachither to ensure coverage, so when someone calls in its a surprise. If I call someone and they say they are not feeling it today, I dont pressure them to come in either.",
            "polarity": 0.30624999999999997,
            "subjectivity": 0.5416666666666666
        },
        {
            "comment_id": "hij9ybj",
            "body": "Restaurant managers like: No... No, I don't think I will",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij9s29",
            "body": "I work with folks all over the world. Comms only going out during specific work hours is just tedious and inefficient. The correct approach here is to set the expectation that messages outside of work hours SHOULD NOT be addressed outside of normal working hours. There is no confusion or open ended nature to it. There's no maybe. It's just a message. Don't read it. We aren't curing cancer. Nobody's dying. Ignore the message until you're at your desk the next day.\n\nMy VP straight up tells people to uninstall their work apps while on vacation or during the weekend and he gets really pissed if people try to give folks props or callouts for working outside of hours. He's just like \"It's great that you did it, but we don't want this behavior encouraged. It's an emergency, not a goal.\"",
            "polarity": 0.07083333333333335,
            "subjectivity": 0.39791666666666664
        },
        {
            "comment_id": "hij9oo2",
            "body": "Can you leave an email though? Like they can get back to you whenever they’re working again?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij9ifh",
            "body": "And if you are a manager and have spent the entire day in meetings and after work is the only time you have to catch up on email… That’s cool, get an email client that will delay sending your missives until 8 AM the next morning. That way you get your work done, and you are not poking employees who should be off the clock. \n\n(This has a weird side benefit of people thinking you are massively industrious and on top of things. If you send an email to your boss with a timestamp of 2 AM, they tend to have a poorer reaction to it than if it arrives at 7 AM. For some reason, that delay of five hours somehow turns your image from a procrastinating ne’er-do-well to an incredibly industrious worker-bee, who is getting shit done before they even arrive in the office. \n\n🤷‍♀️ \n\nYou can even get away with coming in a little late, because the boss has already heard from you this morning and figures it’s justified.",
            "polarity": 0.06634615384615385,
            "subjectivity": 0.6596153846153846
        },
        {
            "comment_id": "hij9co7",
            "body": "Tell me you’ve never been a manager without telling me you’ve never been a manager.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hij94b7",
            "body": "I am a manager, and I get a lot of pressure from my manager to arange meetings with my team out of their shift. I never have done it, only in one case she was part of it, but I told them that I will put 1 hour extra for that day on their timesheet even tho it was 20 minutes.",
            "polarity": 0.0,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hij8tjv",
            "body": "How about if it’s not work related? Just sharing a YouTube video or sending a picture of something funny?",
            "polarity": 0.125,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hij8sm5",
            "body": "my managers do this so rarely that I know something is seriously f’d if they do, and I’ll take it seriously",
            "polarity": -0.12222222222222222,
            "subjectivity": 0.7444444444444445
        },
        {
            "comment_id": "hij8qnx",
            "body": "Depends on many factors. If you’re a banker, lawyer, consultant making $300k in client service… when the client CEO calls your boss, and your boss calls you for a fire drill, you run. Of course, that’s known going in and you sign up for stupid money and stupid expectations.",
            "polarity": -0.36666666666666664,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment_id": "hij883y",
            "body": "It works the other way too. If your manager is off, they're off. Go to the next in line or wait till they're back in. This happens to me most weeks and it's fucking annoying.",
            "polarity": -0.085,
            "subjectivity": 0.355
        },
        {
            "comment_id": "hij83u5",
            "body": "Or just don’t answer until your in office hours. You can’t tell a manager they cannot contact outside hours, they can do whatever the hell they want. It’s on you if you respond or not during outside hours so the LPT should be don’t answer outside hours.",
            "polarity": 0.0,
            "subjectivity": 0.05000000000000001
        },
        {
            "comment_id": "hij83ck",
            "body": "True. I was a project engineer, though not a project manager but I was responsible for a small team of construction workers. I never texted them or called them outside working hours. But I told them if they need me (after working hours), I prefer them to text me over calling me.",
            "polarity": 0.07500000000000001,
            "subjectivity": 0.41250000000000003
        },
        {
            "comment_id": "hij82kh",
            "body": "My manager just sent out a very terse email to the team today saying that asking for the day off late in the evening or at night may be denied, with a note that she does not contact us at home without good reason and we should extend her the same courtesy.\n\nApparently someone called her last night to ask for leave. Considering her mother is currently in the hospital, I guess she wasn't in the mood for unexpected phone calls.",
            "polarity": 0.09375,
            "subjectivity": 0.43020833333333336
        },
        {
            "comment_id": "hij7y14",
            "body": "What if there is a party?  Some managers are friends with their employees",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hiic05s",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hiikkpx",
            "body": "At one place I was a manager we were forbidden from calling associates unless we clocked them in.\n\n\"Hey Jay, sorry to bug you, just so you know your being compensated right now... Do you remember where you put the Jenkins file? Okay, thanks talk to you later\" 15min paid OT if applicable",
            "ups": 5442,
            "downs": 0,
            "polarity": 0.09714285714285714,
            "subjectivity": 0.4471428571428572
        },
        {
            "comment_id": "hiig7f5",
            "body": "I often use the delay delivery feature if I'm sending email outside usual hours or to people on leave. That way, even the ones who can't stop themselves working during down time don't have the temptation. \nI tell them I do this, so when the need arises to send tasks/info outside of usual hours, they know I think it's important.",
            "ups": 1164,
            "downs": 0,
            "polarity": -0.04259259259259259,
            "subjectivity": 0.3148148148148148
        },
        {
            "comment_id": "hiict74",
            "body": "I think that the EU are going to pass a law about this. Perhaps it’s not going ahead but it’s becoming more and more annoying and acceptable for bosses or colleagues to contact outside working hours.",
            "ups": 422,
            "downs": 0,
            "polarity": 0.12999999999999998,
            "subjectivity": 0.5599999999999999
        },
        {
            "comment_id": "hiijh28",
            "body": "Eh. Depends on what you do for a living and a lot on how reasonable the request is. I’m salaried and support systems that need to run 24/7.  I’d rather get a phone call about a problem on a Friday night than come in on Monday to a much bigger problem.\n\nIf your boss was hounding you about petty day to day stuff that could just as reasonably be addressed the next working day, I can see that being pretty annoying.",
            "ups": 363,
            "downs": 0,
            "polarity": -0.025000000000000005,
            "subjectivity": 0.6
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hiic05s",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hiikkpx",
            "body": "At one place I was a manager we were forbidden from calling associates unless we clocked them in.\n\n\"Hey Jay, sorry to bug you, just so you know your being compensated right now... Do you remember where you put the Jenkins file? Okay, thanks talk to you later\" 15min paid OT if applicable",
            "ups": 5432,
            "downs": 0,
            "polarity": 0.09714285714285714,
            "subjectivity": 0.4471428571428572
        },
        {
            "comment_id": "hiig7f5",
            "body": "I often use the delay delivery feature if I'm sending email outside usual hours or to people on leave. That way, even the ones who can't stop themselves working during down time don't have the temptation. \nI tell them I do this, so when the need arises to send tasks/info outside of usual hours, they know I think it's important.",
            "ups": 1166,
            "downs": 0,
            "polarity": -0.04259259259259259,
            "subjectivity": 0.3148148148148148
        },
        {
            "comment_id": "hiict74",
            "body": "I think that the EU are going to pass a law about this. Perhaps it’s not going ahead but it’s becoming more and more annoying and acceptable for bosses or colleagues to contact outside working hours.",
            "ups": 417,
            "downs": 0,
            "polarity": 0.12999999999999998,
            "subjectivity": 0.5599999999999999
        },
        {
            "comment_id": "hiivmwm",
            "body": "What about a text reminding them to electronically submit thier timesheet for the third goddamn week in a row?",
            "ups": 294,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hiic05s",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hiikkpx",
            "body": "At one place I was a manager we were forbidden from calling associates unless we clocked them in.\n\n\"Hey Jay, sorry to bug you, just so you know your being compensated right now... Do you remember where you put the Jenkins file? Okay, thanks talk to you later\" 15min paid OT if applicable",
            "ups": 5437,
            "downs": 0,
            "polarity": 0.09714285714285714,
            "subjectivity": 0.4471428571428572
        },
        {
            "comment_id": "hiig7f5",
            "body": "I often use the delay delivery feature if I'm sending email outside usual hours or to people on leave. That way, even the ones who can't stop themselves working during down time don't have the temptation. \nI tell them I do this, so when the need arises to send tasks/info outside of usual hours, they know I think it's important.",
            "ups": 1163,
            "downs": 0,
            "polarity": -0.04259259259259259,
            "subjectivity": 0.3148148148148148
        },
        {
            "comment_id": "hiict74",
            "body": "I think that the EU are going to pass a law about this. Perhaps it’s not going ahead but it’s becoming more and more annoying and acceptable for bosses or colleagues to contact outside working hours.",
            "ups": 417,
            "downs": 0,
            "polarity": 0.12999999999999998,
            "subjectivity": 0.5599999999999999
        },
        {
            "comment_id": "hiivmwm",
            "body": "What about a text reminding them to electronically submit thier timesheet for the third goddamn week in a row?",
            "ups": 294,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}