{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qijlo6/lpt_leaving_the_house_at_least_once_a_day_does/",
    "time_posted": "2021-10-29 14:48:57",
    "time_now": "2021-10-30 16:50:21",
    "ups": 5407,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hijpimb",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hineo0z",
            "body": "That's why I leave at least once a day and cry in the park. Crying in the house all the time is depressing.",
            "polarity": -0.3666666666666667,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hina76k",
            "body": "Shame covid nulls that out for me.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hina3ge",
            "body": "For anyone that feels they physically can't go outside (I completely get that), vitamins can help, as can eating half decent meals with some fruit/veg, protein, carbs etc. If you don't feel up to going outside for a walk or something, opening a window or just sitting next to your door for 5 minutes can help a little.",
            "polarity": -0.012499999999999999,
            "subjectivity": 0.2619047619047619
        },
        {
            "comment_id": "hin9bjh",
            "body": "I made a New Year’s resolution once to go outside everyday for this reason. I have now gone outside everyday for 7 years, 9 months, and 29 days.",
            "polarity": -0.052727272727272734,
            "subjectivity": 0.3509090909090909
        },
        {
            "comment_id": "hin8ilt",
            "body": "I like walking through greenery while listening to Tindersticks II",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin5qjb",
            "body": "I made a habit for myself in the spring of 2020 to go for a short walk at my coffee breaks. I only get about 10 mins outside each break but it’s so helpful. When I began to work from home, I did the same thing - just did a lap around the park across from my home and then returned back home to continue working. Even when it’s -30 out, it gets your blood pumping and you actually feel warm and toasty when returning. The same goes now that I’m back in the office - everyone is sitting inside freezing, but I actually feel quite warm for about 30-45 mins after my coffee break walk, which is so great. \n\nI fully agree with this LPT. 5-10 mins is all it takes",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.31250000000000006
        },
        {
            "comment_id": "hin0s7v",
            "body": "I'm a home body and don't suffer from seasonal depression so....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin0fi7",
            "body": "But it's cold outside...",
            "polarity": -0.3,
            "subjectivity": 0.525
        },
        {
            "comment_id": "himwmzb",
            "body": "I'd rather never leave the house and just stay inside all day playing video games. I bought my house to stay in it as much as possible. If it wasn't for this wife, kid, dog, job, the need to buy food and water, having to take out the garbage, and the need to mow the lawn, I'd never leave the damn house!",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hims9w1",
            "body": "It’s why I’m glad I have my dog. I suffer bouts of severe depression, and having her boop my hand for walkies, seeing how excited and happy she is to be out with me, she’s sometimes the only thing that can lift my heart.",
            "polarity": 0.41875,
            "subjectivity": 0.9375
        },
        {
            "comment_id": "himor9f",
            "body": "I absolutely hate leaving the house , i work with people on my 12/hr shift.. I don’t want to see anyone when I am off. I got a dog so I would go outside and walk. I love my plants &amp; playing in the flower beds so that helps, but I think the posit is excellent advice because of my hermit tendencies.",
            "polarity": 0.175,
            "subjectivity": 0.6375
        },
        {
            "comment_id": "himntww",
            "body": "Not for everyone. I prefer to be inside, and it doesn't depress me more. In fact, being out does.",
            "polarity": 0.21666666666666667,
            "subjectivity": 0.26666666666666666
        },
        {
            "comment_id": "himndah",
            "body": "Tried that a couple times and I just go outside and feel depressed outside rip",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "himl6bj",
            "body": "LPT: there are light therapy lamps on Amazon starting at 50€. They are proven to work, and flippig a switch may be easier to commit to than getting up and leaving home",
            "polarity": 0.2,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "himidbd",
            "body": "I agree with this!\n\nAlthough I figured out that I had actual FT depression and liked to be alone, and that staying inside alone made me happiest, lol",
            "polarity": 0.4666666666666666,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "himfp3z",
            "body": "Props to my sweet doggos. If it wasn't for them I'd be a little ball on my couch rn. If I even made it to the couch. Those two get me out and are just the sweetest cuddling monsters one could wish for",
            "polarity": 0.08124999999999999,
            "subjectivity": 0.575
        },
        {
            "comment_id": "himerlo",
            "body": "I feel like this is only true because of the weather. Most of us have AC and heating, we go outside for more than 10 seconds and hate life itself.",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hime8xz",
            "body": "As someone who suffers often from the kind of depression that tells you \"don't get up, don't do anything, there's no point, it won't make you feel any better\", the best thing you can do is just to start deciding to do the things your brain tells you not to.\n\nIf you're struggling with the idea of actually doing something, just make the decision to do it, excuse my language but fuck the \"no voice\".\n\nDecide to do it, the rest comes easily. And no matter how much your mind tells you that just thinking of doing it is enough to know it won't make a difference, actually doing it is ALWAYS different than the depression infected envisioning of doing it.\n\nMake the decision, let the rest follow suit.",
            "polarity": 0.14027777777777775,
            "subjectivity": 0.44861111111111107
        },
        {
            "comment_id": "himdqgz",
            "body": "This is absolutely true. My kids are grown and living on their own so now it’s just me and the cats. I’m very much an introvert and quite happy spending my days alone, however I simply did not realize over the past year and a half of the pandemic just how much this being alone had morphed into being isolated. There were some pretty long days and weeks where I was very unproductive, I started putting in weight, and I’d stare out the window and think about how nice it looked outside but would not leave the house.\n\nEven if you go for a 10 minute walk outside it makes a huge difference to your mental health. If you’re feeling depressed or unhappy or even just having a blah day, a short walk does help make you feel lighter and less closed-in. I was beginning to feel sad this afternoon so I forced myself to walk over to the golf course, and sit by the large pond and talk to the ducks. Not gonna lie, they seemed happy to see me. 😃 Or maybe it was being out of the house that made me feel so good.",
            "polarity": 0.13503968253968254,
            "subjectivity": 0.5116269841269842
        },
        {
            "comment_id": "himd0zl",
            "body": "It sounds mighty silly but for me an incentive to go out is to spin my daily stop on Pokemon Go to keep my streak going",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.5916666666666667
        },
        {
            "comment_id": "him51bf",
            "body": "I’m not in a great place and tried that and couldn’t, I’ve cut my forearm multiple times and it’s getting worse. I don’t think I’ll make it through this year.",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.45
        },
        {
            "comment_id": "him4ug8",
            "body": "Something about solo walks gives me a weird kind of anxiety. I don’t enjoy a lot of the sensations I end up feeling as I walk, I’m hyper-conscious of how I look, how I’m behaving, whether I look like a creepy weirdo (even though I’m an average unassuming 25F who doesn’t have RBF). If I have friends or family along with me to devote the majority of my focus then those thoughts don’t trouble me, but in the absence of company, walks just don’t feel like a positive activity.\n\nSpecifically regarding seasonal depression: I haven’t heard of others feeling this way, but rather than a lack of sunlight, mine is triggered by feeling too cold! I feel *miserable* when I’m cold. Bad circulation means that just bundling up doesn’t fix it, either (plus wearing tons of layers? Maybe it’s an unpopular opinion, but I do NOT find that comfortable). A personal space heater for my bedroom and an electric blanket for the living room have been lifesavers for me, much more so than the full-spectrum white light lamp I bought after my previous psychologist’s recommendation.",
            "polarity": -0.11399410774410773,
            "subjectivity": 0.5932659932659932
        },
        {
            "comment_id": "him4nk1",
            "body": "This is about to become really difficult for me.\n\nI have spent the last year really working on my sleep and how it relates to my anxiety.  I'm not officially diagnosed as having the seasonal affective disorder, but I have noticed if I'm able to stick to a daily schedule when I get the most sun exposure, then I actually do better overall.   I did this while I was home, unemployed and waiting for my union job to call me back.\n\nProblem is, I'm back at work now, and I'm forced to move to a 2:30 pm start time with an 11:30 pm end time.  In order to properly balance my medications and the sleep schedule I've tried to keep to make sure they weren't a hindrance during my waking hours, I will have to sleep until noon to make sure I have enough energy to work.  This is all going against my doctor's recommendations that I provided months ago that said I need to prioritize a \"daytime\" schedule; and even though I'm in a union, my company is fighting the doctor's note because he never specified an actual time on the two notes he's already provided, just a \"daytime\" schedule.  So, I'm working on this schedule until I see him again in two weeks to explain the new issue.  By which time, I will add, the clocks will have changed, and it will start to get dark around 5 pm where I am. \n\nMy chest has been hurting from the anxiety for the past two days.  I can't quit, because it's a full-time job and union - the job security that I have will never be replicated and I just can't leave for something that's merely advertising a possibility of full-time.  \n\nI don't know what to do anymore.",
            "polarity": 0.04935064935064936,
            "subjectivity": 0.34638047138047134
        },
        {
            "comment_id": "him42gl",
            "body": "It really helps a remarkable amount. Just walk down the street for five minutes each way. I do music most of the time, but if you have wildlife or birds around you, they can help relax you a bunch too.",
            "polarity": 0.32361111111111107,
            "subjectivity": 0.43472222222222223
        },
        {
            "comment_id": "him39ni",
            "body": "I have a dog (going on 9 years) that requires a decent amount of exercise every day. She will herd me around the house if I don't take her out and eventually she'll get in my office chair and bark at me. Walking is great for thinking, too. I get so much thinking done during her walks.",
            "polarity": 0.3888888888888889,
            "subjectivity": 0.5388888888888889
        },
        {
            "comment_id": "him25uo",
            "body": "You should add a small walk to your evening routine\n\nDone with eating and everything's cleaned up? Let's go for a small 15 min walk around the block take a look at the ducks or whatever is there",
            "polarity": -0.25,
            "subjectivity": 0.4
        },
        {
            "comment_id": "him1svo",
            "body": "Can confirm.  Was diagnosed with major depressive disorder last year.  Getting out once per day really forms part of my routine along with meds and therapy to keep me on track.  It has reduced my episodes from nearly every day to maybe once a month.  I do exercise five times a week by walking and the rest of the time its either to to shop or more recently see friends/familynow that lockdown is over.",
            "polarity": 0.14375000000000002,
            "subjectivity": 0.3194444444444444
        },
        {
            "comment_id": "him1qnx",
            "body": "It's so true,  but so hard to make myself do. But when I do go outside, I always say to myself, this feels so great, I should do it more. It's still hard the next day.",
            "polarity": 0.15238095238095237,
            "subjectivity": 0.4333333333333333
        },
        {
            "comment_id": "him1i5n",
            "body": "Said by the person in a not cold climate. Fuck going outside when it's max 5 degrees F for the day. No thank you.",
            "polarity": -0.03333333333333335,
            "subjectivity": 0.55
        },
        {
            "comment_id": "hilz159",
            "body": "Take vitamin D supplements...all year round ...atleast 3k a day",
            "polarity": -0.2,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hilyyz0",
            "body": "Thanks for the reminder. I will get out tomorrow",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hilyxlc",
            "body": "You don't even have to walk. You can just sit outside for five minutes and feel better. It helps you realize there's more to this world than just you and your problems.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment_id": "hilyloc",
            "body": "Yeah, go for a walk in the morning sunlight, resets your biological clock, picks up your mood.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilx9v4",
            "body": "Ever since lockdown started I’ve gone for a walk after work for 40-50 minutes, whatever the weather, I haven’t missed a day for nearly 18 months and it gives me a sense of achievement to know I haven’t broken the chain.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hilw9w3",
            "body": "Feeling cold weather makes me depressed but staying inside, locked away from everyone, for the 500th day in a row, also makes me depressed.\n\nNo dice.",
            "polarity": -0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilvjnb",
            "body": "Why can't you people just let me marinate in my agoraphobia like a normal millenial",
            "polarity": 0.15,
            "subjectivity": 0.6499999999999999
        },
        {
            "comment_id": "hilv62g",
            "body": "Sunshine, fresh air and exercise. \n\nEven a small bit, every day, is crucial.",
            "polarity": 0.016666666666666663,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment_id": "hilv269",
            "body": "I've been working 12-16 hour days the past month for a working from home job (annual cycle, is shit). Going out for a morning walk, and more later in the day has done wonders for mood. Change of location and sunshine are magic",
            "polarity": 0.11000000000000001,
            "subjectivity": 0.51
        },
        {
            "comment_id": "hilv0jk",
            "body": "Reading this while locked in a 21 day hotel quarantine...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilugb8",
            "body": "Not going to lie I started working from home. Just a new remote job and the going outside in the sun really helps a lot like a lot",
            "polarity": 0.05909090909090909,
            "subjectivity": 0.22613636363636364
        },
        {
            "comment_id": "hilu2hc",
            "body": "This is very true for me. Although, with my allergies, outside tries to kill me when I leave the house. But depression tries to do the same if I stay inside.",
            "polarity": 0.051000000000000004,
            "subjectivity": 0.36400000000000005
        },
        {
            "comment_id": "hilrtub",
            "body": "Thanks, Im cured now.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hilrraw",
            "body": "If this works for you, you were never depressed in the first place.",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hilrmk2",
            "body": "Seasonal depression sounds like something doctors made up to make more money off us",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilrg1x",
            "body": "I traded my car for a bus pass 2 years ago. Convincing myself to go outside is difficult so I kind of have to force myself into it.",
            "polarity": 0.15,
            "subjectivity": 0.7374999999999999
        },
        {
            "comment_id": "hilqmwz",
            "body": "This is so true. The problem for me is once I get to far into that depressive state, there’s nothing I can tell myself that will make me believe getting some fresh air or human interaction with have a positive impact on how I’m feeling. My normal mind knows for a fact it would help as I think about it now but my depressed mind won’t believe any of it. I try to look at doing that stuff as routine maintenance so I don’t slip to far into the dark but I’m not always successful.",
            "polarity": 0.20303030303030303,
            "subjectivity": 0.643939393939394
        },
        {
            "comment_id": "hilpvhs",
            "body": "But it's too cold :(",
            "polarity": -0.675,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilpudk",
            "body": "Receive sunshine daily - it is virtually lifesaving.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilnwv9",
            "body": "I don’t know if anyone will see this but i struggle with this a lot too. I feel like even though i can probably force myself to get out, there’s just nowhere to go? Does anyone have any suggestions? Nothing sounds interesting. I want to be able to get out once a day but it’s hard when everything just feels so blah.",
            "polarity": 0.23611111111111108,
            "subjectivity": 0.5555555555555555
        },
        {
            "comment_id": "hilkrzo",
            "body": "Do people really not go outside? The sun is so amazing!",
            "polarity": 0.37500000000000006,
            "subjectivity": 0.47500000000000003
        },
        {
            "comment_id": "hiljxc4",
            "body": "Truth, I force myself to go on bike rides, go out to dinner, something. I always thank myself in the end.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilit2s",
            "body": "If I'm going outside, I'm definitely not going to reduce my ability to perceive threats by wearing headphones.  I felt uncomfortable just reading the suggestion.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.5166666666666667
        },
        {
            "comment_id": "hilijxu",
            "body": "A half-hour walk per day will provide: a sense of accomplishment, you will sleep better, you will feel better in the morning, you could lose weight.  Works for me.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilii5i",
            "body": "I work outside and Its fucking cold and cold depressed me...what else you got...",
            "polarity": -0.39999999999999997,
            "subjectivity": 0.6833333333333332
        },
        {
            "comment_id": "hilhqxm",
            "body": "The best part of this pandemic has been social distancing and masks.  I can hide my disdain for humanity behind sunglasses &amp; a mask when forced to go out.  The opportunity to turtle up and be a hermit has been DIVINE.",
            "polarity": 0.08333333333333334,
            "subjectivity": 0.31666666666666665
        },
        {
            "comment_id": "hilhlnq",
            "body": "And if I can’t stand being in the presence of people?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilgvnf",
            "body": "Like many, I had several months of free time during 2020.  I went and walked / hiked areas of my neighborhood that I had driven past, but never really noticed before.  Beside the obvious health gains, exploring a new area had mental benefits.\n\n I also got in the car and drove by myself around parts of the city I hadn't been in for several years.   There were really cool older homes and restaurants I never tried before.",
            "polarity": 0.10027548209366391,
            "subjectivity": 0.35344352617079894
        },
        {
            "comment_id": "hilflpx",
            "body": "I go outside nearly every day but still struggle, I’m going to get one of those UV lights this winter.  I went through a pretty rough patch this summer even with being outside a lot, so I’m kinda worried what winter will be like :(",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.4833333333333334
        },
        {
            "comment_id": "hilcdkk",
            "body": "I hate that this helps, lol. I just wanna do nothing.",
            "polarity": 0.0,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hilaqry",
            "body": "without headphones even better, try it out \\~",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil9l2r",
            "body": "What if you cannot avoid the terrible people that are out there?",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hil90zk",
            "body": "And getting out in the morning does wonders.  A quick walk breathing the fresh morning air will get the endorphins flowing.",
            "polarity": 0.31666666666666665,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil79o5",
            "body": "This is why I went hiking so much during quarantine. Staying inside all day makes me completely stir crazy and depressed.",
            "polarity": -0.09999999999999998,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hil70ot",
            "body": "Yes yes yes yes\nIf you can afford it, go buy a coffee and drink it in the place. If you want to not spend any money, go to a library or window shop in a mall or department store.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hil5vvn",
            "body": "But it's fucking coooold",
            "polarity": -0.6,
            "subjectivity": 0.8
        },
        {
            "comment_id": "hil50mr",
            "body": "As someone who was full time WFH prior to COVID, the 3$ daily Star Bucks was worth it to see daylight, people, and the hustle and bustle, not to mention the refills.",
            "polarity": 0.16249999999999998,
            "subjectivity": 0.1625
        },
        {
            "comment_id": "hil3794",
            "body": "Ya'll should really try this if you're not....",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hikzyha",
            "body": "I read “mental snuggles”",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hikzy6h",
            "body": "Does that make homelessness a cure for depression? S\n1 Ticket to hell please",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hikzdi6",
            "body": "So true man, had surgery two weeks ago so I have been just sitting home all day and night for the two weeks I've been off work. Actually started to feel depressed and emotional the past couple of days. Can't believe I'm actually looking forward to going back in into work tomorrow.",
            "polarity": 0.016666666666666663,
            "subjectivity": 0.2916666666666667
        },
        {
            "comment_id": "hikxyqy",
            "body": "Get a pupper it forces you to go outside and animals help fight depression",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "comment_id": "hikxn4d",
            "body": "I go out every day because I have to, I probably wouldn’t if I didn’t",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hiksmxs",
            "body": "Plants indoors too, I have a wall of plants behind the TV monitor I am using. A literal life saver for me at least. It is hard to get depressed when you see happy plants all around you.\n\nTIP: I *swear* by using [these](https://www.amazon.ca/ZAOS-Watering-Probes-Stakes-Roses/dp/B074YSW7HB/ref=sr_1_18?crid=7CT22Q1UCY53&amp;dchild=1&amp;keywords=plant+watering+spikes&amp;qid=1635549400&amp;sprefix=plant+watering+spike%2Caps%2C138&amp;sr=8-18) specific plant watering spikes that are anti gravity through capillary action, not like other 'spikes'. It is a life changer. If you manually watering plants, you are doing it on hard mode (and overwatering is leading cause of death for indoor plants).",
            "polarity": -0.06354166666666666,
            "subjectivity": 0.47291666666666665
        },
        {
            "comment_id": "hikoixa",
            "body": "That may be true, but I sure would like to try staying home!",
            "polarity": 0.4875,
            "subjectivity": 0.7694444444444444
        },
        {
            "comment_id": "hikh5bm",
            "body": "Sometimes is so difficult to get out of bed and eat, imagine going outside:( but it’s great advice",
            "polarity": -0.11249999999999999,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hikes6y",
            "body": "If you know you suffer from seasonal affective disorder it’s important to start taking preventive steps before you actually start feeling the onset. Consider adding vitamin D supplements. Many of us are vitamin D deficient. I find it helps to exercise regularly and if possible travel somewhere warm and sunny during the colder months. When this has hit me, sometimes hitting the gym, eating right, socializing and taking my vitamins help by degrees. It doesn’t always fix everything but I’ll take any improvement over simply sitting in depression.",
            "polarity": 0.15396825396825398,
            "subjectivity": 0.541086691086691
        },
        {
            "comment_id": "hikd9yv",
            "body": "In finland we have this medicine called forrest.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hika0dj",
            "body": "Like Dale Carnegie said:\n\n&gt;\"Inaction breeds doubt and fear. Action breeds confidence and courage. If you\nwant to conquer fear, do not sit home and think about it. Go out and get busy.\"",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hik0zro",
            "body": "Bro I just walked in the rain. Best feeling is just looking up into the rain and enjoying life.",
            "polarity": 0.75,
            "subjectivity": 0.44999999999999996
        },
        {
            "comment_id": "hik0udj",
            "body": "Agreed now imagine its implications when we fully transition into the type of society where remote school and work, meal delivery and social online “multiverses” become the norm confining the vast majority of the population indoors.",
            "polarity": -0.022222222222222227,
            "subjectivity": 0.4222222222222222
        },
        {
            "comment_id": "hijx8xx",
            "body": "It’s hard to go out when you are feeling depressed. But it’s good advice if you can force yourself. A good therapist told me I can do anything for 5 minutes and then reassess if I still feel bad about doing said thing- like going outside. Most of the time 5 turns into 10 turns into 20 and so on.",
            "polarity": 0.15138888888888888,
            "subjectivity": 0.4930555555555555
        },
        {
            "comment_id": "hijwswn",
            "body": "Any exercise will do wonders for your mental health",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hiju5k7",
            "body": "Excellent reminder, particularly at this time of year when Daylight Savings begins.",
            "polarity": 0.5833333333333334,
            "subjectivity": 0.6666666666666666
        },
        {
            "comment_id": "hijqabk",
            "body": "This is totally true for me!! When I venture out into the world, it instantly makes me feel better.",
            "polarity": 0.3489583333333333,
            "subjectivity": 0.6055555555555555
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hijpimb",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijx8xx",
            "body": "It’s hard to go out when you are feeling depressed. But it’s good advice if you can force yourself. A good therapist told me I can do anything for 5 minutes and then reassess if I still feel bad about doing said thing- like going outside. Most of the time 5 turns into 10 turns into 20 and so on.",
            "ups": 458,
            "downs": 0,
            "polarity": 0.15138888888888888,
            "subjectivity": 0.4930555555555555
        },
        {
            "comment_id": "hik0zro",
            "body": "Bro I just walked in the rain. Best feeling is just looking up into the rain and enjoying life.",
            "ups": 107,
            "downs": 0,
            "polarity": 0.75,
            "subjectivity": 0.44999999999999996
        },
        {
            "comment_id": "hiksmxs",
            "body": "Plants indoors too, I have a wall of plants behind the TV monitor I am using. A literal life saver for me at least. It is hard to get depressed when you see happy plants all around you.\n\nTIP: I *swear* by using [these](https://www.amazon.ca/ZAOS-Watering-Probes-Stakes-Roses/dp/B074YSW7HB/ref=sr_1_18?crid=7CT22Q1UCY53&amp;dchild=1&amp;keywords=plant+watering+spikes&amp;qid=1635549400&amp;sprefix=plant+watering+spike%2Caps%2C138&amp;sr=8-18) specific plant watering spikes that are anti gravity through capillary action, not like other 'spikes'. It is a life changer. If you manually watering plants, you are doing it on hard mode (and overwatering is leading cause of death for indoor plants).",
            "ups": 81,
            "downs": 0,
            "polarity": -0.06354166666666666,
            "subjectivity": 0.47291666666666665
        },
        {
            "comment_id": "hijqabk",
            "body": "This is totally true for me!! When I venture out into the world, it instantly makes me feel better.",
            "ups": 67,
            "downs": 0,
            "polarity": 0.3489583333333333,
            "subjectivity": 0.6055555555555555
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hijpimb",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijx8xx",
            "body": "It’s hard to go out when you are feeling depressed. But it’s good advice if you can force yourself. A good therapist told me I can do anything for 5 minutes and then reassess if I still feel bad about doing said thing- like going outside. Most of the time 5 turns into 10 turns into 20 and so on.",
            "ups": 462,
            "downs": 0,
            "polarity": 0.15138888888888888,
            "subjectivity": 0.4930555555555555
        },
        {
            "comment_id": "hijqabk",
            "body": "This is totally true for me!! When I venture out into the world, it instantly makes me feel better.",
            "ups": 68,
            "downs": 0,
            "polarity": 0.3489583333333333,
            "subjectivity": 0.6055555555555555
        },
        {
            "comment_id": "hil50mr",
            "body": "As someone who was full time WFH prior to COVID, the 3$ daily Star Bucks was worth it to see daylight, people, and the hustle and bustle, not to mention the refills.",
            "ups": 34,
            "downs": 0,
            "polarity": 0.16249999999999998,
            "subjectivity": 0.1625
        },
        {
            "comment_id": "hik0zro",
            "body": "Bro I just walked in the rain. Best feeling is just looking up into the rain and enjoying life.",
            "ups": 105,
            "downs": 0,
            "polarity": 0.75,
            "subjectivity": 0.44999999999999996
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hijpimb",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hijx8xx",
            "body": "It’s hard to go out when you are feeling depressed. But it’s good advice if you can force yourself. A good therapist told me I can do anything for 5 minutes and then reassess if I still feel bad about doing said thing- like going outside. Most of the time 5 turns into 10 turns into 20 and so on.",
            "ups": 466,
            "downs": 0,
            "polarity": 0.15138888888888888,
            "subjectivity": 0.4930555555555555
        },
        {
            "comment_id": "hijqabk",
            "body": "This is totally true for me!! When I venture out into the world, it instantly makes me feel better.",
            "ups": 69,
            "downs": 0,
            "polarity": 0.3489583333333333,
            "subjectivity": 0.6055555555555555
        },
        {
            "comment_id": "hil50mr",
            "body": "As someone who was full time WFH prior to COVID, the 3$ daily Star Bucks was worth it to see daylight, people, and the hustle and bustle, not to mention the refills.",
            "ups": 36,
            "downs": 0,
            "polarity": 0.16249999999999998,
            "subjectivity": 0.1625
        },
        {
            "comment_id": "hik0zro",
            "body": "Bro I just walked in the rain. Best feeling is just looking up into the rain and enjoying life.",
            "ups": 101,
            "downs": 0,
            "polarity": 0.75,
            "subjectivity": 0.44999999999999996
        }
    ]
}