{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qj0ssm/lpt_get_started_on_your_retirement_today/",
    "time_posted": "2021-10-30 08:48:11",
    "time_now": "2021-10-30 16:49:41",
    "ups": 808,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "himy81u",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hintgdi",
            "body": "All I can say... thank goodness the job i had in my 20s started contributing to a retirement fund for me, otherwise I would be very behind. I still feel somewhat behind, but it's because other expenses at the moment (like child care) have to take priority. Luckily I can still squirrel some nuts away.",
            "polarity": -0.17791666666666667,
            "subjectivity": 0.7045833333333333
        },
        {
            "comment_id": "hint14g",
            "body": "Tbh, learning trends and technical analysis doesn’t take that long and you will easily be able to outpace a company matched 401k and won’t get boned by penalties if you ever needed the money. And it’s fun.Just my opinion though",
            "polarity": 0.15,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hins7mw",
            "body": " I'm 28 and I've honestly looked into this. Between all the corrupt and awful investment companies and apps as well as being poor it is just not viable",
            "polarity": -0.325,
            "subjectivity": 0.875
        },
        {
            "comment_id": "hins2td",
            "body": "\"It blows my mind how many people aren't doing this.\"\n\n\nThat kind of thinking comes from a place of privilege, friend.  Some of us are broke and occasionally have to put groceries on credit cards because we don't always have enough with the other bills we have that week.  (And I say this coming from my own place of privilege even having credit cards.)  We don't even have savings account, so retirement money is a luxury that we'll never have.",
            "polarity": 0.2625,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment_id": "hinrn30",
            "body": "Bruh...people can barely afford food and rent.  Medical bills drown many.  How the fuck can you not see this and make this arrogant ass post?\n\nWhy does it blow your mind people can't afford retirement?  So you really believe people are stupid not victims of an oligarchy?  Fuck me 2021 is insane and the privileged are fucking blind.",
            "polarity": -0.26111111111111107,
            "subjectivity": 0.5185185185185186
        },
        {
            "comment_id": "hinrfpw",
            "body": "I work in retirement. Don't be Cat Food Lady. Don't be forced to eat cat food because you didn't save enough for retirement. Don't be $20K Man, who never looked at his statement and remained in money market for 20 years. Take an interest in your future!",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.27499999999999997
        },
        {
            "comment_id": "hinqzf7",
            "body": "I can barely afford rent",
            "polarity": 0.05,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hinq9mh",
            "body": "Really?\n\nThen stop pushing sub-par proprietary investment products onto your customers.\n\nStop pokng them every quarter to increase their LOC or mortgage.\n\nHow about trying to help them square their personal balance sheets rather than load them up with more debt ?\n\nAnd cut it out with the constant credit card pitches.\n\nAnd, if you are in Canada, stop foisting 'mortgage insurance' onto mortgage borrowers.  The product is shit, and it's a fucking wonder that the regulators haven't gone after the bans on that one.",
            "polarity": -0.016666666666666673,
            "subjectivity": 0.48888888888888893
        },
        {
            "comment_id": "hinpwqv",
            "body": "Im trying to find the best one do do... \nIra \nRoth \nCds \nMoney markets \nIts easy but also confusing",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.5111111111111111
        },
        {
            "comment_id": "hinpkgo",
            "body": "Follow-up LPT - Increase your 401k contribution by 1% every time you get a raise. The higher pay and higher contribution amount will compound over time, and it will never feel like you have to take a \"hit\" to your take-home pay by needing to bump it up at some point later.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment_id": "hinphmf",
            "body": "This all assumes the market won't collapse, the environment will stabilize, people have enough income to make future investments, and that there is no other way to plan for the future outside of money. I absolutely despise \"long term investment, or retirement planning\" bullshit. This shit only applies to the upper end of middle class and above. A group that is shrinking to smaller and smaller percentages by the day. Sure go ahead. Invest if you can, but you damn well better plan beyond that, because the likelihood that money will actually be available to you in 20 years, or worth even half of what you need it to be worth is almost none at this point in history.\n\nIf you read this and feel pressure to fit this 50's mentality of future planning bullshit, especially if you are young, don't buy the hype. This has never proven to be as effective of a life strategy as bankers (who make money off of your investments) and financial planners (who also make money off you when you do this) want you to think it is.",
            "polarity": 0.11330128205128207,
            "subjectivity": 0.39444444444444454
        },
        {
            "comment_id": "hinpfyw",
            "body": "It's all fun and compound interest until the collapse.",
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hinnym8",
            "body": "I mean, a lot of us live paycheck to paycheck and aren’t able to.",
            "polarity": 0.10795454545454546,
            "subjectivity": 0.6041666666666666
        },
        {
            "comment_id": "hinnyk6",
            "body": "Sure, when I can make more then poverty-level wages that barely cover my rent and food. I'll stick that extra dollar at then end of my paycheck into a retirement account.",
            "polarity": 0.2625,
            "subjectivity": 0.39722222222222225
        },
        {
            "comment_id": "hinnqbw",
            "body": "Blow all your money and die before retirement.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinniui",
            "body": "Amen! This is real good advice. When my last grandparent passed about 10 years ago, I was 13 and got a healthy sum of money in the inheritance. Somewhere in the order of $180,000. My dad, smartly, invested it with a company that only takes upper volume clients. \n\nNow that I’m 24, I own a house that I bought for $250,000, I have $80,000 left on the mortgage and that $180,000 is now just over $300,000 as of yesterday at market close. It’s gone up over $40,000 since this year started (thank you bull markets). \n\nThat inheritance grew to enough where I could buy myself a house (now valued at about $300,000 itself) and have a quarter million dollars with no other debt. Compounding interest is a freaking godsend! People that invest smartly when they’re young should have no problem with cash flow when real expenses come such as mortgages, child care costs, weddings, etc",
            "polarity": 0.20762117346938777,
            "subjectivity": 0.4876700680272109
        },
        {
            "comment_id": "hinnau2",
            "body": "If you start at 18 and save 20 bucks a week/120 bucks a month a 8% (the average yearly return on the stock market) you will retire a millionaire.  \n\n\nhttps://www.investor.gov/financial-tools-calculators/calculators/compound-interest-calculator",
            "polarity": -0.15,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment_id": "hinn4sq",
            "body": "Clearly written by someone who has more than $10 to spare a month",
            "polarity": 0.3,
            "subjectivity": 0.44166666666666665
        },
        {
            "comment_id": "hinn0a1",
            "body": "Retirement?  I'll be happy if I'm alive.",
            "polarity": 0.45,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hinmfml",
            "body": "Just invest in gold and bury it in random locations all around your town. Banks are a Ponzi scheme.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinlp6d",
            "body": "I wish that more people were familiar with the rules of the SSI program. We get between $500 to $800 a month from the US government for our disabilities but we're not allowed to save it for retirement. If our bank account balance or assets ever go over $2,000, we get kicked out of the program and lose the monthly payments that we need for our life expenses as well as our health insurance called Medicaid.",
            "polarity": 0.4375,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hinl2wv",
            "body": "So in other words, stocks only go up?",
            "polarity": -0.0625,
            "subjectivity": 0.6875
        },
        {
            "comment_id": "hinjruz",
            "body": "Im financially retarted. But at 28 my credit score is great and i try to not buy useless crap and thats a big step over my parents. I really should learn how to put away for retirement tho.",
            "polarity": -0.049999999999999996,
            "subjectivity": 0.34166666666666673
        },
        {
            "comment_id": "hinjqma",
            "body": "Can someone simplify the steps I need to take for planning my retirement ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hini4xy",
            "body": "So true. I started saving in my company match (6%) 401k in my early 20's. Thanks to that, I will be able retire next November at 61.",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.355
        },
        {
            "comment_id": "hinhzlt",
            "body": "The important part of this LPT is you have to invest the money somewhere that will return higher than inflation rates or your money might as well burn. Banks don’t offer investment vehicles that will outpace inflation in 2021. Therefore you will have to look into equities or crypto. Compounding interest is all good when you get a return that outpaces inflation but for the vast majority of people. Spending their money now is the only way they can maximize its value.",
            "polarity": 0.27,
            "subjectivity": 0.82
        },
        {
            "comment_id": "hinhujr",
            "body": "Fuck that I hate the idea of retirement. Like I don't like free time now. How Will retirement work?-",
            "polarity": -0.2666666666666667,
            "subjectivity": 0.7666666666666666
        },
        {
            "comment_id": "hinhm4r",
            "body": "yep, i’m putting in 15% each paycheck. it also helps that i don’t buy a lot of things",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hing3vw",
            "body": "Keep in mind that while you may get 2% apy, inflation is more than this. Yeah it may seem like a good idea to earn money via this method but unless you’re getting a very generous return, the buying power of that money will be minuscule once you retire. Maybe invest in scarce assets like art, or something that isn’t directly tied to usd, like crypto. Not financial advise and dyor before investing your money.",
            "polarity": 0.3,
            "subjectivity": 0.36000000000000004
        },
        {
            "comment_id": "hinf37e",
            "body": "If you save $10 a day and invest it you will be a millionaire by the time you retire.\n\nThis assumes you start saving at 22 years old, and retire at 65 years old, and an average real return of about 7% which is the average over the last century or so I believe.",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.2611111111111111
        },
        {
            "comment_id": "hinewcd",
            "body": "This is why I think they should replace algebra in schools with lessons on how the power of compound interest can work for or against you.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hindoyz",
            "body": "And then be like my sister, who lost half her pension in her divorce, them had to borrow against the rest and buy her tiny ranch house from the ex- husband as part of the proceeds.\nShe had worked at the same company from age 18 until retirement age and had nothing to show for it",
            "polarity": -0.05555555555555555,
            "subjectivity": 0.2638888888888889
        },
        {
            "comment_id": "hincvkg",
            "body": "Something I've emphasized to my kids and they've listened. The nineteen year old told me last night he has 24k in index funds an 6k in checking. He might not have to touch the college fund at this rate.",
            "polarity": 0.05,
            "subjectivity": 0.13333333333333333
        },
        {
            "comment_id": "hinctae",
            "body": "Im 25 with a 401k that my company is matching my 3% so 6% per year which only comes out to roughly 2,300yr being added to it. What’s the best way to add to this without taking too much more out of my checks every month?\n\nI’m assuming I won’t be able to retire because social security is gonna implode by the time I’m 65\n\nEdit: my “plan” if I can even make one at my income level is to own some property by then and make it self-sufficient (large garden, off grid power etc. so my costs of living will be low) and obv be making more money in a few years but I did the math and over 40 years I’ll barely be clearing 100k in my “retirement” fund",
            "polarity": 0.2581349206349206,
            "subjectivity": 0.4433531746031745
        },
        {
            "comment_id": "hincsi4",
            "body": "LOL we are all living paycheck to paycheck.",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "comment_id": "hinbumf",
            "body": "Could you explain where or how to get compound interest?\n\nThe only compound interest I play with is my credit cards, enjoy my money chase",
            "polarity": 0.2,
            "subjectivity": 0.75
        },
        {
            "comment_id": "hinb6wi",
            "body": "did it this morning, i bought a lottery ticket.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinanvr",
            "body": "Okay cool. How. My school system didn’t teach me anything about this and I barely understand whatever I google. Most of the time I don’t even know what to google.",
            "polarity": 0.35,
            "subjectivity": 0.4375
        },
        {
            "comment_id": "hina4i7",
            "body": "It doesn't blow my mind. I see the stupidity in tons of people. Nobody wants to be stupid and that's great but let's watch how we spend and save. Emergencies happen and people I talk to want to worry about how much it is to start, na you need to have a ton of Emergency money saved. Not like it's 500 every Emergency, SAVE. Af the end you covered your emergencies and can push forward but hey,  let's keep saving. It's not like you only get one Emergency per life time.",
            "polarity": -0.03333333333333332,
            "subjectivity": 0.6750000000000002
        },
        {
            "comment_id": "hin9jw4",
            "body": "It feels so small &amp; impossible... then 15 years go by and you feel great.  Just need to stay committed &amp; not touch it.",
            "polarity": -0.03888888888888886,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "hin8wcp",
            "body": "Yaaaas when I started my very first job I didn’t get paid a lot so I thought it wasn’t worth putting anything in—I’d do it later and just add more. \n\nThen I realized with compound interest it’s better to put in a tiny amount earlier and then just increase it as much as you can as you go along, rather than wait and then add a bunch all at once. So now I’ve been investing in a 401k for a yr",
            "polarity": 0.228125,
            "subjectivity": 0.3416666666666667
        },
        {
            "comment_id": "hin8pz2",
            "body": "Hi op, can you explain how to even access compounding? Is it something only certain banks do or can you just leave it in an index etf and it will compound?\n\nI understand there’s a lot more info available but honestly depending on how humble your background you won’t likely even know the right questions to ask. Any advice is appreciated thx for your post man",
            "polarity": 0.22222222222222227,
            "subjectivity": 0.6007936507936507
        },
        {
            "comment_id": "hin8gle",
            "body": "How do I know I’m gonna be alive in 10 years?? I would much rather spend my money and my time living this beautiful life gifted to us by god… love your family and your friends because you never know when your time will end… god bless you all",
            "polarity": 0.43,
            "subjectivity": 0.64
        },
        {
            "comment_id": "hin7zg3",
            "body": "Y’all still use banks for retirement?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin7pgu",
            "body": "People who say this sort of thing assume that a kid on a minimum wage job and a zero-hour contract actually has a reliable amount of surplus money each month to put into a pension plan. Quite often, its not even reliable to cover rent each month.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hin7jwk",
            "body": "The perspective of retirement is a interesting thing .  When I was a kid I thought it just happened;  you worked till a certain a age and then you just retired.. where I grew up the complete surrounding area (that's the major city and the suburban area of up to 10 city's surrounding it), the average home is a million dollars and it's only going up.  that's also  with out a representation of a wage that supports housing markets. So now the idea if being able to retire means if I wanted to live where I grew up, (most comfortable)  as my initial plan it only means I'll just be able to own a home.  I do understand that  retirement is a financial status and not a state of being . \n\nIt's just soo depressing that the methodology of saving for retirement for my generation of individual born in the 80s  has been thrown on its  head; what we were told about saving is still a manageable thing, just that final outcome isn't really going to be close to the initial vision\n\nThat idea of being able to have your house paid off before you retire, have one or two kids off to collage or university  before you retire, and then have money set aside to live comfortably and be able to travel a little.. own a pleasure vehicle or something for retirement... these things can not happen , full stop, or not in any  realistic manner .. even if you  were extremely reserved with your spending through your life time , just having a family of one or two kids and allowing them a moderately fulfilled life as they grow up  almost makes this not attainable. \n\n\nI'm not trying to discredit your post; I think it's still is sound advise you should always be saving because you never know if you know if you know  a virus will come along an disrupt the world on a global scale  and you could very well loose your job , or you may just need an expensive surgery that's not covered.  It's just  I think the perspective that  you just retire  even if you have put money into savings and investments is not a straightforward as people think ..",
            "polarity": 0.1388988263988264,
            "subjectivity": 0.5297025047025048
        },
        {
            "comment_id": "hin73ab",
            "body": "One other thing about a 401k or IRA is after it gets to a decent size you can also take a loan out on your 401k. You pay interest but the interest is to yourself and it goes back into your retirement account.",
            "polarity": 0.013888888888888886,
            "subjectivity": 0.34722222222222215
        },
        {
            "comment_id": "hin6zj8",
            "body": "I am constantly blown away to learn that decently paid (6 figs or close) late 20s/early 30s folks at my job don’t take advantage of 6% 401k match. Many don’t even know about it because they don’t understand saving/investing and tune out at the benefits meeting every year.",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hin65a9",
            "body": "So a banker…assuming they are a licensed financial professional, more or less, suggests utilizing compound interest in a time where rates are &lt;0.01% and inflation hangs around 5%. I’m not a millionaire, but not so sure this is the route to pursue.",
            "polarity": 0.18666666666666668,
            "subjectivity": 0.31111111111111106
        },
        {
            "comment_id": "hin605m",
            "body": "The key to wealth is to Get Rich Slowly. Start young, spend less than you make, and invest the rest. It only takes small amounts of money over a long period of time to ensure a stress-free retirement.",
            "polarity": -0.036458333333333336,
            "subjectivity": 0.5520833333333334
        },
        {
            "comment_id": "hin5qm2",
            "body": "How much should you invest in your retirement from your salary? 10% or 15% ?",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "comment_id": "hin5h53",
            "body": "What if you're self employed and no 401k? What route can you take?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin1yoq",
            "body": "What kind of account are you talking about?",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "comment_id": "hin0vg1",
            "body": "Just how fast will my 10k get to a million at 0.01% compounding?",
            "polarity": 0.2,
            "subjectivity": 0.6
        },
        {
            "comment_id": "hin0ij2",
            "body": "[deleted]",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin0a7g",
            "body": "Where do you do this? It’s never seemed so “easy” or obvious with how many different companies there are. How can you tell which one to go for?",
            "polarity": 0.23333333333333334,
            "subjectivity": 0.6083333333333334
        },
        {
            "comment_id": "himzmxl",
            "body": "Wow this is so smart",
            "polarity": 0.15714285714285714,
            "subjectivity": 0.8214285714285714
        },
        {
            "comment_id": "himz7tu",
            "body": "The best time to plant a tree is 20 years ago \n\nThe second best time is today",
            "polarity": 0.6666666666666666,
            "subjectivity": 0.19999999999999998
        },
        {
            "comment_id": "himyjhz",
            "body": "Fail. In order to accrue compound interest you have to be able to afford to put money into a bank to save. You know, the whole cost of living, specially housing, becoming insanely expensive for about 95% of Americans.",
            "polarity": 0.08452380952380951,
            "subjectivity": 0.5744047619047619
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "himy81u",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himz7tu",
            "body": "The best time to plant a tree is 20 years ago \n\nThe second best time is today",
            "ups": 1,
            "downs": 0,
            "polarity": 0.6666666666666666,
            "subjectivity": 0.19999999999999998
        },
        {
            "comment_id": "hin7pgu",
            "body": "People who say this sort of thing assume that a kid on a minimum wage job and a zero-hour contract actually has a reliable amount of surplus money each month to put into a pension plan. Quite often, its not even reliable to cover rent each month.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hin6zj8",
            "body": "I am constantly blown away to learn that decently paid (6 figs or close) late 20s/early 30s folks at my job don’t take advantage of 6% 401k match. Many don’t even know about it because they don’t understand saving/investing and tune out at the benefits meeting every year.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.09166666666666667,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hin0a7g",
            "body": "Where do you do this? It’s never seemed so “easy” or obvious with how many different companies there are. How can you tell which one to go for?",
            "ups": 1,
            "downs": 0,
            "polarity": 0.23333333333333334,
            "subjectivity": 0.6083333333333334
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "himy81u",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himz7tu",
            "body": "The best time to plant a tree is 20 years ago \n\nThe second best time is today",
            "ups": 1,
            "downs": 0,
            "polarity": 0.6666666666666666,
            "subjectivity": 0.19999999999999998
        },
        {
            "comment_id": "hin6zj8",
            "body": "I am constantly blown away to learn that decently paid (6 figs or close) late 20s/early 30s folks at my job don’t take advantage of 6% 401k match. Many don’t even know about it because they don’t understand saving/investing and tune out at the benefits meeting every year.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.09166666666666667,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hin9jw4",
            "body": "It feels so small &amp; impossible... then 15 years go by and you feel great.  Just need to stay committed &amp; not touch it.",
            "ups": 1,
            "downs": 0,
            "polarity": -0.03888888888888886,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "hin0a7g",
            "body": "Where do you do this? It’s never seemed so “easy” or obvious with how many different companies there are. How can you tell which one to go for?",
            "ups": 1,
            "downs": 0,
            "polarity": 0.23333333333333334,
            "subjectivity": 0.6083333333333334
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "himy81u",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "himz7tu",
            "body": "The best time to plant a tree is 20 years ago \n\nThe second best time is today",
            "ups": 1,
            "downs": 0,
            "polarity": 0.6666666666666666,
            "subjectivity": 0.19999999999999998
        },
        {
            "comment_id": "hin6zj8",
            "body": "I am constantly blown away to learn that decently paid (6 figs or close) late 20s/early 30s folks at my job don’t take advantage of 6% 401k match. Many don’t even know about it because they don’t understand saving/investing and tune out at the benefits meeting every year.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.09166666666666667,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hin9jw4",
            "body": "It feels so small &amp; impossible... then 15 years go by and you feel great.  Just need to stay committed &amp; not touch it.",
            "ups": 1,
            "downs": 0,
            "polarity": -0.03888888888888886,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "hin0a7g",
            "body": "Where do you do this? It’s never seemed so “easy” or obvious with how many different companies there are. How can you tell which one to go for?",
            "ups": 1,
            "downs": 0,
            "polarity": 0.23333333333333334,
            "subjectivity": 0.6083333333333334
        }
    ]
}