{
    "post_url": "https://www.reddit.com/r/LifeProTips/comments/qiqylx/lpt_as_a_general_rule_at_the_beginning_of_the/",
    "time_posted": "2021-10-29 21:20:16",
    "time_now": "2021-10-30 16:49:59",
    "ups": 3542,
    "downs": 0,
    "comments_since_last_sample": [
        {
            "comment_id": "hil7udo",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hinktmt",
            "body": "I have to disagree with this advice.  In my experience professors are generally crabby people and trying to ingratiate yourself typically just leads to them getting annoyed by eagerness.  They want to sit in their office and pretend to be busy between people begging for grade changes, they do not want forty people coming to say hi.",
            "polarity": -0.10416666666666666,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hinken0",
            "body": "Or you can do your work and let the professor do his in peace, without creating unfair advantages in the class",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hingtww",
            "body": "The OP fails to mention what the expected benefit of this tip might be. Better relationship with your professor? Sure. Better grade? No.\n\nA much better tip if you want to do well in class is to skip the small talk and ask questions about the material.\n\nClass expectations? No need to go to office hours, just read the syllabus.",
            "polarity": 0.05714285714285715,
            "subjectivity": 0.49841269841269836
        },
        {
            "comment_id": "hindtya",
            "body": "How tf do you get to know someone?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hinasmt",
            "body": "For me, I only talked to professors for practical reasons when I was struggling with assignments/exam studying. I never saw the value in getting to know professors 1-on-1 like that. If it's strictly for informational purposes, then sure.  But even then, everything that is expected of you as a student should be outlined in the course syllabus.\n\nDiscussing goals with the professors sounds nice in theory but isn't ultimately going to change the nature of the courses. Although it may be a decent networking opportunity if you show enough engagement in the course",
            "polarity": 0.16666666666666669,
            "subjectivity": 0.7793650793650794
        },
        {
            "comment_id": "hin9kvp",
            "body": "Don't know whether this is useful advice for those in the UK, I've found generally lecturers prefer to be left alone when possible and in return they don't make a fuss about your lack of attendance or comment on it the one time they spot you.",
            "polarity": 0.0875,
            "subjectivity": 0.375
        },
        {
            "comment_id": "hin9clt",
            "body": "Also if you have a chronic illness **LET YOUR PROFESSORS KNOW AHEAD OF TIME!** When I was a sophomore I woke up sick (stomach issues) the day of a scheduled exam. I emailed myb teacher and she almost wasn't going to let me reschedule until I reminded her that I told her this might happen ahead of time. As soon as she remembered our conversation at the beginning of the semester she almost gleefully let me reschedule",
            "polarity": -0.7142857142857143,
            "subjectivity": 0.8571428571428571
        },
        {
            "comment_id": "hin998m",
            "body": "Best lpt that no one will ever do.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hin8vbu",
            "body": "I teach business law at my local community college. Please don’t come to office hours and explain to me some bullshit you read online trying to convince me the income tax is unconstitutional.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hin8kxr",
            "body": "The true LPT is to (try to) answer questions in a class when everyone else is quiet. The professor will remember that. I managed to pass finals where &gt;90% failed, simply because he remembered me from lectures and we had a nice chat about the subject, my career goals and a bit of chit chat.",
            "polarity": 0.04722222222222222,
            "subjectivity": 0.4956349206349207
        },
        {
            "comment_id": "hin7j7i",
            "body": "As a general rule, just look at the syllabus. They are legally required to follow the syllabus. You can finish an entire semester in 2 weeks or less by doing everything on the syllabus. If you have questions about a later project, shoot an email.",
            "polarity": 0.01666666666666667,
            "subjectivity": 0.2783333333333333
        },
        {
            "comment_id": "hin6n3k",
            "body": "As a professor, I second this! If we say \"no one comes to my office hours\", come to the office hours. You'll be surprised how helpful it may be later in the semester. \n\nAlso, lots of us are enthusiastic about what we teach!",
            "polarity": 0.2125,
            "subjectivity": 0.45
        },
        {
            "comment_id": "hin6l83",
            "body": "This is great advice! In college I only saw my profs at the end of the semester when I had questions. They were always nice, but I know I had no impact on them in any way, they wouldn't remember me or be able to write a letter for me. As a former adjunct prof and high school teacher, I would have loved if a student did this and it would have had a major impact.\n\nToo bad I can't go back in time and do this myself, but I can mention to everyone it's a great idea!",
            "polarity": 0.30204545454545456,
            "subjectivity": 0.6028787878787879
        },
        {
            "comment_id": "hin6j2q",
            "body": "Ugh this is so annoying. Whenever I wanted to ask a real question about the material I had to wait an HOUR for the suck ups to finish kissing the professor’s ass before I could ask my questions. And it’s also embarrassing as hell to be the only person in the room trying to ask about something you didn’t understand and everyone is having a much easier time with the material. Also, I often didn’t have time to wait around to ask things because I also worked a full time job, unlike most of my classmates in a science program. This tip fucks up other peoples lives.",
            "polarity": 0.046428571428571416,
            "subjectivity": 0.5464285714285715
        },
        {
            "comment_id": "hin27qh",
            "body": "As a professor, please God remove your lpt. I don't need 200 students to introduce themselves and seek personal one by one time every semester.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "comment_id": "hin11wj",
            "body": "Fuck how far back are we going to say people need to *network* and *make connections* \n\n\nIt's college -- show up, do your work, and participate in class, your professors will learn your name",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment_id": "himzzos",
            "body": "This is such great advice!",
            "polarity": 0.5,
            "subjectivity": 0.625
        },
        {
            "comment_id": "himzivt",
            "body": "I don't know if I should single myself out like this. Could possibly be detrimental.\n\nGoing to college in a few months. Thoughts?",
            "polarity": -0.09047619047619049,
            "subjectivity": 0.4380952380952381
        },
        {
            "comment_id": "himzbg0",
            "body": "LPT: Don't go to your professor's office hours to meet them if you don't genuinely want to. If they sense you are a slimey gamesman trying to win favor, they will grade you harder.",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.3
        },
        {
            "comment_id": "himz624",
            "body": "LPT: don't come to my office to ask me things I told you in class. I have other things to do.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment_id": "himy4m2",
            "body": "I had lectures with 400 students in the room, did my lecturers have any interest in knowing them all? Not a chance.\n\nLike everything, situational awareness will take you a long way.",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "comment_id": "himxq19",
            "body": "This works in high school too. I have extra help for about 20 minutes every day. When I do my grades, I absolutely remember who came to extra help. If they're a borderline pass or borderline 90, I'm much more willing to bump if they made an effort. Also applies if they need an extra day or two for an assignment.",
            "polarity": 0.15857142857142856,
            "subjectivity": 0.42714285714285716
        },
        {
            "comment_id": "himxiwv",
            "body": "May not work as intended, none of my college professors cared about their students and those who tried only got more frustrated and thought it was personal.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.5
        },
        {
            "comment_id": "himwitk",
            "body": "Honestly this works in jobs too. I used to work for a company of about 100 people. The first week I made sure to catch the CEO and talk for a few minutes so he knew me.",
            "polarity": 0.28750000000000003,
            "subjectivity": 0.5555555555555556
        },
        {
            "comment_id": "himwd3g",
            "body": "Only reason I got into a top 5 grad program for my field is the reccomendations I got from my professors. I don't think it was my imperfect gpa, less than stellar subject GRE score, or lack of literally any non curricular activity. This shit matter big time for your future, especially for grad school.",
            "polarity": 0.02407407407407408,
            "subjectivity": 0.46388888888888896
        },
        {
            "comment_id": "himsl3y",
            "body": "Not strictly a professor but a university lecturer, tutor, TA equivalent and primary contact of one specific unit in Australia:\n\nDon’t do this.\n\nIf you need help or have questions, absolutely!  I’m here to help.  Even if the questions aren’t strictly about units I teach I can at least point you in the right direction.  If you need an extension or are worried about your ability to complete assessment, talk to me. It’s what I’m here for.\n\nI’m not here for small talk.  Don’t come to me and introduce yourself and talk about the footy.  There’s more than five hundred of you fuckers and I have shit to do, like mark the assignments you handed in this week and some students are already demanding the grades for.  I don’t want to know which name is attached to which face is attached to which assignment, because it biases my grading.  I do not like sitting here staring at a number for half an hour worrying over whether my personal dislike of this (INCREDIBLY IRRITATING) student has made me knock them down half a mark, or if knowing they’re a nice person really has made me be too generous.  Or if in trying to negate my own bias I’ve gone too far in the other direction.  (My apologies to the coworker I had to ask to counter-mark the last batch of essays.  At least we mostly agreed on the final scores.)",
            "polarity": 0.06399240855762595,
            "subjectivity": 0.5141131815044858
        },
        {
            "comment_id": "himsa2j",
            "body": "They'll probably think you wanna fuck em.",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "comment_id": "himrwaz",
            "body": "I don't think it works on most university, at least not where I graduate.",
            "polarity": 0.1,
            "subjectivity": 0.45
        },
        {
            "comment_id": "himrvw9",
            "body": "It's harder to fail someone when there a face to the name.",
            "polarity": -0.3,
            "subjectivity": 0.14999999999999997
        },
        {
            "comment_id": "himrhii",
            "body": "This is bad advice, you show up, clearly trying to build rapport instead of needing help for real, they’ll be annoyed with you like anyone would. If you genuinely feel like you can connect with a professor on your career path, absolutely go and have a conversation for a goal. Else, don’t force it.",
            "polarity": -0.0333333333333333,
            "subjectivity": 0.5916666666666667
        },
        {
            "comment_id": "himqqq1",
            "body": "What a great idea, professor will definetly be not annoyed by 300 students attending his office hours to ask the same questions all over again...",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5583333333333333
        },
        {
            "comment_id": "himosmr",
            "body": "And always follow the syllabus 100%. ;)",
            "polarity": 0.25,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himod42",
            "body": "I mean you can do this if you want. Definitely not important though. Maybe if you are struggling it is useful.",
            "polarity": -0.07083333333333332,
            "subjectivity": 0.5625
        },
        {
            "comment_id": "himm9cr",
            "body": "That’s great advice.  It will also give you experience in breaking the “power barrier” that a lot of shy people (myself) have difficulty overcoming.",
            "polarity": 0.15000000000000002,
            "subjectivity": 0.625
        },
        {
            "comment_id": "himkq2a",
            "body": "LPT: It's great to get to know your professors! Good professors will be very happy that you're interested and engaged. However, when you talk to them make sure you actually have questions (even if you're making them up specifically to get to know your professor) or something relevant to say. Professors can tell when you're showing up to office hours just to get that rec letter :-)",
            "polarity": 0.54375,
            "subjectivity": 0.7173611111111111
        },
        {
            "comment_id": "himjt1n",
            "body": "How small are your classes?",
            "polarity": -0.25,
            "subjectivity": 0.4
        },
        {
            "comment_id": "himgaff",
            "body": "Reads like 'Don't forget to lick their ass in case you are too bad to learn and show your intelligence with your skills'.\n\nYou should go to your professor only when you have a legitimate or urgent question and/or you need some infomation regarding their subject.\n\nBy simply clogging their (professor's) schedule with unnecessary visits you also steal time from other students who could use this time for their learning effort and to get better at the subject this prof is teaching.",
            "polarity": -0.13229166666666667,
            "subjectivity": 0.5581845238095237
        },
        {
            "comment_id": "himesoi",
            "body": "&gt;Good things to ask/talk about are what to expect from the class, what they expect from you\n\nthat gets covered on the first day of class,  with handouts\n\nlately it seems a lot of LPTs recommend being nice or acting interested as a manipulative, transactional tactic.  it's almost sociopathic:  \"i'll pretend to be nice so they'll give me a discount\"  \n\nthis one talks about \"showing sincerity\", not *being* sincere",
            "polarity": 0.2714285714285714,
            "subjectivity": 0.5619047619047619
        },
        {
            "comment_id": "himepdn",
            "body": "Also: If your professor asks help with some work, volunteer. \n\nI'm a shit student, but helped a masters student collect some soil samples ONE DAY like 4 hours. When I was applying for a summer job next summer, I asked if the professor could write a recommendation. He told that he actually knew the guy doing hiring and gave him a call.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.3
        },
        {
            "comment_id": "himc6cl",
            "body": "Lmao that's not how uni works",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment_id": "himaz79",
            "body": "This really doesn't seem like a good life tip. Unless you intend to exploit her relationship with the professor, by trying to get extra credit or an extension on a deadline is really no point to waste yours or their time with idle chitchat because the odds are you will not see them again after the class.",
            "polarity": 0.06666666666666664,
            "subjectivity": 0.23333333333333336
        },
        {
            "comment_id": "him9u85",
            "body": "Wow this is so smart",
            "polarity": 0.15714285714285714,
            "subjectivity": 0.8214285714285714
        },
        {
            "comment_id": "him898w",
            "body": "A lot of commenters (college professors) agree with that LPT. I'm wondering if I'm the only one who would not appreciate some random student to introduce themselves. I've got shit to do. If someone needs something or has a question they're welcome but don't bother me with random stuff.\n\nI have to say though that I'm from Europe and we have a different culture on smalltalk, maybe that's the difference.",
            "polarity": -0.06666666666666665,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "him7ewp",
            "body": "Nah. I’d rather go to class, do my work, go home. Keep my head down and not stand out",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "comment_id": "him76qx",
            "body": "Haha imagine like 400 students going to office hours and being like “we just came to say hey and get to know you.” And then going to the next professors office hours… and so on… this is insane advice for everyone to use, perhaps people that arent confident in the class based on the syllabus. But by no means should every student go to office hours. It’s not meant for the entire class to show up to.\n\nTo give this as general advice is wrong, it doesn’t apply to everyone.",
            "polarity": -0.10714285714285714,
            "subjectivity": 0.594047619047619
        },
        {
            "comment_id": "him1c51",
            "body": "This depends om country, discipline and level of class, I'd say.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "him0qc1",
            "body": "100% LPT this. I wasn’t the best student but remember advice a student tour guide gave me….to go visit your professors office hours. Especially because virtually no one ever does go to office hours! And professors usually will help you focus on the material that will be on the exams. Well I wouldn’t have graduated if it wasn’t for that advice because on two separate occasions my GPA was low enough to not graduate unless I got a certain grade on a final. Well, during my college journey, I realized I was falling behind and needed certain grades in order to pass and avoid another expensive year of school which I didn’t want to finance whatsoever. So I went to the office hours and communicated that I needed a certain grade in order to graduate. The professors were so helpful and I felt like they cared enough to help their student. They honestly helped me so much with the material. Everything they pointed to for me to focus on really was on the exam and I got my passing grades.",
            "polarity": 0.09952380952380953,
            "subjectivity": 0.550952380952381
        },
        {
            "comment_id": "hilz62d",
            "body": "I wish my students would follow this advice. Most of the students who end up coming do so for make up tests.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilxdtk",
            "body": "Even better, meet your TA.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment_id": "hilx1ki",
            "body": "I wholeheartedly believe in this LPT. I really enjoyed an economics class as a freshman in college and I went to the professor’s office hours to get a better understanding on a difficult homework assignment. Over the course of several visits, she ended up thinking I was a bright student and offered a job to work in the economics center she oversaw.\n\n\nI worked for her through my years of college and after graduating landed a great job. I’m currently making 100k at 26.. with an economics degree from a non prestigious state university.\n\n\nProfessors are great resources because they are usually well connected and they WANT to help you. They literally teach for a living!",
            "polarity": 0.23875000000000002,
            "subjectivity": 0.525
        },
        {
            "comment_id": "hilwqm2",
            "body": "Definitely do this if you might want to get a graduate degree later on\n\nI basically went from class to work/home every day. Now I’m paying out of pocket to take some graduate classes because I need academic letters of recommendation before I apply to grad school 🥲",
            "polarity": 0.0,
            "subjectivity": 0.16666666666666666
        },
        {
            "comment_id": "hilwdoz",
            "body": "You dont really give any benefits of doing this besides \"it will go a long way\"\n\nHow is this a LPT with no benefits? Haha\n\nI'll tell you what most professors will like you if you actively participate in class. Thats all. Those are the students that stand out to them.",
            "polarity": 0.14333333333333337,
            "subjectivity": 0.4
        },
        {
            "comment_id": "hilusyw",
            "body": "If you want to be the professor's friend, do your work well and turn it in on time and without drama.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilsbla",
            "body": "I can get behind this in theory. That being said I slayed university and I didn't get to know a single Prof. Probably different for different majors.",
            "polarity": -0.11785714285714285,
            "subjectivity": 0.5285714285714286
        },
        {
            "comment_id": "hilsaja",
            "body": "OP says \"as a general rule\" and because of that, I'd agree. Faculty mostly want to help you, and even more so if you're a relatable human who is clearly trying your best.\n\nI'm a professor (22 years in). I want to help my students, but I'm not extra-motivated to do so if they won't help themselves (I am still *normally* motivated, though!). Be real with me and I'll do what's fair and reasonable, and even more, to help you out.\n\nI've given extensions to students who just straight up asked if they could make up Friday because game XXXXX is coming out Thursday. I get it, I would have appreciated that back when 16-bit graphics were cool. These students were honest and real. Just be real. Need a moment/day to collect yourself? Good by me, I've been posting my class sessions privately on YouTube for years, and can send you a link. Miss an assignment by a few hours? It's okay just don't make it a habit. In many classes (NOT all) a late assignment is better than no assignment.\n\nA lot (not all, unfortunately... Maybe they're lizard people? [Joking!]) of your professors are also real people with real lives outside of work. Today at 8:30am I joined a work meeting early and watched a colleague playing \"Here Comes the Sun\" by The Beatles on a guitar he made himself. He was proud of his handiwork, and played really well, but he also wanted us early arrivals to hear something positive to start the meeting. Your professors really are real humans. Yes, even the douchebag ones.\n\nDisclaimer: despite what you might have heard, faculty are generally pretty smart. Be real, not exploitative or fake, and don't lie. You *might* get scorched otherwise.",
            "polarity": 0.21200139146567715,
            "subjectivity": 0.45706297670583396
        },
        {
            "comment_id": "hilrbjj",
            "body": "wouldn't hurt to bring a 6 pack of their favorite beverage as well",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment_id": "hilhgv3",
            "body": "This is also a practical life skill. People are more likely to help you if they know you.\n\nIn the context of college, a lot of undergrads going out into the work force or onto higher education tend to forget in the moment that employers want references. Establishing at least a cordial acquaintanceship with an individual who reviews your work product and can attest to your diligence/discipline can never hurt.",
            "polarity": 0.09,
            "subjectivity": 0.5599999999999999
        },
        {
            "comment_id": "hilgdox",
            "body": "LPT this applies to anyone in a position of authority over you. Treat them like a human and they may treat you like one in return",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment_id": "hilef9l",
            "body": "I made the mistake of introducing myself to the professor of a large lecture class back when I was in college. She called on me every day to answer things because mine was the only name she knew. Here's an LPT: wait until you know a bit more about the class and instructor before deciding if knowing them on a one-on-one level is something you really want.",
            "polarity": 0.18285714285714288,
            "subjectivity": 0.4257142857142857
        },
        {
            "comment_id": "hildtzc",
            "body": "I'm 3.9 GPA MBA student and I've never been to an office hour in my entire life. Not even in undergrad.",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "comment_id": "hilarxx",
            "body": "I'm supposed to graduate in December and I've never once been to office hours for any professor.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment_id": "hilabx6",
            "body": "Additional LPT: Use this time to get intimate with your professor and sleep your way to an easy \"A\".  💁🌈🌠",
            "polarity": 0.31666666666666665,
            "subjectivity": 0.7166666666666667
        },
        {
            "comment_id": "hila7lx",
            "body": "As a former college instructor, this is a great LPT. Also, circle back to former ones you like so that when/if you go asking for a recommendation letter the instructor/professor may be more willing to write you a great one.",
            "polarity": 0.33571428571428574,
            "subjectivity": 0.39285714285714285
        },
        {
            "comment_id": "hil9mw6",
            "body": "As a college professor, I think this is excellent advice!",
            "polarity": 1.0,
            "subjectivity": 1.0
        }
    ],
    "top_comments_top": [
        {
            "comment_id": "hil7udo",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hilef9l",
            "body": "I made the mistake of introducing myself to the professor of a large lecture class back when I was in college. She called on me every day to answer things because mine was the only name she knew. Here's an LPT: wait until you know a bit more about the class and instructor before deciding if knowing them on a one-on-one level is something you really want.",
            "ups": 1125,
            "downs": 0,
            "polarity": 0.18285714285714288,
            "subjectivity": 0.4257142857142857
        },
        {
            "comment_id": "hilsaja",
            "body": "OP says \"as a general rule\" and because of that, I'd agree. Faculty mostly want to help you, and even more so if you're a relatable human who is clearly trying your best.\n\nI'm a professor (22 years in). I want to help my students, but I'm not extra-motivated to do so if they won't help themselves (I am still *normally* motivated, though!). Be real with me and I'll do what's fair and reasonable, and even more, to help you out.\n\nI've given extensions to students who just straight up asked if they could make up Friday because game XXXXX is coming out Thursday. I get it, I would have appreciated that back when 16-bit graphics were cool. These students were honest and real. Just be real. Need a moment/day to collect yourself? Good by me, I've been posting my class sessions privately on YouTube for years, and can send you a link. Miss an assignment by a few hours? It's okay just don't make it a habit. In many classes (NOT all) a late assignment is better than no assignment.\n\nA lot (not all, unfortunately... Maybe they're lizard people? [Joking!]) of your professors are also real people with real lives outside of work. Today at 8:30am I joined a work meeting early and watched a colleague playing \"Here Comes the Sun\" by The Beatles on a guitar he made himself. He was proud of his handiwork, and played really well, but he also wanted us early arrivals to hear something positive to start the meeting. Your professors really are real humans. Yes, even the douchebag ones.\n\nDisclaimer: despite what you might have heard, faculty are generally pretty smart. Be real, not exploitative or fake, and don't lie. You *might* get scorched otherwise.",
            "ups": 281,
            "downs": 0,
            "polarity": 0.21200139146567715,
            "subjectivity": 0.45706297670583396
        },
        {
            "comment_id": "hila7lx",
            "body": "As a former college instructor, this is a great LPT. Also, circle back to former ones you like so that when/if you go asking for a recommendation letter the instructor/professor may be more willing to write you a great one.",
            "ups": 74,
            "downs": 0,
            "polarity": 0.33571428571428574,
            "subjectivity": 0.39285714285714285
        },
        {
            "comment_id": "him898w",
            "body": "A lot of commenters (college professors) agree with that LPT. I'm wondering if I'm the only one who would not appreciate some random student to introduce themselves. I've got shit to do. If someone needs something or has a question they're welcome but don't bother me with random stuff.\n\nI have to say though that I'm from Europe and we have a different culture on smalltalk, maybe that's the difference.",
            "ups": 54,
            "downs": 0,
            "polarity": -0.06666666666666665,
            "subjectivity": 0.7166666666666667
        }
    ],
    "top_comments_best": [
        {
            "comment_id": "hil7udo",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hilef9l",
            "body": "I made the mistake of introducing myself to the professor of a large lecture class back when I was in college. She called on me every day to answer things because mine was the only name she knew. Here's an LPT: wait until you know a bit more about the class and instructor before deciding if knowing them on a one-on-one level is something you really want.",
            "ups": 1127,
            "downs": 0,
            "polarity": 0.18285714285714288,
            "subjectivity": 0.4257142857142857
        },
        {
            "comment_id": "hilsaja",
            "body": "OP says \"as a general rule\" and because of that, I'd agree. Faculty mostly want to help you, and even more so if you're a relatable human who is clearly trying your best.\n\nI'm a professor (22 years in). I want to help my students, but I'm not extra-motivated to do so if they won't help themselves (I am still *normally* motivated, though!). Be real with me and I'll do what's fair and reasonable, and even more, to help you out.\n\nI've given extensions to students who just straight up asked if they could make up Friday because game XXXXX is coming out Thursday. I get it, I would have appreciated that back when 16-bit graphics were cool. These students were honest and real. Just be real. Need a moment/day to collect yourself? Good by me, I've been posting my class sessions privately on YouTube for years, and can send you a link. Miss an assignment by a few hours? It's okay just don't make it a habit. In many classes (NOT all) a late assignment is better than no assignment.\n\nA lot (not all, unfortunately... Maybe they're lizard people? [Joking!]) of your professors are also real people with real lives outside of work. Today at 8:30am I joined a work meeting early and watched a colleague playing \"Here Comes the Sun\" by The Beatles on a guitar he made himself. He was proud of his handiwork, and played really well, but he also wanted us early arrivals to hear something positive to start the meeting. Your professors really are real humans. Yes, even the douchebag ones.\n\nDisclaimer: despite what you might have heard, faculty are generally pretty smart. Be real, not exploitative or fake, and don't lie. You *might* get scorched otherwise.",
            "ups": 276,
            "downs": 0,
            "polarity": 0.21200139146567715,
            "subjectivity": 0.45706297670583396
        },
        {
            "comment_id": "hila7lx",
            "body": "As a former college instructor, this is a great LPT. Also, circle back to former ones you like so that when/if you go asking for a recommendation letter the instructor/professor may be more willing to write you a great one.",
            "ups": 73,
            "downs": 0,
            "polarity": 0.33571428571428574,
            "subjectivity": 0.39285714285714285
        },
        {
            "comment_id": "hilusyw",
            "body": "If you want to be the professor's friend, do your work well and turn it in on time and without drama.",
            "ups": 29,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "top_comments_hot": [
        {
            "comment_id": "hil7udo",
            "body": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "ups": 1,
            "downs": 0,
            "polarity": 0.7250000000000001,
            "subjectivity": 0.6625
        },
        {
            "comment_id": "hilef9l",
            "body": "I made the mistake of introducing myself to the professor of a large lecture class back when I was in college. She called on me every day to answer things because mine was the only name she knew. Here's an LPT: wait until you know a bit more about the class and instructor before deciding if knowing them on a one-on-one level is something you really want.",
            "ups": 1129,
            "downs": 0,
            "polarity": 0.18285714285714288,
            "subjectivity": 0.4257142857142857
        },
        {
            "comment_id": "hilsaja",
            "body": "OP says \"as a general rule\" and because of that, I'd agree. Faculty mostly want to help you, and even more so if you're a relatable human who is clearly trying your best.\n\nI'm a professor (22 years in). I want to help my students, but I'm not extra-motivated to do so if they won't help themselves (I am still *normally* motivated, though!). Be real with me and I'll do what's fair and reasonable, and even more, to help you out.\n\nI've given extensions to students who just straight up asked if they could make up Friday because game XXXXX is coming out Thursday. I get it, I would have appreciated that back when 16-bit graphics were cool. These students were honest and real. Just be real. Need a moment/day to collect yourself? Good by me, I've been posting my class sessions privately on YouTube for years, and can send you a link. Miss an assignment by a few hours? It's okay just don't make it a habit. In many classes (NOT all) a late assignment is better than no assignment.\n\nA lot (not all, unfortunately... Maybe they're lizard people? [Joking!]) of your professors are also real people with real lives outside of work. Today at 8:30am I joined a work meeting early and watched a colleague playing \"Here Comes the Sun\" by The Beatles on a guitar he made himself. He was proud of his handiwork, and played really well, but he also wanted us early arrivals to hear something positive to start the meeting. Your professors really are real humans. Yes, even the douchebag ones.\n\nDisclaimer: despite what you might have heard, faculty are generally pretty smart. Be real, not exploitative or fake, and don't lie. You *might* get scorched otherwise.",
            "ups": 278,
            "downs": 0,
            "polarity": 0.21200139146567715,
            "subjectivity": 0.45706297670583396
        },
        {
            "comment_id": "hila7lx",
            "body": "As a former college instructor, this is a great LPT. Also, circle back to former ones you like so that when/if you go asking for a recommendation letter the instructor/professor may be more willing to write you a great one.",
            "ups": 79,
            "downs": 0,
            "polarity": 0.33571428571428574,
            "subjectivity": 0.39285714285714285
        },
        {
            "comment_id": "hilusyw",
            "body": "If you want to be the professor's friend, do your work well and turn it in on time and without drama.",
            "ups": 28,
            "downs": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}