{
    "time_posted": "2021-10-30 15:05:00",
    "url": "https://www.youtube.com/watch?v=9AdbCyRD7U0",
    "time_now": "2021-11-02 14:44:53",
    "ups": "10672",
    "downs": "158",
    "views": "381982",
    "top_comments": [
        {
            "comment": "They’re evolving....",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Dragon egg!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Poke it with a stick",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Going to tenerife, the Island next to la palmas next month.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That was on my 20th birthday😱\n. I was born on september 19, 2001",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You know the narrator spent hours practising how to pronounce _la cumbre vieja_ .\nShe says it just like the female voice on google translate.",
            "polarity": -0.05,
            "subjectivity": 0.13333333333333333
        },
        {
            "body": "Can you be imagine theres a large one",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.42857142857142855
        },
        {
            "body": "They’re evolving....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey! Hot potato! Who wants to play a round? 😜",
            "polarity": 0.10416666666666664,
            "subjectivity": 0.45
        },
        {
            "body": "LakumnbbbrrreeDghhggfAaa.. is it correct? 😁",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "1 John 1:9\r\nNew International Version\r\n9 If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.22727272727272727
        },
        {
            "body": "Luke 18:9-14\r\nNew International Version\r\nThe Parable of the Pharisee and the Tax Collector\r\n9 To some who were confident of their own righteousness and looked down on everyone else, Jesus told this parable: 10 “Two men went up to the temple to pray, one a Pharisee and the other a tax collector. 11 The Pharisee stood by himself and prayed: ‘God, I thank you that I am not like other people—robbers, evildoers, adulterers—or even like this tax collector. 12 I fast twice a week and give a tenth of all I get.’\r\n\r\n13 “But the tax collector stood at a distance. He would not even look up to heaven, but beat his breast and said, ‘God, have mercy on me, a sinner.’\r\n\r\n14 “I tell you that this man, rather than the other, went home justified before God. For all those who exalt themselves will be humbled, and those who humble themselves will be exalted.”",
            "polarity": 0.10052800734618915,
            "subjectivity": 0.5092516069788797
        },
        {
            "body": "Acts 2:17-21\r\nNew International Version\r\n17 “‘In the last days, God says,\r\n    I will pour out my Spirit on all people.\r\nYour sons and daughters will prophesy,\r\n    your young men will see visions,\r\n    your old men will dream dreams.\r\n18 Even on my servants, both men and women,\r\n    I will pour out my Spirit in those days,\r\n    and they will prophesy.\r\n19 I will show wonders in the heavens above\r\n    and signs on the earth below,\r\n    blood and fire and billows of smoke.\r\n20 The sun will be turned to darkness\r\n    and the moon to blood\r\n    before the coming of the great and glorious day of the Lord.\r\n21 And everyone who calls\r\n    on the name of the Lord will be saved.’",
            "polarity": 0.16233766233766236,
            "subjectivity": 0.28160173160173163
        },
        {
            "body": "Ephesians 6:10-18\r\nNew International Version\r\nThe Armor of God\r\n10 Finally, be strong in the Lord and in his mighty power. 11 Put on the full armor of God, so that you can take your stand against the devil’s schemes. 12 For our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the spiritual forces of evil in the heavenly realms. 13 Therefore put on the full armor of God, so that when the day of evil comes, you may be able to stand your ground, and after you have done everything, to stand. 14 Stand firm then, with the belt of truth buckled around your waist, with the breastplate of righteousness in place, 15 and with your feet fitted with the readiness that comes from the gospel of peace. 16 In addition to all this, take up the shield of faith, with which you can extinguish all the flaming arrows of the evil one. 17 Take the helmet of salvation and the sword of the Spirit, which is the word of God.\r\n\r\n18 And pray in the Spirit on all occasions with all kinds of prayers and requests. With this in mind, be alert and always keep on praying for all the Lord’s people.",
            "polarity": -0.0907925407925408,
            "subjectivity": 0.5958624708624709
        },
        {
            "body": "But dont bombs go boom, that boulder did not.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Imagine sum dumbass doesn't know what it is an tries to pick it up",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "body": "And remember the movie \"volcano\"\nThe lava bomb landed then shot lava out and burned a girls leg\n\nMaybe do not gey close just in case haha",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "I just wanna poor water on it",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "Oh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The earth is fighting back!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}