{
    "time_posted": "2021-10-30 16:00:12",
    "url": "https://www.youtube.com/watch?v=_eUHAkRhPHA",
    "time_now": "2021-10-31 13:18:32",
    "ups": "1741",
    "downs": "7",
    "views": "18492",
    "top_comments": [
        {
            "comment": "Two more items to add to your list:  The first is a bottle or two of water.  Guests may need a drink, sometimes in the middle of the night, and not know where to get one or feel awkward asking.  The other is to put your WiFi password in a pretty little frame set out on the bedside table or dresser.  It’s so much fun surprising guests with unexpected niceties.  Great vid as always Lisa!",
            "likes": 8,
            "number_of_replies": 0,
            "polarity": 0.19886363636363635,
            "subjectivity": 0.5598484848484848
        },
        {
            "comment": "I ask my guests/family while they stay to let me know if there is anything I need to add or change to help in their stay. I make a list to get or do if it doesn’t happen while they are here. Then the next time when someone stays it is much better. \nThat’s when I learned about the tissues, fans, and the tub drain that wasn’t draining well.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.25
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I'd love to have a guest room! One thing I don't see commented anywhere, though- ear plugs as well as the sleep masks someone commented. And PLEASE don't use scents in the air or on the sheets! Idk how many times I've passed by someone on the street wearing colognes or perfume, I immediately cannot breathe! (I also can't go into the laundry or pesticide aisles in the store). The smell of \"Gain\" actually would make it impossible for me to be in that room😕😕😷",
            "polarity": 0.18489583333333334,
            "subjectivity": 0.55
        },
        {
            "body": "OMG! They will never leave! Haha.  (So do the opposite when you don't want them staying long!)\nI loved this. I do all that except for the hooks so they can hang things.  My welcome basket does not look nearly as good as this but I love it!",
            "polarity": 0.4232142857142857,
            "subjectivity": 0.5142857142857143
        },
        {
            "body": "I ask my guests/family while they stay to let me know if there is anything I need to add or change to help in their stay. I make a list to get or do if it doesn’t happen while they are here. Then the next time when someone stays it is much better. \nThat’s when I learned about the tissues, fans, and the tub drain that wasn’t draining well.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "Great tips! I think I need to add hooks.\n\nPerfect timing on this video. My sister is coming in two days. Woo Hoo!!! We are like two Lisa Holt’s personalities on caffeine. I can’t wait!!!\nI just created a new guest space for her yesterday. Our 20 yr old daughter decided to move out a couple of months ago. I had a blank white room to start with. 🙌 We now call it the upper east wing instead of _____’s room. 😆 No more game room/guest room in this house. \n\nI would add to the list:\n*Charging station\n*Tissues!!! (We live in the allergy belt)\n*Wastebasket(s)\n*Reading nook and/or a desk area with a notebook/journal, post it notes, and a sharpie. I also like to give my favorite pens away. Pilot Frixion♥️ They are erasable GEL pens. They do not need a special shedding eraser. They use friction/heat to erase. They are AWESOME!!!\n*Maybe a small fan and or noise machine -My sister always requests at least one fan. She lives in the north.  We live in beautiful warmer Tulsa. 😊\n*Clock (I know most of us use our phones, but some like having an easy to see clock in the night and not have to pick up their phone. Maybe a wall clock as art. 🤷‍♀️) \nOh, and maybe one I’m the bathroom \n\nSpeaking of the bathroom-if it is shared:  \n*counter space\n*drawer space\n*place to hang their towels \n*space in shower for shampoo etc. \n*blow dryer\n*maybe an iron or a small steamer\n*double check to make sure there is enough TP!!!\n*even though it is ugly a plunger is handy. It saves them the embarrassment of asking. We’ve had this happen. \n\nOf course clean it thoroughly and then some!!! Maybe even use it yourself just to see if there is something one can add or remove. \n\nOoooh, I think I need to get a make up mirror for guests. 💡 🤳 🪞\n\n(My guest share the bathroom with my kid(s) It’s not ideal, but only my family comes to visits.)",
            "polarity": 0.17801653331787257,
            "subjectivity": 0.585649866007009
        },
        {
            "body": "Shortly after moving into our current home, I announced to my husband one night that I was going to go sleep in the guestroom.   He thought he was in trouble and asked why.  I told him I needed to make sure I'd gotten everything right for future company. 😄",
            "polarity": 0.0976190476190476,
            "subjectivity": 0.4082671957671957
        }
    ]
}