{
    "time_posted": "2021-10-30 16:00:12",
    "url": "https://www.youtube.com/watch?v=_eUHAkRhPHA",
    "time_now": "2021-11-03 07:14:20",
    "ups": "2544",
    "downs": "10",
    "views": "31802",
    "top_comments": [
        {
            "comment": "I look at my guest rooms as if I am going to stay there: is it comfortable, is the light within easy reach when reading in bed, etc etc. Thank you for the tips, I am missing the comfy throw! 😍",
            "likes": 2,
            "number_of_replies": 1,
            "polarity": 0.24583333333333335,
            "subjectivity": 0.5958333333333333
        },
        {
            "comment": "I would add some coasters, a box of tissues, bottled water and a small trash can.  Great video!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.375,
            "subjectivity": 0.575
        },
        {
            "comment": "Great video. Living out of a suitcase is horrible when visiting!  You hit all the comforts that I like to have  to my guests. I did add a reading lamp with a USB on the base. I realized that when my daughter started running wires all over the place on the guest room! \nFabulous video has always. Need to get on to your your new design club. 😍",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": -0.13272727272727272,
            "subjectivity": 0.8409090909090908
        },
        {
            "comment": "And PLEEEEEZ, put a table of some sort on each side of the bed.  I've been in far too many guest rooms where there is NO bedside table, hence no lamp, no surface for a book or glass of wine, and no where for kleenex or anything else.  And speaking of glass of wine, how about a bottle of wine, corkscrew and wine glasses?  Fresh flowers, some fashion magazines, small nail kit and bath oils and bath salts.  We often don't pamper ourselves at home, but when we are away it seems so much more possible.if some of these supplies are available to us/our guests.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.2583333333333333,
            "subjectivity": 0.5499999999999999
        },
        {
            "comment": "I would had one more thing to the list, if there is any space to do so in the room (if it can fit put one it absolutely) : a bench. Why? Because the best thing when you arrive at some place and have to unpack, is to have something to hold your suitcase above the floor! So convenient! Otherwise you have to put your suitcase on the bed and it might stain the bedding, or bend over the floor when your back is already strained from travelling. And when unpacking is done, the bench can be used as an extra seat to help put on your shoes or deal with dressing up a kid.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.3,
            "subjectivity": 0.3285714285714286
        }
    ],
    "comments_since_last_sample": []
}