{
    "time_posted": "2021-10-30 16:00:12",
    "url": "https://www.youtube.com/watch?v=_eUHAkRhPHA",
    "time_now": "2021-11-05 16:54:59",
    "ups": "2748",
    "downs": "10",
    "views": "35134",
    "top_comments": [
        {
            "comment": "I look at my guest rooms as if I am going to stay there: is it comfortable, is the light within easy reach when reading in bed, etc etc. Thank you for the tips, I am missing the comfy throw! 😍",
            "likes": 2,
            "number_of_replies": 2,
            "polarity": 0.24583333333333335,
            "subjectivity": 0.5958333333333333
        },
        {
            "comment": "I would add some coasters, a box of tissues, bottled water and a small trash can.  Great video!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.375,
            "subjectivity": 0.575
        },
        {
            "comment": "Loved the welcome basket and the robes idea! I love these tips LISA!!! Thanks for sharing all your knowledge. LOVE from Argentina!",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.7003125000000001,
            "subjectivity": 0.6200000000000001
        },
        {
            "comment": "I would had one more thing to the list, if there is any space to do so in the room (if it can fit put one it absolutely) : a bench. Why? Because the best thing when you arrive at some place and have to unpack, is to have something to hold your suitcase above the floor! So convenient! Otherwise you have to put your suitcase on the bed and it might stain the bedding, or bend over the floor when your back is already strained from travelling. And when unpacking is done, the bench can be used as an extra seat to help put on your shoes or deal with dressing up a kid.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.3,
            "subjectivity": 0.3285714285714286
        },
        {
            "comment": "Love this video! Thank you! I also have 2 nice luggage racks I can put out for guests. People always tell me how much they love having a luggage rack!",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.5515625,
            "subjectivity": 0.6
        }
    ],
    "comments_since_last_sample": []
}