{
    "time_posted": "2021-10-30 16:00:12",
    "url": "https://www.youtube.com/watch?v=_eUHAkRhPHA",
    "time_now": "2021-10-31 05:04:58",
    "ups": "1475",
    "downs": "7",
    "views": "14516",
    "top_comments": [
        {
            "comment": "Two more items to add to your list:  The first is a bottle or two of water.  Guests may need a drink, sometimes in the middle of the night, and not know where to get one or feel awkward asking.  The other is to put your WiFi password in a pretty little frame set out on the bedside table or dresser.  It’s so much fun surprising guests with unexpected niceties.  Great vid as always Lisa!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.19886363636363635,
            "subjectivity": 0.5598484848484848
        },
        {
            "comment": "Lisa I worked in luxury Hospitaly for a number of years . I just finished two guest room and viola .. I have comfort , white linens , plush white towels , white robes , water carafe next to bed and a little crystal jar of delicious gummy bears 🥰glad your advice is much like my own personal taste . Thank you",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.17916666666666664,
            "subjectivity": 0.3333333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Bath sheets are towels that are larger than bath towels, similar in size to a beach towel",
            "polarity": 0.0,
            "subjectivity": 0.45
        },
        {
            "body": "We finally have a guest room with just two kids left at home. I’ve had fun getting it ready for company with just about everything on your list! Glad to know I’m on the right track!",
            "polarity": 0.2345238095238095,
            "subjectivity": 0.5392857142857143
        },
        {
            "body": "Hi. It’s Deb in Dallas how did you know my bestie from college gets here next Sunday. 47 years, we’ve been such dear friends. I’m taking her to Magnolia, which is only about 1-1/2 hrs from here. I hope this Air bnb is a good one. I’m treating for something special.",
            "polarity": 0.21142857142857144,
            "subjectivity": 0.5342857142857144
        },
        {
            "body": "Love all the tips!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Hi!  It’s Deb from Dallas.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I giggled all the way through this video.  Your tips were spot on, but all I could think about is  the advice my father gave me when I bought my first home...\"Don't ever make your guestroom too comfortable. You will regret it as your guests will never want to leave\"  Boy was he right!  Oh well, lesson learned the hard way.  lol.",
            "polarity": 0.3030952380952381,
            "subjectivity": 0.5821428571428571
        },
        {
            "body": "Thank you Lisa!!!❤️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks for the great info.. you re so right. Always enjoy all your designs.",
            "polarity": 0.4214285714285714,
            "subjectivity": 0.49642857142857144
        },
        {
            "body": "❤️ Love this",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Two more items to add to your list:  The first is a bottle or two of water.  Guests may need a drink, sometimes in the middle of the night, and not know where to get one or feel awkward asking.  The other is to put your WiFi password in a pretty little frame set out on the bedside table or dresser.  It’s so much fun surprising guests with unexpected niceties.  Great vid as always Lisa!",
            "polarity": 0.19886363636363635,
            "subjectivity": 0.5598484848484848
        },
        {
            "body": "Where to buy plush towels?  I've tried a few places that after washing a few times they are not that plush.  Any suggestions anyone?",
            "polarity": -0.2,
            "subjectivity": 0.1
        },
        {
            "body": "Thank you!!!\nAwesome I love it!!",
            "polarity": 0.890625,
            "subjectivity": 0.8
        },
        {
            "body": "Guestroom..? 🤔 Oh yeah - that space oddball furniture goes to die, lol.\nBut seriously, great thoughts. Esp. re clean white bedding & towels. Will remember that. It's true, there's nothing worse than sleeping in a dingy stale unkempt guest bed. There've been times I've slept on top of the bedspread, my coat used as a blanket, no joke.\n\n(I keep clean guest blankets in their original plastic packaging bags with half a dryer sheet tucked inside so they always smell freshly laundered. However, if your guest(s) has fragrance allergies this might be a bad idea. Probably best to ask them before they arrive.)",
            "polarity": 0.22083333333333338,
            "subjectivity": 0.5345238095238096
        }
    ]
}