{
    "time_posted": "2021-10-30 16:00:12",
    "url": "https://www.youtube.com/watch?v=_eUHAkRhPHA",
    "time_now": "2021-10-31 09:11:47",
    "ups": "1598",
    "downs": "7",
    "views": "16941",
    "top_comments": [
        {
            "comment": "Two more items to add to your list:  The first is a bottle or two of water.  Guests may need a drink, sometimes in the middle of the night, and not know where to get one or feel awkward asking.  The other is to put your WiFi password in a pretty little frame set out on the bedside table or dresser.  It’s so much fun surprising guests with unexpected niceties.  Great vid as always Lisa!",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.19886363636363635,
            "subjectivity": 0.5598484848484848
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Oh no!  Company is COMING?  Why didn't you tell me sooner?  CWAP!   ~  The basket idea is super fab.  I like those water carafes with an glass turned upside down for the lid.  I put a flashlight in the drawer and have nightlights if they want they can unplug.  Sound machine and black out curtains.  Your robe idea and dual firmness pillows, is so fabulous, mind blown.  Thanks!  My mom...the last thing she tells her guests before they turn in, is which cabinet to find the chocolate stash is in in the kitchen~so there is that.  : )",
            "polarity": 0.1951388888888889,
            "subjectivity": 0.5069444444444444
        },
        {
            "body": "This is the best thing I learned regarding the guest room. You don't just tell us what to do but explain why as well in a so confident way. So nice to hear advices from a real expert. You're the best Liza. Thanks a lot dear 😘",
            "polarity": 0.5833333333333334,
            "subjectivity": 0.48888888888888893
        },
        {
            "body": "flowers from the garden, water flask with glasses, Tylenol or Asprin, books, rescue remedy, hand cream and adaptors",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wait “your kids sister” is that a riddle?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love it! My girlfriend visited me last month, she forgot hair gel & night moisturize another idea for your list 😘",
            "polarity": 0.3125,
            "subjectivity": 0.3333333333333333
        }
    ]
}