{
    "time_posted": "2021-10-30 15:00:00",
    "url": "https://www.youtube.com/watch?v=alrdCmo2i20",
    "time_now": "2021-10-31 00:57:43",
    "ups": "2277",
    "downs": "31",
    "views": "21579",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "\"I Put Myself Into an N64 Game (And For a Few Thousand Dollars You C...\"\n\nThat title change...",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.25
        },
        {
            "body": "I want to see more N64 DD Videos",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "17:27 Yes I would love to more Nintendo 64-DD video from you! ❤",
            "polarity": 0.5625,
            "subjectivity": 0.55
        },
        {
            "body": "thought it might've just been me but it sounds like the general voiceover is a lil balanced towards the right? i want uncle derek in both ears! don't take that outta context.",
            "polarity": 0.20357142857142857,
            "subjectivity": 0.5178571428571428
        },
        {
            "body": "I can't say I ever did anything like that with Nintendo stuff, but back in the xbox 360 days I had a 360 camera (specifically for being able to video call with a family member) and discovered that Tom Clancy's Rainbow Six Vegas 2 had an option to use the camera to take a picture of your face and map it to your character in game. So I did that and it actually did a fairly good job of reproducing my major facial features. It wasn't perfect of course, but with my gear on it looked enough like me that it was passable.",
            "polarity": 0.20694444444444443,
            "subjectivity": 0.4138888888888889
        },
        {
            "body": "\"I am thorough!\"\n\"Even Uncle Derek's got his limits.\"\n-Top 20 Most Empathetic Anime Villain Backstories",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "12:34 tbf NOTHING is exciting as perfect head.",
            "polarity": 0.65,
            "subjectivity": 0.9
        },
        {
            "body": "Uncle Derek living my 13yo selfs dream. \n\nJust wow.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "So, more than inspired, R&D1 worked on the polygon studio. I was kind of wondering with how often the teams cross pollinate. From an April 2006 interview:\nWell to tell you the truth, this happened a couple of years \nago.  At the time our team was working on a game called Mario Artist: \nPolygon Studio for the N64 DD.  As you know it was an extra accessory \nfor the N64. In Polygon Studio you could create 3D models and animate \nthem in the game, but there was also a side game included inside.  In \nthis game you would have to play short games that came one after \nanother.  This is where the idea for Wario Ware came from.",
            "polarity": -0.05555555555555555,
            "subjectivity": 0.3777777777777777
        },
        {
            "body": "Love seeing DDs",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "YES PLEASE! MORE DD VIDEOS!!!!",
            "polarity": 1.0,
            "subjectivity": 0.5
        },
        {
            "body": "D's",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "pls let us see the capture feature!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So if your name is more the two syllables gotta shorten it",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "....i....i also own 2 gameboy cameras....and i honestly have NO IDEA how i got the second one, i just opened up my old gameboy case, and had one in my old grey brick, and another in my gba....NO DAMN CLUE how i got the second one, or where it came from...",
            "polarity": 0.19285714285714287,
            "subjectivity": 0.3428571428571429
        },
        {
            "body": "Disk swapping on the Nintendo 64 DD",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It kinda bugs me how you put a every thing you could use on display as if you needed all of it when In reality half of those are alternatives for the same part of the process?",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.14583333333333331
        },
        {
            "body": "Dude Uncle Derek just can't miss these days",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "4 shades of grey ;)",
            "polarity": 0.1,
            "subjectivity": 0.55
        },
        {
            "body": "You might have been the only person to have done this, incredible",
            "polarity": 0.45,
            "subjectivity": 0.95
        }
    ]
}