{
    "time_posted": "2021-10-30 12:45:00",
    "url": "https://www.youtube.com/watch?v=BH-J-KX-7Z4",
    "time_now": "2021-10-30 16:46:18",
    "ups": "438",
    "downs": "6",
    "views": "2389",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "My favourite was the little star made from the sweater. It looked so cute as a topper! And whoever gets it can use it as a tree ornament year after year! Can you do some more like that? That'd be awesome! Thanks for sharing another helpful and beautiful video ❤",
            "polarity": 0.5239583333333334,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "I love the mason jar sweaters!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Everything turned out very beautiful and I enjoyed all of them, but I have to say the French horn swag was my absolute favorite. 🌹",
            "polarity": 0.44000000000000006,
            "subjectivity": 0.72
        },
        {
            "body": "Christina you sure know how to make everything special and unique. I learn a lot from you! Thank you and have a great day! ❤",
            "polarity": 0.5814732142857143,
            "subjectivity": 0.8025793650793651
        },
        {
            "body": "Maybe for your string on the horn...to keep it looking a bit cleaner...use longer string ( like a double loop) and tie it at the horn only...then cover it with ribbon or small flowers like baby's breathe.",
            "polarity": -0.125,
            "subjectivity": 0.2
        },
        {
            "body": "You are so gifted and creative! I love watching your diy's. I loved the french horn project. I had one of those and purged it one year when I needed to let go of some Christmas decor. Now I wish I had it. I'll have to keep an eye out for one at a thrift store and make a decor piece like yours.",
            "polarity": 0.465,
            "subjectivity": 0.68
        },
        {
            "body": "I just loved the bowl and French horn! Well done.",
            "polarity": 0.35,
            "subjectivity": 0.4
        },
        {
            "body": "Thanks for the fab video ❤️",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "That French horn swag is gorgeous!",
            "polarity": 0.4375,
            "subjectivity": 0.45
        },
        {
            "body": "Great ideas thank you !",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "Love watching all of your creative ideas. They are all so beautiful, I agree with you the French horn was my favorite.",
            "polarity": 0.47000000000000003,
            "subjectivity": 0.72
        },
        {
            "body": "Lovely crafts!",
            "polarity": 0.625,
            "subjectivity": 0.75
        },
        {
            "body": "Great decor, I love that you got so much at the thrift store. Love the music pages, and the wood bowl.",
            "polarity": 0.5,
            "subjectivity": 0.5375
        },
        {
            "body": "I’m so loving the wood bowl !!! I wish I had a value village.",
            "polarity": 1.0,
            "subjectivity": 0.95
        },
        {
            "body": "Love them all! Now I need to go thrifting! :)",
            "polarity": 0.640625,
            "subjectivity": 0.8
        },
        {
            "body": "I am a bit of a bookworm so I really like the book stack...but as usual, these are all great ideas. Thanks Christina.",
            "polarity": 0.2375,
            "subjectivity": 0.35
        },
        {
            "body": "All of these thrifted up cycled crafts are so beautiful! It’s hard to pick a favourite! They all make gorgeous, unique Christmas decor! Such great ideas!",
            "polarity": 0.4673611111111111,
            "subjectivity": 0.7819444444444444
        },
        {
            "body": "Still not ready for the holidays, but these are great ideas!",
            "polarity": 0.45,
            "subjectivity": 0.625
        },
        {
            "body": "Wonderful ideas! Thank you. My favorite-the mason jars with thrifted sweater😊",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Gorgeous!",
            "polarity": 0.875,
            "subjectivity": 0.9
        }
    ]
}