{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-11-03 15:28:35",
    "ups": "9154",
    "downs": "112",
    "views": "237194",
    "top_comments": [
        {
            "comment": "Let's go Brandon! FJB 👌👌👌👌",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I'm from the south and I know not to get between a mamma bear and her cubs! Evidently some city democrats have never been taught this! Mamma bear 101 is in session America! Let's go Brandon!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.762939453125,
            "subjectivity": 0.25
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "People didn't come to their senses, in Virginia. Voting for the other side of the same coin. Youngkin, that is.  It's politics. It's a system of control, used by Wall Street bankers. In the presidential election, they made sure Biden won, and then turned him into, \"the senile hair sniffer\". Now the ball's been lateraled back to a Republican, in Virginia. When the Republican effs up, and people are angry, the Wall Street power mongers will lateral the ball back, and \"give\" America a Democrat. Wall Street owns both parties, and plays games, with the public, over and over again. Meanwhile  behind the scenes, both parties are following a predetermined path of destruction, against our country. The public's easy. They just want to pick a team, to stand behind. Sports has been used to condition people to think that way. The people vote, thinking it's Republicans against Democrats. The truth is,  it's the \"Two party\", against the public.   Smoke and mirrors............... AND overall we continue to loose America.",
            "polarity": -0.037905982905982905,
            "subjectivity": 0.34609686609686613
        }
    ]
}