{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-11-01 01:40:06",
    "ups": "7762",
    "downs": "89",
    "views": "186546",
    "top_comments": [
        {
            "comment": "These shots can only hurt children,not help them.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Democrats have become completely unhinged postmodern post-truth neo-Marxist bull, woke style.\nLet me warn you...if this continues normal regular people are in danger of years of oppression.\nThat said, the world will come under the sway of a global dictationship.  The EU has threatened Australia on zero emissions while The People's republic of China is still off the hook......",
            "polarity": 0.0625,
            "subjectivity": 0.2817307692307692
        },
        {
            "body": "These shots can only hurt children,not help them.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Children R Innocent  Leave the Children Alone  Leave  Women Alone  & Leave  Animals  Alone",
            "polarity": 0.5,
            "subjectivity": 0.7
        },
        {
            "body": "Youngkin will lose magically in the middle of the night.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Can I go to Virginia and vote for Youngkin,the commies did it in 2020",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Joe is criminal and chief and the so called Democrats are organized crime",
            "polarity": -0.4,
            "subjectivity": 0.55
        },
        {
            "body": "This harkens back to Hillary's \"It takes a village to raise a child.\" Everyone clamored over it, but put it into action and look what you have now!",
            "polarity": 0.0625,
            "subjectivity": 0.05
        },
        {
            "body": "This isn't wokeness this is socialist time to get rid of them vote them out of office",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I've said it once I've said it twice time to get rid of the democratic establishment they do not care about America and they do not care about Americans citizens what they care about is their own political power and whatever inside trading they can get to make themselves enriched evil is here time to get rid of the evil",
            "polarity": -0.35,
            "subjectivity": 0.775
        },
        {
            "body": "These parents are worried about their children and what education they are getting.Political influences are not acceptable because they must grow to understand. But now a group trying to influence the children to have a preconceived notion about every single thing they believe.This is what the parents want to stop.Good on their efforts.",
            "polarity": -0.07142857142857142,
            "subjectivity": 0.21428571428571427
        },
        {
            "body": "Democrat’s own their awful, evil, and criminal agenda? Hell would freeze first. Dems are 100% evil.",
            "polarity": -0.425,
            "subjectivity": 0.8138888888888888
        },
        {
            "body": "I don’t know because the democratic can cheat.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The district of Columbia is UNITED STATES corporation and is foreign to the United States of America.",
            "polarity": -0.125,
            "subjectivity": 0.125
        },
        {
            "body": "Excepting benefits and privileges like Social Security birth certificates make our children wards of the court. Take your powers back with baby deeds. move into the private get out of the public or at least protect yourself by giving notice using the four corners of your contract abilities. Affidavits people. Affidavits of truth affidavits of independence affidavits of sovereignty. Keys",
            "polarity": -0.05333333333333333,
            "subjectivity": 0.18166666666666667
        },
        {
            "body": "That's because Democrats don't care about you or your kids only how much money they can steal from your paychecks.",
            "polarity": 0.1,
            "subjectivity": 0.6
        },
        {
            "body": "Women need to kick Biden's butt",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Feel so sorry for this generation of parents and children. Fight that fight moms!",
            "polarity": -0.625,
            "subjectivity": 1.0
        },
        {
            "body": "Trump supporters won't go away without crying . A President Trump who fell asleep on a virus n lies about everything",
            "polarity": -0.2,
            "subjectivity": 0.6
        },
        {
            "body": "Biden is dead. These mandates are signed by a forger. This is illegal. A mandate is not a law.",
            "polarity": -0.35,
            "subjectivity": 0.45
        }
    ]
}