{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-11-01 09:54:02",
    "ups": "8248",
    "downs": "101",
    "views": "205897",
    "top_comments": [
        {
            "comment": "We must stand up and Fight for our KIDS 🙏🏻🇺🇸",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Democrats take their own children to great schools but parent are not allowed.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.7,
            "subjectivity": 0.875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "8 lead untill they find the hidden ballots from the left...",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "fox news is not news.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why should Democrats care what Mums think? Mums don't pay as much money as teacher's unions. Mums still vote for Democrats over Republicans because Democrats appear \"nicer\".",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Most democrats are literal kids who never grew out of teen mentality, what else can you expect when a bunch of teens, get such power.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "It's called comunnesim that's what the left want",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "She had me at \"educrats\".",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love these women!!",
            "polarity": 0.78125,
            "subjectivity": 0.6
        },
        {
            "body": "Democrats target anyone who challenges thier narrative,  parents of public school students are the current flavor of the month.  I went to a private Catholic school but in my day it didn't matter if you went to a public or private school parents were very involved in thier kids educational progress. Parents went to parent/teacher conferences in person and teachers made sure parents were kept informed of their kids progress.  But as time went on parents were not as involved as they once were and teachers attitudes changed. Teachers unions became political and school boards were made up of wannabe politicians with a personal agenda and sucked up to the unions because they needed the unions support if an elected boardmember pursued higher political office. Many of the liberals attacking parents most likely don't send thier kids to a public school or don't even have kids, were never career teachers or are members of the LGBT community with a self serving agenda.  For the last 20 years or so parents didn't involve themselves in thier kids education progress and educators took advantage of that and began pushing a political ideology that was anything but American. The pandemic did have a positive effect,  it gave many parents the opportunity to listen to their kids Zoom classes which exposed them to what was really going on in the classroom. Some school districts made desperate attempts to keep parents from seeing what was being taught in the classroom for good reason, they didn't want the truth exposed. There are a lot of dedicated,  caring and talented teachers out there but sadly they are bullied by hard-core union members and corrupt school administrators who really don't have the kids best interest.  Educators have overplayed there hand and parents are now beginning to wake up. I only hope colleges start feeling the heat as they have been screwing students for the last 20 years. I work at one in a non academic position and I will say this students, especially the current generation of young minds are getting violently sodomized by liberal and far left activist educators only the students don't know it yet. What this country needs is a Student Bill Of Rights or some kind of lemon law so students can hold activist or incompetent teachers and administrators accountable for not preparing them to properly survive the real world.  A lot of this should be the responsibility of parents but parents themselves are to blame. Over the last few years I've watched or read the insane opinions that many teachers have expressed that should have resulted in the removal of those teachers from the classrooms but administrators protected them because they were owned by unions. College level educators have the protection of tenure unless of course your an educator who doesn't share the liberal far left Anti American ideology at which point academic freedom and tenure somehow doesn't apply and those teachers are removed from the classroom and fired. Students shouldn't be going to school to have thier identity and self esteem ripped from them by some ignorant activist masquerading as a educator.  Any teacher that tells 6 year old kids that your evil because you were born white or showing them how to masturbate should be brought up on child abuse charges and banned from ever teaching anyone under 30 years old for life.",
            "polarity": 0.046022727272727285,
            "subjectivity": 0.4268037518037518
        },
        {
            "body": "Fox News and their viewers are pure comedy. I’ve never seen a group of people so fragile. Lmao",
            "polarity": 0.2714285714285714,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Democrats take their own children to great schools but parent are not allowed.",
            "polarity": 0.7,
            "subjectivity": 0.875
        },
        {
            "body": "It's going to come down to parents having to home school their children if they want them to have a good education. That or have private teachers home school their children with the parents approving their curriculum.",
            "polarity": 0.18148148148148147,
            "subjectivity": 0.42129629629629634
        },
        {
            "body": "Why would you trust politicians....to be on your side?😒",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We must stand up and Fight for our KIDS 🙏🏻🇺🇸",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "what happens when kids start dying from the bioweapon vax?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "$350,000 of dirty money for democrats....",
            "polarity": -0.6,
            "subjectivity": 0.8
        }
    ]
}