{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-31 21:32:38",
    "ups": "7397",
    "downs": "84",
    "views": "174615",
    "top_comments": [
        {
            "comment": "All parents should either homeschool or start their own private school coops.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.6875
        },
        {
            "comment": "Don't buy Chinese!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Let’s go Brandon.  Just say no to Socialism.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wow look at that All White Supremacist Panel? That's what the Democrasst Propagandist Party will say (Nope did not spell Democrats wrong, but for saying there human beings they are Totally Crass) but NO! I see 3 concerned Mothers, who have just discovered there Kids are being abused by the ones' who are supposed to Educate & Protect them, when parents can't be there.  Well I say Go Go Get'em Moms, before the take all your rights away, and worst of all your Kids... Let your Tongue be your weapon, and Let the truth be your shield✌🏼",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.625
        },
        {
            "body": "Don't mess with the mama's and the papas.",
            "polarity": -0.175,
            "subjectivity": 0.175
        },
        {
            "body": "If Moms contributed as much as the NEA to politicians_  then maybe the Dems would listen to the Moms. Pay to Play Ladies.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "When it comes to education, the Democrats are totally beholden to the socialistic teachers’ unions who support them politically, the children be damned.",
            "polarity": 0.0,
            "subjectivity": 0.425
        },
        {
            "body": "All parents should either homeschool or start their own private school coops.",
            "polarity": 0.3,
            "subjectivity": 0.6875
        },
        {
            "body": "PLEASE I beg as many of you that can,  vote for Youngkin for those parents that dont live in your state.  You all have become a beacon of hope to the rest of the country to finally bring about positive change.  We can begin to rebuild our nation through the voices and actions of its citizens instead of unlawful, unconstitutinal, and just downright stupid AGENDAS that seem to benefit nobody and look out for only number 1...Themselves!😭  By the way how can someone who hates America and its foundation be 2nd in command of that same COUNTRY!  I thought Biden saying shes black and shes a woman was a joke.  Uuummm really!  I think if that was all the criteria needed...i would have chosen so many other brilliant black women that doesnt laugh all the time and can actually relate to people and not talk down to them or treat them like they are 5 years old.  Oh also...Where are you Kamala?  I keep thinking ill see her face on a milk carton...if i could afford milk.  Lets go Brandon🙄",
            "polarity": 0.05261828814460394,
            "subjectivity": 0.4895268474215842
        },
        {
            "body": "Momma Bear Revolution...haha, I love it!!  Democrats will never let CRT go, it's an obsession with them.",
            "polarity": 0.78125,
            "subjectivity": 0.6
        },
        {
            "body": "The Dems don't want you to know .  The left is so corupt and evil they want control over all Americans",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Very Beautiful Republican Moms 💜",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Don't buy Chinese!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If dem win the6 will go full force as a example an$ to act as this is America saying to keep the communist globalist great reset agenda dem want power no5 to work fo4 us",
            "polarity": 0.65,
            "subjectivity": 0.5666666666666668
        },
        {
            "body": "Gee...another \"Hate Dems\" piece at FAUX News?? Say it ain't so!!  Most Americans want to end racism, exclusion, bullying, and ignorance in public education...I can totally see why the GOP doesn't.  We ALL pay taxes and have equal say...don't like it?  win an election without Putin's help.",
            "polarity": 0.05000000000000001,
            "subjectivity": 0.4777777777777778
        },
        {
            "body": "There is a ton of evidence that democratic politics are even trying to create division between parents and children, just like they do among every other group.\nFJB",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "Awesome moms. I’m a public school teacher who’s had it with the instruction disrespecting parents and children. I’m starting a homeschool services school. I think public education is lost, and we need to get back to basics. Families and proper useful educational service. As a teacher, I provide a service to families.",
            "polarity": 0.19375,
            "subjectivity": 0.19791666666666669
        },
        {
            "body": "EVERYONE is sick of the woke mob",
            "polarity": -0.7142857142857143,
            "subjectivity": 0.8571428571428571
        },
        {
            "body": "Social media should have the same restrictions in society as Pornography.",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.09583333333333333
        },
        {
            "body": "Never get between Mama bear and her Cubs. You will be damaged! Just saying!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Cool yougkin is ahead, but are we not worried about the rigged election?",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "You moms need to understand that  Fox is also not on your side.  They can report and do more but they just stay in their chairs and let other speak and they will never give you the complete story or ignore stories",
            "polarity": 0.15833333333333333,
            "subjectivity": 0.425
        }
    ]
}