{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-30 16:45:50",
    "ups": "2099",
    "downs": "26",
    "views": "27349",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Hunter Van Gogh and Quid Pro Joe……….Let’s Go !!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's so good to see parents getting involved with their Children's minds .",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "FYI, home schooling is illegal in Sweden and Germany.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "There is a clear difference in what \"we the people\" mean for \"we the people\" and democrats. Democrat elites think they are \"we the people\" not the people are \"we the people\"",
            "polarity": -0.10624999999999998,
            "subjectivity": 0.5354166666666667
        },
        {
            "body": "But can Glenn beat the machines? Zero chances of  beating the machines",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If the moms weren't citizens the democrats would totally have their backs!",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Republicans step up.  Get moving!  Start shouting the American message of teaching our children the correct curriculum, and protect them from the toxicity being pushed down their throats.  Parents claim your children.  Take them away from the woke establishment, and lay down the law.",
            "polarity": -0.10370370370370373,
            "subjectivity": 0.19259259259259262
        },
        {
            "body": "Let's pray everyone gets out an votes  red",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just shows you that democrats are never for women or their families just like when they pander for the black vote then get nothing ….but yet the women and the black family still keep voting for democrats when will they learn",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "children are nothing but numbers, drones for the state, to be indoctrinated and made docile to be used either as a source of labor and taxes or cannon fodder.. That is the mindset of all authoritarian governments such as the current US government",
            "polarity": 0.0,
            "subjectivity": 0.45
        },
        {
            "body": "“Educrats”… She’s good.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "These women are out of their minds.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Go vote RED . Stop the madness",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Are you sure with the Dominion machine still in use?",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "They're not getting our kids they're just going to get the shaft whatever it takes for as long as it takes we will fight and vote and vote, campaign, donate and get out and politic, and protest in their face, and their front yard, let's go Brandon",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "Besides Parent and Moma Bear oversight, our entire school system needs to change.  I  home schooled my two boys.  One of the major differences is that you don't go past a math problem or some grammar item until they know it 100%.  That way they are never haunted by what they didn't really get before.  You might think that would slow them down, but instead they actually speed up.  And you don't get kids graduating with a poor education.  It would be a major overhaul, but should be considered. \n\nI also had to pull my son out of school in the 4rth grade.  He was being bullied as well and I had to stand up for him.  He also had severe dust allergies and it made him sick.  I worked with him on his schooling and he was an A student despite his absences.  He came home at the end of the year and told me he had to repeat 4rth grade.  I stormed into the principle's office.  She told me it was Virginia state law that if you missed x many days you had to repeat the grade.  I told them that was a stupid blanket rule especially since he had such stellar grades and was on the principle's list.  So I took him out of the system and home schooled him from that point on.  He did fabulously.  He even was the chief Technical officer at his first major employer at age 25.    When I moved to Florida, we also ended up home-schooling my 2nd boy.  We tried the schools in Florida, but they are a disgrace.  Basically he has  been home schooled his entire life.  Went to college and got a masters degree and now works for a major think tank company.",
            "polarity": -0.03499278499278499,
            "subjectivity": 0.48315295815295817
        },
        {
            "body": "We need to take a long and hard look at following the money on people like Merrick Garland's daughter making 78 million visor being the main advertiser on all these left-wing propaganda shows pushing the vacs",
            "polarity": -0.05500000000000001,
            "subjectivity": 0.29500000000000004
        },
        {
            "body": "LETS GO BRANDON",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "(woke parent talking) \"The Government would never lie to me.\"\n(real parent answering) \"If you believe that, I know of a beach front house I can sell you in Arizona.\"",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        }
    ]
}