{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-31 00:57:56",
    "ups": "5368",
    "downs": "69",
    "views": "109141",
    "top_comments": [
        {
            "comment": "Who’s counting the ballots?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "CIATTARELLI IS THE CHANGE WE NEED AS IS YOUNGKIN. Wake up American parents.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "This is a relevant story, why is it being lead by an unengaged white guy who has zero relevance?",
            "polarity": 0.2,
            "subjectivity": 0.45
        },
        {
            "body": "Good point that the Democrats never support parents. Well done.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "woke parent must not care about are children",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "of course not want to groom are children to hate one another because of color of skins",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "Fascists and communists always seek to indoctrinate kids and turn them against their parents. Karl Marx, the author of mass genocide and untold human misery in the 20th Century, viewed the nuclear family as an instrument of capitalism and the bourgeoisie. A view parroted in both the BLM and Extinction Rebellion manifestos, and one it would appear that the Democrats share.",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "body": "Wow. Parents finally opening their eyes about their childrens indoctrination.",
            "polarity": 0.05,
            "subjectivity": 1.0
        },
        {
            "body": "Of course they don't take the parents side... The state is the mother and father in communism",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "dems be communist they just have not figured it out yet...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Huge mistake to start war with parents. You can never win such war.",
            "polarity": 1.850371707708594e-17,
            "subjectivity": 0.6
        },
        {
            "body": "I am home schooling for the second year and I WILL CONTROL HOW MY CHILD DEVELOPS, which is exactly why the Dems hate school choice.\nIf you remove their ability to indoctrinate, they lose the next generation of DEM voters.\nPUT YOUR CHILDREN FIRST!\nVOTE REPUBLICANS!",
            "polarity": -0.03187500000000001,
            "subjectivity": 0.29666666666666663
        },
        {
            "body": "I DONT TRUST THESE WHAMEN THEY LOOKLIKE THE SAME FEMENIST WHO MURDERED CHIVALRY AND PROMOTED SINGLE MOTHERHOOD !",
            "polarity": -0.04464285714285714,
            "subjectivity": 0.16964285714285715
        },
        {
            "body": "I do believe Youngkin is going to win the race.  The dumbs have miscalculated and will not regain their footing at 11:59.\n     Like I said twenty other comments:  the communists show you flowers and BS to start with, but it always ends up in hatred, control and genocide.  They will do what they have to to get cooperation from the populace for support of their regime with promises of flowers and utopian paradise.  Then they will eliminate everyone who is a threat to their regime and in every case of history that means millions and tens of millions will be exterminated.  At every opportunity we must support the constitution of The USofA and reject any ideas that conflict with it.  Refuse to sing along.",
            "polarity": 0.3375,
            "subjectivity": 0.3875
        },
        {
            "body": "I love seeing women finally voting for what the candidates stand for and not their color or the clothes they wear or something silly. You go ladies . Nice job",
            "polarity": 0.15,
            "subjectivity": 0.86875
        },
        {
            "body": "CIATTARELLI IS THE CHANGE WE NEED AS IS YOUNGKIN. Wake up American parents.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "When the birth certificate is issued in capital letters of the name of baby they have taken your baby and using it a commodity to be traded.  Check it out.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pray for Biden to be replaced and may GOD turn his heart to the truth before he dies",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Who’s counting the ballots?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We’ll soon see how many Virginia Moms go to the polls and vote. And how they vote. Then there’s still the rigging factor.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "The State.  The State. THE STATE.\nNot only is this the case, but what you are now seeing is only the tip of the iceberg.",
            "polarity": 0.0,
            "subjectivity": 1.0
        }
    ]
}