{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-31 05:04:47",
    "ups": "5929",
    "downs": "72",
    "views": "131016",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "When the pandemic hit and their kids were stuck at home, many parents were shocked at how really dumb their kid have become. The leftist educrats have turned their once happy children into woke, angry little morons with attitude.",
            "polarity": -0.1640625,
            "subjectivity": 0.7375
        },
        {
            "body": "Why no father's in the picture. Are women the only parents?",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "The left will probably steal the election in Virginia. No one ever stops them from stealing any elections at this point, so they will just be emboldened to do it all the more.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "Hillary wrote It Takes a Village, and parents acquiesced. Well her village doesn't really care about your kids, just the power of the village leaders.  It takes Parents to raise our kids! Finally folks are waking up against wokeism.",
            "polarity": 0.125,
            "subjectivity": 0.6
        },
        {
            "body": "Seriously... Democrats have underestimated The American Mama Bear! We will eat them for lunch! We will fight for our kids! Its our nature!",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "California had a GREAT opportunity to give the Left the finger, and pissed it away! I hope Virginia does not follow suite!!",
            "polarity": 0.4,
            "subjectivity": 0.375
        },
        {
            "body": "These MOMS are the BOMB 💣! With moms like this and dads like the ones in Shreveport, Louisiana, these buffoons will NEVER be allowed to change our great country.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "who does a baby cow belong to? the mama cow or the rancher? - the rancher says \"No baby Cow left behind\" and passes a law regarding his baby cows - the mama cow feels relief, at least my kid won't be left behind - mama cow was scammed of course - if you work for a living and pay taxes - you are not a Capitalist, you merely serve the Capitalist, who are Capitalizing on you $$$",
            "polarity": -0.20606060606060606,
            "subjectivity": 0.28484848484848485
        },
        {
            "body": "The lady with the mama bear shirt.. looks like a mama bear for real. May God Bless her and her little ones.. she truly cares about our children.  GOD BLESS AMERICA 🇺🇸🙏",
            "polarity": 0.0062500000000000056,
            "subjectivity": 0.4
        },
        {
            "body": "SECURE POLLING PRECINTS FROM FRAUDSTERS = SECURE YOUNGKIN'S WIN",
            "polarity": 0.5333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "The Democrats have just discovered 24 more cemeteries in north Virginia.  Let's go Brandon, let's go.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "These MAMA BEARS HAVE THE POWER TO CHANGE THE COUNTRY.  LETS GO BRANDON.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yes pull you children out of public schools they told me 30 yrs ago that my son was just slow and would always be slow I pulled him out of public school and put him and my daughter vin private christen school they both later graduated from public colleges with 3.0 degrees take them out",
            "polarity": -0.08571428571428573,
            "subjectivity": 0.1964285714285714
        },
        {
            "body": "These MOMS HAVE MORE POWER THAN THEY REALIZE!   They are very very powerful,  GOD BLESS THEM",
            "polarity": 0.5075000000000001,
            "subjectivity": 0.75
        },
        {
            "body": "A good variety of parents that were speaking. If it wasnt done right, the left would say you had only one race of the parents that were speaking. You would have been accused of racism?",
            "polarity": 0.2464285714285714,
            "subjectivity": 0.5339285714285714
        },
        {
            "body": "The Democrats have the albatross of CRT and gender reorientation hung permanently around their necks..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Democrats have the albatross",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "God bless all parents who want to protect their children and it should always be not by the hands of government ever!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "VOTE THE FOOLS OUT.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There is no proof that vaccines are effective other than spreading the virus that has been men made out of Wuhan China??? And why would you want to vaccinate everyone including children when control is the only thought of transitioning the collective😢😊🧐🧐",
            "polarity": 0.15833333333333333,
            "subjectivity": 0.725
        }
    ]
}