{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-11-01 18:08:48",
    "ups": "8681",
    "downs": "108",
    "views": "219886",
    "top_comments": [
        {
            "comment": "Who is the MAN in the middle",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Who is the MAN in the middle",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"con mis hijos no te metas\" chant that revertabated over and over again in Venezuela, while hundreds of  thousand middle class horrified parents protested the socialist transformation agenda.\nThe debacle of the Venezuelan thriving middle class started when they started tearing down monuments, inventing  racial tension, rewriting history, de emphazing academic preformance..\nSound familiar...\nDoes all this sound to close to home?\nLets keep America on track.\nBack to the basics ...teach children reading, writing, arthmetic, respect your peers/law/elders, pride in your self, family, community.",
            "polarity": 0.12743055555555555,
            "subjectivity": 0.19861111111111113
        },
        {
            "body": "What ever happened to PTL meetings",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democrats are mentally ill , they are sick and demonic. They need prayer.",
            "polarity": -0.6071428571428572,
            "subjectivity": 0.9285714285714286
        },
        {
            "body": "I saw a video where two new female teachers said they would not teach history, but substitute it with LGBTQ and BLM.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.3106060606060606
        },
        {
            "body": "Yay! Asra is the best!!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "They’ll find a way to steal it!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "These rabid Leftists want to OWN your children.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Where in the hell were you ladies 2020. You helped put dictator Biden in office.  Never vote Democrat again!  We need to take charge of schools and raise the bar for education.  Let's get children up to be the best education on the planet.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I went to a lot of school as a kid because my family moved around a lot. I didn't see any SJW teacher until 2001. My sophomore year of high school was the start of it from my point of view. That's the year that all of sudden there where more young teachers that all acted a like.",
            "polarity": 0.19,
            "subjectivity": 0.485
        },
        {
            "body": "This vaccines are not FDA approved, the approved vaccine is not in the market.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democrats will cheat. Please pay attention at the polls.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's rather simple...ANYTHING that doesn't give Democrats/The Left   1. MORE control over you life  2. More of your money......They will fight against it!!  \n\n- So naturally when moms started saying we want more control over what our kids are being taught....you are an enemy of the Democrats/left.",
            "polarity": 0.37625000000000003,
            "subjectivity": 0.38
        },
        {
            "body": "Definitely not on my side",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Agenda 2020 and 2030 global summit was about reconditioning the children at all cost...among other things.",
            "polarity": -0.0625,
            "subjectivity": 0.1875
        },
        {
            "body": "I know real Democrats who have a real love for this country and they really love the children this administration is not real Democrats they are something else.",
            "polarity": 0.33749999999999997,
            "subjectivity": 0.5249999999999999
        },
        {
            "body": "They never will be or for the working man. The Dems only care about their own pockets and is the reason the are the party of big corporate",
            "polarity": 0.15,
            "subjectivity": 0.525
        },
        {
            "body": "Mammas keep speaking out don't let these woke a holes tell you what your kids are taught!!! You are the parent you went threw the labor pains to have your children!!!! Not them!!!! Teachers unions will experience karma real soon!!!!",
            "polarity": 0.48828125,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "In the words of Kamala Harris “ it’s a movement. It won’t stop and it shouldn’t stop “   Oh how the tables have turned !!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Save the children from racists wokeness!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}