{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-31 13:18:20",
    "ups": "6500",
    "downs": "80",
    "views": "148531",
    "top_comments": [
        {
            "comment": "The government won’t even let the parents decide what they need to do they’ll fire you if you don’t get vaccinated",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Defund public education now. Take away their soap box platform and their ability to corrupt.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25,
            "subjectivity": 0.5333333333333333
        },
        {
            "comment": "We surely need a revolution in this country is Biden administration is terrible",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25,
            "subjectivity": 0.9444444444444444
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The government won’t even let the parents decide what they need to do they’ll fire you if you don’t get vaccinated",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Defund public education now. Take away their soap box platform and their ability to corrupt.",
            "polarity": -0.25,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "We surely need a revolution in this country is Biden administration is terrible",
            "polarity": -0.25,
            "subjectivity": 0.9444444444444444
        },
        {
            "body": "Because Demorats dont have fathers",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There's a very wheat easy way to handle this. Remind yourselves that person who is teaching your child CRT in a variety of other concepts l likely live down the street from you. They are the teachers. They are the administrators of schools. They are the ones who are actually doing these things directly to your children. Put aside the harebrained leftist concepts they are teaching to your children they have overseen the failure of our school system's even teach our children the basics. How much do they get paid? How many weeks of vacation do they get compared to you? What kind of healthcare and retirement benefits do they get compared to you. They are getting all of these goodies because of your tax dollars. And they are not teaching your children basics while at the same time teaching your children CRT on your tax dollars.",
            "polarity": 0.10874819624819623,
            "subjectivity": 0.45873015873015877
        },
        {
            "body": "All parents who disagree should help form private schools that all who want their children to attend can afford and leave the building full of the dregs of society who don't care about their children. It's basically re-segregation because integration failed. The only difference is the parents have to pay for the public schools and their private school of choice. That's why Democrats won't allow vouchers. They know the schools would empty out.",
            "polarity": -0.03571428571428571,
            "subjectivity": 0.45238095238095244
        },
        {
            "body": "Contrast these 3 intelligent, well spoken ladies with the unhinged members of \"the Squad\". They put those screeching hens to shame.",
            "polarity": 0.8,
            "subjectivity": 0.9
        },
        {
            "body": "The only thing Republicans capitalized on latey was undermining Donald Trump when he was president.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "The so-called democrats aren't on anyone's side. America, wake up!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kind of sad that these ladies, seem nice and good but are acting naive and don't realize that they are going to need to take over the schools board by board and teaching position by teaching position and do what the leftist did (over decades), namely holistically control the US educational system. This needs to be done from K through graduate university. The other option is to evacuate so many students that the governmental indoctrination schools collapsed in on themselves. Leftists don't respond to reason or civil pressure and when they do it is only temporary.",
            "polarity": 0.15227272727272725,
            "subjectivity": 0.6568181818181817
        },
        {
            "body": "Don't criticize them... This isn't a case of using their own against them type deal. They're nazis plain and simple this is 1930s Germany trying to make a come back",
            "polarity": 0.09642857142857142,
            "subjectivity": 0.4285714285714286
        },
        {
            "body": "Don't be surprised if when the vote counting gets to 90% with the republican leading, the counting stops and restarts with the democrat leading.",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "body": "Well it is difficult to be on the parent's side when the only side they are on is their own.  Only things progressives care about is pushing an agenda and virtue signalling to each other when they get their way after bullying others into doing things, making it look like they fixed a problem.",
            "polarity": 0.012499999999999997,
            "subjectivity": 0.7625000000000001
        },
        {
            "body": "We will save America between now and 2024 or we won’t save it at all.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wait till you find out the democrats aren’t on minorities side either. Or the gays.  Or anyone else they claim to be for. The only people democrat leaders care about are themselves. Retaining power and stealing our money.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "It’s not just moms the Democrats have deserted but women in general. Them saying “trans women” are the same as women, letting them compete against biological women, letting biological men in women’s restrooms and locker rooms. The Democrats have fallen totally under the heel of the far left.",
            "polarity": 0.030000000000000006,
            "subjectivity": 0.475
        },
        {
            "body": "Go girls!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "MARGORIE GREENE BROUGHT FORTH 2 COUNTS OF IMPEACHMENT ON OCTOBER 24/2021 TO BIDEN.. WHY ISN\"T FOX COVERING IT?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Assuming elections are fair (big assumption) school.boards are ELECTED. These directors are very powerful.. know who they are",
            "polarity": 0.3633333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "I predict youngkin to be ahead by millions of votes then counting will stop and then youngkin will stop receiving votes and then the democrat will win by 100,000 votes \n\nJust like what happened with trump and what happened in the Georgia race",
            "polarity": 0.8,
            "subjectivity": 0.4
        }
    ]
}