{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-11-01 05:47:08",
    "ups": "8057",
    "downs": "95",
    "views": "198487",
    "top_comments": [
        {
            "comment": "God bless these Mom's.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Wonder what the first clue was.  Could it have been that they are arresting parents that question their authority or the fact that they are trying to sterilize the kids or maybe it's the fact that the FBI is being used against them and using schools indoctrination to communism",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Any Politician who says \"Parents have no right to tell teachers what they may teach their children\" ... has no right to even run for office.  Terry McAuliffe, get the hell out of here ... our children do NOT belong to you.\n\nParents are the ONLY ONES who have a right to decide what is best for their children  ... Our tax dollars pay teacher's salaries -- they answer to US",
            "polarity": 0.2,
            "subjectivity": 0.5814285714285713
        },
        {
            "body": "And they never will be on our side it's not the communist way",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "3 old bags \nWho will end up old cat ladies",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "God bless these smart women. We as conservatives say,\" Your children matter the Most. ✝",
            "polarity": 0.35714285714285715,
            "subjectivity": 0.5714285714285714
        },
        {
            "body": "God bless these Mom's.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You ever heard the term if you poke a bear will they just poked a bunch of Mama bears which is even worse. Hahaha now deal with it. Let's go Brandon",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "body": "Democrats are done.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please hear the gospel message! Ray Comfort has FREE movies and interviews on YouTube! Jesus is our only hope for freedom and Salvation!",
            "polarity": 0.25,
            "subjectivity": 0.9
        },
        {
            "body": "Stay the course. Let's get on with \"Walk three miles or run two miles it's up to you\" but let's get back to living not on to undermining the entire country just so some scary gory democrat can have his day in court about the election he lost.",
            "polarity": -0.25,
            "subjectivity": 0.65625
        },
        {
            "body": "Kids are first you go Bears we don't need the creeps.  This is Communism 101 take over education!  God bless the parents!",
            "polarity": 0.390625,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "When you signed your childs birth certificate YOU GAVE YOUR CHILLD TO THE STATE AS A WARD OF THE STATE. YOU CAN RESIND THIS BUT IT TAKES WORK.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The new left: ‘’ your property is our property and your children are our property.”",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.22727272727272727
        },
        {
            "body": "Home school your children people. Do not let the communists take over. And the communists are now the Democratic Party... Can't you see they're dumbing down your children.",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "Well what did you expect to happen? Biden lied about everything yet people still voted for him. Democrats always lie, they don't care about anything but themselves.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My children are adults now & I cannot imagine going through what today's parents are facing!!! However, even if our children are grown we all need to wake up, show up & speak up!  The future of our country & the freedoms we have enjoyed are being endangered by this very effort to indoctrinate our young.  It must not ever be allowed!!!",
            "polarity": 0.223828125,
            "subjectivity": 0.38125
        },
        {
            "body": "TerryFreak 💩💀",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They haven't  just started this was an agenda that is close on 50years or more. However America\n have the government you deserved.\n\nAll of this is not delving down they are already there. \n\nYou Don't  own your children. You gave them up voluntarily when you registered their births. \n\nLet me describe the process you are ignorant of. First go to any online law dictionary and look up the term          \" registration \".  You really need to sit down and think of the meaning of the word.",
            "polarity": 0.20648148148148146,
            "subjectivity": 0.4351851851851852
        },
        {
            "body": "If VA goes Red on Tuesday Pelosi and her team will 💩 on their pants",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}