{
    "time_posted": "2021-10-30 15:00:18",
    "url": "https://www.youtube.com/watch?v=bm10lJQFxMs",
    "time_now": "2021-10-31 09:11:36",
    "ups": "6219",
    "downs": "79",
    "views": "140497",
    "top_comments": [
        {
            "comment": "We owe a great gratitude to the Virginia parents who never backed down. They are leading the way. Thank you!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.24809027777777778,
            "subjectivity": 0.5194444444444445
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The Democrats & Republicans who are unable to put this country and its people ahead of their personal agenda should NOT be in office, period! Right now that is nearly all the democrats and a few republicans. Vote RED to turn the tide and stop the drowning of these cities, states and our wonderful country. People aren't blaming each other for this ridiculously obvious reverse racist movement. They know the TRUTH that a FEW who profit off the harm racism does is promoting this harmful and misrepresentation of the public. We are all one race HUMAN, varying degrees of!",
            "polarity": 0.03005952380952381,
            "subjectivity": 0.33144841269841274
        },
        {
            "body": "Momma Bear revolution,GO MOMS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Comrade Biden is all kids Mommy and Daddy",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Parent's Protect Your Children NOW!   Bless you all PARENTS AND CHILDREN OF THE USA.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democrats need to get away from flux gender nonsense and CRT racebaiting.  America has no interest.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "News flash... parents are about 10 years late to the party.  This has been going on for years in the schools, just under a cloak and not as braising of an agenda. How do you think so much of this junk has started to become normalized in our society?  Parents just turned a blind eye hoping it wouldn't get that bad.... guess what?  It was, is, and will continue to be, that bad unless we have a major catastrophic shift in politics/government structure.",
            "polarity": -0.3229166666666666,
            "subjectivity": 0.5499999999999999
        },
        {
            "body": "They're both going to be reelected. This is going to be another Newsom moment. Sadly",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "It's staggering that so many parents are putting school boards on notice that they will not tolerate any interference in the education of Their children, and that regardless, the school boards keep on pushing forward. They appear to be very confident and completely indoctrinated to the point of being dangerous.",
            "polarity": 0.1625,
            "subjectivity": 0.7
        },
        {
            "body": "We owe a great gratitude to the Virginia parents who never backed down. They are leading the way. Thank you!!!",
            "polarity": 0.24809027777777778,
            "subjectivity": 0.5194444444444445
        },
        {
            "body": "Good Lord, 🇺🇸 🇺🇸 LET'S GO BRANDON! 🇺🇸 🇺🇸",
            "polarity": 0.875,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Your vote, it matters not; just give me the contract for the voting machines..and this Virginia election, I got this...  CEO of Dominion.   Watch out Virginians, the dead are watching and they vote.  Like the man said if my uncle knew he was voting for any Democrat, he would turn over in his grave..",
            "polarity": -0.2,
            "subjectivity": 0.4
        },
        {
            "body": "Let's Go Brandon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We don’t need vacation…",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The DemoRats want to treat ALL families like they treat the black families … They want to separate families… \n\nImpeach Pelosi and AOC first, then impeach Harris and Traitor Joe Biden, in that order…for a start…",
            "polarity": 0.04166666666666667,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "btw truth be told most of you \"involved parents\" wouldnt even have noticed the insane nightmare your own children were being indoctrinated into if covid hadnt forced you to spend more time with your kids..,just sayin..im not going to make a hero out of any of you now for  just doing the right thing for your own offspring when you should have been doing it all along.",
            "polarity": 0.1693877551020408,
            "subjectivity": 0.676530612244898
        },
        {
            "body": "you dont have to be a parent to understand that the federal government is over reaching its long spindly  arms into every aspect of your life and trying to indoctrinate  yet another generation of leftist naive  fools they hope will one day rule the whole world..however they are too much pinky and the brain cartoon characters to actually pull such a maniacal endeavor off.god bless them anyways...hahahah",
            "polarity": 0.0,
            "subjectivity": 0.4571428571428572
        }
    ]
}