{
    "time_posted": "2021-10-30 13:00:07",
    "url": "https://www.youtube.com/watch?v=BpNerJUg81Q",
    "time_now": "2021-10-31 00:58:01",
    "ups": "1570",
    "downs": "24",
    "views": "40468",
    "top_comments": [
        {
            "comment": "THE TRUE COST IS US.....YOU KNOW, THE ACTUAL WORKING AMERICAN CITIZENS.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.11666666666666665,
            "subjectivity": 0.25
        },
        {
            "comment": "Joe already said it doesn't cost anything!!..and he whispered it so you know its true!.😆😆😆🤫",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "\"the bill is paid for\"--one of the most bold face, pernicious, evil, lothing lie ever told.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.05555555555555558,
            "subjectivity": 0.7222222222222222
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Do not pass that id i o tic spending bill! Giving ILLEGALS 450k each! Let’s Go Brandon!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Not worth watching! 👎🏻",
            "polarity": -0.1875,
            "subjectivity": 0.1
        },
        {
            "body": "You see, the democratic strategy is to pass the bill first, then afterwords read and determine what is in the bill. The cost is determined the same way. The stupids are running our country.",
            "polarity": 0.125,
            "subjectivity": 0.22916666666666666
        },
        {
            "body": "And the nashan will. No that the land belong. To the lord by reapentance and the nation will be rule by the lord wen pilet wash his hands by haveing the nashan serving the devel by the constition by the law of the land which is the cormanment of the devel a man and not by the words of the lord that the lord cormanded moses in this willdernss of sin are mong evry bodey in the nashancant get are long with each other for there equal right. Creating sin and hell which is the willder ness of sin one to dye in sin and hell. By the law of a man and then the judgement from the lord to fing christ",
            "polarity": 0.027678571428571427,
            "subjectivity": 0.3901785714285714
        },
        {
            "body": "Wonder who pays when unvaccinated lose jobs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Sad to see \nI see a revolution coming,or America splitting up \nlet’s go Brandon",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "We need to drag these idiots out into the street and string them up!",
            "polarity": -0.55,
            "subjectivity": 0.4354166666666667
        },
        {
            "body": "😡😡😡😡😡😡😡",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I feel sorry for Trump supporters because he have lead them into a cult. I believe in God , family and constitution.  These Trump supporters worship and follow a cult leader.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Change. The constution that all of all u will not keep argueing for all you equal right and justic were there is no equal rights and justic with no god in god in there mine when equal right come from juses christ and salvashan com from the lord and the true light that shine on man come from the lord and the law of the land come from moses which is the 10 comanmen that constetiton is a ley made by a man a evel doer that have to cut of from the face of the earth. When the one man in sin full felsh argaince pilate the leader of the eveldoers in the nashan. That god bless in this strong nation",
            "polarity": 0.23386243386243383,
            "subjectivity": 0.4949735449735449
        },
        {
            "body": "\"the bill is paid for\"--one of the most bold face, pernicious, evil, lothing lie ever told.",
            "polarity": -0.05555555555555558,
            "subjectivity": 0.7222222222222222
        },
        {
            "body": "LET'S GO BRANDON.... FJB",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Joe already said it doesn't cost anything!!..and he whispered it so you know its true!.😆😆😆🤫",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Anyone supporting this bill. Doesn't deserve another term in office.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "$100B for illegals??  WTH I'm so pissed 🤬🤬🤬  Somebody take that dam pen away from the inbicel that's n the WH  QUICK. FJB. FJB. FJB",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "Biden is a on term President. No one in the right mind will ever vote for this dishonorable person. He left Americans behind in Afghanistan. He makes it a “policy” to never talk about them. In his eyes, they simple no longer exist. Look at all the new taxes on hard working Americans. Now look at how the Biden administration is setting aside $100 Billion for illegal immigration. He is using US taxpayer money to actively assist illegal immigrants at the expense of hard working Americans.",
            "polarity": -0.16945887445887448,
            "subjectivity": 0.4730735930735931
        },
        {
            "body": "THE TRUE COST IS US.....YOU KNOW, THE ACTUAL WORKING AMERICAN CITIZENS.",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.25
        },
        {
            "body": "NO BILL",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "America last has got to stop how much more of us have to die to help terrorist? Barely surviving in CA",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.2222222222222222
        }
    ]
}