{
    "time_posted": "2021-10-30 13:00:07",
    "url": "https://www.youtube.com/watch?v=BpNerJUg81Q",
    "time_now": "2021-10-30 20:51:40",
    "ups": "1264",
    "downs": "19",
    "views": "29801",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "It's Obama and his administration. NOT BIDEN",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He, is, USA President,this is what ,he represent ,think ,like that ,this ,days,weeks,month years.!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "the cost is more inflation. where are the 81 million that voted for Beavis and Butthead now???",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Starvation for middle class and poor people",
            "polarity": -0.2,
            "subjectivity": 0.3
        },
        {
            "body": "Pushing us to a mad max future. ☠☠☠☠",
            "polarity": -0.3125,
            "subjectivity": 0.5625
        },
        {
            "body": "Absolutely!!! The worst administration ever. 😡🤬👹👺",
            "polarity": -0.3046875,
            "subjectivity": 0.95
        },
        {
            "body": "As long as it's to much. And you can not trust them I hope it gets way down.only good thing infrastructure bill we need. We don't need all the things  democracts  want to ram through. Don't pass if bad for amercia and amercians.",
            "polarity": 0.03750000000000003,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "True!",
            "polarity": 0.4375,
            "subjectivity": 0.65
        },
        {
            "body": "Remove Biden and Harris's from office. Close the border. Stop the spread of the virus!\n3.5 trillion plus interest = 0 BS!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Also let me put my trailer on my vacant lot please",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am impressed ,you do not care neither about your unborn Children That you ask for Abortions Who force you ,to make abortions,the chinese the Russians the Indians The Palestinians,the Mexicans,Canadians,???",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Last night I returned home with my body fully swollen! People are collapsing at work because of Serious Heavy Workload! I had to keep begging the Customers to give me few seconds to breath! \nHISTORIC STEALING from Helpless Innocent Workers who is crushing themselves to serve and serve! Working 7 Days a Week and Living Paycheck to Paycheck! \nThese Politicians have been stealing $300 taxes from my every paycheck! \nCan you please please devote one complete episode to daily suffering of the Middle Class, who is working day and night paying Big bills and serving High Class, Politicians, and others? They have been cutting $300 taxes from my every paycheck, plus PG&E takes away close to $400 every month and I have been working seven days a week to be able to survive! \nI am crushing myself day and night to serve and serve! \nSo for how long Middle Class is supposed to suffer for the Rich and High Class?",
            "polarity": 0.09041666666666666,
            "subjectivity": 0.4257017543859649
        },
        {
            "body": "You distroid your Dollar ,with this Inflation more than 30   Years .!!",
            "polarity": 0.78125,
            "subjectivity": 0.5
        },
        {
            "body": "America can't, and won't survive 4 years of the shadow government running us.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why you taxes the Dollar To rase the inflations.??",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Are you criminals snd hate your National Coin???",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "London is the Capital of United Kindom.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "London is normal to became victim of Fraud ID etcm",
            "polarity": 0.03749999999999999,
            "subjectivity": 0.35
        },
        {
            "body": "Did you started import electric cars from Iran in case you still,do not started going to work. Be careful , hiar in",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Spaghetti Mitch, you couldn't do better than spaghetti???? I would say what they're throwing, isn't edible.",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}