{
    "time_posted": "2021-10-30 11:00:05",
    "url": "https://www.youtube.com/watch?v=C_9OkNrp6Ps",
    "time_now": "2021-10-31 09:11:46",
    "ups": "1930",
    "downs": "80",
    "views": "108301",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "comments saying lets go brandon is pathetic it doesnt even translate to what u really mean. it sounds close to lets go Joe Biden",
            "polarity": -0.65625,
            "subjectivity": 0.84375
        },
        {
            "body": "Why don't fox5 get sued? Tucker Carson get sued, he knows he's lying! He's a  maker of the incarceration",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If the statements are true they have  no legs to stand on.",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "We are ignoring your word. See your ratings.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "SUE FOX !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dynamite segment on the absolute need for a free press, Ari. This is so critical that we have to fight tooth and nail against this crap. If it turns out to be the hill that we die on, so be it.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.825
        },
        {
            "body": "Proof\nCommunist symphatisers in America want to do what comrade Poothin demands",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"In the long history of the world, only a few generations have been granted the role of defending freedom in it's hour of maximum danger...I do not shrink from this responsibility---                              I welcome it.\"  ------------President John F. Kennedy 1961 Inauguration Speech",
            "polarity": 0.1375,
            "subjectivity": 0.6
        },
        {
            "body": "@8:15:  \"It turns out America, it's not just the food that's much worse in England.  Sick burn but true\".  Love it because as a UK citizen who's lived in Germany, France, Italy, Australia, Fiji and the States my opinion is opposite.\n\nI find the UK food to be varied, tasty, full of variety, has proper spicy options (read Chinese, Indian, Pakistani, Thai and more), smaller portions but of much greater value.  This is in direct opposition to nearly all the US food I've tried.\n\nNow I've tried most of what the US has to offer and outside a few expensive restaurants where meat is nearly always the only focus (I eat a lot of vegetarian and vegan food so have a bias here) the serving sizes are huge, the quality is poor, the flavour low, the spice non-non-existant and overall are based on the same American values of \"more\".\n\nMexican food is a partial antidote to this when in the Southern states and dedicated restaurants but they again do the above: massive portions that dilute it.\n\nSo, the picture of fish 'n chips made me laugh as done well that is an amazing delicacy with all sorts of nuance from the local chippy (read cheap food for the poor) to the posh ones (expensive and comes in fancy boxes [yes, true]).  I give you some of the pies and poor delivery of food in the UK can be awful but in general the English eat a lot of Chinese, Indian, Thai, middle-eastern and other types with \"English\" low on the list.\n\nEnjoy what you like!",
            "polarity": 0.02895136778115502,
            "subjectivity": 0.4075987841945289
        },
        {
            "body": "Hey Ari, the food isn’t as bad as you think in England, I cook five star.",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Trump is SUING someone?? NO..it can't be...lmao",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Is this is what governing is about??!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lmfao he played Martin Luther king and the tried to act black introducing a black guy. The left is crazy",
            "polarity": -0.23333333333333334,
            "subjectivity": 0.44166666666666665
        }
    ]
}