{
    "time_posted": "2021-10-30 11:00:05",
    "url": "https://www.youtube.com/watch?v=C_9OkNrp6Ps",
    "time_now": "2021-11-01 14:01:46",
    "ups": "2920",
    "downs": "121",
    "views": "201357",
    "top_comments": [
        {
            "comment": "This was a nice change for MSNBC. Great piece! Except the British food comment. There are plenty of great English dishes. It’s kind of like saying rap sucks. There’s some decent rap if you look hard enough.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25750000000000006,
            "subjectivity": 0.5408333333333333
        },
        {
            "comment": "and the GOP is doing the same to this country, sadly",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25,
            "subjectivity": 0.5625
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "PUTIN and trump, 2 PEES in a pod. woohoo-o-oo-oo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Neanderthals walking around Congress.... 😂 😂 😂 😂 YES!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My guy Ari calling out England on it's food😂🤣😂🤣 You know he was fed something that left an impact on him. AND he loves candy corn. I mean I keep finding new things to love about him",
            "polarity": 0.08096590909090909,
            "subjectivity": 0.43551136363636367
        },
        {
            "body": "Genuinely surprised about the cheap shot regarding the English food - that came out of nowhere and wasn't called for in this otherwise interesting piece.",
            "polarity": 0.25,
            "subjectivity": 0.525
        },
        {
            "body": "It all starts with saying fake news to everything you don't like. Then you take free speech away so people only hear your propaganda. Then you forbid the opposition, and so on. It's all a prelude to fascism and a dictatorship. Read history.  What the republicans have done the last 5 years and are doing is from a playbook they play page after page, alinea after alinea and word after word.  Exactly as my parents, teachers and others told me it went down in the 30th and 40th  Only with the differents that Hitler came up during the great depression and people had nothing to lose. In a sense this is also true for big portion of the US population.  Since there is almost no one who can tell you please read the history books or  watch a documentary about it.  And look around you to countries that has become or are becoming a dictatorship.",
            "polarity": 0.11495726495726494,
            "subjectivity": 0.5273504273504274
        },
        {
            "body": "I was wondering how long it would take Trump to try and get himself into the law books",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "Metadata. \nData about data.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Counter sue Trump!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Imagine you have to prove your innocence everytime someone accuses you.. Lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Ari!!!  i love your show and watch it regularly, I agree on our free speech failures in the UK.... but please the UK food isn't terrible.  If you come to the UK let us know my wife and I will prove that.",
            "polarity": -0.024999999999999994,
            "subjectivity": 0.6192307692307693
        },
        {
            "body": "and the GOP is doing the same to this country, sadly",
            "polarity": -0.25,
            "subjectivity": 0.5625
        },
        {
            "body": "\"It is not just the food that is worse in England\".... Mmmm clearly you have never eaten Pickled Onion Monster Munch",
            "polarity": -0.15,
            "subjectivity": 0.49166666666666664
        }
    ]
}