{
    "time_posted": "2021-10-30 11:00:05",
    "url": "https://www.youtube.com/watch?v=C_9OkNrp6Ps",
    "time_now": "2021-10-31 21:32:49",
    "ups": "2582",
    "downs": "98",
    "views": "164559",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "We Americans had better listen to this and listen well. Because we are heading that way. Listen to the words of Martin Luther King.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "The election of 2020 was fraudulent. Thats what the world knows. \n\nEven 30 plus percent of democrats admit to believing that Biden only won because of cheating. Not that 30 plus percent admit to believing there was fraud in the election of 2020 but specifically that Biden only won because of cheating. \n\nAlmost 60 percent of republicans admit that they believe Biden won because of cheating. \n\n50 percent plus of independents and undecided admit that they believe Biden won because of cheating. \n\nYou can stop pushing your fair elections propaganda because most of the common people are not falling for your propaganda.",
            "polarity": 0.1,
            "subjectivity": 0.5857142857142856
        },
        {
            "body": "Remind me Ari....why is UK holding Julian Assange pending extradition? Extradition to which country? On what charges? He's not been arrested in the UK......he's just waiting for the USA to up their case so they can send Assange to prison for publishing information. Reminds you of Putin doing the same to journalists in Russia? So get off your moral hypocritical high ground....",
            "polarity": 0.05333333333333334,
            "subjectivity": 0.305
        },
        {
            "body": "A bunch of Cry Babies. Any person in the public Eye, can become an irritant. Donald Dickus and Nunes are irritants. EfEm!",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Ari- I think you do a great job in the presentation of the news!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "As you see in this video President Obama says that you have a right to free speech and obeying the law constitutional r Then President Obama saw to the future and see if these rate should be obeyed in America and whoever is against these laws are traders",
            "polarity": 0.22857142857142856,
            "subjectivity": 0.48690476190476195
        },
        {
            "body": "He’s talking about the character and and his leader ship toward annihilating any competition that gets in his way he’s a gangster just like his cohort trump",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And so today we are at that same stage that we were in in the 60s and the same powerful people are in office today people do you see the correlation",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "\"...the press is the enemy of the people....\", Josef Stalin, Benito Mussolini, Donald Trump",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Keep speaking the truth!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So right about the food in UK being rubbish, of course you can avoid McDonald's and find real cuisine so problem solved, also nothing wrong with fish and chips, cheap shot from Ari, unsubscibed!",
            "polarity": 0.12142857142857143,
            "subjectivity": 0.6089285714285715
        },
        {
            "body": "Democratic Party is trying to bring America 🇺🇸down into Bankruptcy!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}