{
    "time_posted": "2021-10-30 11:00:05",
    "url": "https://www.youtube.com/watch?v=C_9OkNrp6Ps",
    "time_now": "2021-10-31 17:25:34",
    "ups": "2394",
    "downs": "94",
    "views": "142641",
    "top_comments": [
        {
            "comment": "These court decisions that support the news media that do research and fact check verification of their stories should continue.  The bogus law suits on liable should pay the defendants for defending themselves when they lose their court cases.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "comment": "There is no way our reporters should risk their lives bothering with evil oligarchs or Putin or any other nation or nations. We can not be summoned there under the protection of our nation, we have that protection.  OBAMA WARNED US OF THIS.EVERYONE SHOULD HAVE FREEDOM OF SPEECH WHETHER WE LIKE IT OR NOT. WHETHER WE AGREE OR DISAGREE.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.5625,
            "subjectivity": 0.6875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Hmmmmm…Trump won’t be banned any more….there will be some happy dances happening.",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣 Don the con suing & losing again? 😂😂😂😂😂😂😂😂😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If ignorance is bliss, then the MAGA crowd must be blissful. Trump has to be more afraid that his ignorance will be brought out.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.7
        },
        {
            "body": "Chevron Manipulated the United States Judiciary System to jail Lawyer Steven Donziger.\n\nWhat was his Crime? Exposing them for poisoning an Ecuadorian village.\n\nThe fact that Ari Melber can't speak about it tells you he doesnt want you to Google it.\n\nSo whatever you do, Don't Google It.",
            "polarity": -0.1,
            "subjectivity": 0.0
        },
        {
            "body": "When r we going 2 stop talking about what these global megalomaniacs r doing 2 us & actually DO SOMETHING about them? SMH",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "body": "Great journalism Ari!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "I am just so sick of self righteous Trumpers yammering about their \"rights\" or \"the constitution\" over some misunderstanding, ignorance or shallow knowledge.\nAt the same time they ignore or even support ACTUAL threats and abuses of basic human and constitutional rights.\nThe later requires a more enlightened and nuanced understanding.  They lack the discipline to obtain if AND the humility to listen to it, preferring a some self affirming slogan.  (ex. \"this is our house\" while storming the capital)",
            "polarity": -0.06845238095238096,
            "subjectivity": 0.2883928571428572
        },
        {
            "body": "Happy Halloween 🎃 From the USA 🇺🇸 ...",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "Most FOOD in the US is FAR WORSE than the UK and less healthy.",
            "polarity": 0.10666666666666666,
            "subjectivity": 0.5333333333333334
        },
        {
            "body": "Good grief!  This is what the GOP does to distract.  What are they distracting your attention from now?  Oh yeah!  Their involvement in the insurrection of January 6th.  Okay, now we know.  Let's ignore them and move on.",
            "polarity": 0.06666666666666665,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "Trump's policies are worse than his personality",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "What about the lies spread by Trump? Why are the media publish these lies?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am concerned about the attack on free  speech extreme right wing corporations already own a lot of news media even The Wall street  journal is owned by the same person that owns  fox News   .trumpy put a lot of right wing Federalist Socity judges in many courts and  the federalist society helped pick who and where they are packing courts to get the out ome the confederate/Republicans want  total control of our country  they  are wanting an autocratic government which means no free speech",
            "polarity": 0.19404761904761902,
            "subjectivity": 0.6718253968253969
        },
        {
            "body": "I find it to be a complex issue. I absolutely agree with the points here. But we also have a new problem that we’ve never had before. Social media. It has allowed tiny marginal groups to build up power and spread very dangerous ideas. Everything from COVID denial to the spreading of white supremacy to flat earthers and anti-evolution and climate change denial, etc, etc. Some of those seem almost harmless (flat earth) but they represent an anti-science, anti-facts, anti-truth culture that has become very powerful here and around the world. It’s extremely dangerous and makes it hard to have discussions over policy (which is what I purport we should be arguing about) and instead arguing over basic, provable, facts. I think our country, and the world, is in severe danger because of this.\n\nI don’t have a solution. Free speech is an absolutely critical right. The most important right. But the world has changed. What do we do to protect free speech, but ameliorate the damage caused by social media’s outsized soapbox that it gives to every crazy theory out there. It takes advantage of the flaws in our psychology to make us angry and react without consideration.\n\n*sigh*",
            "polarity": -0.0024872953133822577,
            "subjectivity": 0.5685206098249578
        },
        {
            "body": "These court decisions that support the news media that do research and fact check verification of their stories should continue.  The bogus law suits on liable should pay the defendants for defending themselves when they lose their court cases.",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "body": "Oh come on Ari.... Making cheap statements about the quality of food in the UK is sooooo outdated; The choice and quality of food now available in the UK probably far outshines the USA.... which is hardly known to be a beacon of haut cuisine in the first place ! Ever heard of the word \"subjective\" ? Of course you have....",
            "polarity": 0.08680555555555554,
            "subjectivity": 0.6013888888888889
        },
        {
            "body": "Must be fab having all that freedom......",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There is no way our reporters should risk their lives bothering with evil oligarchs or Putin or any other nation or nations. We can not be summoned there under the protection of our nation, we have that protection.  OBAMA WARNED US OF THIS.EVERYONE SHOULD HAVE FREEDOM OF SPEECH WHETHER WE LIKE IT OR NOT. WHETHER WE AGREE OR DISAGREE.",
            "polarity": -0.5625,
            "subjectivity": 0.6875
        },
        {
            "body": "@9:50.. “an outgoing president’s warning…”. Something just as dire as when Eisenhower left office and spoke against the military industrial complex. Apparently, we’re not so good at heeding these warnings, especially given that they’ve come from people who should really know, from experience, what they’re talking about.",
            "polarity": -0.09166666666666667,
            "subjectivity": 0.38333333333333336
        }
    ]
}