{
    "time_posted": "2021-10-30 11:00:05",
    "url": "https://www.youtube.com/watch?v=C_9OkNrp6Ps",
    "time_now": "2021-10-31 05:04:57",
    "ups": "1776",
    "downs": "70",
    "views": "94296",
    "top_comments": [
        {
            "comment": "Thank you, Ari Melber. Thank you and thank you again.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Our Constitution has been written by the Framers. A group of extremely intelligent educated men, Russia and the U. K. need to write their own laws. Our First Amendment stands strong in our country. It cannot be re-written by foreign politics.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.3916666666666666,
            "subjectivity": 0.6183333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Trump sues so much im surprised he hasn't sued his imaginary friend zippy for identity theft!",
            "polarity": 0.125,
            "subjectivity": 0.9
        },
        {
            "body": "Hahaha! You really made me laugh in the middle of such serious matters about British food. You are so right - it might look alright via their TV chefs - but in reality in the everyday? it is truly diabolical. That island has become a hornets nest of racism through the Brexit years and more recently via the tsunami of racism in the media and via thousands and thousands of comments about Meghan, Duchess of Sussex. There was no intervention by the Queen or other royals to ask that the media should stop it. The Queen has a long history of protecting her own interference in politics and media coverage. She literally does it all the time, even up to COP26. But ne'er a word to defend or protect Meghan, or Harry, who escaped that nasty island, and its nasty food, with their lives. On another serious note, Putin's record is pure evil. And not just with books or stories written about him, those, as you demonstrated, are fairly easily scrubbed from existence. But he murders opponents like Alexei Navalny who is now in a Siberian prison after a miraculous recovery from poisoning by KGB-type agents you would find in a John le Carré novel. He's only alive because of some immediate treatment in Russia before he was flown to Germany for a long recovery. The# list of dead journalists is long. Sometimes death isa meted out in the most brutal of ways by contract killkngs eg: Anna Politkovskaya. Amnesty International has named Russia as the most dangerous country in Europe for journalists. Without journalists telling us what they see and investigate when there's corruption we are all ignorant. This is especially the case when there's corruption and power inequality.",
            "polarity": -0.06236559139784947,
            "subjectivity": 0.5492703533026114
        },
        {
            "body": "Treason is 20 years!\r\n6 months to a year is pinky privilege.\r\nWhat sentence would they get if they were black?\r\nWE LIVE IN A GENERATION WHERE TEASING AND LAUGHING AT AMERICANS IS THE NORM.",
            "polarity": -0.015151515151515152,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "The U S tortures people and is owned and run by right-wing Israel maniacs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If only the extremist right were so shortsighted and ignorant when it comes to authoritarian and totalitarian rule. They might learn the the Democrats weren't wanting to take away their rights.",
            "polarity": 0.14285714285714285,
            "subjectivity": 0.7678571428571428
        },
        {
            "body": "I think, he is trying to branch alone with his own company using Facebook popularity.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Our Constitution has been written by the Framers. A group of extremely intelligent educated men, Russia and the U. K. need to write their own laws. Our First Amendment stands strong in our country. It cannot be re-written by foreign politics.",
            "polarity": 0.3916666666666666,
            "subjectivity": 0.6183333333333334
        },
        {
            "body": "It's a total shame how u rappers can disrespect black women in this fashion what's wrong with u   it's  your  mother your sister what's going on",
            "polarity": -0.2222222222222222,
            "subjectivity": 0.6944444444444445
        },
        {
            "body": "Thank you, Ari Melber. Thank you and thank you again.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Very well put together. Rest in peace Martin Luther King.",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "The lawsuit is mightier than the lying bull chit.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Reporters are supposed to be bound by ethics.  Fact check everything before reporting.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dr. Martin Luther King would be turning over in his grave over the Democats shinanigans.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Democats love surpressing people.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "And why are there no Republicans serving on the Jan 6 Committee?\nI smell something very, very fishy.",
            "polarity": 0.26,
            "subjectivity": 0.39
        },
        {
            "body": "I need to know what role the Democats had in this so-called Insurrection?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Democats are in big, big trouble in the 2022 midterms.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.13333333333333333
        },
        {
            "body": "MSNBC should sue AT&T OAN's funder then they'll knock it off.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't let the new neo-natzi GOP party from turning America into a new natzi nation.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        }
    ]
}