{
    "time_posted": "2021-10-30 14:59:49",
    "url": "https://www.youtube.com/watch?v=cRw3pAG39Pk",
    "time_now": "2021-11-03 23:42:55",
    "ups": "13159",
    "downs": "94",
    "views": "163918",
    "top_comments": [
        {
            "comment": "LINK TO ALL MUSIC STREAMING SERVICES https://ffm.to/squidgames\nSHARE THIS EVERYWHERE YOU KNOW!!!!",
            "likes": 355,
            "number_of_replies": 15,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Putting aside how simply incredible this entire song is, it also really accurately shows what it feels like having an addiction to anything. You know its wrong, and you just cant stop. So yeah, this hit musically and as a life message",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.16,
            "subjectivity": 0.6116666666666666
        },
        {
            "comment": "[Verse 1]\nGo ahead\nTake a little money, it ain't no sweat\nYou gon’ make it back with some more bread\nProbably have enough to buy yourself a little Rolex\nYou can make that money up with no stress\nBreaking your back for pennies, that's grotesque\nDon't you wanna have your mom getting more bread\nAll that money just waiting, dawg, go fetch\nYo, put a little more (Yeah, yeah)\nShe will never know (Yeah, yeah)\nAnd we don’t fold, feel it, we so close\nMaybe one more chip we can get that rolls\nWe can be so goals (Yeah, yeah)\nBe the one who earns, not the ones who owe\nNot the one who calls and they ignore your phone\nWe can win that all, we can bring that home, shit\nWe just gotta double down\nFind a little more money, do another round\nNo, every time that I do this it ends up the same\nBut we are the same, get the hell out my brain!\nMoney and fame, that's a hell of a lane\nPut your foot to the floor and the quicker we gain\nWhat the fuck are you talking about? This is insane!\nWe're in this position cause you can't abstain!\nI just wanna give up\nCause everything that I touch\nGets crumbling into dust\nI've never been enough\nIt's a trap in a bucket, so fuck it (stop!)\nFeel it up in your stomach, don't jump ship (stop!)\nWe are not that puppet, we rush it (stop!)\nI'm a masochist, I must love this, damn\n\n[Chorus]\nEvery time that I do this\nI can hear the path to right and I mute it\nI can see what I don’t have and I lose it\nLook at me and all them laugh at my uselessness\nNow I look at my bruises\nAnd I see that I’m the one that's abusive\nAnd I know all the pains of my doing\nAnd I’m the one that's a lunatic\n\n[Verse 2]\nWhat will they remember, what is my legacy\nNever gave the alpha minimal energy\nAlways been a better, but never bet on me\nSo I rolled the dice and landed some enemies\nNever been a stone killer\nBut the right choke hold make a go-getter\nAnd I went from that life, giving no effort\nSending any Gganbu to the omega, you should have known better\nAin't you me and I am you\nWell that should mean that you should know what I can do\nAnd when I fall, you right on cue, you like a loop\nYou keep coming round every time I lose (bitch)\nYou brought my life to the ICU\nNow I see you, one, no, I see two\nThought I buried you alive, sorry, I assumed\nI'll light the fuse and cause you are twice removed\nCan’t nobody fuck a life up like I can do\nThey lie to me and all just hide the truth\nGone south, cold winter, gonna fly the coup\nRagdoll, I don't have a slide, it's clue\nBut I'm bout to dive in, got the lycra suit\nAnd like a suit I'm pressed for the right pursuit\nI won't even live for me, but die for you\nYou stand with me, but walk with the rival crew\nBeen living existence a literal sedative\nMaybe this just what I needed to get a grip\nLife been a horror flick, time that I edit it\nCrop out my demons, the heathen, the hedonist\nNever been them, you were always my nemesis\nSnake in the grass and it's time that I shed the skin\nDon't need a box, bitch, I'll walk off the premises\nMaybe I'll walk to the life that I've never live (huh)\n\n[Chorus]\nEvery time that I do this\nI can hear the path to right and I mute it\nI can see what I don't have and I lose it\nLook at me and all them laugh at my uselessness\nNow I look at my bruises\nAnd I see that I'm the one that's abusive\nAnd I know all the pains of my doing\nAnd I'm the one that's a lunatic\nEvery time that I do this\nI can hear the path to right and I mute it\nI can see what I don't have and I lose it\nLook at me and all them laugh at my uselessness\nNow I look at my bruises\nAnd I see that I'm the one that's abusive\nAnd I know all the pains of my doing\nAnd I'm the one that's a lunatic",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.056024722913020776,
            "subjectivity": 0.4944824383654171
        },
        {
            "comment": "Glad I just started this series",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment": "This rap is fire🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "OMG, EXACTLY WHAT I NEEDED \r\n------------------------------------------------------⏯Cliklink----------------------------------------------------------THE NEW VIDEOS SEX 🎬ⓉⓊⒷⒺⓈⒺⓍ🔞------------------------------------------------------------------------------------------------------------------------------------------------------------------------- MY 18+ PHOTOS HE RE 💜 👉 MYID7284.UNO?GB/HDRCam私のヌードセックス トップAVビデオに参加する ❤️\r\n\r\n\r\nライブ配信の再編ありがとうです！この日のライブ配信は、かならりやばかったですね！１万人を超える人が見ていたもんね（笑）やっぱり人参最高！まさかのカメラ切り忘れでやら1かしたのもドキドキでした！今後は気を付けないとね. .\r\n!😉💝❤️#今後は気をライブ配信の再編ありがとうです！#この日のライブ配信は、#かならりやばかったですね！#１万人を超える人が見ていたも \r\nん（#笑）#やっぱり人参最高！#まさかのカメラ切り忘れでやら1かしたのもドキドキでした $ \r\n#今後は気をライブ配信の再編ありがとうです！ #この日のライブ配信は、W #かならりやばかったですね！ ! \r\n#１万人を超える人が見ていたもん（ #笑）#やっぱり人参最高%！ \r\n#まさかのカメラ切り忘れでやら1かしたのもドキドキでした #垃圾W#再編ありがとうです！#いたもん（#笑）在整個人類歷史上，強者，富人和具有狡猾特質的人捕食部落，氏族，城鎮，城市和鄉村中的弱者，無'守和貧窮成員。然而，人類的生存意願迫使那sfdsd些被拒絕，被剝奪或摧毀的基本需求的人們找到了一種生活方式，並繼續將其DNA融入不斷發展的人類社會。. 說到食物，不要以為那些被拒絕的人只吃垃圾。相反，他們學會了在被忽視的肉類和蔬菜中尋找營養。他們學會了清潔，切塊，調味和慢燉慢燉的野菜和肉類，在食品`.",
            "polarity": 0.23153409090909088,
            "subjectivity": 0.3522727272727273
        },
        {
            "body": "They said dragons didn't exist. They were wrong.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "Makes me feel tingly😩",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}