{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 09:54:00",
    "ups": "7996",
    "downs": "46",
    "views": "91889",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Bannons face will be totally eaten away before he gets arrested.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Justice department has no leg to stand on if they whom are expected to hold up the law... ARE NOT!  It truely is looking rather like my friends are correct, they have no intentions of making all these criminals face charges and time. I am so disappointed in the DOJ! If this was any other country , theyed be aressted, tried and serving time if not hung!",
            "polarity": -0.2171875,
            "subjectivity": 0.54375
        },
        {
            "body": "Garland and all the Dems are just too meek. In other countries Trump and all off his underlings would be in prison right now. This is the time when Biden needs to step in and make command decisions. This whole thing has been a big joke. We are in deep trouble.",
            "polarity": 0.026785714285714284,
            "subjectivity": 0.3351190476190477
        },
        {
            "body": "Fake news and fake evidence.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Garland, don't flinch at the GOP Senator's performative abuse; they are deeply wrong, they are cravenly horrific threats to democracy and to the rule of law. The law, AG, without fear nor favor--be legally, morally clear AND ACT NOW.",
            "polarity": -0.4666666666666666,
            "subjectivity": 0.7611111111111111
        },
        {
            "body": "Why? Garland is not facing current reality to drag his feet here. Get out of the job if you're not up to enforcing the law; all on you, Garland DOJ. Do it, because justice MATTERS.",
            "polarity": -0.05,
            "subjectivity": 0.23541666666666666
        },
        {
            "body": "What is this negotiating crap with Meadows?   He got a subpoena demanding his testimony and documents.  This is not subject to bargaining.  The demand means what it says and had a deadline.  No extension.  Produce or action, whether it's by the DOJ or the more direct route.  I guarantee if any of these people were behind bars until they complied, they'd provide everything requested in a New York minute.  If they want to appeal, fine.  But you remain in the slammer until then.  And just remember, the wheels of justice turn slowly no matter which side you're on.  And also, this would be the Capitol jail, not Rikers Island, so it wouldn't be too traumatic.",
            "polarity": 0.01863636363636363,
            "subjectivity": 0.41878787878787876
        },
        {
            "body": "Do It 🇺🇸💯",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So what we gotta do pit them under a citizens arrest.  !  Th7s us absurd. Quit wItubg while they run the cloth and destroy records. The fedsocs ate at it everysevibg in the cases bd seeing how everything runs",
            "polarity": -0.25416666666666665,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Congress and Garland needs to grow a  pair, neither seems to be using the full power of  their office. Bannon should have been arrested already and tRump and  the others in office who participated and helped plan Jan 6th should be looking at indictments already..",
            "polarity": 0.35,
            "subjectivity": 0.55
        }
    ]
}