{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-02 18:52:14",
    "ups": "8176",
    "downs": "49",
    "views": "96039",
    "top_comments": [
        {
            "comment": "Why isn't Bannon indicted yet? Are you people too afraid, just don't care or you have too much money. This is all a bunch of hogwash I'm beginning to think that's total Washington DC inflation you childish little kids make me sick",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25029761904761905,
            "subjectivity": 0.6678571428571428
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "It’s Tuesday. (November 2). Justice is being delayed. I don’t think the DOJ believes justice matters.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank you for staying the facts clearly and succinctly.",
            "polarity": 0.10000000000000002,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "Looks like it might be time to protest outside the DOJ to put more pressure on Garland. I'd like a purge of Trump loyalists because the coup is still active. If Garland is incapable of upholding the law, Biden better find someone who can. Now! Biden's approval ratings will skyrocket once he holds the traitors to account. Until then, his supporters will have doubts. And...pick Bannon up. This is ridiculous!!!",
            "polarity": 0.06812500000000003,
            "subjectivity": 0.53
        },
        {
            "body": "garland is a wuss , dems are cowards, the country is freely being given to the fascist. Even New Zealand aint far  enough away from this slow moving trainwreck",
            "polarity": 0.06727272727272726,
            "subjectivity": 0.630909090909091
        },
        {
            "body": "This is ridiculous.\nDo the democrats want to get re-elected?\n\nTrump won because people perceived him to be a strong man.. Flawed but true.\n\nWe all basically know that Trump and his minions are likely guilty of numerous crimes. Arrest them already.\n\nI fear the doj is afraid of backlash by way of massive public unrest if trump and his ilk are arrested.",
            "polarity": -0.10909090909090911,
            "subjectivity": 0.6681818181818181
        }
    ]
}