{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 05:47:06",
    "ups": "7940",
    "downs": "44",
    "views": "90805",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "RIGHT ON-----NOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "polarity": 1.0,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "I totally agree with you! I really don’t know why the AG has to decide anything!",
            "polarity": 0.125,
            "subjectivity": 0.475
        },
        {
            "body": "You are spot on. Garland needs to go.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Garland must GO! He has a soft voice and does not have what it takes to stand up to the major backlash that he will get from the Republicans if he were to come down hard and actually do his job to hold Bannon`s feet to the fire. I do not think the guy has it in his DNA, wrong person to be DOJ",
            "polarity": -0.13078703703703706,
            "subjectivity": 0.44675925925925924
        },
        {
            "body": "Good\n\nCongress is full of unamerican communist enemies of u.s. citizens",
            "polarity": 0.5249999999999999,
            "subjectivity": 0.5750000000000001
        },
        {
            "body": "SCUMB BUTT bannon IS NOT\nMADE OUT OF TEFLON, SO WHY IS IT TAKING THIS FREAKIN LONG TO NAIL his ARUS INSIDE MAXIUM PRISON?",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "What are they waiting for! Throw him in jai!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He's likely terrified.  He should just resign for health or family reasons.  Then he doesn't have to do what he must and avoids the wrath of those planning to overthrow the government.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "So ... how many millions did Garland accept from the Mercer family to keep protecting Bannon  ?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "INDICT BANNON NOW",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I suspect that Russia has threatened Garland and his family. There's no other reason a competent AG would let Bannon get away with thumbing his nose at Congress.",
            "polarity": 0.28125,
            "subjectivity": 0.5208333333333333
        },
        {
            "body": "Glen how do we prevent Steve Bannon from being acquitted like Rita Lavella? All it takes is bias from one jury member to eliminate Congress’ co-equal power.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Give it time. We want it air tight.",
            "polarity": -0.17857142857142858,
            "subjectivity": 0.2857142857142857
        },
        {
            "body": "Biden will not allow Trump and his team to be indcited by DOJ, its just that obvious. Ten months in office and Biden has done very little on his campaign promises and a Big Nothing on Trump.",
            "polarity": -0.060937500000000006,
            "subjectivity": 0.3125
        },
        {
            "body": "Thank You, Glenn.  Your restraint and patience to allow the DOJ to move has been admirable.  I find the seeming inaction incomprehensible.  Do they not viscerally comprehend how much worse they're making the situation?",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "🖐👎🏻💥💥 yes, we’re all outraged as O Fortuna continues her downward spiral! Outrageous! Outlandish, Unacceptable! …wash, rinse, repeat. Dismissed!!",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I know!  Let's be fair to a sob that has stated - for years - that his answer was to TOTALLY tear down our country!  Hey DOJ!  If you are worried that you'll be blamed for the coming civil war, don't worry - tr+mp's Sturm Abteilung will be coming after unsuspecting everyday people, not someone who can protect themselves like you can.",
            "polarity": 0.06423611111111109,
            "subjectivity": 0.6347222222222222
        }
    ]
}