{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-02 02:23:38",
    "ups": "8125",
    "downs": "48",
    "views": "94873",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Soon it will be day 365 days and 2022 elections will be in full swing.. You need to talk about this ever single day.. EVERY DAMMMM DAY..",
            "polarity": 0.1392857142857143,
            "subjectivity": 0.3821428571428572
        },
        {
            "body": "As Dem constituents sit on the COUCH!!! 🤭🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Talk, talk, talk ..... When's the walk?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Is it true that Garland is waiting to decide if the Bannon subpoena has a legislative reason? It sounds like if Congress isn't planning on legislation based solely on Bannon testimony it won't take it to a grand jury. What's happened to your friend Garland?",
            "polarity": 0.425,
            "subjectivity": 0.825
        },
        {
            "body": "Looks like AG Garland checked his courage and oath at the door.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Prosecutors all over this country do not need to contemplate before tossing the book at people of color, or the poor, who are charged with crimes; they don't wait for the subject to come down to the precinct for an interview. This travesty illustrates how unequal this country is when it comes to criminal justice. Garland will do nothing, Congress will just wring its hands. We're screwed. The system is busted.",
            "polarity": -0.28055555555555556,
            "subjectivity": 0.4430555555555556
        },
        {
            "body": "Only Democrats could screw up these Slam Dunk  cases.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Thanks Glenn!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "body": "Arrest Steve Bannon NOW!",
            "polarity": -0.0625,
            "subjectivity": 0.0
        },
        {
            "body": "Be waiting a long time .........   Wont happen . There is no justice !",
            "polarity": -0.0625,
            "subjectivity": 0.4
        },
        {
            "body": "Garland doesn't have time to sit in these goofy repub questions! He needs to start getting his ducks in a row and prove he's worth his job. Im doubtful unfortunately👊👃",
            "polarity": 0.041666666666666664,
            "subjectivity": 0.6666666666666666
        }
    ]
}