{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 14:01:32",
    "ups": "8027",
    "downs": "46",
    "views": "92548",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "1692",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The facade of equal rights, and noone above the law is exposed. Being in republican circles puts you above consequences...",
            "polarity": 0.0,
            "subjectivity": 0.15
        },
        {
            "body": "I love it.  You keep saying all this justice s*** matters and Trump's judges keep saying   no it doesn't.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Piss or get off the pot Sir, what would you do?????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If you were appointed special counsel for J6   what would you do?",
            "polarity": 0.35714285714285715,
            "subjectivity": 0.5714285714285714
        },
        {
            "body": "GOP will be laughing all the way to the white house if this keeps up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "8 days eh. Big surprise. How do you think Mark Meadows will respond?  Oh yeah   he hasn't been called yet. \nJustice    ha",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Merrick Garland hasn’t got the stomach to go after these grifters … Merrick Garland needs to go …",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What is Merrot Garland doing now. Whos side is he on?  Jan 6 better just toss Both Bannon and Medows asses in Jail like they should have done in the first place. Polose take action what the hell are u waiting for?",
            "polarity": 0.1875,
            "subjectivity": 0.2333333333333333
        },
        {
            "body": "Does the Republican Brown SHIRTS have something on Garland???",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Garland only wanted the job, not to do his job according to his oath with equal justice for all.",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "body": "Garland looks like a quivering puppy whenever he is asked about all those criminals from the tRump administration. What the hell is he thinking??? Remove him!  I also have a feeling it is Biden who doesn’t want him to prosecute Trump because he knows when the tables turn and the GOP get back in power they will go after him…what Biden doesn’t realize is that trump and GQP  WILL go after him anyway, just like he was trying (and still is) to go after Hilary and Obama!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}