{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 22:16:09",
    "ups": "8104",
    "downs": "48",
    "views": "94286",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Please can we change attorney general? We need you!",
            "polarity": 0.06250000000000003,
            "subjectivity": 0.5
        },
        {
            "body": "Garland may have been a great judge but that in no way qualifies him to be AG, as we are sadly witnessing now. When I saw his pathetic performance last week in the hearings I was both disgusted and outraged and my heart sank. He sat there and quivered like a wet puppy as they took turns kicking sand in his face. And this is all on Biden, who is firmly committed to his yearning for a return to the way things used to be done. The Dems are all stranded up on \"the high road\" clutching their pearls and filling up their water balloons instead of marching into the trenches with bayonets and loaded guns, which is where we're   all headed if they don't do their jobs and clean up this mess NOW. I get sick to my stomach thinking of the hell we are about to drop into when we lose 2022, because if we lose '22, '24 is already gone. Garland is not the only spineless coward in this mess, the Dems are the wuss party, but Garland is the only one who can save us now, and isn't that a kick in the a$$.",
            "polarity": -0.22917460317460317,
            "subjectivity": 0.670920634920635
        },
        {
            "body": "Stop with the 'contemplation' this is INFURIATING - Merrick Garland should either DO his job - or RESIGN!!!",
            "polarity": -1.0,
            "subjectivity": 0.8
        },
        {
            "body": "This is very concerning. The message that the DOJ and January 6th committee are sending is very disappointing. We waited 4 long years for this...REALLY!",
            "polarity": -0.2141666666666667,
            "subjectivity": 0.5366666666666666
        },
        {
            "body": "I said months ago I have no faith in the system",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "DOJ needs to move against Bannon now, not only for what he did but to put pressure on the others, NOW!! And yes Congress version of contempt needs to happen now !!",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "We are all still waiting for Justice!!!!! Thanks Glen!!",
            "polarity": 0.3125,
            "subjectivity": 0.2
        }
    ]
}