{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-30 20:51:33",
    "ups": "4138",
    "downs": "16",
    "views": "29666",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "It's sad but I think you gave Garland a LOT more credit than he deserves when he took this on Glenn.  As usual, the little guys are in jail and the organizers will never be found guilty.  Same old, same old swamp.  He's showing that there is definitely 2 levels of justice and politicians are above the law.  Disgusting.",
            "polarity": -0.14134615384615384,
            "subjectivity": 0.4230769230769231
        },
        {
            "body": "I now have zero expectations of Garland doing anything vs Trump and Trump allies.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What are they waiting for?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bannon mocks the D.O.J EVERYDAY on his show Bannon war room.  He thinks he's above the law calls them morons and scumbags.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "I don't understand why Trump's group is not anxious to present all their exculpatory evidence to the people. You know like they did in the Russian prob.",
            "polarity": 0.041666666666666664,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Shouldn't take this long for someone who ignores a GOV subpoena. The DOJ needs to wake up and do their jobs... Congress - do your job..",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "If I were an American citizen, I'd already be looking for a new place to call home. America is circling the drain. 2024 will see a full sweep of Congress, Senate and White House by Thuglicans...and all hell is going to break loose. There will be a cleansing of media and law enforcement that stood up to trump, and visible minorities as well as people of Hebrew roots will pay a horrible price. \nIt can be turned around as yet, but only if Biden's AG and the courts start doing their job quickly, and make harsh examples of everyone involved with insurrection, corruption, and political mayhem. Starting at the top. \nMr. Garland, find a back bone - you have nothing to fear but fear itself...and it's obviously paralyzing you.",
            "polarity": 0.0030552780552780545,
            "subjectivity": 0.40526973026973023
        },
        {
            "body": "Look how long we waited for Mueller to do America 🇺🇸 Justice, and look what Mueller gave us. 😠",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "The DOJ is stalling and ppl are not happy about it . I guess Democrats really want Chump to be potus again . FOH",
            "polarity": -0.1,
            "subjectivity": 0.6
        },
        {
            "body": "Congress and the DoJ are demonstrating that violence behaviour and the threat of more violent behaviour has them intimidated and too frightened of  ‘consequences’.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.75
        },
        {
            "body": "It's almost Halloween...\nIt'd be cool to arrest Bannon the Ghoul right during his own Halloween party and infront of all his corrupt buddies. Imagine the photographs: Bannon dressed up as his hero: the clown from Spawn \"Violator\". \nIt'd be so embarrassing for him.\n\nWhat a wonderful gift that'd be!\nAll those maggots in one room.\nIt would put the fear of God in them, all at once! \nThey'd possibly start turning on each other.",
            "polarity": 0.1950892857142857,
            "subjectivity": 0.6950892857142857
        },
        {
            "body": "Merick Garland: \"Steve Bannon? maybe a ticket might not be too harsh\"",
            "polarity": -0.2,
            "subjectivity": 0.7
        },
        {
            "body": "Its bulltrump he should be locked up already",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bannons ain’t going anywhere but the tavern , please prove me wrong 😑",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "Soon it won't be referred to as January 6th but as January 6th, 2021. Timely justice. Justice delayed is Justice denied.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As always thanks Glenn.  What is up with the slow motion DOJ?  6th Commission do your job.  I hope you are constantly checking, and reminding them, that the public wants action at DOJ!",
            "polarity": 0.0375,
            "subjectivity": 0.20000000000000004
        },
        {
            "body": "Merrick is starting to pathetic! He seems to passive!",
            "polarity": -0.5,
            "subjectivity": 0.55
        },
        {
            "body": "It looks like the strategy of the insurrectionists is to run out the clock. I, for one, would appreciate if the DoJ was a little less accommodating to their plan.",
            "polarity": -0.17708333333333331,
            "subjectivity": 0.2833333333333333
        },
        {
            "body": "Hello Glenn is there someway we can get in touch with the top of the doj? I along with alot of us want this sh...t show to be over!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "If the DOJ, and AG Garland fail to bring the top actors in Jan6 insurrection to justice, then, Americans should begin protesting with justice marches?    Jan6 was an attempt to install X45 as America’s first dictator?   Why no repercussions with this act of tyranny?    AG Merrick Garland was interrogated last week, and absolutely acted like cold milk-toast, no fire in his belly, and seemed ineffectual for the position?    At this time in history another AG should be appointed, yes, you Glenn Kirschner?   If the chief insurrectionist escapes justice, rest troubled, he isn’t giving up, remember 1930’s Germany and Hitler?",
            "polarity": -0.09285714285714285,
            "subjectivity": 0.5857142857142856
        }
    ]
}