{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 17:25:20",
    "ups": "7568",
    "downs": "39",
    "views": "83376",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "merrit garland rubs his eyes when he wakes up in the morning because he doesn't have any balls to scratch.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🤬🤬",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Go easy Glenn,  you're sounding a little unhinged.  What's the problem? Isn't this how the wheels of justice work for the affluent?",
            "polarity": 0.2986111111111111,
            "subjectivity": 0.7611111111111111
        },
        {
            "body": "Take Off the Gloves!\nNice guy doesnt work.\nFull speed ahead!!!!\nOr, Merrick, we will stop asking Polite.....demanding your replacement....we Know your BOSS",
            "polarity": 0.72724609375,
            "subjectivity": 0.775
        },
        {
            "body": "Prosecute Steve Bannon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Meadows is waiting to see what happens to Bannon.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank you for being direct, and explaining in simple layman's terms what the actual processes are.  I come to you for clarity which I cannot find on MSM.  So thank you for your valuable and pertinent reporting!!!",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.2857142857142857
        },
        {
            "body": "Garland is not able to effectively do his job!",
            "polarity": 0.25,
            "subjectivity": 0.7125
        },
        {
            "body": "Merrick Garland has proven to be a disappointment as attorney general. maybe a change needs to be made in regards to him. especially since Cruz and and other Republicans tore him apart about a memo that he made. it appears that he isn't up to the task as attorney general. otherwise if he wants to redeem himself. he needs to grow some balls and get moving on these matters.",
            "polarity": -0.07083333333333332,
            "subjectivity": 0.4791666666666667
        },
        {
            "body": "Garland was up for supreme court judge, he does not seem strong enough to be attn general. Replace him with someone who is, let Garland be a judge. Hurry, People are losing faith in our governing system? we the public are not ignorant as to how the law works. Money will FIX everything.",
            "polarity": 0.12083333333333332,
            "subjectivity": 0.45
        },
        {
            "body": "WTH is the hold-up!! Know who you are, DOJ, and do what you know needs to happen!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We know where the bank robber is,we even have some of the banks money he is spending. We are contemplating if he will give it back or run?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please tell us what we can do before we lose our democracy.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't count on DOJ Garland, he is pondering how he can do nothing diplomatically, and still stay in his job..... How do we appoint a better DOJ???? This one does not believe in Justice.... Thinking he will blame President Biden, as POTUS stated those that are in contempt should be charged... a simple truthful statement, but a statement POTUS should not said out loud...",
            "polarity": 0.275,
            "subjectivity": 0.5392857142857144
        },
        {
            "body": "Get all those traitors and scumbag behind bars. If America don’t do something about them it will cancerous America. And yes: Justice Matters!!!",
            "polarity": -0.78125,
            "subjectivity": 0.7
        },
        {
            "body": "There has GOT to be some way that we can replace Garland with Glenn. That is the only way we can move foreward. Glenn, do you want the job? You have my vote!",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "It’s like the AIG bail out all over again. In the US it’s justice some some not all",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How can it possibly take that long unless he’s looking for a safe out to NOT indict? Let’s just give another green light to sedition and lawlessness, that’s really worked well with Trumpism.",
            "polarity": 0.1416666666666667,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "Maybe they're all thinking: \"There but for the grace of God go I.\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}