{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-04 03:50:35",
    "ups": "8229",
    "downs": "50",
    "views": "97240",
    "top_comments": [
        {
            "comment": "How did it go in Virginia with all this living in the past and waiting for a stale, pale, male to do the right thing in the DOJ? \n\nAmerica - you have the representation you deserve. I'm enjoying watching the sun set on the arrogance and ignorance of the US.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.029047619047619044,
            "subjectivity": 0.36095238095238097
        },
        {
            "comment": "It’s just beyond frustrating,aren’t they really interested in holding anyone accountable for these heinous crimes against the American people??!! My God, if it was me I’d have been thrown in jail and threw away the keys!! It’s like this AG doesn’t want to do anything like he’s scared or something, well if that’s the case, then just quit and give YOU the job, I’m sure you’ll do what’s needed!! Jesus Christ man, these people are killing me with this procrastination shit!!!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0529296875,
            "subjectivity": 0.4377777777777778
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Are you kidding I can even get out of their own way without asking Republicans if they can go to the bathroom they’re so scared of the Republicans so wet their pants before Ask we don’t have a party anymore all we have is a bunch of people who said behind the desk whether or not and ask a bunch of stupid questions and do nothing and the Republican party is laughing at us constantly yes justice does matter Just talk to the Democrats",
            "polarity": -0.13999999999999999,
            "subjectivity": 0.6866666666666666
        }
    ]
}