{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 13:18:17",
    "ups": "7337",
    "downs": "37",
    "views": "79223",
    "top_comments": [
        {
            "comment": "This is what happens when you have dirty money in politics. Nearly every member in the house and senate are dirty. This is why people like Sanders and Cortez are so rare. They actually want to help the country but are attacked on both sides by the corporate puppets in office and corrupt media who profit off the infighting, They don't go after each other as a rule because they don't want people to come after them. National unions are the people's only way forward to bring these criminal corrupt corporations, dark money groups and criminal corrupt politicians to their knees. Use social media as a way to form massive groups to fight for voting rights, livable wages, community funding etc! Because if you don't these criminals will keeps their boots on your necks forever.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.20885416666666667,
            "subjectivity": 0.6213541666666667
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "It seems that the plotics are winning. It is about time garland gets off his ass and do the his job along with the rest of the doj. Why is it taking time when the evidence is out in the open. If he does not this country is going by the way side. Just look at trump and his followers distroying this  country. Is this what america is about.",
            "polarity": 0.25,
            "subjectivity": 0.625
        },
        {
            "body": "Donald Trump had control of the FBI, CIA, and NSA for four years, and Epstein didn't kill himself. How much dirt do you think he has on our lawmakers? Even if Merrick is as clean as a whistle, somebody he cares about may not be.",
            "polarity": 0.2833333333333333,
            "subjectivity": 0.45000000000000007
        },
        {
            "body": "Garland is not as strong as we all though. Even President Obamas was under the same impression. I'm starting to think it was better not to choose him as part.of the supreme court.",
            "polarity": 0.23333333333333334,
            "subjectivity": 0.3645833333333333
        },
        {
            "body": "Well said. Pressure must be applied to Garland to do his job or resign.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So DOJ is MIA. They can probably apply for the rights to that agency name change and receive it. I encourage it. Because it's what they are.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I knew nothing would happen",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Stop thinking the DOJ are not acting. I would wager they are gathering charges, information to expand the indictment.  Mr. Kirschner chill it will come.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's time to start sending these jokers to Prison & Do Your Sworn Duty to & For the American People! We also are watching the actions of Congress! Bannon and all of these Trump Bad Boys are Guilty as Heck and the America Public & Congress Knows this So Congress get off your Hands and DO Your Duty as All Members Swore to on the HOLY BIBLE to the Constitution of the UNITED STATES of AMERICA! Or have All you Congress Officials Lied to Us the AMERICAN PUBLIC?",
            "polarity": -0.19999999999999996,
            "subjectivity": 0.3
        },
        {
            "body": "The call for Garland's lack of decisive action would seem to fall on deaf ears in DC.  If Trump runs in 2024, Biden can thank Merrick for the failure of the DOJ.",
            "polarity": -0.10833333333333335,
            "subjectivity": 0.2
        },
        {
            "body": "Im not a lawyer though I think it's just Due process. I'm going to Be patient. The radical RT wants to attack Garland and the committee. They twisted his memo recently and will twist and attack anything done prematurely. I think 9 days doesn't apply. The executive privilage lawsuit filing, though thin, still gums up the indictment process. Stalling with lawsuits is Trump's expertise. But don't worry. Work is still getting done behind the scenes everyday. Congress has forced Trump to officially try to protect Bannon and thus himself. It shows he is worried. However they will never testify. If brought to trial each will plead the 5th so I wouldn't be on the edge of your seats. This is just an initial investigation and see how the RT has scrambled and cried to derail it. I believe a special prosecutor will be needed eventually. Don't let them discourage us. That is their game.Im not a lawyer though I think it's just Due process. I'm going to Be patient. The radical RT wants to attack Garland and the committee. They twisted his memo recently and will twist and attack anything done prematurely. I think 9 days doesn't apply. The executive privilage lawsuit filing, though thin, still gums up the indictment process. Stalling with lawsuits is Trump's expertise. But don't worry. Work is still getting done behind the scenes everyday. Congress has forced Trump to officially try to protect Bannon and thus himself. It shows he is worried. However they will never testify. If brought to trial each will plead the 5th so I wouldn't be on the edge of your seats. This is just an initial investigation and see how the RT has scrambled and cried to derail it. I believe a special prosecutor will be needed eventually. Don't let them discourage us. That is their game plan.",
            "polarity": -0.1493197278911565,
            "subjectivity": 0.46156462585034014
        },
        {
            "body": "Sir, you are really doing ya best.The AG is being influenced by Trump's  statement that the AG is ra well espected gentleman who must do what is right. Am so so afraid",
            "polarity": -0.03809523809523809,
            "subjectivity": 0.5452380952380952
        },
        {
            "body": "Is the DOJ so riddled with Trump cohorts Garland is incapable of doing his job?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I like the democrats but they are pathetic.  They are like guard dogs that are missing their teeth. Grow a pair! I predict nothing will be done to help by the midterms. They will still be saying  they are working on it.",
            "polarity": -0.625,
            "subjectivity": 0.525
        },
        {
            "body": "This is what happens when you have dirty money in politics. Nearly every member in the house and senate are dirty. This is why people like Sanders and Cortez are so rare. They actually want to help the country but are attacked on both sides by the corporate puppets in office and corrupt media who profit off the infighting, They don't go after each other as a rule because they don't want people to come after them. National unions are the people's only way forward to bring these criminal corrupt corporations, dark money groups and criminal corrupt politicians to their knees. Use social media as a way to form massive groups to fight for voting rights, livable wages, community funding etc! Because if you don't these criminals will keeps their boots on your necks forever.",
            "polarity": -0.20885416666666667,
            "subjectivity": 0.6213541666666667
        },
        {
            "body": "Everyone loves to forget the fact that if Biden had decided to nominate a pit-bull for AG, he would have been rejected out of hand.  This is the best we are gonna get until the Senate confirmation hearings aren't filled with lunatics.",
            "polarity": 0.7,
            "subjectivity": 0.6
        },
        {
            "body": "Bannon Indictment Watch Day 327: DOJ Has Yet to Indict Bannon for his Crime of Contempt of Congress",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Look Glenn,  the Republicans will waste no time if the shoe were on the other foot.  It's sad. The unnecessary delays!",
            "polarity": -0.33125,
            "subjectivity": 0.56875
        },
        {
            "body": "Biden should have enough leverage over anyone who helped or was involved with Jan. 6, he should be able to get voting rights laws and anything else he wants passed but he’s an ethical guy.  I’m happy about that.",
            "polarity": 0.33999999999999997,
            "subjectivity": 0.5650000000000001
        },
        {
            "body": "It is rather surprising that no action is coming forth from the DOJ. Even the Select Committee is failing to exercise its inherent power to arrest Bannon. Are they afraid? Afraid of what? The inaction conveys a sinister meaning for the Law Enforcement as well as the Congress. Can’t they comprehend what their inaction conveys to the people at large? The situation boils down to mean any of the following. May be they want more time to act. Or do they have personal bias? Or do they have interests that could prejudice their action, if taken. Are they not unlawfully and unjustifiably favoring Steve Bannon instead of lawfully and justifiably taking action against him, in accordance with the Law of the Land? The present Congress and DOJ are committing a serious lapse which could ultimately lead to collapse of the Democratic Institution in America 🇺🇸. They should not procrastinate. They must act NOW.",
            "polarity": -0.05483906525573193,
            "subjectivity": 0.42064594356261015
        },
        {
            "body": "Can we ever get rid of this crooked government with the truth in their face 😈",
            "polarity": 0.0,
            "subjectivity": 0.1
        }
    ]
}