{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 18:08:46",
    "ups": "8069",
    "downs": "46",
    "views": "93667",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Merrick Garland always says he will \"follow the law\" but he is careful not add  that, if necessary, he will not hesitate to enforce it.  It's what he's NOT willing to say that speaks volumes...",
            "polarity": -0.075,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "Justice  matters to Glen, but obviously not to D.O.J.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "We now have the clear message that, congressional subpoenas are just free toilet paper like in \"The Destructor\"",
            "polarity": 0.15555555555555556,
            "subjectivity": 0.39444444444444443
        },
        {
            "body": "This DOJ undermine US credibility even more than Barr.  This is the cavalry coming... just like Mueller.  and nothing happend.  Democracy die, and you all fuck off.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.55
        },
        {
            "body": "Merrick Garland is an insurrection sympathizer in contempt too.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would appear before Congress to tell them in person how much contempt I have for it.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "It's not just justice that matters. \"It's timely justice that matters and right now, we're just burning democracy daylight.\"  We are in such danger. This is not hyperbole. If Glenn's words don't chill you to the bone, maybe you got hold of a supply of Huxley's Soma. (I have to reference Aldous Huxley because there is a real drug named Soma, apparently without irony.)",
            "polarity": 0.13392857142857142,
            "subjectivity": 0.4214285714285714
        },
        {
            "body": "USA needs to be saved from corruption. Trumps corruption and his buddies. All this is just so scary. My chest and heart hurts. I don’t think I could role my eyes louder. 🥴😵‍💫🖖✌️😩",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Why in the world aren't we saying \"Attorney General Doug Jones?\"",
            "polarity": 0.05000000000000002,
            "subjectivity": 0.5
        },
        {
            "body": "Prosecute prosecute hes a disgusting greedy bigot that defiled our nation.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I know they are worried that the GQP is going to do these things to Biden if they do this but the plan is already in motion to impeach Kamala and Biden as soon as they get in power again!  Make Trump the speaker so he can take the presidency forever!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}