{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 09:11:34",
    "ups": "7054",
    "downs": "34",
    "views": "73853",
    "top_comments": [
        {
            "comment": "DOJ, WHAT THE FUCK ARE YOU PLAYING AT.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "comment": "Fascism is literally at our front doorstep\nIt's time to start using our collective voices",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "DOJ, WHAT THE FUCK ARE YOU PLAYING AT.",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "I became a single Mother of five children, ages 3-12 at the time. They are now grown, responsible, thriving children with families of their own. I attribute this to one main thing I learned from my parents. When a problem arises, you deal with it IMMEDIATELY. Nip it, confront it and take appropriate actions. I watched so many other parents vacillate and issues grew worse. This is no different. As a matter of fact this delay in action is pathetically weak. We should not, as citizens, have to wait and wonder whether DOJ or committee has enough common sense to read the situation correctly and act with the diligence required to achieve the desired outcome of Justice. For the love of God, they need to grow up and do their damn jobs.",
            "polarity": 0.0925170068027211,
            "subjectivity": 0.4998299319727891
        },
        {
            "body": "Keep the faith please. DoJ needs to do die diligence etc. If the benchmark is 9 days, you should still have like a week of patience.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank you very much for your daily contribution. This allows me to follow the situation in the US closely. I watch in disbelief as a democracy implodes due to the inaction of those in charge who do not allow the institutions to function as they should. It is astonishing and above all disappointing. A bad example for all fragile democracies in the world.",
            "polarity": -0.08312499999999998,
            "subjectivity": 0.4502083333333333
        },
        {
            "body": "Garland looked timid, weak, and intimidated in face of GOP verbal assaults during committee hearings. Strange reaction for such power position.",
            "polarity": -0.14166666666666666,
            "subjectivity": 0.425
        },
        {
            "body": "Garland is a whimp",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fascism is literally at our front doorstep\nIt's time to start using our collective voices",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "US Attorneys under the direction of Garland are not taking the protection of our precious democracy seriously...Garland does not want to appear partisan or political or make waves...yet the very survival of democracy depends upon him stepping up...are you a patriot?  do you care about our democracy?  when will you move?  mass casualty violence by domestic terrorists and MAGATs?????",
            "polarity": 0.175,
            "subjectivity": 0.37500000000000006
        },
        {
            "body": "Oh Dear... Decisions Decisions... let me think it over for a few more Months... Pathetic or what !",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "💜",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I get so tired of democrat socialists communist news like this crap.you have RIGHTS to remain silent .learn YOUR constitution RIGHTS. Socialist democrat party news",
            "polarity": -0.2,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I used to have the utmost respect for General (Judge) Garland, and I had high hopes that this man would be the hero the country needed to weed out the criminals, insurrectionists and scofflaws.  It is apparent from his non-action that little to nothing is going to be done about the Criminal-in-Chief and his band of goons.  Face it Amerika.... your father's democratic republic is dead as a door nail, replaced by the Authoritarian Oligarchy of Amerika, whose membership requirements are easy to fulfill:  just takes bank balance of $1B and a hefty donation to the Retrumplican Party, soon to be rebranded as the Grand Old Sturmtruppen.",
            "polarity": 0.11322916666666667,
            "subjectivity": 0.5404166666666667
        },
        {
            "body": "Glen what crime did he commit? Standing up and in the way of socialism is not a crime.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Democrats have surrendered long ago.",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "The way he said, “Are you kidding me?” Boy That cracked me up. I couldn’t agree more. WTF is Garland doing in that building?!!",
            "polarity": -0.140625,
            "subjectivity": 0.75
        },
        {
            "body": "Juries sitting for non violent crimes need to start mistrialing all of them in protest of non arrest of the chief insurrectionists.\nI guarantee something would happen.\nMy county AG, don't call me. I am keeping my word as Labor Day was the deadline.\nMcLeod County ya get a free pass to burgled the country club cul de sacs.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.6
        },
        {
            "body": "DOJ REPUBLICAN AND DEMOCRATS ARE AFRAID OF TRUMP WHERE'S MAXINE WATERS #TRUMPRULES",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "body": "I’ve been reading a lot about Biden’s poll numbers being down. Could his appointment of Merrick The Mouse to AG have something to do with it?",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "I had a friend who couldn't understand why my children were so well behaved. I watched her \"discipline\" her children. She would tell them to stop doing something and they would ignore her and then she would say, \"I'm going to count to three. One...two...two and half...\" And then she would throw up her hands and say, \"I just don't know what's wrong with those kids.\" This is what Congress is doing. Once you say two and a half, no one takes you seriously anymore.",
            "polarity": -0.29166666666666663,
            "subjectivity": 0.475
        },
        {
            "body": "What can we do??!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}