{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 05:04:45",
    "ups": "6680",
    "downs": "32",
    "views": "65296",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I am sorry, but you are done..... by YOU I mean the USA as a functioning democracy.  Too many stupid people, too much concentration of wealth among WAY to few, and way way too many guns.  You have believed your own bullshit for too long.... we are number 1... what a joke!.  The only thing you are number 1 at that is a positive, is you have the biggest economy.  oh yes, and Number one for the number of gun deaths, guns per capita, number 1 with the greatest income disparity.... Number 30 when it comes to high school proficiency in reading, math and science.  Years of racial inequality, years of under investment in public education, and years of believing your country is the shining light on the hill.  Having lived in the USA for 4 years, I know there are many many good and smart people.  It is time to get off the couch and save your country, and you have to do it at the ballot box and elect Democrats in a real working majority or you are done. 2022 is the most important election in your history, and time is short.  It gives me no pleasure to make this observation from afar..... thank God it is from afar.",
            "polarity": 0.23027326839826842,
            "subjectivity": 0.6034365981240981
        },
        {
            "body": "My God Glen I hope you're message is heeded by the powers that be, I wish you were the Attorney General I'm sure that the USA would benefit by having truth somewhere in its administration.",
            "polarity": 0.275,
            "subjectivity": 0.6944444444444444
        },
        {
            "body": "Apparently all the crocks In this country can do anything they want and get away with it. I feel like I live in Gotham 🤔🤨",
            "polarity": 0.09318181818181817,
            "subjectivity": 0.425
        },
        {
            "body": "I'm not holding my breath waiting for this to happen. Garland is weak and after seeing his demeanor in a recent hearing I have no hope for this DOJ and Biden is too much of a people pleaser to set a fire under him.",
            "polarity": -0.05833333333333333,
            "subjectivity": 0.35833333333333334
        },
        {
            "body": "Tuff talk,  no action, how disingenuous of them. They know what they should do. Contemplating should not even be on their minds. What happen to they had better watch out.",
            "polarity": 0.225,
            "subjectivity": 0.3
        },
        {
            "body": "I think merrick garland would be better suited for the supreme court but not as DOJ, he is over whelmed, I would not be surprised to see him quit, in the hearing they had with him the republicans ripped him to shreds, and I didn't think he faught back and he didn't take it very well, I am not expecting an indictment in 9 days",
            "polarity": 0.2,
            "subjectivity": 0.425
        },
        {
            "body": "If they don’t get to it, we will see Bannon taking the riots to the streets and telling us he is protecting us from the BLM folks.   Merrit Garland’s DOJ is a bunch of pussies if they don’t chase him down and drag his privileged ass into jail",
            "polarity": -0.11851851851851854,
            "subjectivity": 0.11990740740740742
        },
        {
            "body": "If the DOJ doe'nt start to move soon, It will be too late, The past crimes will be swept away and Trump will be back in the White House. Goodby Democracy such as it is.",
            "polarity": -0.11000000000000001,
            "subjectivity": 0.27
        },
        {
            "body": "What the deal!  We just keep waiting and waiting.  Could I break the most importaf laws and laugh at my arresters?  Would you be so afraid of me?  Can I count on that?  \nTrump just laughs and laughs when he talks with Putin and all his Publicans dancing the Congo right behind.",
            "polarity": 0.017142857142857147,
            "subjectivity": 0.5471428571428572
        },
        {
            "body": "The fact that there stalling says that trump has paid people to do nothing . I hope I’m wrong but it’s trumps way of getting away with crime.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "Right ON, Glenn! You are an essential voice in this fight!",
            "polarity": 0.17857142857142855,
            "subjectivity": 0.4178571428571428
        },
        {
            "body": "Glenn  what is GARLAND  DOING???",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I agree with Mitch (Got-Them-It!) that Merrick was not a good fit for the supreme court.",
            "polarity": 0.025000000000000022,
            "subjectivity": 0.5
        },
        {
            "body": "What is the problem? DOJ  . Garland  get it done . .........",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Replace Garland with Kirschner.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Merrick Garland is gonna get fired",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "E M,Glenn Kirschner , I don’t understand why Attorney General Garland in not doing what the American People are waiting for Steve Bannon to be arrested and jailed. The Attorney General Garland needs to indict trump for the insurrection and the Terrorist attack on the United States Capital. Congress need to start investigating all those republicans senators that were personally involved in meeting with groups and preparing the day before the attack in the Capital. It’s unbelievable that so many months have gone by and still trump and hid corrupt republicans senators are still trying to protect themselves and trump.  Also Congress need to indict Mark Meadows who has all the knowledge of who did what in planing the insurrection and attack in the Capital.  Frustration has hit us all.",
            "polarity": -0.021428571428571425,
            "subjectivity": 0.5428571428571428
        },
        {
            "body": "Because they're all scared if they do anything, the rep will get revenge when they are the majority, What they don't understand is they will never have power for the people or get anything through whether they're in the position or not.  Because they are a part of the elite club and do not want to give up their perks and donor money, which means they're just as corrupt as the rest of them in the club. To have justice you need a Just system. Right now it´s Just a corrupt system that is designed to suppress the underprivileged and make them pay, whether through privately owned jails that profit from modern-day slavery, On top of the fact that it free labor they also make them pay for any amenities, so there constantly sucking their families dry as well. Sick broken system. Through working and poor class paying the bulk of the taxes and working for low wages, that keep them from ever being able to get ahead of their bills, and high-cost medicine and people being allowed to murder without any consequences. This is not a Justice system it´s a Rotten Corruption system... Unfortunately, you can´t fix it.,   but I admire your efforts.....",
            "polarity": -0.09965986394557823,
            "subjectivity": 0.6375850340136052
        },
        {
            "body": "Bannon, of course, should already be incarcerated.  His cockiness is very annoying.  Let’s get it done.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Very discouraging!",
            "polarity": 0.25,
            "subjectivity": 0.3
        }
    ]
}