{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 00:57:53",
    "ups": "5702",
    "downs": "29",
    "views": "50934",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "This America is feeling more and more like Justice for the few. It hard to mention the shame I feel. Wow",
            "polarity": 0.12166666666666666,
            "subjectivity": 0.5283333333333333
        },
        {
            "body": "I thought weekends were excluded from the 9-day rule etc.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This attitude of “patiently waiting for justice” together with the 1st and 2nd amendment is what is going to kill Democracy in America.\nDemocrats are worried of “not looking respectful of the institution” of not being “politically correct “ enough, while Republicans are asking “when can we start killing them”",
            "polarity": 0.125,
            "subjectivity": 0.32499999999999996
        },
        {
            "body": "This is getting extremely frustrating!!!  What the heck is going on in this country?  We are not holding anyone accountable for anything.  We don't have a lot of time left.  If the crazy   R's take back the House and the Senate, we are screwed.  Our democracy will be done.  Come on people, you have to take care of this because us little people cannot stop this from happening.  What the hell are we waiting for?  If we keep going this direction, how will we ever get our democracy back?",
            "polarity": -0.26145833333333335,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "How much b******* is this magan didn't even testify when Trump was in office they got to straighten that s*** up when has to do with stuff like if it goes straight through",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "I guarantee you Trump and Republicans if it was the other way around would be arrested",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "I wouldn't care if Steve Bannon said okay I'll talk now too bad you can't talk but you're still going to jail for a f****** year",
            "polarity": -0.09999999999999994,
            "subjectivity": 0.38888888888888884
        },
        {
            "body": "I knew Garland was weak, but he's probably had death threats against him by the far-right, idiot anarchists in office.",
            "polarity": -0.5875,
            "subjectivity": 0.7125
        },
        {
            "body": "I wouldn't waste my time with asking isubpoena every one of them call there doing is making you push it back push it back",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.0
        },
        {
            "body": "I just want to point out the increasing dissatisfaction of other progressive voices with Merrick Garland. He has been squarely named a fascist. Listen to this Thomm Hartmann  YouTube video: Why Is Mafia Merrick Garland Protecting Trump? (w/ Sarah Kendzior). At 3:50, you supplicate yourself to Garland for moving on with Bannon indictment. I am not surprised that he is dragging his feet. He is merely protecting a fellow fascist. You have profusely parised Garland in other videos. You should have known better having been familiar with his work. You disappoint me.",
            "polarity": 0.012499999999999992,
            "subjectivity": 0.525
        },
        {
            "body": "Justice is not blind in America, there are conservative judges and liberal judges - they 'see' justice differently, they are not blind. As usual, it is an example of America's 'exceptionalism'. But they don't care what the rest of the world thinks, \"we are the greatest\".",
            "polarity": 0.25,
            "subjectivity": 0.6366666666666666
        },
        {
            "body": "somebody girls iu v pop",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Garland needs to be removed, he is too pathetic and weak to do the job!!!",
            "polarity": -0.8662109375,
            "subjectivity": 0.8125
        },
        {
            "body": "I've been patient with the trump crime wave for years and I'm tired of being patient Glenn.",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "Glenn can you make a few phone calls and inquire and get this thing rolling I don't know what these people are waiting for Americans are getting very very frustrated at the pace of this subpoenas convictions and jail time for these cronies and the Teflon Don when's it going to happen?",
            "polarity": -0.4033333333333333,
            "subjectivity": 0.12
        },
        {
            "body": "At this point... I'm just asking for the IMPRESSION of 'Justice' to matter!!!\n\nCan ANYONE verify IF the 'Justice Department' has even presented this case TO a Grand Jury?  I know... the Law says \"SHALL\" present... but \"SHALL' does NOT cover 'how quickly' it is presented.\n\nThere are FOUR words used in Government language that gives an indication of how important a requirement is....  \"May\"  you May... or May not.  There is a Choice.  \"Should\"  You Should.... but it's not required.  \"MUST\" you Must do what is required... (but no time requirement except prior to the end of the event)  \"SHALL\"  You SHALL do what is required!  (But again... no Time Limit imposed).\n\nBall in YOUR Court (literally!!) Mr. A.G. Garland.... and we're WATCHING CLOSELY!!!!!!!!!!!!!!!!!!!!!",
            "polarity": 0.24666666666666667,
            "subjectivity": 0.5
        },
        {
            "body": "Like the former #PRESIDENT #OBAMA said, \"#FOLLOW the #MONEY #TRAIL!!!\" #DOJ, if you want to bring #UNITY to #AMERICA then do your #JOB and you will find the #CORRUPTED #POT of #GOLD at the end of the #RAINBOW!!! #THANK #YOU for #LISTENING to my #MESSAGE!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Glenn,l have just watched Sen.Whitehouse Question Garland at a Judiciary Committee DOJ Oversight Hearing.He was brilliant!Also visibility as frustrated and as livid as you!I’d like to see him as President and you as AG at this most fragile time.",
            "polarity": -0.06666666666666665,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "Thank you so very much!!!! Thank you! A democracy if we can keep it!",
            "polarity": 0.9918212890625,
            "subjectivity": 0.26
        },
        {
            "body": "As I've said before about Trump months ago, Bannon will not be held accountable either. Gee, I should have my own channel. At least I'd be right some of the time.",
            "polarity": 0.1952380952380952,
            "subjectivity": 0.6452380952380952
        }
    ]
}