{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-31 21:32:35",
    "ups": "7735",
    "downs": "41",
    "views": "86261",
    "top_comments": [
        {
            "comment": "Contemplating is code word meaning the DOJ will do NOTHING.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "We have a very awesome military that can stand up to dictators around the globe, but this US government is powerless against the enemy within.  \nThis video is an unequivocal appraisal of the ability of justice to work freely and effectively against the most powerful  in this country",
            "polarity": 0.3142857142857142,
            "subjectivity": 0.7285714285714285
        },
        {
            "body": "Contemplating is code word meaning the DOJ will do NOTHING.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The longer this takes (if it ever is going to happen at all?) the worse this will get for the country and the Democrats prospects on keeping the majority, as slim as it is. Not to mention passing those bills that are taking forever to pass. Someone also needs to bring the ex-president to justice. Will we do all that needs to be done?",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "don't be afraid to tell us.democracy has lost.go to sleep old man",
            "polarity": -0.25,
            "subjectivity": 0.55
        },
        {
            "body": "I really don't believe the DOJ has any plans to indict Bannon. If they do I will believe it when I see it.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "\"Because it would be perceived as partisan by the Republican party -- allies of the accused -- the DOJ declines to prosecute Mr Bannon for his obvious violation of a Congressional subpoena.\" -- AG Garland (probably)",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "So true",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "Glenn you should have been the AG I know things would be actually getting done. Garland------ or get off the pot, do your damn job.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "So the January 6th committee thinks that criminals will voluntarily testify to their crimes. We're Doomed!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Get it done",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "he he.the message garland is sending out to young people that bad guys always win.",
            "polarity": 0.06666666666666672,
            "subjectivity": 0.48888888888888893
        },
        {
            "body": "Garland will still be wringing his hands when Trump is inaugurated in 2025. Did you how wimp he was when Senate Republicans tried to haul him on the carpet for his school board memo? First, the assphat GOP members either didn't read the memo or were just (surprisingly?) lying when questioning him. He just sat there wimpering.",
            "polarity": 0.475,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "It shows the complete invisable command the extreme racism fascism white supremacy right wing have on hold in the DoJ. Political appointees come and go, the disease is deep and imbedded in America. A n apartheid Nazi country",
            "polarity": 0.043452380952380944,
            "subjectivity": 0.4059523809523809
        },
        {
            "body": "Team J!  Could you please do a  post on the embarrassing stance that Gerneral Garland took after being slapped around by a conspirator to the insurection by the name if Ted Cruz and company. \nFrom the video that was released it appeared that MG is being paid off to keep his mouth shut and not talk back to any Republicans. \nProof rhe country is owned by Trump and goons!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Glenn,  you know nothing is going to happen to these \"bad characters\".  The J6 committee and the AG are either not willing or not able to do anything that would show the country, or the world for that matter, that they mean business.  Talk is cheap.",
            "polarity": -0.19749999999999995,
            "subjectivity": 0.6858333333333333
        },
        {
            "body": "Thank you for the briefing Team J! \nWell its no surprise. Bannon will go down as a marter fie the republican party and Tucker Carlson is niw going to be the next president it looks like!\nSad day for America!",
            "polarity": -0.2601851851851852,
            "subjectivity": 0.42962962962962964
        },
        {
            "body": "Infuriating... he should have been indicted the very next day...",
            "polarity": -0.3,
            "subjectivity": 0.4
        },
        {
            "body": "wrr",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Sadly limp wristed Democrats' lacky?",
            "polarity": -0.2,
            "subjectivity": 0.5
        },
        {
            "body": "Mr. Garland is all BS he’s not going to prosecute any of Trump n all his enablers. Mr Garland is just another Bill Barr",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}