{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-11-01 01:40:03",
    "ups": "7859",
    "downs": "42",
    "views": "88771",
    "top_comments": [
        {
            "comment": "Jeezuz Christ Garland get off your ass and do something! Your country is IMPLODING 🤯🤷‍♀️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "What the hell are they waiting for Christmas?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why isnt president biden on  doj to get their job done  if not get congress going.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Confidence in the DOJ is gone and I am sorry but really can’t see what they are waiting on!! Garland is seeming not at all to be the right person for the job! And will leave it right there!!",
            "polarity": 0.15401785714285712,
            "subjectivity": 0.5678571428571428
        },
        {
            "body": "What is the gain? Why the need to delay, what is getting left out that needs in... 😽\n\nYou know how... when you reflect and question...\nWhy do I know this “ frustrating “ feel ....\nShort story:reference to me..\nI stood in my living room, stating I wanted more help for my child, I was very firmly told “ get the f out”. 20 years in , 2 days later, I was out..... not down, not done and his hands that were around my neck... will not reach my flesh again.",
            "polarity": -0.011746031746031749,
            "subjectivity": 0.35841269841269835
        },
        {
            "body": "November 1st, 2021 would be a perfect day to indict and arrest Steve Bannon.",
            "polarity": 0.475,
            "subjectivity": 0.5
        },
        {
            "body": "No huevos on the committee and no huevos in any democrat.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Burning democracy daylight--exactly. It's so horrible.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Its all a joke. The top cops who resigned the day after Jan 6 should have been behind bars long ago. Nobody will pay for this except those high school drop outs directly involved.",
            "polarity": 0.061999999999999986,
            "subjectivity": 0.508
        },
        {
            "body": "They are very afraid of Bannon being the match that lites the civil war",
            "polarity": -0.78,
            "subjectivity": 1.0
        },
        {
            "body": "It's so frustrating that DOJ doesn't seem to be on our side.",
            "polarity": -0.4,
            "subjectivity": 0.9
        },
        {
            "body": "I wonder if Merritt Garland knows his legacy will be tied in with the likes of Manchin, and Sinema, as the reason Joe Biden will be a one term President. Good thing he didn't make the Supreme Court after all from the looks of it. ( Sorry Joe they're blowing it for you)",
            "polarity": 0.09999999999999998,
            "subjectivity": 0.8
        },
        {
            "body": "Given that AG Garland inherited an utter mess with the deeply corrupted DOJ\nunder trump, I can understand and support his cautious and careful but deliberate management approach at this precarious time.",
            "polarity": -0.06875,
            "subjectivity": 0.64375
        },
        {
            "body": "Garland retires December more reason to get on with it. Democracy and rule of law will be retired soon. Now Trump is playing court game to avojd accessing 6 Jan document. Good night democracy",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.5
        },
        {
            "body": "The clock is ticking 😡 still waiting to see bannon do his perp walk🤨 What the heck is wrong with the DOJ🤬",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "Ii heard Garland was a republican.  Could he be in Cahoots with the Republicans?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What do.we hsve to do get that useless s.o.b. merit garland off his ass.  AFTER that bullshit  he said at he s hearing",
            "polarity": -0.5,
            "subjectivity": 0.2
        },
        {
            "body": "Can Biden change the ag and put someone in his place",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Of course Congress should be using their inherent power of contempt, I think that's what it's called, but this will go on and on and on. The longer it goes on stalling and trying to run out the clock the less faith all of Americans I have in our Congress and our DOJ. What the hell are we waiting for! This is October 31 and this all happened back in January. I just can't believe that anything would take this long that is this important. This wouldn't happen with you or me",
            "polarity": 0.03541666666666668,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "Jeezuz Christ Garland get off your ass and do something! Your country is IMPLODING 🤯🤷‍♀️",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}