{
    "time_posted": "2021-10-30 16:00:34",
    "url": "https://www.youtube.com/watch?v=dRWqRiTvO7E",
    "time_now": "2021-10-30 16:45:48",
    "ups": "1091",
    "downs": "4",
    "views": "5147",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "AND JUST WHAT??? CAN AMERICANS DO ABOUT IT???? GET REAL GLEN SERIOUSLY WHAT????",
            "polarity": -0.06666666666666665,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "Hey Glenn, apparently I'm not the only one who thinks Garland is not doing his job efficiently....this is exactly why I'm loosing confidence on the DOJ job.\nStay safe sir.",
            "polarity": 0.18125,
            "subjectivity": 0.525
        },
        {
            "body": "Still waiting for useless DOJ Merrick Garland? Don’t waste you breath, he tried to kiss trump ass, but Republicans not kissing his!",
            "polarity": -0.375,
            "subjectivity": 0.1
        },
        {
            "body": "Maybe the DOJ is planning shock and awe with a flurry of indictments , one can only HOPE",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "We need a new attorney general Merrick Garland is not working we need someone with a backbone",
            "polarity": 0.09318181818181819,
            "subjectivity": 0.4772727272727273
        },
        {
            "body": "Why does Steve Bannon act so brazenly confident?  Does he know something we don’t?  Are we all being played for fools?",
            "polarity": 0.5,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "ROFL...  I dont think you get it.  If they do that, every politican from that moment forward will be fucked.  What goes around, comes around and next year they are going to be thanking themsleves they never did that - because a year from now we will be having hearings about how mishandled this whole covid situation was. Except, republicans will be in control. They aren't stupid.",
            "polarity": -0.07999999999999997,
            "subjectivity": 0.6
        },
        {
            "body": "'Cause money matters and justice is a joke.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dem's once again are acting TOO WEAK against an adversary the likes of which no-one has ever experienced - factual history of having no ethics\\morals, easily lie, use made up conspiracies, incite,hate,chaos.bigotry & violence- nothing is off the table - there's no civility, winning is all. When a Trump GOP lawmaker calls for a civil war publicly, time to take the gloves off !",
            "polarity": 0.2263888888888889,
            "subjectivity": 0.5291666666666667
        },
        {
            "body": "Thank you Glenn for expressing, on your platform, the disgust, anger, outrage, (I can go on), towards the cowardly Congress and the DOJ that most of us have!",
            "polarity": -0.03749999999999998,
            "subjectivity": 0.35
        },
        {
            "body": "Surely Democratic leaders can see that their unwillingness to enforce the law will be fatal  in the upcoming elections. Why bother supporting a party that's weak and lacking in conviction?",
            "polarity": 0.125,
            "subjectivity": 0.5879629629629629
        },
        {
            "body": "I wonder what DIRT Trump and Thugs have on EVERYONE to blackmail them for their silence or stop of action.",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "The malignancy of the trumpolini cancer has been under estimated..  congress appears  worthless to me .. & the DoJ follows suit? That means crooked donny wins.. sad day 4America when he wins .",
            "polarity": -0.13999999999999999,
            "subjectivity": 0.4800000000000001
        },
        {
            "body": "Immediate… contemplation, the burning of democracy daylight,  taking almost 8 months to form the select committee. Typical do nothing plays from the/my party of do nothing , run out the clock party of complacency. If trump was destined to lose that election, this administration is almost the next best thing for them. This is all intentional. And to all the dottin I’s crossing T’s, be patient, it’s coming crowd… you’re part of the problem. We are facing a committed, unified, all in, to hell and back, crowd of brain washed, and/or,  the I’ve got mine, to hell with you,  voters, who are controlled by the ultra rich and the corporations who buy politicians, red and blue… looking at you pole dancer and coal Barron. 12 months people…      Can’t wait to see Dans response to this.",
            "polarity": 0.20138888888888892,
            "subjectivity": 0.25833333333333336
        },
        {
            "body": "What is holding up the Indictments from our DOJ??  2 Words; \"Merrick Garland\". He's a WUSS!! A Chihuahua with no teeth!!\n He left his Testosterone on a rag between his mattresses!!\n Sorry Merry, I'm pissed & growing more impatient!! You have the power!! USE IT!! Candy Ass!!",
            "polarity": -0.25,
            "subjectivity": 0.6
        },
        {
            "body": "The oxygen of Democracy need no longer be applied to those who don’t believe in it anymore .\nThey lost that right when they helped a traitor undermine what they had SWORN to defend.",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "Garland was chosen by Obama, not because they were ideologically aligned but because Garland was such a non-controversial centrist that it was thought that the right couldn't possibly object to his nomination.  (yeahright)  I think the timidity we are seeing now is a reflection of that trying-not-to-offend-anyone centrism.",
            "polarity": 0.09523809523809523,
            "subjectivity": 0.6785714285714285
        },
        {
            "body": "I'm just wondering if the DOJ is feckless or not",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am disappointed to find out that I am naive. I was always under the impression that the Federal Government could walk and chew gum at the same time. That the Attorney General could charge others with the powers to conduct an investigation and bring people to proper justice, but I guess I was wrong. It seems the Attorney General of the United States really isn't very interested in enforcing the laws of the land, protecting the democratic process and constitution.  So my question is, where is the DOJ, where is Congress, what are they actually doing?",
            "polarity": -0.125,
            "subjectivity": 0.5138888888888888
        },
        {
            "body": "Biden needs to put some other than garland in position",
            "polarity": -0.125,
            "subjectivity": 0.375
        }
    ]
}