{
    "time_posted": "2021-10-30 14:54:01",
    "url": "https://www.youtube.com/watch?v=e-3wPrNQ0Uc",
    "time_now": "2021-10-31 00:57:56",
    "ups": "4176",
    "downs": "17",
    "views": "36048",
    "top_comments": [
        {
            "comment": "USA left a huge vacuum by getting out of Afghanistan. Somebody will have to fill this, and Iran has the muscle needed. Afghanistan is in a major crisis and none of the neighbors want huge amounts of refugees swarming out of that country. So they have to come up with some sort of solution.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.17083333333333334,
            "subjectivity": 0.45999999999999996
        },
        {
            "comment": "I really do not care who helps keep peace in the Middle East, I just care that me and mine in America are not doing it.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.05,
            "subjectivity": 0.1
        },
        {
            "comment": "APPRECIATE YOU KEEPING US INFORMED",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I didn't forget, Beau.  But I hadn't heard. Thank you for this update and for your sage counsel! The US and Britain fouled things up for long enough. I hope the people in that area can get their feet back under them. Being on your own two feet always feels the best, doesn't it?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30999999999999994,
            "subjectivity": 0.43999999999999995
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Trying to make a nation-state out of a loose confederation of medieval tribal groups was never going to work for reasons ranging from inter-tribal hate, especially against the Pashtun to widespread corruption and drug smuggling. Russia, China and Iran are all neighbors with a strong interest in stabilizing the Taliban regime. Pakistan is a long standing Taliban supporter despite being a US ally (spoiler alert: they're not and never have been). But they have nothing to gain from opposing this new arrangement.\n\nMeanwhile, Iran continues to have a brutal, torture and murder loving authoritarian regime. They could go on indefinitely until they collapse internally. Not likely to happen for decades to come.",
            "polarity": -0.06322261072261073,
            "subjectivity": 0.6707109557109557
        },
        {
            "body": "I am encouraged. We've worn out our welcome, it needs to come from the region.",
            "polarity": 0.8,
            "subjectivity": 0.9
        },
        {
            "body": "We could accomplish a lot if we could muzzle some of the war mongers and war suppliers.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "American exceptionalism is a way of trying to never admit that we are wrong, no matter how amoral our behavior.",
            "polarity": -0.25,
            "subjectivity": 0.45
        },
        {
            "body": "So the big take home lesson here is that \"over there\" apparently refers to the middle east and Afghanistan?",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.15
        },
        {
            "body": "Remembering your video of a couple days ago, the media hand-wringing over Chinese missiles, and your musing that the US needs another boogieman, and quick.  I'm hoping the US doesn't interfere in this.  The temptation to use this as another excuse for increased \"defense\" spending might be more than our corporate politicians can resist.",
            "polarity": 0.15666666666666668,
            "subjectivity": 0.21000000000000002
        },
        {
            "body": "Iran's government is as evil as any organization is capable of being.",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "It was a success- for us to get the hell out of the way and let them handle things.",
            "polarity": 0.3,
            "subjectivity": 0.0
        },
        {
            "body": "Remember beau it's hard to remember your main objective is to drain the swamp when your up to your ass in aligators",
            "polarity": -0.04166666666666668,
            "subjectivity": 0.325
        },
        {
            "body": "Losing ground fast as you grind your nation to pieces fighting each other for any and all reasons and , of course, your rights.........with no end in sight..........and getting worse..............................................",
            "polarity": -0.10833333333333334,
            "subjectivity": 0.525
        },
        {
            "body": "Beau, have you ever thought of running for Congress or ANY political office? I believe you could do a lot of good in that arena. I wish you had the kind of platform that the politicians that ARE in office would HAVE to listen/respond to you.",
            "polarity": 0.4333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "So,  evil Iran has to clean up after the Americans in the Middle East.",
            "polarity": -0.2111111111111111,
            "subjectivity": 0.5666666666666668
        },
        {
            "body": "Country\tDesignation Date\r\nCuba\tJanuary 12, 2021\r\nDemocratic People’s Republic of Korea (North Korea)\tNovember 20, 2017\r\nIran\tJanuary 19, 1984\r\nSyria\tDecember 29, 1979",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bottom line, a step in the right direction, it doesn't matter which country did it, as long as it (might) happen.",
            "polarity": 0.11785714285714285,
            "subjectivity": 0.46785714285714286
        },
        {
            "body": "I didn't forget, Beau.  But I hadn't heard. Thank you for this update and for your sage counsel! The US and Britain fouled things up for long enough. I hope the people in that area can get their feet back under them. Being on your own two feet always feels the best, doesn't it?",
            "polarity": 0.30999999999999994,
            "subjectivity": 0.43999999999999995
        },
        {
            "body": "APPRECIATE YOU KEEPING US INFORMED",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My only thought is how can iran be believed considering their past history ? They still are a destabilizing force dealing with hamas and such against Israel.  If they feel they have more power in the region, they may push forward to a full out war with Israel.",
            "polarity": 0.12,
            "subjectivity": 0.5599999999999999
        },
        {
            "body": "USA left a huge vacuum by getting out of Afghanistan. Somebody will have to fill this, and Iran has the muscle needed. Afghanistan is in a major crisis and none of the neighbors want huge amounts of refugees swarming out of that country. So they have to come up with some sort of solution.",
            "polarity": 0.17083333333333334,
            "subjectivity": 0.45999999999999996
        },
        {
            "body": "(from the Netherlands, here in Europe, quite close to the Middle East:)   Are Americans realizing that the most of their efforts to direct the developments in the Middle East do not help (or in the wrong direction)? And that the preoccupation with Iran is just as stupid as Trump's preoccupation with North-Korea? This is all more \"Hollywood' than sensible foreign policies! (Perhaps one must say that in general this Hollywood-thing is determining much more in the USA than it should... )",
            "polarity": 0.06306818181818184,
            "subjectivity": 0.49318181818181817
        },
        {
            "body": "I really do not care who helps keep peace in the Middle East, I just care that me and mine in America are not doing it.",
            "polarity": -0.05,
            "subjectivity": 0.1
        }
    ]
}