{
    "time_posted": "2021-10-30 14:54:01",
    "url": "https://www.youtube.com/watch?v=e-3wPrNQ0Uc",
    "time_now": "2021-10-31 05:04:48",
    "ups": "4594",
    "downs": "18",
    "views": "41395",
    "top_comments": [
        {
            "comment": "I am encouraged. We've worn out our welcome, it needs to come from the region.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.8,
            "subjectivity": 0.9
        },
        {
            "comment": "Iran knows how much of a domineering warmonger the US can be.  He's taking his risks with the other domineering warmongers that are a little closer to home that can get there sooner.\n\nI'm no military strategist, but it's what I'd do.  If Iran stabilizes Afghanistan, Iran is a world hero.  That nation hasn't been stable since more powerful (greedy) nations discovered resources there, ages ago.  If anyone can do it, it's a local player who knows the field, and what better than one of the oldest players around?  If there be peace coming from Allah, so what?  It's peace!  Deal with it, world!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.18984375,
            "subjectivity": 0.396875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "This is what I appreciate the most about Beau. Being a “dreamer” in America it is so incredibly heartwarming when an American man like Beau is this honest and respectful about the world, and therefore sets the example for our younger Americans, it’s so rare, because his generation is still part of that project to erase the idea of a fair society that wasn’t out there to subjugate the rest of the world, that toxic individualism that contaminated America during the Cold War, that ended up selling out the country slowly to the highest bidder because money always came first. \n\nbecause one of the saddest thing here is how the country has been treating the “woke American culture”, it’s hard to watch them try to degrade, defraud and destroy the one generation of Americans who TRULY understands what the United States is supposed to mean, and is supposed to become, woke America seems to be the only America that gets “America”, these Americans now are growing up under the corruptive conditions we had to endure in Latin America, so we truly connect to them, I mean all “glitches” aside it’s thanks to the internet that for the first time we have a generation in this entire continent that can see eye to eye, even with a physical wall between us, this is the first step, now all we have to do is keep pushing for more investment in public education, we will eventually stabilize our continent, and we have to do it in time because now only is it “the new world” but it’s also “the last world”, we need to get climate change under control, and we can only do it peacefully with an open boarder system, we can’t keep sabotaging Central America.",
            "polarity": 0.10708699902248286,
            "subjectivity": 0.4974968579807289
        },
        {
            "body": "Thanks for the update, I just don't have the time and resources to find the info that you share. You are a trusted source of information ( but I don't follow blindly I do check what you say : )",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.6222222222222222
        },
        {
            "body": "Might this also be happening because of isis-k bombing Shia Mosques and the Taliban unable to prevent these attacks?",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Iran knows how much of a domineering warmonger the US can be.  He's taking his risks with the other domineering warmongers that are a little closer to home that can get there sooner.\n\nI'm no military strategist, but it's what I'd do.  If Iran stabilizes Afghanistan, Iran is a world hero.  That nation hasn't been stable since more powerful (greedy) nations discovered resources there, ages ago.  If anyone can do it, it's a local player who knows the field, and what better than one of the oldest players around?  If there be peace coming from Allah, so what?  It's peace!  Deal with it, world!",
            "polarity": 0.18984375,
            "subjectivity": 0.396875
        },
        {
            "body": "It's a step in the right direction. I'll take it and be grateful for a step towards stabilizing the region.",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "Wouldn’t it be something if American foreign policy looked more like this, from the side, saying “Good work, you’ve got this, you know where to find us if you need help.” Instead of the current, “OK, we’re here, now we can get down to business. Don’t anyone go doing anything while we’re not around.”",
            "polarity": 0.20277777777777775,
            "subjectivity": 0.34484126984126984
        },
        {
            "body": "Thanks for the thought",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "So …. What does Israel have to say about this …",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why couldn't this have occurred prior to our engagement 20 years ago?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I truly hope that those poor people in Afghanistan get some help. Things look pretty dire there to me.",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.8
        },
        {
            "body": "if only people would quit joining the MIC and using a steady paycheck and benefits as an excuse for job stability while going over and killing black and brown people for their resource and slave wage labor.",
            "polarity": -0.0125,
            "subjectivity": 0.49583333333333335
        },
        {
            "body": "Then leave. Simple.",
            "polarity": 0.0,
            "subjectivity": 0.35714285714285715
        },
        {
            "body": "Let China, Russia, & Iran deal with the self contradictions that Afghanistan are. Meanwhile, we'll send nukesubs to our friends of many more years [and a more stable democracy]. Bye Felicia!",
            "polarity": 0.5416666666666666,
            "subjectivity": 0.5
        },
        {
            "body": "Hard to believe that I actually feel a little bit relieved about Iran stepping up and getting involved in Afghanistan. Your poker analogy is perfect. Happy Halloween sir.🎃🦇💀👻🤡",
            "polarity": 0.26416666666666666,
            "subjectivity": 0.6283333333333333
        },
        {
            "body": "Another good point is that US is NOT spending $300milion a day and no US citizens are hurting.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "People just need a stable arena to establish communities and live well within a zone of comfort.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "Iran is \"east of the middle\" Mideast.  Anyone gnashing his teeth about a flow of power extant in Iran ought to worry more about the consequences of a vacuum.  Take heart, too; there's a similar and more western-leaning hegemony still evolving in the \"left of the middle\" Mideast.",
            "polarity": 0.14166666666666666,
            "subjectivity": 0.19999999999999998
        },
        {
            "body": "Also, Iran has a major interest in protecting the large Shi'ite minority in western Afghanistan that is persecuted by both the Taliban and ISIS.",
            "polarity": 0.09226190476190477,
            "subjectivity": 0.30952380952380953
        }
    ]
}