{
    "time_posted": "2021-10-30 14:54:01",
    "url": "https://www.youtube.com/watch?v=e-3wPrNQ0Uc",
    "time_now": "2021-10-31 09:11:36",
    "ups": "4780",
    "downs": "18",
    "views": "44354",
    "top_comments": [
        {
            "comment": "Iran knows how much of a domineering warmonger the US can be.  He's taking his risks with the other domineering warmongers that are a little closer to home that can get there sooner.\n\nI'm no military strategist, but it's what I'd do.  If Iran stabilizes Afghanistan, Iran is a world hero.  That nation hasn't been stable since more powerful (greedy) nations discovered resources there, ages ago.  If anyone can do it, it's a local player who knows the field, and what better than one of the oldest players around?  If there be peace coming from Allah, so what?  It's peace!  Deal with it, world!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.18984375,
            "subjectivity": 0.396875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "What's the context on the Helen Back T-shirt? Is it just a subtle pun, or bigger than that?",
            "polarity": -0.1111111111111111,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "As always…Let’s go Brandon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Iran (an Islamic Nation) is one of the few neighboring countries that has generously helped their Christian Neighbor, Armenia.  Armenia faces genocidal threats from both Turkey and Azerbaijan; in fact, the genocide is happening right now, as I'm writing this; but, I see little in the way of sanctions against either of those two countries.",
            "polarity": -0.025446428571428578,
            "subjectivity": 0.2839285714285714
        },
        {
            "body": "OK, so maybe no war in the region of Afghanistan. But women all over that region are treated as non-persons. Slaves really. No real education except the Koran. No rights. [So-called] \"Honour Killings\", a pandemic of rape and no consequences for the rapists. Throw acid in a girl's face, because she wants an education. But sure, no WAR!!",
            "polarity": 0.3453125,
            "subjectivity": 0.4472222222222222
        },
        {
            "body": "If your getting pissed at comments from the right please try to remember that it’s the Algorithm. It ensures there is a Us and a Them… it’s easy to react with anger and ugliness… but I say we show that AI b why being Human is better than computing power and clicks. ☮️",
            "polarity": 0.10380952380952382,
            "subjectivity": 0.43380952380952387
        }
    ]
}