{
    "time_posted": "2021-10-30 14:54:01",
    "url": "https://www.youtube.com/watch?v=e-3wPrNQ0Uc",
    "time_now": "2021-10-30 16:45:51",
    "ups": "1824",
    "downs": "9",
    "views": "9981",
    "top_comments": [
        {
            "comment": "Nationalism is politics for basic people. \n\nPUT THAT ON A SHIRT",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "comment": "I disagree with Beau, it was a success and it is attributed to Biden because it wouldn’t have happened if the US /Biden hadn’t walked away.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Nationalism is politics for basic people. \n\nPUT THAT ON A SHIRT",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Thanks, Beau. Regarding things from an historical perspective, we should remember that the Persian Empire used to consider the original Varyagi Boyars of Russia Barbarians. And the Chinese at the start of the Silk Road were treated with utmost respect, even wonder!",
            "polarity": 0.14375,
            "subjectivity": 0.2375
        },
        {
            "body": "For decades some one has found it in their economic interest to keep the middle east unstable",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "cool. I am definitely curious as to how this will work out in the end. Hopefully the CIA stays away from Iran this time. Last time, they helped overthrow a duly elected person and pretty much ensured that we would never be trusted in the region for decades if not longer.",
            "polarity": 0.13999999999999999,
            "subjectivity": 0.5833333333333334
        },
        {
            "body": "Mandatory youtube engagement comment.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks Beau 😊",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "My concerns are with China and Russia being involved. Not good.",
            "polarity": -0.35,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "I disagree with Beau, it was a success and it is attributed to Biden because it wouldn’t have happened if the US /Biden hadn’t walked away.",
            "polarity": 0.3,
            "subjectivity": 0.0
        },
        {
            "body": "Love ya, Beau.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "From what I have heard, their new president is one whom the mullahs have more control over and should have a more extreme view of things than the previous one, and as I understood it, the religious leaders did not let the former stand for re-election, which might have happened if they succeed in making a deal before their election and before the United States and the United Nations leave the country. Would be better with a more liberal leader who also wanted to reduce extremists' power over laws and society. But it does not have much reporting on Iran and where their new leaders stand on many issues and also what his goal is to take over after you left the country in ruins (easier to create extremists that they can turn to the West or try to get them to change religion and become an antithesis to Saudi) or they want to seize the assets there to become a very rich country and start mining and they decide on a large part of minerals so everyone will have to follow their will for trade and hope to become a new superpower in the region. It is still too quiet about what their goals are or it is not reported as we in the EU have energy shortages and logistics problems in addition to the virus and some natural disasters, such reporting has decreased.",
            "polarity": 0.14615285508142653,
            "subjectivity": 0.4293908472479901
        },
        {
            "body": "Thanks Beau of the Fifth Column Et  Al🙂  \"... 3 Poles of Power...It's not Them walking away from the table and finding a few extra Chips...Russia and China... it's Organic...",
            "polarity": 0.0,
            "subjectivity": 0.13333333333333333
        },
        {
            "body": "In the spectrum of liberal and conservative the Middle East is full of conservative thinking fundamentalists rightwing governments. There are no liberal governments in the Middle East so don’t get your hopes up their will be any lasting peace or more human rights in any of those countries.\nThe Middle East is what you get when church and state are one in the same and rightwing religious fundamentalist and neofascist rule with impunity!\nSure some of those country have socialism in their name but those names are just  remnants of the past rejection of colonialism. Any inklings of liberalism  or socialism died when the religious fundamentalist and dictators took power.",
            "polarity": 0.09166666666666667,
            "subjectivity": 0.24282407407407405
        },
        {
            "body": "The ENTIRE middle east campaign was a mess from day one, was a lie with Bush and the intercontinental ballistic Nuclear weapons he claimed were a threat, REPUBLICANS took us to EVERY SINGLE MIDDLE EAST war we have had, for the profit of there buddies in the corporations that make and test weapons, this is a multi Trillion dollar industry that about 1/3 of the entire US population has a hand in, in some way or another, its a huge industrial complex being it, generating money, profit, technology and weapons, this is the reality, like it or not, the middle east was a mistake, the West could have used that time money and military block for much better purposes in that time, but did not, you should think carefully before voting for Republican governments that do this, that for over 50 years now, have literally put the US into MORE DEPT to do this, with trickle down economics, again a Republican invention under Reagon , cut taxes for teh rich and up taxes for the workers and privatise EVERYTHING, of the two parties the Republicans are the worst economic managers, the data clearly shows that, decade after decade, government after government,  so complaining about a Biden exit that Trump started and where Trump signed a literal surrender to teh Taliban and freed hundreds of terrorists the US had spent years tracking down and locking up, at the orders of other Republicans that took us there,  to blame Biden for the exit mess at this late stage is a JOKE, and is just pathetic when so much more was done so poorly with that entire Middle east mess.........",
            "polarity": -0.06060481663929939,
            "subjectivity": 0.41725506294471815
        },
        {
            "body": "The World is starting to getting divorced from The USA! \nSoon The USA will no longer have allies to go to war with.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Wow! I wouldn't know! In them parts I mind my own business and only sling calligraphy with who is approved or act on behalf legal script or not at all, the current leader weather the people likeitor not and will weapon freesling any civilian to the ground from USA and protect the name and body til next rule even in five minutes change for your safety public or out of uniform military! Not for our usa president! Caprice and try to take you to airport or asian wall and leave myself paid or not! Section eight invited by higher power civilian Missouri ark defence! Silence and I'm female! All children stay in there care women trust ifwhite andtheblack women In afrika okay! Civils it is not option if there black and your not well if argue with anyone about politics religions instead of happy healthy visitation on tour! Mexicans can follow and Canadians! You are not on your soil! It is there's even if all five year old! They know how to stay alive and what they think you'll like there as guest and learning lesson to tell all your people very alive when you go home! Or asylum to learn language there language not yours if allowed to stay in qaurintine! If planes are down we might have to walk three hundred miles as your gaurdians and weak to hospital! Okay! I can't hear you! But they are learning a shared female and male uni language for first time in a long time! Not confusing 75000 versions of English! Chill like if we weren't my lake camping butthereclassier then me!",
            "polarity": 0.15814686213991772,
            "subjectivity": 0.40002057613168734
        },
        {
            "body": "It matters a lot, because Republicans will say Biden gave Afghanistan to Russia and China.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "A much better foreign policy than TFG.",
            "polarity": 0.1875,
            "subjectivity": 0.3125
        },
        {
            "body": "with older countries that are more tribal  or religiously driven, it simply takes longer.  generations not decades.... problem is people in more developed nations seem to be loosing much of their patience as time goes on, it's like we gotta go faster and faster, outpacing productivity but at the same time loosing much of what makes us who we are.   doing something fast doesn't mean you poured your heart and soul into it, it looses that sort of value.... the problem as always is that power corrupts, if you cannot get the safeguards in place to keep it in check, people will eventually abuse something of the system, typically for financial gain or influence.  with that corruption comes the desire to keep that power, and hence the safeguards fail and you end up with some form of dictatorship... or likewise.  there is the potential that afghanistan will evolve, but we can't just point at next year or the year after and say if they don't have everything we have, then there is something wrong.... because as i said, this is an older country and it is still very tribal / religious based... it will take generations.   if it becomes stable in my lifetime, i will be amazed, surprisingly so.  but also very proud of the chances they have, to step away from what they were.... not saying they'll become a flagship for any type of governance but a step in the right direction, even if i don't agree with much of what they do, is still a step closer for their people to have better lives.  after all that's the point.  not that they live their lives under my flag or anothers, but that they have good lives under their own flag, and are willing and able to foster peaceful relations with others, to join the world economy... or at least the continental/regional one.",
            "polarity": 0.17425764339826838,
            "subjectivity": 0.460844494047619
        },
        {
            "body": "Daily Reminder: William Krystol has STILL not apologized to the American people for being so aggregiously wrong in his approach (and that of his entire NeoCon cabal) under “Project For A New American Century” (PNAC) which gave us Perl, Rice, Cheney, Wolfowitz, Rumsfeld, etc for America to control/manipulate the Middle East via Iraq.\n\nYou’re welcome.👍",
            "polarity": -0.05194805194805195,
            "subjectivity": 0.28279220779220776
        },
        {
            "body": "...but we have always been a war with Midasia.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}