{
    "time_posted": "2021-10-30 14:54:01",
    "url": "https://www.youtube.com/watch?v=e-3wPrNQ0Uc",
    "time_now": "2021-10-30 20:51:35",
    "ups": "3466",
    "downs": "17",
    "views": "26478",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Well you know this is the US and we still have Raphael Cruz inn the Senate... So the US republicans in Congress are almost certainly going to do everything in their power to make this alliance fail... You know because peace is bad for business... But only if your business is having an income gap and not making the world or survivorship the USA a better place to live...",
            "polarity": -0.0582251082251082,
            "subjectivity": 0.5896825396825397
        },
        {
            "body": "One could argue it needed to happen this way for it to be a success at all.  Staying there so long delayed what we are seeing today.  We should have been out sooner.",
            "polarity": 0.125,
            "subjectivity": 0.2
        },
        {
            "body": "It all sucks for women though!",
            "polarity": -0.375,
            "subjectivity": 0.3
        },
        {
            "body": "This may not matter what n the bigger scheme of things but Afghanistan beat Scotland in the T20 cricket championship taking place in UAE! WTG Afghanistan!",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "We'll be collectively lied into another war soon enough to sate the greed and power of the Military-Industrial Complex.  My guess is it will be a conflict either somewhere in Asia or Africa ... or both.",
            "polarity": -0.15,
            "subjectivity": 0.45
        },
        {
            "body": "Some of these comments makes me wonder how Americans can forget all US Presidents don’t rule alone they always have and had experienced advisors except Trump",
            "polarity": 0.8,
            "subjectivity": 0.9
        },
        {
            "body": "*Pointing at middle east map showing U.S military bases*\nYou see how aggressive Iran is about regional power, we can't let this happen.",
            "polarity": -0.05,
            "subjectivity": 0.05
        },
        {
            "body": "Figures.  When left to thier own devices,  unstable countries in mid east straightened themselves out.  If it wasn't for the death and destruction,  it would be ironic.",
            "polarity": 0.2,
            "subjectivity": 0.475
        },
        {
            "body": "More power to them.  They probably can stabilize it because they don't have to deal with the idiots in the state department.   The  US foreign policy establishment pushed nation building & spreading democracy.  Those things aren't in America's interest but are in the interest of corporations and NGO's.",
            "polarity": -0.1416666666666667,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "Iran has interests there thanks to the main Shiite groups in Afghanistan, the Hazaras and the Qizibashis. These people are Dari (Farsi) speakers and originally from eastern Iran. They have been an oppressed minority under the Sunni majority. On Oct. 8th, IS blew up a Shiite mosque killing dozens. Whoever can provide some peace and stability should be welcomed. It certainly wasn’t the US that could provide it.",
            "polarity": 0.23898809523809525,
            "subjectivity": 0.46369047619047615
        },
        {
            "body": "Biden is too busy ramping up tension with China, starting another arms race and reviving the Cold War to care about peace and stability.  Gotta say...from a foreign policy standpoint, Biden been a major disappointment and is just as much of a war hawk as the vast majority of prior administration. The military industrial complex really do runs this country.",
            "polarity": -0.09687500000000003,
            "subjectivity": 0.36041666666666666
        },
        {
            "body": "Whatever works.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Afghanistan went back in time, 20 years or so in about 30 days. I'm sure some MAGA members would love to copy the system (of time travel) and some are already trying (voting suppression, banning abortion for all cases, etc)\n\nIn Afghanistan, women are forbidden to go back to university (as students or workers), to work without permission of the male leader of the family, to go out the streets or someone's home without a male chaperon. In many cases they have to go back to a known (terrible) oppression system... in the case of the young people they have to learn how to behave in this (old) new system of oppression after living in a society where they could express (with discretion) their own believes and opinions.\nIn my opinion this situation proves that the USA wasn't doing much in the place other that taking... The kind of change needed in the region must come from within but the US had been telling its citizens they were there to provide assistance to the region and justifying your presence that way... And in 20 years the country didn't build a stable social/political/religious change to avoid exactly what is happening now.",
            "polarity": 0.14785353535353535,
            "subjectivity": 0.387135241301908
        },
        {
            "body": "“Nationalism is politics for basic people”. The Christian nationalists of the U.S. are so inundated with self importance they wouldn’t understand that sentence.",
            "polarity": 0.0,
            "subjectivity": 0.0625
        },
        {
            "body": "Iran always considered itself the gendarme of the Middle East.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "#Imperialism #EndImperialism #DifferentRegimeSameWarCrimes",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks Beau.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Biden is going all out to d-estroy America",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey Beau. Have a question. Because of how chaotic and conflicted as the Republican party is now and how weak the Democrat party is, would you say it's more likely that the Republicans implode and defeat themselves before the Democrat party does? I know this sounds like wishful thinking but then, it's not reasonable just to reject a possibility because it's the preferred outcome. I guess I can see a future where that could happen because of all the turbulence in the GOP.",
            "polarity": 0.004999999999999999,
            "subjectivity": 0.5700000000000001
        },
        {
            "body": "We weren't going to have effective policy in that region, and we're not welcome, but Iran as a third \"pole\" may create conditions that finally let Afghanistan be more than the SNAFUBAR cartographic convenience it's been. I say we in the US need to fix our own house before we sit on anyone else's lawn.",
            "polarity": 0.21666666666666665,
            "subjectivity": 0.7000000000000001
        }
    ]
}