{
    "time_posted": "2021-10-30 15:26:58",
    "url": "https://www.youtube.com/watch?v=ebRtyTxeGRk",
    "time_now": "2021-11-05 04:33:24",
    "ups": "819",
    "downs": "66",
    "views": "52385",
    "top_comments": [
        {
            "comment": "Aap sub ko Dekh rahe hain main bhi Dekh Raha ho par in sub ko banane wale aik aadmi hai bus aik aur woo great aadmi hai Aftab Iqbal aur koi inovation Nahi  same copy hai same copy koi new baat Nahi main usko dicourge Nahi Kar Raha par dukh is baat k hai yeh Apne Mohsin k bhool  gaye Hain yeh copy kr k new show Kar diyaa par Haroon sahib aap Naya Lao nayaa new segment aad Karo tab aap hoshyarr ho gee Nahi Tu is time Tu aap copiedddd hoo",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.1928030303030303,
            "subjectivity": 0.3787878787878788
        },
        {
            "comment": "میرے اللہ نے اسے مردوں اور عورتوں پر لعنت فرمائی ہے جو مرد عورتوں جیسا لباس پہنے اور جو عورتیں مردوں جیسا لباس استعمال ۔ کس چیز کی خوشی اور ہوشیاری تم لوگ کر رہے ہو تم لوگ آپ کے سوداگر ہو ابلیس کے نمائندے ہوں جہنم کو خرید رہے ہو جہنم میں جانا چاہتے ہو میرے اللہ کے جنت سے تم سب کو نفرت ہے جس کام کو میرے اللہ اور اس کے رسول صلی اللہ علیہ وسلم نے منع فرمایا ہے گویا تم لوگ احکام ہیں خداوندی اور رسول اللہ صلی اللہ علیہ وسلم کی تعلیمات کی توہین کر کے تم لوگ روٹی روزی کما رہے ہو اب سمجھ لو قیامت کے دن کیا کچھ ہونے والا ہے تم سب کے ساتھ ۔ یہ ابلیس کا دھوکا ہے تم اپنے آپ کو ہوشیار سمجھتے ہو تمہارے جیسے ذلیل اور بے شرم بے وقوف انسان دنیا میں بہت کم ہیں ۔",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "لکی ڈٸیر زبردست😄😄😃😃",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Har banda Aftab Iqbal ki copy kar k betha hai yar.. kuch naya lao market main copycats q banay phirte ho?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "comment": "Good",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Awesome Contents",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Awesome game playing",
            "polarity": 0.3,
            "subjectivity": 0.7
        },
        {
            "body": "Welcome back",
            "polarity": 0.4,
            "subjectivity": 0.45
        }
    ]
}