{
    "time_posted": "2021-10-30 15:00:20",
    "url": "https://www.youtube.com/watch?v=fXOaWevi6f8",
    "time_now": "2021-10-31 09:11:36",
    "ups": "5458",
    "downs": "99",
    "views": "217495",
    "top_comments": [
        {
            "comment": "I drink tea daily with two pods of cardamom 😋",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Love it in black coffee. Just a hint.",
            "polarity": 0.16666666666666669,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "You are amazing 👍👍👍",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "Some clips are not Idukki.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Everyone reading this must know... The rejected pods are also sell at other non European countries... Such as the Arabic gulf countries...",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.2916666666666667
        },
        {
            "body": "I can help you to import cardamom to your country, we have the best cardamom in Java island Indonesia 🙏",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Why did the narrator says idukki  (Kerala) and showing Tamilnadu....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Respect to these people. Cardamoms are a necessary spice for our daily intakr",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Last massgae take care issue Subject Department relationship rate facilites small requieast to massanger",
            "polarity": -0.13888888888888887,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "Facilites naw Subject demand and supply facilites Method wise i'llnes India nation small requieast to massanger",
            "polarity": 0.09444444444444444,
            "subjectivity": 0.5444444444444444
        },
        {
            "body": "Meanwhile in PAK : we uses it in every dessert and in cultural food.",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "Velaychi",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This language is tamil ,i am from tamilnadu",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I started throwing a few pods of cardamom in my rice a couple years ago.  Never going back.  I would happily pay two or even three times as much to treat the farmers better.",
            "polarity": 0.26,
            "subjectivity": 0.36
        },
        {
            "body": "I Wondered if The Cardamom is Plantable elsewhere in similar weather conditions.",
            "polarity": 0.0,
            "subjectivity": 0.4
        },
        {
            "body": "is it just me or what. why almost every videos here now became india's industry. \nno offense though, but i think there are a lot more than just india's. \nthere are a lot off countries that still doing industry and manufacture the old way, and still a home industry that struggle to exist and compete with the modern society.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "I drink tea daily with two pods of cardamom 😋",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I live in Kerala and due to the damn export we don't  get good quality cardamom even for high prices which are exported. Because the developed countries will send back cardonon which don't have first grade quality. We only get leftovers",
            "polarity": 0.15267045454545453,
            "subjectivity": 0.4560416666666667
        },
        {
            "body": "Always buy cardamon with the pod. Powder will loose it's smell fast.",
            "polarity": 0.06153846153846154,
            "subjectivity": 0.4346153846153846
        },
        {
            "body": "Hey insider, you guys are showing Tamil nadu footage for idukki district, my family owns a cardamon plantation in idukki district.The one which you guys are showing is actually tamil nadu, thats a totally different state, even though its near to idukki.\nNevertheless Great video guys, its a very labour intensive job, which requires some recognition like this, thank You.",
            "polarity": 0.22000000000000003,
            "subjectivity": 0.43
        }
    ]
}