{
    "time_posted": "2021-10-30 15:00:20",
    "url": "https://www.youtube.com/watch?v=fXOaWevi6f8",
    "time_now": "2021-11-02 10:37:48",
    "ups": "11860",
    "downs": "213",
    "views": "633720",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "This is the only video where the cost is justified when compared to the amount of labour and risk undertaken",
            "polarity": 0.2,
            "subjectivity": 0.95
        },
        {
            "body": "every episode covering one of the most expensive  spices  made me realize every spice of them are used in Bengalis'  food item.😐 And I think  \nmost South Asian  countries are using most of these expensive  spices...Shouldn’t  we be richer than Western countries??? \n.\n.\nYeah!  Our culture is really rich.💚\nLove for all south Asian from Bangladesh 🇧🇩💚",
            "polarity": 0.12,
            "subjectivity": 0.37000000000000005
        },
        {
            "body": "How did you come up with growth rate data?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why are you flashing subliminal images of Mao Zedong?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "In Egypt we put it in the soup 🍲 , you are very unlucky if it comes under your teeth 😂😂",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "Malayalis poli aanu mone...\nUS show il vare nammude Idukki vannu...\nBy the way I am from Thiruvananthapuram district , Kerala , India🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ANYTHING TO DRIVE THE PRICE UP :)",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "rejected one comes to market again with low level prices,",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "Always thought it was Cardamon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Will in Arab world we use it on every thing tea, food, coffee",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Outstandig vídeo.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Government should make sure that they get direct access to market and sellers. The middlemen are getting richer without doing anything. Lion's share of profit is taken by middlemen. If market is directly connected to farmers, they will be richer than any IT guy in India. Government tried to do it but the middlemen are so powerful that they have made life hard for the government to implement it. Hope future is bright for these farmers.",
            "polarity": 0.20119047619047617,
            "subjectivity": 0.5936507936507935
        },
        {
            "body": "Green Cardamom available 6mm, 8mm ping me",
            "polarity": 0.1,
            "subjectivity": 0.35
        },
        {
            "body": "that soil under the cardamom plants looks very rich, just like a fresh compost!",
            "polarity": 0.43125,
            "subjectivity": 0.7375
        },
        {
            "body": "I'm also one of the cardamom farmer, from Idukki. Get some  prouded.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}