{
    "time_posted": "2021-10-30 15:00:20",
    "url": "https://www.youtube.com/watch?v=fXOaWevi6f8",
    "time_now": "2021-10-30 20:51:35",
    "ups": "3119",
    "downs": "55",
    "views": "98470",
    "top_comments": [
        {
            "comment": "I had recently ordered 2kg of Idukki's green cardamom (8mm quality) over whatsapp from a local reseller there @ 1500 INR (which is 20 USD) per kg. These sellers or agents from Idukki and Kochi are all over the facebook groups if youre looking for cardamom. Also, it's true that cardamom's colour has a lot do with how easily it can be sold to retailers, so it fetches good value. For this, you can sometimes have the sellers / farmers add artificial colour for your batch, which is a common practice not unheard of.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.047916666666666656,
            "subjectivity": 0.5166666666666667
        },
        {
            "comment": "Nice video.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "comment": "If anyone gets a chance, please visit idukki district of Kerala. The smell of freshly harvested Cardamom is heavenly.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I'd like to experiment  with it in an indoor hydroponics  setting.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Indian, Kerala 🇮🇳🇮🇳 മലയാളി",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Nice video.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "The places shown from timeline 4.55 to 5.10 is Tamil Nadu it should be cumbum or theni district and no way related to Idukki district. Please do your research before publishing videos of these kind on the channel. I don't understand how can you do blunders like this.",
            "polarity": 0.3,
            "subjectivity": 0.65
        },
        {
            "body": "Before watching the video, I can probably guess why.. It's almost always the same reason: laborious work.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "What is a kilogram?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If anyone gets a chance, please visit idukki district of Kerala. The smell of freshly harvested Cardamom is heavenly.",
            "polarity": 0.3,
            "subjectivity": 0.5
        },
        {
            "body": "It would be honest and scientific if every video you make is not about the sun cycles that can change the climate from time to time, over 100’s of years.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "Wearing masks lol.",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "i live with someone from Pakistan and they love cardamom, usually a bag of it here costs around 1,5-2 euros thats 100g bag making cardamom worth around 15-20 euros in Ireland, i just inspected the bag (as we obviously have one at home) and to me it looks like small to medium sized generally the ''low quality cardamom'' though after i asked Pakistani person i live with if this is a bad quality cardamom, he just said ''there is nothing wrong with this cardamom its as good as something you would get in Pakistan'' now i personally cannot grade it as i absolutely despite cardamom (its disgusting for me), but that Pakistani person has been using the spice throughout his whole life and if he says that 15 euro per kilo cardamom is good, i believe him, the brand he is using is called ''east end'' (a google reference for ye)",
            "polarity": 0.013101604278074866,
            "subjectivity": 0.530392156862745
        },
        {
            "body": "I had recently ordered 2kg of Idukki's green cardamom (8mm quality) over whatsapp from a local reseller there @ 1500 INR (which is 20 USD) per kg. These sellers or agents from Idukki and Kochi are all over the facebook groups if youre looking for cardamom. Also, it's true that cardamom's colour has a lot do with how easily it can be sold to retailers, so it fetches good value. For this, you can sometimes have the sellers / farmers add artificial colour for your batch, which is a common practice not unheard of.",
            "polarity": 0.047916666666666656,
            "subjectivity": 0.5166666666666667
        },
        {
            "body": "Seems it is grown as a secondary crop amongst a primary one. Hopefully this practice cuts losses when conditions are less than ideal.",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "The small cardamom that sells the lowest grade $12 par kg in India sells for 35$ to 50$ in Pakistan.  You can estimate 90$ par kg. In my country Pakistan small cardamom is really so expensive.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "For all these spices in Kerala, Europeans came to us and then started the era of enslavement and colonialism. Before the arrival of greedy Europeans, there was peaceful spice trade with Arabs and Jews. Now Europeans gets cheap resources from Africa by supporting the rebels and dictators there. If democracy comes there, the cost of resources will sky rocket!",
            "polarity": 0.32083333333333336,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "yo it cost $5/ kg where i live,",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "Why is it too unaffordable for the rich?\n\n\n\nToo many people planting them and too not cash money.\n\n-$$$$$$$$",
            "polarity": 0.4375,
            "subjectivity": 0.625
        },
        {
            "body": "all these reports are interesting.  but when will we stop masking people?  it's really degrading",
            "polarity": 0.35,
            "subjectivity": 0.35
        },
        {
            "body": "Wow I'm tiered just watching these people sort it out wow what a pain in the bum for them!!!! 😃😃😃😃 \nIt's just wrong that we reject most of his income because it's not pretty enough cardamom, poor farmer.",
            "polarity": -0.025837053571428577,
            "subjectivity": 0.7857142857142857
        },
        {
            "body": "Business is not going too bad for those farmers if a watch like that can be afforded.\nMin 5:36",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Indian farmers are the most exploited people.",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}