{
    "time_posted": "2021-10-30 15:00:20",
    "url": "https://www.youtube.com/watch?v=fXOaWevi6f8",
    "time_now": "2021-11-04 03:50:38",
    "ups": "15943",
    "downs": "297",
    "views": "934945",
    "top_comments": [
        {
            "comment": "ഏലക്ക 🙂",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Ohh expensive ,I thought it was cheap (I live in India)",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.012121212121212125,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "The price tag is really confusing me because I have like 500 green cardamom at my house and they did not cost that much 👀",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.09999999999999999,
            "subjectivity": 0.3
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "ഏലക്ക 🙂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My Mummy's district is famous for spices and my father's district is famous for cashew industries 😁\nIdukki & Kollam",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Ohh expensive ,I thought it was cheap (I live in India)",
            "polarity": 0.012121212121212125,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "As an owner of 872sqft cardamom land producing over 600kg a year I'm surprised how simple yet informative this video is, For the people who are concerned about the labour wage they get paid around Rs.500 to Rs.700 ($7 to $10) for 6.5 hours of working time, Yes they are underpaid but still save more than an average engineer does in a month in India. They all have their house and family nearby the farm itself and atleast 3 person works for the same farm a day from a family so yeah the job is convenient and nothing special compared to other farming practices except for men where things get difficult due to the inclined position of land and rocks it's hard to carry the bags weighing 50kg a person and to mix the sand for both plantation and cleaning process especially in rainy season. It's the peace and aroma that matters to us and keeps ourselves happy all the time despite other factors like low wages etc. I live in the southern part of India (Kerala - Munnar to be specific).",
            "polarity": 0.03393175451998981,
            "subjectivity": 0.4967787114845939
        },
        {
            "body": "Lol... In  India we get one for free when you buy a paan🤣",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.75
        },
        {
            "body": "For thousands of years in most countries middle men ruled, in fairer societies middle men took less profit.India is still dog eat dog world. The farmers want the government to buy from them, to ensure good prices, but the farmers are not the innocent lot. They will sell bad stuff to government. \nWhen prices go high they will sell to private. The cardamom even when tiny is doused of pesticides in India, get some lab to check it. Its not fit for humans.,But, since in India there is no testing(testing happens of someone dies),no bother. \nThey will say cardamom is the  delicacy of the upper  class. And btw, certified organic will get zero more price in India as middle men dont care. \nThus its a ethics less society. The only ethics is while dealing with family and close friends, there a lot of ethics exist unlike in the west.",
            "polarity": 0.07041666666666667,
            "subjectivity": 0.3696875
        },
        {
            "body": "its a spice? its expensive?????",
            "polarity": -0.5,
            "subjectivity": 0.7
        },
        {
            "body": "TBH Cardamom doesn't taste that great to me, a mild sweetener & not herbal enough, but perhaps mine have been too dry & not green enough",
            "polarity": 0.19444444444444445,
            "subjectivity": 0.525
        },
        {
            "body": "Modi still hasn't taken back the corrupt \"farm bills\" (corporate giveaways) even though farmers have been protesting for over a year now!",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "This entire So Expensive series is just meant to make everyone panic that a \"climate crisis\" is going to destroy the world.  \n\nEvery video is awesome until the final 30 seconds in which the narrator claims the end is nigh if we don't give all our money to Klaus Schwab.",
            "polarity": 0.06000000000000001,
            "subjectivity": 0.665
        },
        {
            "body": "You colonizers are re-discovering your taste for Indian spices, and exploiting Indian labor and children to get your fill.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Farmer with a mask outside? Crazy",
            "polarity": -0.3,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "Aaaaaaaa... I ❤😘 cardamom... The green is the SUPER 👍😍👍😍\nIndonesia 🇮🇩 has a kind of cardamom. The size is bigger but the smell is a bit soft...",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.5433333333333333
        }
    ]
}