{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-10-30 20:51:50",
    "ups": "4924",
    "downs": "59",
    "views": "53687",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 18,
            "number_of_replies": 4,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "With push-in you will always have fingerprints on the surface. Go with the regular handles (I'm using both so have some experience :) )",
            "polarity": 0.25,
            "subjectivity": 0.5384615384615384
        },
        {
            "body": "I’d say the pan pull out is a good solution for both accessing and storing your cookware. Having it tucked into the corner is a much better use of an area that could be awkward. Having it slide out over the counter will ensure that you don’t have clutter on your counter top. I’m a big fan of keeping things off counters. Easier to clean, better looking space. Also loving that cabinet making set up. You make it look easy, though I’m sure that equipment and software wasn’t cheap.",
            "polarity": 0.35454545454545455,
            "subjectivity": 0.6611111111111112
        },
        {
            "body": "Push",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm a bit confused why you used the CNC to cut some basic rectangular boards. Wouldn't it be simpler to cut with some type of circular saw?",
            "polarity": -0.2,
            "subjectivity": 0.4125
        },
        {
            "body": "You need a truck dude 😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Honestly I love push to open, Its sleek, modern & there's no big handles on the cabinet, However I do feel that when you invite people over some might not have any clue on how to open the doors (especially kids) so I feel like people might pull and maybe even destroy the cabinets (im no expert, I have no clue if they will be able to break so don't judge) (My uncle just built a new house and they did pust to open on everything in the kitchen including the refridgerator & freezer, them doors get bullied everytime they have guests).\n\nIf I would have built a kitchen I would have used push to open & a nice handle that is not too big, like that small piece that u showed us. :)",
            "polarity": 0.13242424242424242,
            "subjectivity": 0.5053030303030303
        },
        {
            "body": "I love push to open yet those simple pull look great too!",
            "polarity": 0.375,
            "subjectivity": 0.5517857142857143
        },
        {
            "body": "go with pull tabs, i have a push to open matt black kitchen it just leaves finger prints everywhere",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "enjoying this series. wrt the kitchen cabinet hardware (or lack of same), if this is a kitchen that you will be using frequently, you should go for the matte black pulls (or some other kind of pulls). without any kind of pulls on the cabinets, you'll be leaving fingerprints and whatever ingredients you have on your hands on the cabinet fronts. if you're more of an occasional chef and you just want a fancy-looking kitchen, then go with the push-to-open hardware",
            "polarity": 0.22314814814814815,
            "subjectivity": 0.4731481481481481
        },
        {
            "body": "push to open is such a faff dont bother, it also means the faces of the cabinets get mucky quick!",
            "polarity": 0.13888888888888887,
            "subjectivity": 0.5
        },
        {
            "body": "push to open ends up leaving dirt and oil from your skin on the cabinets over time. I agree with the comment that the cabinet in the corner may be hard to access so you might want to really think what would go there and how often you will be accessing those items. Finally, are you going to do an undermount vent for the stove top in the island? If you do an overhead, it will feel a bit more intrusive in the space.",
            "polarity": 0.15138888888888888,
            "subjectivity": 0.5402777777777777
        },
        {
            "body": "LOVE the monitor!  I thought my monitor was big (32\" curved monitor), but I am now VERY jealous!",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "A combo of both would be different and eclectic",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "the push to open mechanism is really annoying I wouldn't recommend it",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "I'd go with pulls because:\n- If they match cabinets/other hardware/counter tops they make the kitchen come together.\n- With push to open your cabinets will be forever dirty from fingerprints (and other stuff your hands may be dirty with in the kitchen)\n- Pulls cannot really break in any way (and if they get a bit loose you can always tighten them) which cannot be said about push to open mechanisms\n- With push to open all spacings between cabinet/drawer fronts must be perfectly equal. If it's not, it's going to draw a ton of attention.\n- You can open drawers/doors with one motion instead of pushing on it and then opening the cabinet/drawer manually.\n\nThe only reason for push to open that I can think of is that if you manage to break a pull or want to expand the kitchen without tearing down everything else, you may be in a situation where manufacturer stopped producing that specific pull and you either have to try to match a different pull or replace all of them. With push to open it's not really a problem.\n\nA side note: Anything sliding over the counter top (talking about the slide out pantry) may become a pain in the butt when you have lots of stuff on the counter top and need to move it just to get something from the pantry.",
            "polarity": -0.024077822762033296,
            "subjectivity": 0.46884840305892933
        },
        {
            "body": "Fantastic work, dude! 😃\nThe cabinets are looking great!\nI wouldn't use MDF here where I live because of the air humidity. It's too high and MDF becomes pasta in 6 months. 😬\nAnyway, stay safe there with your family! 🖖😊",
            "polarity": 0.4842727272727272,
            "subjectivity": 0.638
        },
        {
            "body": "I wouldn’t suggest the range on the island. I have that and the clean up is hectic. The food splashes and splatters all over the cooktop and around it as well as the floor on the other side. With a wall at the back, it prevents this to an extent and clean up is a lot easier.\n\nSomeone also mentioned venting. I would also be concerned about not being able to vent the space because of not wanting to close up the design or block off light",
            "polarity": 0.2513888888888889,
            "subjectivity": 0.5166666666666667
        },
        {
            "body": "Black pulls definitely.\nAnd as someone mentioned earlier, rollout pantry in the corner will totally be a fun buster. It's probably a better space for seasonal kitchen items.",
            "polarity": 0.12666666666666665,
            "subjectivity": 0.42666666666666664
        },
        {
            "body": "Push to open hardware as it will keep the fronts smooth!",
            "polarity": 0.25,
            "subjectivity": 0.5
        }
    ]
}