{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-02 06:30:57",
    "ups": "12679",
    "downs": "165",
    "views": "203781",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 36,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        },
        {
            "comment": "Love what your doing.  Very interesting and entertaining.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5499999999999999,
            "subjectivity": 0.65
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I would have a hard time not touching that I-beam everytime i walk through that first room.",
            "polarity": -0.09722222222222225,
            "subjectivity": 0.45833333333333326
        },
        {
            "body": "You missed a perfect opportunity to recreate the \"Lumber Jetta\" but with a GTI.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I can really see the uptick in quality of the video editing.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Designsoftware and CNC: The king is dead, long live the king! Although DIY and raising three young children don't mix well, your video's keep me hopeful for the future. Love to see you live it. I can't imagine myself sharing so much online but thanks that you do. See you in the next one.",
            "polarity": 0.10568181818181818,
            "subjectivity": 0.3325000000000001
        },
        {
            "body": "Love what your doing.  Very interesting and entertaining.",
            "polarity": 0.5499999999999999,
            "subjectivity": 0.65
        },
        {
            "body": "4:05 you could start a new series called Modustrial Baker...just saying!",
            "polarity": 0.17045454545454544,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Blum soft close drawer runners are great, we use them at my work. \n\nDefinitely use the lip pull handles too. Less fingerprints and should blend in well to the black drawer/door fronts",
            "polarity": 0.11333333333333336,
            "subjectivity": 0.42000000000000004
        },
        {
            "body": "Man, its gonna be 2022 soon.  Lose the mask.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You are going to have a great looking kitchen. Ugh - can’t believe I am going to leave a negative comment BUT you are going to hate the placement of your refrigerator when you are cooking. That is a lot of walking to the sink from where the fridge is when you are prepping a meal. It’s great for grabbing a snack or cold one - but it’s far from ideal when you are cooking.",
            "polarity": 0.1285714285714286,
            "subjectivity": 0.8285714285714285
        },
        {
            "body": "looks like amazing work ahead of you",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        }
    ]
}