{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-10-31 17:25:38",
    "ups": "9585",
    "downs": "122",
    "views": "139519",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 32,
            "number_of_replies": 5,
            "polarity": 0.0625,
            "subjectivity": 0.45
        },
        {
            "comment": "Even though you covered it with your finger, I'm pretty sure you ended up showing you entire credit card for a few frames. You might want to double check your footage frame by frame and I would seriously consider canceling that card. Maybe I'm paranoid, but there are some pretty crappy people on the internet.\nLoving this project project by the way, been watching this one from day 1!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.15208333333333335,
            "subjectivity": 0.6538194444444444
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "My vote is for matte black pulls.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "'My kitchen used to be an illegal nightclub for the mafia'- you could dine out on that story!",
            "polarity": -0.625,
            "subjectivity": 0.5
        },
        {
            "body": "I have a lot of respect for how much work you're putting into that kitchen! I occasionally do some CNCing and man.. it van be a lot more work than some people think ;) Good luck!\nYou might have already decided on the drawers but still: I'd want push to open on everything in my house but.. I'd add handels to that function in the kitchen. It's one of the few places where you sometimes need something quick and you just want to jank open that draw and grab it. \nAnyway, good luck! looking forward to the next one",
            "polarity": 0.26212121212121214,
            "subjectivity": 0.42045454545454547
        },
        {
            "body": "Do the push pulls because resale with that style is freaking amazing and it is super modern",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.6222222222222222
        },
        {
            "body": "definitely use the matte black pulls too.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "Even though you covered it with your finger, I'm pretty sure you ended up showing you entire credit card for a few frames. You might want to double check your footage frame by frame and I would seriously consider canceling that card. Maybe I'm paranoid, but there are some pretty crappy people on the internet.\nLoving this project project by the way, been watching this one from day 1!",
            "polarity": 0.15208333333333335,
            "subjectivity": 0.6538194444444444
        },
        {
            "body": "Push to open is great until it doesn't work. Either go for the disreet matt black pulls or machine out a trench on the top/bottom of the drawer door for you to gain some finger purchase on the door to manually open it if needed.",
            "polarity": 0.15833333333333335,
            "subjectivity": 0.5458333333333334
        },
        {
            "body": "Can anybody explain to me why an oven on eye level is a good idea? Because I have found it difficult to awkwardly lift a hot dish out of there while trying not to burn your arms on the scalding door. I just don't get it..",
            "polarity": -0.037500000000000006,
            "subjectivity": 0.8625
        },
        {
            "body": "Matte black pulls, less dirty fingers on your cabinets",
            "polarity": -0.3111111111111111,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "No offense.  I love your channel but your style/taste in interior finishes is so HGTV/generic whit person...its just boring and lacks any originality TBH",
            "polarity": -0.25,
            "subjectivity": 0.8
        },
        {
            "body": "Hahaha, a lot of work \"cut\" out for me on the CNC. Pun probably not intended. :D",
            "polarity": 0.6,
            "subjectivity": 0.7
        },
        {
            "body": "I would definitely recommend pulls/handles since you're doing a matte black finish on the cabinets. A finish like that will catch a lot of grease from your fingers if you do push to open.",
            "polarity": -0.05555555555555555,
            "subjectivity": 0.4777777777777778
        },
        {
            "body": "This is insane but I liked the first design for the kitchen island MUCH more. It just had so much more character in my opinion :)",
            "polarity": 0.225,
            "subjectivity": 0.6888888888888888
        },
        {
            "body": "Dunno man, Modustrial Eats is a catchy channel/show name lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "You’d think my being short, I’d love the idea of microwave in the island. Nope! I HATE it! It was some ill-conceived idea to get to microwave off the counter top. Obviously who thought of it did not live with active nosy dogs and kids.",
            "polarity": -0.01093073593073593,
            "subjectivity": 0.5571428571428572
        },
        {
            "body": "Strongly disagree with your color choice. Dark colors, especially blacks are a big no no for kitchens in my personal opinion.",
            "polarity": 0.056666666666666664,
            "subjectivity": 0.5066666666666666
        },
        {
            "body": "Can’t wait to see it finished",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love the kitchen design. Agree with many others on the black pulls. Also kitty’s appearance was lovely. Cats are the best micro managers out there… clearly you were taking to long filming lol 😂",
            "polarity": 0.3979166666666667,
            "subjectivity": 0.5083333333333333
        },
        {
            "body": "Push pulls",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}