{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-10-31 00:58:22",
    "ups": "6447",
    "downs": "87",
    "views": "82306",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 22,
            "number_of_replies": 4,
            "polarity": 0.0625,
            "subjectivity": 0.45
        },
        {
            "comment": "Random question, do you miss work?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.5,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Matt black pulls ;)",
            "polarity": 0.04166666666666667,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "You get the push-to-open no matter what, so why not run with that, and you can add the pulls later, if you don't like it?\n\nNice work with the CNC.  Consistent parts, and you can be doing assembly while the CNC is cutting the next cabinet.  (work smarter)",
            "polarity": 0.05,
            "subjectivity": 0.43
        },
        {
            "body": "Definitely go with the black pulls. Keeps everything clean, industrial, and modern, but everyone you have in your place will know how to open your cabinets and drawers. \nThink about it. Some asks \"where's the silverware?\" \n\"Right next to the sink\"\n\"Ok.... Thanks... Umm How do you open it?\" \nThat scenario times 100",
            "polarity": 0.13857142857142857,
            "subjectivity": 0.41690476190476194
        },
        {
            "body": "It's a little overkill but, do both",
            "polarity": -0.1875,
            "subjectivity": 0.5
        },
        {
            "body": "How about the kitchen bench has a large overhang, so you can talk to your mates sitting at the bench while you make dinner? and.. I'd go with the pulls 👍🏼🙏🏻",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.42857142857142855
        },
        {
            "body": "Definitely pulls. Repeated touching will make your cabinets look nasty over time. My kitchen doesn’t have pulls or handles on the cabinets or drawers (something we will be changing) and the areas were we have to touch them constantly need cleaning cuz they look dirty.",
            "polarity": -0.22000000000000003,
            "subjectivity": 0.6266666666666667
        },
        {
            "body": "I liked that floating bar on the island. You should still do that.",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "It's amazing how the cnc makes cabinet making process so easy... cuts your hinge holes. Shelve holes. Everything. Makes everything so precise.... great job",
            "polarity": 0.5583333333333333,
            "subjectivity": 0.8208333333333333
        },
        {
            "body": "Simply safe sucks",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "If I'm being honest, the butcherblock countertop looks kinda random cause it's the only one in the space, maybe makes the hangover part of the island, where you sit and eat also butherblock?",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "Random question, do you miss work?",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "good choice using blum. was about to post that.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "no reason not to use both the push to open and the black pulls, its just a case of putting them in the right place",
            "polarity": 0.03968253968253968,
            "subjectivity": 0.4896825396825397
        },
        {
            "body": "It looks awesome seeing the CNC do it's thing , but aren't you suppose to wear a good dust mask at all time plus a dust collecting fan?",
            "polarity": 0.85,
            "subjectivity": 0.8
        },
        {
            "body": "Thanks for the share.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "I think so long as you have a CNC you should cut out your own drawer pulls.  Just a modern slit.",
            "polarity": 0.25,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "Great video",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Both!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Spices and herbs rack needs to be close to stove area the size matters too. Flat black still shows dirt, keep counter tops white clear coat so stains does not embed the concrete. Pull out swing door for pots and pans or that area always clear. Vent over stove is a must too. Need big Pantry for extra food and appliances maybe?",
            "polarity": 0.019791666666666676,
            "subjectivity": 0.22812500000000002
        }
    ]
}