{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-02 18:52:33",
    "ups": "13168",
    "downs": "170",
    "views": "212094",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 36,
            "number_of_replies": 7,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Be careful with push to open drawers and frameless cabinets. Your drawer face needs to move into the drawer box a slight bit to get the slide to actuate properly. I have solved this issue by putting a rabbet around the back of the drawer front so it has a bit of distance to be pushed into the cabinet body to get the slide to spring open",
            "polarity": -0.044444444444444446,
            "subjectivity": 0.37777777777777777
        },
        {
            "body": "why are the fridge and dishwasher not build in? so all the fronts are the same",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Matt Black pulls",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "How about a long spring holding that dust collection hose up so you dont have to adjust it manually when using the CNC?",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "Dude, interesting content but 8 ads plus your sponsor ad make one lose their interest in the video. \nI get you need to get revenue but this is the most ads in one 17 minute video I have seen.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Hey I do know the Blum Push to open drawers. I used them in a Cabinet i built myself. The clean look might be awsome and to open the drawser works also like a charm. But to close these things is kind of a pain in the a... when they are too light you really need to slam close them and often times you end up trying to close them 2-3 times. Also they are really easy to open by accident. I do love the clean aesthetic but i will neve use this system again. The normal softclose Drawers from Blum are very good on the other hand.",
            "polarity": 0.29243589743589743,
            "subjectivity": 0.6106410256410256
        },
        {
            "body": "Super",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "If you're going to be running a bunch of sheet goods on the CNC invest in a vacuum system for holding down everything. My dad made the change shortly after he bought his CNC and it is a total game changer.",
            "polarity": -0.11277777777777778,
            "subjectivity": 0.3477777777777778
        },
        {
            "body": "PLEASE don't do a range oven + cooktop burners in 1. Such an appliance is only seen in the absolute worst and cheepest buildings in europe. ALWAYS do it separate. It is so much more elegant and exclusive looking. And will give you a lot more design freedom.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.7714285714285715
        },
        {
            "body": "Unless you’re ok with fingerprints all over your kitchen, I’d go with the pulls\n\nAlso: not sure how practical that pull-out pantry is since it’ll limit what you can put on the counter?",
            "polarity": 0.125,
            "subjectivity": 0.6944444444444444
        },
        {
            "body": "Usecase in the Kitchen would be you may have dirty hands - will you have fat finger protection layer at the spot where you push to open?",
            "polarity": -0.3,
            "subjectivity": 0.65
        },
        {
            "body": "depending on your paint finish, push to close might leave fingerprints",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Matte black pulls! I think you'd want pulls in case the push to open ever stops working.",
            "polarity": -0.10416666666666666,
            "subjectivity": 0.4666666666666667
        }
    ]
}