{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-10-31 21:32:53",
    "ups": "10225",
    "downs": "131",
    "views": "152987",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 34,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        },
        {
            "comment": "Hey man! Love u’r videos and this project in particular hits very close to home. I work as a proffesional kitchen planner/sales rep for a one of the largest (and oldest) kitchen manufacturers in Norway. Love the black look you are going for as its very clean and scandinavian looking, however it won’t stay very clean for very long with push-open I’m afraid. Black is one if the hardest colours to keep smudge free on a kitchen and with push-open you’ll constantly get fingerprints everywhere. I would therefor do the backmounted lip handles in black but i would also add push-open to the cabinet with garbage disposal. Always handy to be able to open that with u’r knees or something if u got u’r hands full :) Hope this was helpfull and can’t wait to see how this turns out! Gonna look great 😁",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2331578947368421,
            "subjectivity": 0.6227192982456141
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "👍👍👍👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Push to open. Love the clean look. Als hide the dishwasher, use a build in.",
            "polarity": 0.2888888888888889,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "I like the black matte cabinet pulls.  I think they would be cool.  Take your time on cutting out those cabinets.  $3400 is a lot to mess up.  Although much cheaper than ready made.  🤗 oh, and Happy Halloween 🍁🧟‍♀️🎃",
            "polarity": 0.08690476190476193,
            "subjectivity": 0.5511904761904762
        },
        {
            "body": "I vote for the PTO cabinet hardware.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Do you have a 1/4” end mill on the CNC? The one you put on looked thicker. Might explain your dado problem for your back panel.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i would for sure do separate oven and stove. makes it a lot easier when you need help in the kitchen",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "I think it would be much better to put the range against the wall and maybe the sink on the island....",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "My opinion would be no hardware (push to open), but if you are going with black rather go with gloss dark grey than matt black, the matt will show dust really really quickly and the black will not help with that however the dark grey gloss will be showing dust a lot less and will not scratch as much or as easily when cleaning it.",
            "polarity": -0.02727272727272728,
            "subjectivity": 0.3818181818181819
        },
        {
            "body": "What will you do with the cooker hood over the range?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love your vids.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Another vote for the matt black pulls. Can't wait to see how it turns out. Out of curiosity how long does each run on the CNC take?",
            "polarity": -0.10833333333333334,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "Hey man! Love u’r videos and this project in particular hits very close to home. I work as a proffesional kitchen planner/sales rep for a one of the largest (and oldest) kitchen manufacturers in Norway. Love the black look you are going for as its very clean and scandinavian looking, however it won’t stay very clean for very long with push-open I’m afraid. Black is one if the hardest colours to keep smudge free on a kitchen and with push-open you’ll constantly get fingerprints everywhere. I would therefor do the backmounted lip handles in black but i would also add push-open to the cabinet with garbage disposal. Always handy to be able to open that with u’r knees or something if u got u’r hands full :) Hope this was helpfull and can’t wait to see how this turns out! Gonna look great 😁",
            "polarity": 0.2331578947368421,
            "subjectivity": 0.6227192982456141
        },
        {
            "body": "You should have set the refrigerator over to the right and put it in that pocket in the wall",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "I think having the same color pulls isn’t very good just cause you can’t see it if it doesn’t pop",
            "polarity": 0.45499999999999996,
            "subjectivity": 0.45250000000000007
        },
        {
            "body": "i would go for the pulls.. i have push to open.. it always gets dirty.. on matt black you will see fingerprints like hell.. having the pulls will be much better..",
            "polarity": -0.06666666666666665,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "I’ve had both - separate the hob and ovens 100% get a island job with remote control centre fan",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "Definitely pulls. You're going to hate push to open within a week!",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "MDF that's more dense than normal MDF would be HDF. Both are fairly sturdy, but in terms of durability they are weak af. You can really only use them in wet environments like Kitchens and Bathrooms, when they've been coated with a waterproof material, like finished maple or Melamine (or the shoddy plastic that Ikea uses). Common for all is though that they really, REALLY do not like water. Longer exposure to moisture and water will result in the boards starting to bulge, as the glue gets dissolved and the wood dust starts falling apart in clumps. Add to the equation that the glue used is typically hella toxic and you've got several types of wooden boards that claim to be reasonably durable and environmentally friendly, despite that not being the case. Plywood is more reasonable and way more durable, but I'd far prefer solid wood, regardless of whether it's fir, oak, maple, walnut, Zebrano, teak or whatever other type",
            "polarity": 0.08373015873015874,
            "subjectivity": 0.47857142857142854
        },
        {
            "body": "I mean.. If it's free get the push to open stuff. Cant get a cleaner more minimal look than that.",
            "polarity": 0.0975,
            "subjectivity": 0.6174999999999999
        }
    ]
}