{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-01 09:54:17",
    "ups": "11281",
    "downs": "145",
    "views": "176270",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 34,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I like the black handles hay i was wondering if you would make the sink from wolf children at some point, ive been surching for it for years, its made with pebles that shine realy pritty when wet if you look at botw gorudo town they have the same stone patterns in the cannels and you can do a mix of concrete and resin, i also love water fall like taps just an idea oh and is it possible to make like a dubble bath shower hybrid?",
            "polarity": 0.0638888888888889,
            "subjectivity": 0.4763888888888889
        },
        {
            "body": "1. Lazy susan cabinets, you can never have too much storage OR make a trash chute (not sure what's below).\n2. Separate cooktop and wall oven so practical plus easier to clean. Induction cooktop for safety. If you bake a wall oven is sweet.\n3. Cooktop on island. Had a sink in island - made a  splash mess all over the kitchen and dinette.\n4. Don't change the island. The cooktop fits on the short leg of the L.",
            "polarity": 0.034523809523809526,
            "subjectivity": 0.559126984126984
        },
        {
            "body": "17:15 \"I've got a tonne of work *cut out* for me now\"....I see what you did there",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i would 100% say do not use push to open drawers/cabinets in a kitchen. you lean up against the cabinets/draws a surprising amount when cooking and it just becomes a nightmare opening and closing them all the time. when you have handles, you just naturally avoid them and everything is fine :)",
            "polarity": 0.3433333333333333,
            "subjectivity": 0.58
        },
        {
            "body": "Push to open, much more modern.",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "Can you put the CNC on a Livestream? :) It will just be as satisfying as watching a 3D Printer",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I love the idea of not getting your dirty hands on your cabinets handle when need something. Instead using the back of your hand to push it to open…NEXT LEVEL KICHEN! 👏👏👏",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "MDF is the standard for cabinets in most of europe :D",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Starts watching video: Please, please don't cover all that exposed brick like he has for most of the rest of the building....",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Matte black pulls",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "I vote for the matte black pulls,  you could do both but if you go with just the push to open you set yourself up for a lot of fingerprints which will may stand out on black cabinets.",
            "polarity": -0.1111111111111111,
            "subjectivity": 0.45555555555555555
        },
        {
            "body": "good ol sketchup... It has been a great tool for me. I use it every day for my design work. Before a design hits the cnc I already have a \"final\" design",
            "polarity": 0.5,
            "subjectivity": 0.7833333333333333
        },
        {
            "body": "Push to open would be so cool",
            "polarity": 0.175,
            "subjectivity": 0.575
        }
    ]
}