{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-01 22:16:31",
    "ups": "12207",
    "downs": "157",
    "views": "193556",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 35,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Matte black drawer pulls! I feel like the push to open option might get old/annoying",
            "polarity": -0.10416666666666666,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "Finger pulls will save you from needing to constantly wipe down all the finger/hand grime",
            "polarity": -0.07777777777777779,
            "subjectivity": 0.3111111111111111
        },
        {
            "body": "The way most cabinet makers do cabinet are 4\" toe kick separate from cabinets--and cabinet boxes at 30 1/2\" high;;''.. That way you can set your toe kicks level and then just drop on cabinet boxes. Much easer to make and to install...",
            "polarity": 0.2866666666666667,
            "subjectivity": 0.41333333333333333
        },
        {
            "body": "Push to open",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "In my house we decided to use matte black finish for our kitchen cabinets as well, and I don't know what happened but it gets super dirty quite fast and you can see EVERYTHING, all of the grease, all of the fingerprints, everything. Every time I cook I feel obligated to give it a clean with a rag and product. Do not recommend (I don't remember what the material is, but I know it is wood!).",
            "polarity": 0.045000000000000005,
            "subjectivity": 0.64
        },
        {
            "body": "I like the security camera ad, but doesn't the magnet mounting allow someone to walk off with it?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Definitely no pull! I thought that before you even started mentioning the pull option. Can speak from experience, it’s so nice. The only thing to consider is making sure that wherever finish you use can handle oily fingerprints (natural material cabinet fronts are usually better in this context)",
            "polarity": 0.2833333333333334,
            "subjectivity": 0.7148148148148148
        },
        {
            "body": "Hi! I work for a hardwood plywood company as an Engineer and am so curious if you are using our plywood to make your kitchen cabinets. It will not have our company logo on it but may have a description along the side. I have so enjoyed your videos and this series especially! If you are ever in the Oregon area, I may be able to give you a tour of our facility and you can see first hand how hardwood plywood is made.",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.7316666666666667
        },
        {
            "body": "Hey man I am in your area, I might be able to help you get the deleted footage off the sd cards if you have not used them or wrote over the cards completely. Hit me up if you see this.",
            "polarity": 0.3,
            "subjectivity": 0.5125
        },
        {
            "body": "push to opens are cool but I have had issues with mines, sometimes they don't \"pop out\" as they should and you have to end up prying the cabinet door open from the side with your fingers. Plus functionally, they  can get really dirty! I would go with the matte black handles, good luck!",
            "polarity": 0.06166666666666667,
            "subjectivity": 0.5966666666666667
        },
        {
            "body": "Push to open",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I was really hoping to see all those sheets of plywood on top of the GTI",
            "polarity": 0.35,
            "subjectivity": 0.35
        },
        {
            "body": "Going great!  I can't wait to see the grand tour! You're living my ultimate dream: an all custom home! That Mozaik software is boss. As a bonus I guess you will have extra cabinets (if you don't mind them being made if MDF).",
            "polarity": 0.40625,
            "subjectivity": 0.7125
        },
        {
            "body": "I like the push to open idea, but with my kids that would be a nightmare. Not sure how well child locks would work with those.",
            "polarity": -0.125,
            "subjectivity": 0.6944444444444444
        }
    ]
}