{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-01 18:09:10",
    "ups": "11903",
    "downs": "151",
    "views": "187369",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 35,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        },
        {
            "comment": "Hey bud, just a quick tip. On that drawer bottom. After you glue the bottom up and slide the bottom in, with the drawer upside down you can run a bead of hot melt glue. (Hot glue) around the drawer bottom underneath the drawer so no one would ever see it. And it'll not only hold the loose bottom in place. But it'll keep the bottom from rattling around if the glue up wasn't tight enough and/or didn't hold properly. Just a thought. I sometimes do that after pin nailing the bottom without wood glue. It just makes the drawer building process a bit quicker. I just got done building 5 drawers for my shop and a cabinet to hold them. And I've gotta pick up another sheet of plywood, because the other half the cabinet with house 8 or 10 more drawers.\n\nAlso I think the black pulls look good. But both are awesome.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.14426332926332924,
            "subjectivity": 0.5145889295889297
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Ukrainian illegal night club. It is like when my conservative mom found out the house she was renting out was being used as a brothel. 😂😂😂",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "You cant beat pulling on handles. I dont think you would like the push to open unless it wouldnt get a whole lot of use. If you need something fast you would appreciate classic pull handles.",
            "polarity": 0.14166666666666666,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "I have those matte black pulls and I hate them. Because they are on the tops of the doors and sit horizontally, my clothes get hooked on them constantly.",
            "polarity": -0.32222222222222224,
            "subjectivity": 0.5555555555555556
        },
        {
            "body": "Man, super excited for you. It's coming along. I love your channel. Keep up the great work.\nLooking forward to the following video.",
            "polarity": 0.40166666666666667,
            "subjectivity": 0.5733333333333334
        },
        {
            "body": "One of the things about CNC machines is that it doesn’t take much to have everything go wrong like what happened in this video",
            "polarity": -0.15,
            "subjectivity": 0.55
        },
        {
            "body": "Just as a note if you’re going to shoot the cooktop for any sort of cooking show type thing, get a large mirror to put above to cooktop and have the camera setup shoot the mirror, you just have to get the angles right, you don’t want camera equipment right above a hot stove, it ends badly for them, it’s looking great though, I’m impressed.",
            "polarity": 0.2373015873015873,
            "subjectivity": 0.5518518518518518
        },
        {
            "body": "Cannot stand no pull cabinets in kitchen. You will be cooking, hands dirty and then you need to push open drawer. Guess how that will go. You will be cleaning and wiping your fingers off new kitchen 500 times a day.",
            "polarity": -0.15454545454545454,
            "subjectivity": 0.5848484848484848
        },
        {
            "body": "It's probably way too late, but we put in \"toe kick\" drawers in our kitchen and it was an awesome use of space.  The drawers are perfect to pans, lids, towels etc.  they are out of the way and really add lots of storage.",
            "polarity": 0.475,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "This follow 😍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Flat top range. Wall ovens cost more to service and are a pain to service.",
            "polarity": 0.325,
            "subjectivity": 0.375
        },
        {
            "body": "Awesome series! You'll definitely want the discrete cabinet pulls. Over time fingerprint gum would build up on the finish with messy cooking hands",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "I have a tip for you for making the drawers. I don't know how the software for the CNC you have works but for Blum undermount slides, cut out your sides with grooves (make sure your front and back panel are tall from the groove to the top of the drawer) and then just make the box with sides and front/back and clamp it together then just slide in the bottom and nail it in to the back and front. that makes your drawer perfectly square and you don't even have to check it if you drawer bottom is tightly in place.",
            "polarity": 0.30357142857142855,
            "subjectivity": 0.44576719576719576
        },
        {
            "body": "Use the pulls.  Short of them falling off (which can then be fixed), nothing can go wrong with them ten years from now.  There's value in that.",
            "polarity": -0.1,
            "subjectivity": 0.35
        },
        {
            "body": "Друже, ти занадто багато знаєш) і базікаєш.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "“Hey what are you doing here?”\n🐈: MEOOOOOOOOOW",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey bud, just a quick tip. On that drawer bottom. After you glue the bottom up and slide the bottom in, with the drawer upside down you can run a bead of hot melt glue. (Hot glue) around the drawer bottom underneath the drawer so no one would ever see it. And it'll not only hold the loose bottom in place. But it'll keep the bottom from rattling around if the glue up wasn't tight enough and/or didn't hold properly. Just a thought. I sometimes do that after pin nailing the bottom without wood glue. It just makes the drawer building process a bit quicker. I just got done building 5 drawers for my shop and a cabinet to hold them. And I've gotta pick up another sheet of plywood, because the other half the cabinet with house 8 or 10 more drawers.\n\nAlso I think the black pulls look good. But both are awesome.",
            "polarity": 0.14426332926332924,
            "subjectivity": 0.5145889295889297
        },
        {
            "body": "black pull handles!! they're going to complete the look",
            "polarity": -0.08020833333333331,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "Do the modern double wall ovens! An island with an overhang/bigger counter with barstools will definitely boost resale value. That's what people definitely look for in homes. Even if it's not made with concrete.",
            "polarity": 0.07,
            "subjectivity": 0.32
        },
        {
            "body": "Regarding the Double Wall oven...  I have a Double oven where the Top oven is multi function.  It can work as a microwave or a convection oven.  It is great.  I did not want a separate Microwave as I rarely use them.\n\nWith your island cooktop..  \n1. Induction Cooktops can't be beat\n2. How are you going to vent it outside?  \n\nin the corner you have  blind spot Consider some kind of butlers pantry for things like air fryers and Food processors and stuff.",
            "polarity": 0.21250000000000002,
            "subjectivity": 0.47083333333333327
        }
    ]
}