{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-01 14:01:51",
    "ups": "11556",
    "downs": "146",
    "views": "180519",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 35,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "3400 in plywood lol woowee",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Not sure which smells better....a lumber yard or a cigar humidor.  Both I could spend hours in..",
            "polarity": -0.25,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "Definitely pulls, there's nothing more annoying than those push to pop open cabinets",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.6
        },
        {
            "body": "If someone is sponsoring hardware. Go with the push to open ones.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Wooo! Congrats on starting the kitchen project at long last!",
            "polarity": -0.016666666666666666,
            "subjectivity": 0.18888888888888888
        },
        {
            "body": "I agree with many comments, fingerprints will be very visible on matt black fronts so the pulls will probably be a more \"clean\" option.",
            "polarity": 0.27999999999999997,
            "subjectivity": 0.4866666666666667
        },
        {
            "body": "Matte Black handle pulls for sure!",
            "polarity": 0.22916666666666669,
            "subjectivity": 0.6611111111111111
        },
        {
            "body": "I love watching your videos for how informative and fun you make things. I also love that you are an unashamed catguy (some guys act like cats are girly). Much love to you and your old man from me and my old girl (17 year old maine coon-siamese mix).",
            "polarity": 0.20000000000000004,
            "subjectivity": 0.43750000000000006
        },
        {
            "body": "Hi! I can't tell you how much I enjoy your videos. I am a kitchen designer and I would strongly suggest you go with a pull or a knob. Over the years you will wind up wearing off the finish to your cabinets just due to wear and tear of opening the cabinets",
            "polarity": 0.23611111111111108,
            "subjectivity": 0.5361111111111111
        },
        {
            "body": "I had the push to open in my kitchen (matt green) and quickly decided to add some (very similar to yours) finger pulls because of all the finger prints I was getting on all the doors and drawers...",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.455
        },
        {
            "body": "use the matte black pulls, they are cool!",
            "polarity": 0.13541666666666669,
            "subjectivity": 0.5416666666666667
        },
        {
            "body": "6:39 Question, those holes for the Euro hinges look huge... are you putting in an insert into these holes or is there a reason they are so huge? Reason being I was doing some cabinetry this weekend and was using a Kreg jig to cut mine and they were tiny little holes but I have seen others that use a small plastic threaded insert.",
            "polarity": 0.07250000000000004,
            "subjectivity": 0.6399999999999999
        },
        {
            "body": "12:50 Is it because that is the width of your bit and that's the smallest dado you can cut without changing the bit?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I've really enjoyed following along this journey. I don't know if it's just me but it's seems like this build has been super quick. Especially considering you done it mostly yourself. Can't wait to see finished result. Love from Australia 🇦🇺",
            "polarity": 0.3095238095238095,
            "subjectivity": 0.5809523809523809
        },
        {
            "body": "Hidden kickplate storage!",
            "polarity": -0.20833333333333331,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Push to open. Way cleaner.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I would do push to open so you don’t get your clothes caught on the handle",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I would say ask your wife.\nA happy wife a happy life😉😎",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "Do both! It'll let you have the options for when your hands are full etc. and it'll provide options for people with impairments when they visit :)",
            "polarity": 0.425,
            "subjectivity": 0.775
        }
    ]
}