{
    "time_posted": "2021-10-30 14:39:23",
    "url": "https://www.youtube.com/watch?v=G_w10itlBtI",
    "time_now": "2021-11-01 05:47:24",
    "ups": "11044",
    "downs": "138",
    "views": "171109",
    "top_comments": [
        {
            "comment": "Visit https://simplisafe.com/modustrial to learn more and to get at least 30% off your SimpliSafe security system!",
            "likes": 34,
            "number_of_replies": 6,
            "polarity": 0.0625,
            "subjectivity": 0.45
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I think both would be good since you never know which you'll prefer until you use them, and neither is particularly expensive to implement since the pulls are cheap and you're already using the tracks.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Leather tabs or loops would be a really cool alternative handle. Consider stamping them with a custom mark.",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "Want simplicity? Keep doors/drawers simple as well. \nCabinets with integrated handles will have an inwardly beveled edge for your fingers to stick into, allowing you to pull the drawer/door open toward you. The space created by this design will appear as a clean, recessed gap between each cabinet or drawer. \nNote that the front face of each drawer/door is full/flat. The beveled section is recessed... from the outside edge, then diagonalish towards the inside edge. \nHard to explain, but I hope you get the idea, i have them carved into my built-in cabinets and love them.",
            "polarity": 0.09583333333333333,
            "subjectivity": 0.45813492063492073
        },
        {
            "body": "I had someone say they loved the push to open cos when they needed something and their hands were dirty/wet/, they could hit it with their knee or whatever and grab what they needed. \nThe pulls are good to have too cos, when you have friends over you WILL NEED TO SHOW EVERY LAST ONE OF THEM how the kitchen works if it doesnt have pulls on there.",
            "polarity": 0.35,
            "subjectivity": 0.4916666666666667
        },
        {
            "body": "No waterfall edges on the countertops?? would look good just saying",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Go with push to open drawers...they always just seem more premium and will give you a better resale value",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "I mean...you _could_ do a cooking show after you're done renovating and in-between video ideas....\n\"Today on Modustrial Maker: Muffins\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Push to open gets my vote. Not a handle to be seen in my (non DIY) kitchen and it looks super clean – Also nothing to catch on or hit off.",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.6222222222222222
        },
        {
            "body": "Push to open could leave a lot of finger prints",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Licensed cabinetmaker here and I gotta say I do understand your desire for cabinets without any pulls, however, the one I have in my shop failed in about 3 months and I found that if I kicked it a certain way it would work. \n\nAs for the pulls that you showed us, they would be great on your uppers but for drawer units, they leave a snag hazard and you will catch your pant leg and may even rip your pants open.   Just some thoughts.",
            "polarity": 0.1285714285714286,
            "subjectivity": 0.5303571428571429
        },
        {
            "body": "If you're going matte black, you DON'T want push to open.  You are going to be cleaning greasy fingerprints off of the cabinets all the time.  The door pulls keep hands in the same spot, less cleaning.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.28125
        },
        {
            "body": "Kat crushed the editing on this",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "My thoughts are for the matte black pulls. A simple handle would make a big difference.",
            "polarity": -0.05555555555555555,
            "subjectivity": 0.2968253968253968
        },
        {
            "body": "push to open all day long homie",
            "polarity": -0.025,
            "subjectivity": 0.45
        },
        {
            "body": "Will you need exhaust over the range per code?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If you're going to use cables the square edge might snag.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As an accessibility preference finger pulls not push to open",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Oof. Your work triangle.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My dad put his microwave into his island and later regretted it. You end up using it more than you think and as crazy as it sounds bending over all the time is a pain.",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.4666666666666666
        }
    ]
}