{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-10-31 05:04:56",
    "ups": "3926",
    "downs": "46",
    "views": "89607",
    "top_comments": [
        {
            "comment": "People will be kicking themselves in regret in few weeks, if they miss the opportunity to invest now",
            "likes": 32,
            "number_of_replies": 15,
            "polarity": -0.2,
            "subjectivity": 0.1
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Faith and belief in the positive is of paramount importance. Positive momentum will begin - fear will give way to love. Those who believe in fear will remain scared and continue to attract the vary life they fear.",
            "polarity": 0.3181818181818182,
            "subjectivity": 0.5636363636363636
        },
        {
            "body": "He Must Win for sanity sake",
            "polarity": 0.8,
            "subjectivity": 0.4
        },
        {
            "body": "Parents have every right to know and to decide what they are teaching our children. We the parents make the decisions for the health and wellbeing of our children and It is NOT up to government to decide what is best. They are Not the parent! Stop trying g to control the people of this country!",
            "polarity": 0.6428571428571428,
            "subjectivity": 0.4178571428571428
        },
        {
            "body": "Obumbum is a snayke.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Like I'm believing a Fox News poll?  You must be kidding.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "MCCauliffe has said the silent part of what the democrats believe out loud. I think this will affect many electoral races across the country.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "McAuliffe was behind the CHARLOTTESVILLE RIOTS in 2017, telling his cops to STAND DOWN. \r\nOh and yes, he's an ANDREW McCABE/CLINTON/OBAMAGATE shill!",
            "polarity": -0.2972222222222223,
            "subjectivity": 0.49444444444444446
        },
        {
            "body": "McAuliffe the olive is to ripe to turn this around he shot himself in the foot when he said that parents have no control of what their children learn.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "DON'T VOTE, folks. Youngkin is a RINO, an investment banker vulture capitalist. RINOs/Dumbos, there's no difference. True Trump Backers understand. But most of you don't, apparently. Time to sniff the truth. It's all rigged by the deep state.",
            "polarity": 0.225,
            "subjectivity": 0.475
        },
        {
            "body": "I hope Youngkin wins but with America you just never know lots of liberal people out there.",
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "body": "Wonder how the Dems will cheat on this election too",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The broader a child's academic education the more successful they will be.  CRT is not academics, especially in K-12.  Success comes in many forms, even if it is collecting trash.  I never agreed that there should be such disparity of wages in necessary jobs.  Congressmen and senators should NEVER receive twice, or more than twice, the salary of a garbage man.  If anything, congressmen and senator's salary should be exactly that of the highest SSI recipient.  Same with CEOs — no more than twice the top salary in a company with only increase wages for accumulated time with a company based on a beginning wage structure and a piece of the business after 10 years.",
            "polarity": 0.21785714285714283,
            "subjectivity": 0.5232142857142857
        },
        {
            "body": "Awesome news..... LET'S GO BRANDON...!!! LET'S GO BRANDON...!!! LET'S GO BRANDON...!!! LET'S GO BRANDON...!!!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "People will be kicking themselves in regret in few weeks, if they miss the opportunity to invest now",
            "polarity": -0.2,
            "subjectivity": 0.1
        },
        {
            "body": "But the problem is the affluent Indians of Northern Virginia send their kids to private schools and still vote democrat because they think it is morally right. SMH",
            "polarity": 0.31190476190476185,
            "subjectivity": 0.6202380952380953
        },
        {
            "body": "Democrats are going to cheat like they always do",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You don’t think parents should tell schools what they should teach?  I’ll support that thought if you also agree, a school shouldn’t tell a parent what their kid should be taught. \nAll the sudden you find yourself in a quagmire.  \nAll news organizations are Fake News. If there is ANY political slant then it’s no longer news.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Go Youngkin",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is how election is going to play out in VA: yougkin wins the night; mail in ballots and provisional ballots are going to hand McAuliffe the win a week later once Democrats find enough ballots!",
            "polarity": 0.275,
            "subjectivity": 0.275
        }
    ]
}