{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-10-31 09:11:45",
    "ups": "4050",
    "downs": "51",
    "views": "94052",
    "top_comments": [
        {
            "comment": "I only care about the presidential race and i hate kids.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.4,
            "subjectivity": 0.95
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "School should teach facts. Evolution, racial issues, womens issues, lgbtq issues, The US failures and what we have done wrong through out history and facts about this pandemic. It’s ignorant to only teach what people what to want to hear. The world and its issues are bigger then just your opinion and what you think. Facts are facts and we need to teach the FACTS not just right or left ideals. Facts don’t care about your political ideology.",
            "polarity": -0.03571428571428572,
            "subjectivity": 0.5059523809523809
        },
        {
            "body": "I'm so proud of Virginia!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Back to basics that’s what people want and Biden impeached.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What ever happened to the PTA?  The Democrats are NUTS if they now think PARENTS should no longer be a part of their own children's education!",
            "polarity": 0.75,
            "subjectivity": 1.0
        },
        {
            "body": "Democrats want to run on Hollywood profiling and lies for decades. The PUBLIC is over their self-absorbed internet dependent NO life, most. Now these FREE brains are craving stimulation with REAL news, facts and stats and rejecting indoctrination by opinion! Educate yourself and NOT on MSM 90% and cast a REAL vote. If you haven't researched then don't vote. We are in this mess because we didn't do our due diligence in 2012!",
            "polarity": 0.14553571428571427,
            "subjectivity": 0.3595238095238095
        },
        {
            "body": "Virginia we need to stand together for our kids and grandkids vote youngkin! USMC 🇺🇸",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You want to teach your leftist values get your own schools",
            "polarity": 0.27499999999999997,
            "subjectivity": 0.8
        },
        {
            "body": "Wow!..i hope he will survive the last hour dirty election tricks by dems  and media mobs that will make everyone shock something about the result like in  CA..I really hope he will win.💗",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.35555555555555557
        },
        {
            "body": "if the votes are not fix, then nothing will change !!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank God. God is working through our GOP leaders.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Surprise, Surprise… Democrats favor state control over individual freedom and personal responsibility…Surprise, Surprise…",
            "polarity": 0.0,
            "subjectivity": 0.35
        },
        {
            "body": "I only care about the presidential race and i hate kids.",
            "polarity": -0.4,
            "subjectivity": 0.95
        }
    ]
}