{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-10-31 21:32:47",
    "ups": "4324",
    "downs": "59",
    "views": "102013",
    "top_comments": [
        {
            "comment": "Praise the Lord Jesus for Glenn Youngkin !",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "LET'S  -  GO  -  BRANDON. & Xxxx YOU Joey B'.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The LIARS of MXNBC & CNN are telling their REMAINING FEW REVIEWERS that the RACE IS VERY CLOSE. Hah.",
            "polarity": 0.0,
            "subjectivity": 0.2
        },
        {
            "body": "Praise the Lord Jesus for Glenn Youngkin !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "BTW, why did Fox cancel Rudy Guilliani.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Me and G-d have a conflicting relationship, he hates me and I'm ok with that.\n\nBut please G-d let Youngkin win, not for me but for the US.",
            "polarity": 0.65,
            "subjectivity": 0.45
        },
        {
            "body": "This is what Pol Pot did. Take out the parents and turn them against family. It is a socialist /communist tactic that has been tried before. Suddenly your children rely on the teacher more then the parent. That's when the fun starts, as they get the kids to turn on their families. We should fire every teacher that thinks this way. They are our children.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "Voter fraud, dems have this won.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Let’s go Brandon and Trudeau stop communism in Canada and the USA",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The dem establishment rino party must finally be abolished",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "When them same criminal law ppl was the ones pushing the trump Russian coup that’s a story this i$ the dem last effort to change the narrative of politics to lies and propaganda like the dem paid race hustlers trying to push the republicans candidate is a racis5 this is slander a lie and is very troubling to see the dem is pushing civil war again in America",
            "polarity": -0.049999999999999996,
            "subjectivity": 0.19027777777777777
        },
        {
            "body": "Mcauliffe is a communist. Crimes against humanity. He is going to jail, he’s a liar and a thief",
            "polarity": -0.1,
            "subjectivity": 0.0
        },
        {
            "body": "Hey, Virginians get out and vote for Youngkin.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ha ha ha!!! politicians should not mess with mothers when it comes to their kids🤣🤗🤗",
            "polarity": 0.0875,
            "subjectivity": 0.175
        },
        {
            "body": "Great man,praying for you buddy 🙏",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Check it out - I'M GOING TO VIRGINIA AND VOTING FOR HIM!  SO TAKE THAT YOU F*CKING IDIOT BIDEN!",
            "polarity": -1.0,
            "subjectivity": 0.8
        },
        {
            "body": "Like Ronald Reagan said, liberty is always in danger just a generation away. We need I generation of brain washed citizens to change course. Education is fundamental.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Education and parents having control being a priority does not just mean 'critical race theory'. It's about school choice and sexual material etc being thrown at kids when too young etc. If the focus on education is just on 'critical race theory', sooner or later it's going to make black voters think 'Are we in agreement here to walk together on the subject of education or critical race theory'. If it's education being the priority, we have much in common, but if it's critical race theory, I don't like it, but there is much more that concerns me than that. It's important that 'critical race theory is not all that is talked about when it comes to education. Parents have made themselves clear that it is much more than 'critical race theory' that has bothered them by what they gave said in school governor's meetings. If this is now ignored and all that is discussed is 'critical race theory' they are soon going to feel they are not really being heard, but just being used for racial battles they  are less concerned about and that risk splitting them on racial lines. What brings them together is education and the control they have on what their children are taught as they expressed in the meetings and protest. That's what keeps them together. Just focusing on critical race theory alone will soon make some feel marginalised by turning education and parents being in control of what their children are taught into a race issue.",
            "polarity": 0.042261904761904764,
            "subjectivity": 0.5827380952380953
        }
    ]
}