{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-11-01 14:01:44",
    "ups": "4671",
    "downs": "68",
    "views": "113321",
    "top_comments": [
        {
            "comment": "If Younkin wins I will move to VA instead of MD.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "comment": "I can't believe Obama said such words insulting those parents\nhe is a traitor \nWake up America",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.5,
            "subjectivity": 0.75
        },
        {
            "comment": "For the grace of God has appeared . . . instructing us to deny ungodliness and worldly desires and to live sensibly, righteously and godly in the present age.\nTitus 2:11-12;\n\nHave FAITH in God! God’s will is being done! The Democratic Socialist party has lost their agenda!\nAnd we know that all things work together for good to them that love God, to them who are the called according to his purpose.\n🙏🙏🙏❤️Amen!❤️🙏🙏🙏",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3340909090909091,
            "subjectivity": 0.42500000000000004
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "House polls worked out so far better go vote",
            "polarity": 0.3,
            "subjectivity": 0.75
        },
        {
            "body": "If Younkin wins I will move to VA instead of MD.",
            "polarity": 0.3,
            "subjectivity": 0.2
        },
        {
            "body": "There no such thing as real  voting, it just like believing in santa claus.",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "These school  got pedofile mentalities I’m scared for our innocent children",
            "polarity": 0.5,
            "subjectivity": 0.7
        },
        {
            "body": "Only if we can get a honest vote count.",
            "polarity": 0.3,
            "subjectivity": 0.95
        },
        {
            "body": "Democrats seem to do all the vote counting! An 8 point lead won't get the job done.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Defund the school boards",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What that guy say🤔ummm I think us Americans pay teachers and government and most other government jobs lol you don't tell us we tell you so watch your words mister or like trump says your fired because we have the say you do what we say iv heard seen enough I'm a parent that's had enough of this b.s. dare that guy to say this crap to my face",
            "polarity": 0.0625,
            "subjectivity": 0.5625
        },
        {
            "body": "For Republicans, that means reading a whole book.",
            "polarity": 0.2,
            "subjectivity": 0.4
        },
        {
            "body": "Democrats are destroying America and Virginia!",
            "polarity": -0.25,
            "subjectivity": 0.0
        },
        {
            "body": "I live in Virginia! Terry did not do anything for Virginians! Let's give a Republican governor a chance! Terry is against our 2nd Amendment! He is for killing babies too! Parents have the right to know what our kids are doing at school! Vote RED!",
            "polarity": 0.15586952110389607,
            "subjectivity": 0.2589285714285714
        },
        {
            "body": "One down and 49 more to go, hoping this is the start of booting out these destructive leftist's from our lives.",
            "polarity": -0.07638888888888888,
            "subjectivity": 0.49722222222222223
        },
        {
            "body": "Our voice our vote don’t be silent!",
            "polarity": 0.0,
            "subjectivity": 0.1
        }
    ]
}