{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-10-30 20:51:44",
    "ups": "2993",
    "downs": "26",
    "views": "59372",
    "top_comments": [
        {
            "comment": "Let's Go Brandon!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Until the polling shows a consistent 10+ point lead by Youngkin, I would still not be surprised if the Democrat election & vote counting/packing shenanigans could still turn this around for their candidate.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.175,
            "subjectivity": 0.575
        },
        {
            "comment": "Come on VA, get Youngkin in office to save yourself and your kids! 🦅🇺🇲💪",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Let's Go Brandon!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't get your hope too high. The most sophisticated election fraud squad is still alive and kicking.",
            "polarity": 0.31500000000000006,
            "subjectivity": 0.61
        },
        {
            "body": "Come on VA, get Youngkin in office to save yourself and your kids! 🦅🇺🇲💪",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "THE GOVERNMENT IS AFTER YOUR CHILDREN AMERICA!!! DON'T BE A FOOL!!! FOOLS LOSE!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So you're saying those FOOLS were going to lean Democrat???? Am I dreaming????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "But you don't understand.  I'm white and on that basis, it's been proven, that on the grounds of my color, I'm an evil person.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Vote red Virginia!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "GODS MANDATES, NOT BIDENS MANDATES!!\nWhen the government fears the people, Liberty is there.\n🙏🇺🇸",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "TERRY MCAULIFFE IS A SEDITIOUS FIGURE AND A CLINTON BAGMAN",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Citizens of Virginia vote for Youngkin we need your support for your Children's Education...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The tide is turning! \n*LET'S GO BRANDON!*",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Buck Fiden!!!! Youngkin now and getting rid of Biden in 2024!!! Let's Go Brandon!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well Fox News had it right on Arizona during election night, I guess this poll is real then.",
            "polarity": 0.24285714285714285,
            "subjectivity": 0.41785714285714287
        },
        {
            "body": "If parents choose the curriculum, you'd have different teachings in every state which would further the divide in this country. Do we honestly think most parents are that intelligent?? Just imagine the opposing party and how stupid you think their beliefs are...now imagine they get to push those beliefs into schools only based upon a voting majority. Seems like a great way to alienate conservatives who happen to live in cities/suburbs.",
            "polarity": 0.22626262626262628,
            "subjectivity": 0.7388888888888889
        },
        {
            "body": "The commies are all Out to Corrupt our Children- it's in their play book. Their very Good at Destroying Countries. We Need to Stay on Top of all the people in positions from small to large!! That's how the Commies Do it they get their Evil into every positions of Authority- we can Never afford to let our Gaurd Down again!! EVER",
            "polarity": -0.05602926587301588,
            "subjectivity": 0.5496825396825397
        },
        {
            "body": "He is a idiot and dose not belong in politics",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "Until the polling shows a consistent 10+ point lead by Youngkin, I would still not be surprised if the Democrat election & vote counting/packing shenanigans could still turn this around for their candidate.",
            "polarity": 0.175,
            "subjectivity": 0.575
        },
        {
            "body": "I Predict Republicans will lead the race till midnight Monday night and  a large ballot dump will come in and Democrats will win last minute and we have to eat whatever leftist Garbage the Media decides to spin kinda feel like last November",
            "polarity": 0.19285714285714284,
            "subjectivity": 0.31238095238095237
        },
        {
            "body": "It’s tragic how Terry doesn’t support school choice… while sending his own kids to a very expensive private school.",
            "polarity": -0.2,
            "subjectivity": 0.75875
        },
        {
            "body": "The problem is taxes. How did 91 fortune 500 companies pay ZERO in tax in 2019? Firefighters and Teaches pay 22%. Think how many big projects we could build in America with American labor and American products. So many jobs! Now we can't afford it because of that big Trump tax cut for the rich and huge companies. If everyone was working and earning no one would be fighting.  Give us the infrastructure jobs!",
            "polarity": 0.25,
            "subjectivity": 0.35625
        }
    ]
}