{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-11-01 09:54:11",
    "ups": "4590",
    "downs": "67",
    "views": "111208",
    "top_comments": [
        {
            "comment": "I can't believe Obama said such words insulting those parents\nhe is a traitor \nWake up America",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.5,
            "subjectivity": 0.75
        },
        {
            "comment": "MY OPINION IS THAT BIDEN IS THE VERY WORST SOUGHT OF COWARD, LEAVING AND ABANDONING  COUNTRYMAN AND BRAVE MILITARY IN THE LURCH TO BE TORTURE'D AND MANY DIE DESPITE HIS EMPTY PROMISES, THEN HE GREETS THEIR COFFINS WITHOUT A TEAR, MORE INTERESTED IN HIS WRISTWATCH. \nHIS COLD HEARTED COWARDNESS IS SIMPLY BEYOND WORDS. WHEN HAS THIS NASTY PIECE OF WORK EVER PUT HIS LIFE ON THE LINE, THE MAN MAKES ME CRINGE. THESE ARE MY OPINIONS BUT I WONDER\nHOW MANY WILL ADD THEIR NAME. \n\nJOHN KENNEDY AND TED CRUZ SHOULD RUN FOR PRESIDENT AND VICE PRESIDENT, EITHER ONE FOR EITHER POST, WHAT A TEAM THIS WOULD BE.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.022727272727272717,
            "subjectivity": 0.6324675324675324
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "For the grace of God has appeared . . . instructing us to deny ungodliness and worldly desires and to live sensibly, righteously and godly in the present age.\nTitus 2:11-12;\n\nHave FAITH in God! God’s will is being done! The Democratic Socialist party has lost their agenda!\nAnd we know that all things work together for good to them that love God, to them who are the called according to his purpose.\n🙏🙏🙏❤️Amen!❤️🙏🙏🙏",
            "polarity": 0.3340909090909091,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "I can't believe Obama said such words insulting those parents\nhe is a traitor \nWake up America",
            "polarity": -0.5,
            "subjectivity": 0.75
        },
        {
            "body": "There is nothing more important to parents then there children and when someone says to a parent they have no business in there children's education the blood begins to boil and when CRT is being taught to there children and being told they are racist, That's the end of there political career. Now you will see Democrat politicians not saying  what McAuliffe said even though they believed him because they are disingenuous.",
            "polarity": 0.3,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "F  fox news and all its bs distraction tactics    disgusting what the media does today   controlled opposition, people,   please stop supporting them on the u tube platform",
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "body": "Obama has a serious ego and he was actually annoyed that he had to come down to Virginia and stump for a weak candidate. The little people aren’t worthy of his time and greatness and we’d better get our heads on straight and toe the line. Let’s Go Brandon!",
            "polarity": -0.04600694444444445,
            "subjectivity": 0.5975694444444445
        },
        {
            "body": "The election will be rigged, VA will remain blue, y’all did but speak up about 2020 what you expect?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Parents are the best for their children…How sick to think the Marxists teachers know best.",
            "polarity": 0.42857142857142855,
            "subjectivity": 0.4857142857142857
        }
    ]
}