{
    "time_posted": "2021-10-30 11:30:06",
    "url": "https://www.youtube.com/watch?v=gWYcQ_pHemU",
    "time_now": "2021-10-31 00:58:05",
    "ups": "3617",
    "downs": "39",
    "views": "78448",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I'll bet the Democrat wins watch. Magic elections.",
            "polarity": 0.4,
            "subjectivity": 0.6
        },
        {
            "body": "The bane of the Socialist Democrat. Thinking they can dictate what freedoms a free society can and cannot engage in.",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "McAuliffe is a failed politician that now wants to come back into the picture...I've also learned that politicians that flip flop in order to gain votes should not be considered for any position in government.  He clearly said...It is not the parents that need to say what their children are taught...now he wants to back track or flip flop because he only wants to be in power...he is not trustworthy.",
            "polarity": 0.02500000000000001,
            "subjectivity": 0.24791666666666667
        },
        {
            "body": "obama is a Idiot to",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "Fear-mongering, and misinformation at its finest! nobody does it better than Fox Nonsense! Fox is the king of propaganda and anger!!! Fox is the worst \"network\" of misinformation and propaganda there is! who had to admit in a court of law that no reasonable person should believe anything said on Fox is a fact, the truth, or even real! It's all just a show to suck in gullible people who are looking for someone to validate the conspiracy theories they believe and that is where Fox comes in to feed their nonsensical beliefs! Fox does this solely for ratings and money and nobody should listen to anything said on Fox EVER!",
            "polarity": -0.18705357142857146,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "McAuliffe: \"Parents should be seen and not heard!\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "mcauliffe is a absolute idiot must be related to biden",
            "polarity": -0.20000000000000004,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Oh no it's going to be a mess now I can't imagine  every parent have an opinion some parents are crazy and stubborn and have different beliefs we should leave it up to people that actually have years of practice and knowledge this is what happens when we get politics involved.. some kids parents are  dumbasses to but at the same time some teachers have  chosen to overstepped their boundaries by teaching our kids about different pronoun instead of sticking to the basics allowing their own beliefs interfere with our children education and we need better teachers and  need to pay them a good salary because at the end of the day they do have our kids majority of the time and not all kids are good it's a handful but they had this coming 4 being disrespectful about it and rubbing it in parents face you don't say the quiet part out loud",
            "polarity": 0.15208333333333332,
            "subjectivity": 0.5277777777777777
        },
        {
            "body": "Employment under biden is the best in history, plus wages are up substanialy.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Oh yes - once you tell an angry mother when trying to protect their children that there’s no problem they will definitely just be quieter and of course the problem will just go away! Haha",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.6
        },
        {
            "body": "They will find a way to cheat ,,,, the demonic democrats will create more votes like they did for Trump , and we let them get away with it !!!!",
            "polarity": 1.0,
            "subjectivity": 0.5
        },
        {
            "body": "This is fox. So it is not true!",
            "polarity": -0.21875,
            "subjectivity": 0.65
        },
        {
            "body": "Republicans are only trying to get slavery back for every one this time. Black and white. Slaves don't need to be educated and your kids can go to private schools if you have tons of money to pay for it to keep your kids from being slaves.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.3616666666666667
        },
        {
            "body": "Get woke,\nGo ..... Home!\nSelf-Destruct with truth!\nSupport Judicial Watch & Project Veritas!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If Virginia votes for McAuliffe it shows they absolutely just don't freaking care and their just programmed to vote who the big media tells them to vote for.",
            "polarity": 0.1,
            "subjectivity": 0.5
        },
        {
            "body": "mcualliff knows jack shet.. I LIVE IN VA ...I SURE THE NECK DIDNT VOTE FOR HIM",
            "polarity": 0.3181818181818182,
            "subjectivity": 0.6944444444444444
        },
        {
            "body": "What was that guy thinking saying parents shouldn't have any say in their children's education. It's obvious he wasn't aware of how serious and pornographic these books parents wanted removed were.  They were definitely not appropriate for a school library. What an idiot...",
            "polarity": -0.22666666666666666,
            "subjectivity": 0.5433333333333333
        },
        {
            "body": "It looks like McAuliffe is on Crack Virginians must Fired this Psychopath and elect Youngkin.",
            "polarity": 0.8,
            "subjectivity": 0.9
        }
    ]
}