{
    "time_posted": "2021-10-30 14:30:06",
    "url": "https://www.youtube.com/watch?v=ijkvTYX1eAc",
    "time_now": "2021-10-31 05:04:36",
    "ups": "3494",
    "downs": "16",
    "views": "48707",
    "top_comments": [
        {
            "comment": "Lucario: \"Not yet, Ash! I can do this!\"",
            "likes": 323,
            "number_of_replies": 6,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "The pros:\nFinally getting ash Pokémon team being together\nAshs lucario being his own trainer to await mega evolution\nCons:ashs battling here is too off. He gets both Pikachu and lucario to close in multiple times despite both of them getting trapped in the past going against her\nI didn't like how lucario was being used here. He's being used to fight 3 Pokémon in a row despite supposedly being the ace in the fight for mega evolution. Against valkner it was fine because gengar was down and Pikachu had to save more energy for later on. You would think he'd use lucario a bit less for the battle until came down against dynamax.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.05353535353535354,
            "subjectivity": 0.35404040404040404
        },
        {
            "comment": "Wow I just realised there are many fighting type trainers, like Chuck, Dojo master, Maylene, Korina, Hala, Bea and more:o",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.75
        },
        {
            "comment": "very cool",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.45499999999999996,
            "subjectivity": 0.8450000000000001
        },
        {
            "comment": "Leon would have gotten there sooner, but he got lost, lol...",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.8,
            "subjectivity": 0.7
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "very cool",
            "polarity": 0.45499999999999996,
            "subjectivity": 0.8450000000000001
        },
        {
            "body": "How I think Pokémon will end\nFirst of all ash friends all of them will return to see him battle Leon and then basically have a good battle with Leon but it will end like this ash will use Pikachu 10 million thunderbolt to use against Leon's strongest move of his g max charizard then ash and pikachu will reflect all the things they did in their journey like travels,battle and his friends and will all of that ash and pikachu use the z move to its full potential and destroy Leon's charizard and the arena and after the arena is destroyed and the dust is cleared ash I will win as charizard falls,he becomes the Pokémon master and the ho oh will come and give ash it's feather indicating that it wants ash to find and catch it and ash will go on journey with Pikachu only to find and catch ho oh while all evil teams in the anime will follow ash to catch it and when ash has catch ho oh all will come and try to steal ho oh and then while all are battling they all escape and get on their ships while ash will escape to pallet town where all of his friends are throwing a suprise party as he caught ho oh but then ash tell what happen then sky will turn red and all evil teams joint together and try to steal ho oh giving ash warning they will come tommorow if ash surrender they will leave pallet town in harmed but ash gather all his Pokémons to use their strongest Pokémon moves to destroy ships and then ash will sue Pikachu z move 10 million thunderbolt to destroy everything in site while his friends will also help and then after all ships destroy Giovanni will come in helicopter with ash mom and then kidnap ash and then reveal in team rocket head quarters that he his is one of his two sons, ash will be shocked and run away in woods away from everyone while ash will be in woods ash friends tell what ash do to them and tell it doesn't matter who is father is and then all will come together and fight Giovanni while uses Mewtwo while he reveals he has caught Mewtwo and ash will fight it will ho oh and win while red will come and reveal that he is his older brother and then ash and red will battle ash .",
            "polarity": -0.012280701754385961,
            "subjectivity": 0.3956140350877193
        },
        {
            "body": "Bond Getting Stronger as Lucario Not Exhausted yet to be Mega Evolve.. it's so damn interesting..",
            "polarity": 0.35,
            "subjectivity": 0.6
        },
        {
            "body": "Great rating however you glossed over a detail that I think was never mentioned before which is that Ash can only use 1 mechanic mega, z move or gmax. If this was said before then I didn't catch but if it is the first time that it's mentioned its actually a pretty big detail cause it undercuts Ash's OP team which further accentuates my theory that Ash final battle pokemon will be Pikachu and not Lucario like many believe",
            "polarity": 0.225,
            "subjectivity": 0.6479166666666667
        },
        {
            "body": "I want serena. :(",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "body": "I guess the 3rd Pokemon is Dragonight",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I feel like the reason why Ash lost to Alain in the Kalos League, its because Alain is in the Master 8 and Ash will bring back \"SATOSHI GEKKOUGA\", to battle and beat him, that will be insane!",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Wow I just realised there are many fighting type trainers, like Chuck, Dojo master, Maylene, Korina, Hala, Bea and more:o",
            "polarity": 0.3,
            "subjectivity": 0.75
        },
        {
            "body": "When Leon showed up I got goosebumps",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I realllllly wish Korrina would be a permanent companion",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Korrina hugged bea aswell",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I never thought I could take getting to see Ash's Pokemon just have meals together and interact for granted but Journeys has made me realize otherwise. The interactions in the first half were such a nice breath of fresh air and really what this series needs more of. It's trying so hard to rush all over the place and do random things and not taking any time to stop and smell the roses. Episodes like this show those little things can really make a big difference.\n\nBut seriously though. This episode is like the first time we Ash send his whole team out together in one seen. That's kinda crazy considering he caught Dracovish like 35 episodes ago.",
            "polarity": 0.02630208333333333,
            "subjectivity": 0.45885416666666673
        },
        {
            "body": "Im hyped for the next episode who else is.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Zac how do you watch the Japanese dub?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}