{
    "time_posted": "2021-10-30 14:30:06",
    "url": "https://www.youtube.com/watch?v=ijkvTYX1eAc",
    "time_now": "2021-11-06 05:17:04",
    "ups": "4688",
    "downs": "30",
    "views": "88413",
    "top_comments": [
        {
            "comment": "Lucario: \"Not yet, Ash! I can do this!\"",
            "likes": 476,
            "number_of_replies": 7,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I say 8.5 because lucario got beat up like a rag doll, would be nice to show ash having better strategies. It gets a boost just because of Leon is so cool I bet the next episode will be a 10!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.36250000000000004,
            "subjectivity": 0.5375
        },
        {
            "comment": "SS085=91.87%\n(Korrina and Bea are actually friends? I didn't know about that. Korrina even give some chocolates and cries to Bea for not bringing her favorite chocolate. Their relationship is kinda heartwarming and cool at the same time. The relationship between Ash's pokémon,Bea's pokémon and Korrina's Lucario is also heartwarming. Korrina and Bea can be rivals to be honest. I wish that they are battling against each other from time to time. Speaking of battle,the battle itself so far is excellent. The battle really shows how strong and powerful Bea's pokémon are. There are also clever strategies here like Bea's Grapploct using Close Combat on Ash's Pikachu while the Grapploct is still locked by Pikachu's Electroweb and Bea's Machamp using Bullet Punch on Ash's Lucario while squeezing Lucario by Machamp's two hands. There are also some several switching moments just like Ash's previous World Coronation Series match. The greatest moment in this episode is the one where Ash's Lucario refuses to mega evolve just yet. That shows how Ash's Lucario determined in winning the battle and cares about Ash. That moment kinda reminds me of Ash's Lycanroc during its grand trial battle against Nanu's pokémon. This episode is a great start for the rematch between Ash and Bea. I just hope that Go recognizes that he somehow cross the stadium before during the Darkest Day Arc.)\n\nHIGHLIGHTS:\n-Ash and Go finally enter Stow-on-Side Stadium for Ash's World Coronation Series rematch against Bea and see her training with all of her pokémon\n-Bea wants to train with Ash for their rematch tomorrow but Ash wants to see Korrina today so Ash's Pikachu rotates his face to let him see Korrina\n-Korrina runs to Bea to give some chocolates to her and cries for not giving the Miare Galettes to her which Bea loves\n-Korrina's Lucario sees Bea's Grapploct eating its chocolate but Lucarko tries to punch the Grapploct instead so the Grapploct blocks it as well as Bea's Pangoro with Ash's Lucario\n-Ash and Go never thought Bea and Korrina were actually friends so Bea tells them that Bea doesn't agree that pokémon battle are to be enjoyed like Korrina does\n-Ash and Bea finally started their 3 vs 3 World Coronation Series rematch by sending out Pikachu and Grapploct respectively\n-Ash's Pikachu is about to use Iron Tail on Bea's Grapploct but Grapploct's tentacles is about to release from Pikachu's Electroweb and perform Close Combat to grab Pikachu's tail and punch it consecutively\n-Ash's Lucario uses Double Team to create shadow clones and circle them around Bea's Grapploct but Grapploct spins around and fires Liquidation on all of the clones\n-Bea's Hawlucha uses Brave Bird on Ash's Lucario while Lucario is using Force Palm\n-Bea's true ace Machamp uses Bullet Punch on Ash's Lucario while immobilizing it which makes Ash tempt to use his Key Stone but Lucario refuses to mega evolve just yet\n\nEXPECTATIONS:\n-Bea's Hawlucha and Ash's Sirfetch'd will faint at the same time\n-Bea's Grapploct will finally taken down by Ash's Mega Lucario\n-Ash vs Bea World Coronation Series rematch might end up a tie(C'mon,guys. Bea still has 2 more pokémon that Ash never battle yet. We need to see their strength and power. They need to battle each other again to do that.)\n-Go might have an interest in participating in gym battles after the rematch between Ash and Bea\n-Molayne will return to the anime on or before episode 98 teaching Sophocles on how to become a great astronaut\n-Agatha will return to the anime on or before episode 99 provoking Professor Oak in a pokémon battle\n\nSS025=89.88%-6.5%=83.38%",
            "likes": 1,
            "number_of_replies": 3,
            "polarity": 0.22704678362573097,
            "subjectivity": 0.5729532163742689
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "If the series is ending as ash a protagonist the ending should be a battle between him and every champion from every region and mainly for the last battle battle between ash and alain. Ash using greninja  and ash winning. After that we cut 16 years after to another seen of ash and serena with 2 kids a boy who's wish is to become a pokemon master and a daughter who's wish is to become the pokemon showcase master, hence a reboot of the series as ash's son and daughter as the new protagonist. There can be some new secen add for serena winning the pokemon showcase.   .\" i can't see any one else on ash's place rather than is his own son if the took another person rather than that fans will go hated and so many of the fans would even stop watching this other dude crushing ash.  If this happen this will be like beyblade burst were they change the protagonist every season which made me to stop watching that series.  Hence the same will happen to pokemon. I don't want that.",
            "polarity": 0.1595328282828283,
            "subjectivity": 0.5340909090909091
        }
    ]
}