{
    "time_posted": "2021-10-30 14:30:06",
    "url": "https://www.youtube.com/watch?v=ijkvTYX1eAc",
    "time_now": "2021-10-30 20:51:24",
    "ups": "2953",
    "downs": "10",
    "views": "35482",
    "top_comments": [
        {
            "comment": "Lucario: \"Not yet, Ash! I can do this!\"",
            "likes": 252,
            "number_of_replies": 5,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I liked this epsoiode",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "comment": "I loved this episode! Im glad they took their time with everything, and didn't rush into the battle at the start of the episode. In the past, some important battles felt rushed. Oh, and we got to see Gengar too!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.40625,
            "subjectivity": 0.7625
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Korrina: I just love Kunoe Chocolat. I could eat for every meal. Or just constantly, without stopping. 🥰\n\nBea: You'd get fat. 😐\n\nKorrina: No. Why would I get fat? 😄\n\nBea: Chocolate makes you fat. 😐\n\nKorrina: Chocolate makes you fat?! 😳",
            "polarity": 0.25,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "i am soooooooo ready for the next episode!!!!",
            "polarity": 0.1,
            "subjectivity": 0.25
        },
        {
            "body": "Ash: *struggiling to beat bea*\n\nMe who beat bea on my first try in pokemon sword with my corvisquire: *pathetic*",
            "polarity": -0.375,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "I think they overdid it with the \"built up\". Lucario just took such an ridiculous amount of damage what also made it look incredibly weak in random moments, like when it just stood there and took the sky attack, whiel before that it had a dragonball-esque brawl mid air with Hawlucha.\nIt also looked weird how Ash went repeatedly for the Force Palm without showing us any way how that could have potentially worked.\nIt made it look like Force Palm and Aura Sphere are the only moves Ash is aware of that Lucario can use.\n\nThe worst part about it is that I honestly can't feel pressured about the fight anymore. Lucario already has taken so much damage that I can't estimate what would be too much for it. I cannot just assume that the next cross shop would actually take it down or the next 10 cross chops and 1000 bullet punches...",
            "polarity": -0.08494152046783625,
            "subjectivity": 0.4507309941520468
        },
        {
            "body": "Best journeys episode thus far!",
            "polarity": 0.5625,
            "subjectivity": 0.65
        },
        {
            "body": "I loved this episode. Fav moment was Leon thou…he quickly shut everyone up by letting people know that ash and his lucario have a deeper bond then anyone realizes. It also was a big confidence booster for both ash and bea. So next battle will be heated for sure.",
            "polarity": 0.30666666666666664,
            "subjectivity": 0.45777777777777773
        },
        {
            "body": "İ don't understand in pokemon. Ash's lucario hatced as a baby riolu, and soon after, he was an evolutionist, so now lucario is considered a baby, how can he act like an adult? Same thing goes for noiyvern",
            "polarity": 0.05,
            "subjectivity": 0.2125
        },
        {
            "body": "Hype episode - Bealieve it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The music they had in the battle (which is the same music your using in the background right now LumiosTrainerZac) is actually really cool. I hope we can get to hear more of it in the future.",
            "polarity": 0.22714285714285715,
            "subjectivity": 0.3871428571428571
        },
        {
            "body": "Wait I just noticed why isn't ash using gengar in this fight he's immune to fighting and knows psychic. Man he could've gotten another win for gengar",
            "polarity": 0.8,
            "subjectivity": 0.4
        },
        {
            "body": "I think it deserves a 9/10",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "When Ash and Corina boath in unison calmed evryone down after they started fighting in the munching scene , and where shocked they did, I felt a new ship possibly setting sail! 😆",
            "polarity": -0.1797979797979798,
            "subjectivity": 0.6358585858585859
        },
        {
            "body": "Let's hope Ash wins in Next Friday's episode. :3\n\n\nPLEASE MAKE SURE IT HAPPENS, WRITERS! X3",
            "polarity": 0.35625,
            "subjectivity": 0.5222222222222221
        },
        {
            "body": "Battle Bond wasn't mentioned in the 3 mechanics in this episode, so doesn't that mean Ash can use it and one more mechanic? That will make him insanely strong if Greninja comes back.",
            "polarity": 0.15520833333333334,
            "subjectivity": 0.48020833333333335
        },
        {
            "body": "Bruh.... Honestly I'm glad it's a 2 parter... This episode was really good man.. 8.5 out of 10 for me...",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "I loved this episode! Im glad they took their time with everything, and didn't rush into the battle at the start of the episode. In the past, some important battles felt rushed. Oh, and we got to see Gengar too!",
            "polarity": 0.40625,
            "subjectivity": 0.7625
        },
        {
            "body": "Near zera rating",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "I liked this epsoiode",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "This was a really good episode, but where the heck is Lucario’s mega stone?",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        }
    ]
}