{
    "time_posted": "2021-10-30 13:00:11",
    "url": "https://www.youtube.com/watch?v=Isl80lkajZU",
    "time_now": "2021-10-31 09:11:12",
    "ups": "7676",
    "downs": "104",
    "views": "79977",
    "top_comments": [
        {
            "comment": "SIGN UP FOR MY FREE MASTERCLASS: How to Turn Video-Making Into $100k/yr Career\nhttps://bit.ly/3vK6tUe",
            "likes": 97,
            "number_of_replies": 25,
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "comment": "Iloveyou😭😭",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Is it a problem I can’t stop watching your videos? It’s like a disease but a good one!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.875,
            "subjectivity": 0.6000000000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Is it a problem I can’t stop watching your videos? It’s like a disease but a good one!",
            "polarity": 0.875,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "make a reaction to MONEY by Lisa",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i think the only good scene in this mv are all Lisa's scenes and the scene where the women in white dancing",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Why u havent react to burn it all down",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "JORDAN HOW YOU MISSED THAT LISA IS ON GREENSCREEN",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Finally someone said it. Yes, this MV looks boring except for Lisa's part. And I don't think that money is the case. Take for example Tom's Macdonald MVs, wholly made by one person (Tom's girlfriend Nova Rockafeller) - they are really low budget and minimalistic but interesting to watch. It just skills and knowing your job, not money that make good MVs.",
            "polarity": 0.039999999999999994,
            "subjectivity": 0.6799999999999999
        },
        {
            "body": "Jordan vs the app😂😂😂💔💔 Idek this song but now I want to know about the app.\n\n\nAnd everyone in the comment is right by saying Kpop music videos keep you on your toes with the angles and camera movements. Even if it's just a slow pan from here to there. Even the slow jam music videos are still put yogether in a way that makes uou want to know what's next. Before your videos (I came here because of Itzy and Stray Kids) I didn't care much about music videos except to see the artists I like and what ideas they had for the music video. Idc for this song so Idc for thr music video 🤷🏾‍♀ (more so indifferent because I don't hate it incase anyone rrads it that way). A music video I liked that had 13799737 artists in one song is the Touch It [bring it back, watch it, turn it, leave it, stop FORMAT IT] remix (Busta Rhymes).\n\n\nAlso you dancing to mimick what's happening in the video😂😂😂",
            "polarity": 0.020634920634920617,
            "subjectivity": 0.4150793650793651
        },
        {
            "body": "Both Lisa and Megan should've gotten longer parts, sorry Ozuna. The song overall is a bop to listen to, it's not over the top and not moderate. It's a nice song to vibe to while doing ___. The mv was as expected though, they're not as artistic and on a lower budget. So I understand that uhm gr- we don't speak of that shot.",
            "polarity": 0.11904761904761904,
            "subjectivity": 0.6571428571428571
        },
        {
            "body": "The only western artist that got me goin back to youtube is Taylor swift. I personally think she's got good MVs. For the others I just want listening to them on streaming sites like spotify or maybe just download them on my phone. \nKpop mvs are good and fun to watch.",
            "polarity": 0.24285714285714285,
            "subjectivity": 0.38571428571428573
        },
        {
            "body": "Besfran I'm here to find OUT",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "please react to XOXO by Somi nexttttt",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Can you watch the MV for mirror mirror from   MILLI F.hero and changbin from straykids",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Where's that NCT 127 reaction at? Don't tease us with a little clip!!!!!!!!",
            "polarity": -1.0,
            "subjectivity": 0.5
        },
        {
            "body": "Every video where Lisa in is: SHE’S AMAZING + A QUEEN",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "LISA BEING GREEN SCREENED INTO THE VIDEO WAS THE ONLY THING I WAS LOOKING FORWARD TO IMMEDIATELY AFTER THE MUSIC VIDEO WAS RELEASED AND HE DIDN'T EVEN NOTICE 😭",
            "polarity": -0.1,
            "subjectivity": 0.65
        },
        {
            "body": "Please react on Superm \"Jopping\".\nYou will be shocked 😲",
            "polarity": -0.7,
            "subjectivity": 0.8
        },
        {
            "body": "\"YES LISA!!! Yes, that's why we all are here!\", Jordan Orme 2021\n\nHe is 10000% right, I mean he only mentioned Lisa in title and honestly I think they've added Lisa just because of her name. If there wasn't Lisa, this song wouldn't be as successful. She is more popular then other Ozuna, DJ Snake and Megan Thee Stallion anyways.\n\nJust my personal opinion.",
            "polarity": 0.25535714285714284,
            "subjectivity": 0.6831349206349207
        },
        {
            "body": "Iloveyou😭😭",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank you for your knowledge and wisdom.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}