{
    "time_posted": "2021-10-30 13:00:11",
    "url": "https://www.youtube.com/watch?v=Isl80lkajZU",
    "time_now": "2021-10-30 20:51:13",
    "ups": "5281",
    "downs": "64",
    "views": "49166",
    "top_comments": [
        {
            "comment": "SIGN UP FOR MY FREE MASTERCLASS: How to Turn Video-Making Into $100k/yr Career\nhttps://bit.ly/3vK6tUe",
            "likes": 68,
            "number_of_replies": 22,
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "comment": "when he said \"oh no the app, it's broken\" i laughed so hard man 😭",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0027777777777777493,
            "subjectivity": 0.38055555555555554
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The use case for an American MV and a Kpop MV are COMPLETELY different. That's like asking if a pickup truck suck compared to a forklift. A Kpop group can go 5 years with only 4 songs, of which only two have MVs, and those two are the only promotion they are going to have for another few years. So the PUMP the money into the production. Kpop artists are just employees. The American music industry treats their artists like vendors, contractors, or investments. MVs are necessarily an afterthought because it doesn't make business sense to have 75 sets and 100 designer outfits when the return on investment is so low. Their promotion dollars go elsewhere, and it works...KPop is a juggernaut, but it's not like American artists are diminished.",
            "polarity": -0.02,
            "subjectivity": 0.5
        },
        {
            "body": "I'm surprised you didn't say anything about them greenscreening Lisa in 😂",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "body": "I'm Latina, love Kpop. This kind of music plays eveyday in the radio and yes THIS SONG AND VIDEO is kinda boring and plain. Honestly not my fav Latin mv.",
            "polarity": -0.08285714285714282,
            "subjectivity": 0.7514285714285714
        },
        {
            "body": "Pls react NCT 127_ Favorite 🥺",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I think Lisa is the one who work harder for her roles but the others just did their normal easy move on camera ..ugh",
            "polarity": 0.16111111111111112,
            "subjectivity": 0.49444444444444446
        },
        {
            "body": "did you catch that Lisa was CGed into the group shots when they are on that orange stage? They are super fast shots but if you look at it the lighting on her is different than the others. I think that's why they made those shots fast lol",
            "polarity": 0.3066666666666667,
            "subjectivity": 0.6333333333333334
        },
        {
            "body": "You should react to Dumb Dumb and XOXO by Somi",
            "polarity": -0.375,
            "subjectivity": 0.5
        },
        {
            "body": "I WAS WAITING FOR YOU TO DISS THEM ON THEIR EDITING SKILLS BC LISA'S GREEN SCREEN WAS SO AWKWARD",
            "polarity": -0.4,
            "subjectivity": 0.65
        },
        {
            "body": "If it weren't for Lisa I wouldn't even watch the MV.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Okay so watch Strawberry Moon by IU",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Lisa was encrusted by a green screen in group shoots, it is obvious.",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "body": "can you react to Somi's XOXO?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "when he said \"oh no the app, it's broken\" i laughed so hard man 😭",
            "polarity": 0.0027777777777777493,
            "subjectivity": 0.38055555555555554
        },
        {
            "body": "you should react to TXT's \"Frost!\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is the reason why I now watch KPOP.  Period.  And I grew up with Reggaetón back in the days.  I'm surprised that this won the poll.  Frost, Tamed-Dashed and Idol would have been a much better choice.  Check out Frost.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "Please make a React from the new League of legends Music Video with Imagine Dragons and JID \"Enemy\n\"",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Nct 127_ favorite... Pls??",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Lisa was using Green Screen and it ended up so bad :(",
            "polarity": -0.5499999999999999,
            "subjectivity": 0.6555555555555556
        },
        {
            "body": "Love your reactions!! You should watch Fromis_9 “we go” I’m super curious for your editor perspective of this one",
            "polarity": 0.3381944444444444,
            "subjectivity": 0.7555555555555555
        }
    ]
}