{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-30 16:46:01",
    "ups": "622",
    "downs": "23",
    "views": "16392",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Horrifying NIGHTMARE BUILDING!😂😂😂😂",
            "polarity": -0.9,
            "subjectivity": 1.0
        },
        {
            "body": "I remember how I felt watching it. I was in such shock and was so worried about all those cops and Congressmen and Congresswomen just by watching it. I feel for them because it must have felt like being in war, but with nothing to protect themselves with. Horrible.",
            "polarity": -0.5,
            "subjectivity": 0.75
        },
        {
            "body": "maga = We saw magat's best on Jan 6th>>>\"hang Mike Pence\" \"we were gonna shoot Pelosi dead in her brains\" \"i'd rather be Russian than democracy\"....<<>>... so maga.... tried to overthrow America and failed...smearing crap on the capitol walls.... so maga.... their camp are Literally TRAITORS..thankfully it is shrinking down into a toxic crapstew>>.  😂",
            "polarity": -0.031111111111111117,
            "subjectivity": 0.3577777777777778
        },
        {
            "body": "I do not wish to sound angry or inflammatory, but I think Gallego was being a little soft or passive on what needs to be done about the fascist movement in this country. Yes, voting is important, but we need to invigorate and rectify the Democratic Party politicians, the Democratic party voters, the media and the Department of Justice. I am not sure how we can do this, but we must try. In their present state, these entities will just allow the fascists to steam-roll us. Look at the news. \n They are allowing it even as we speak. Gallego mentioned something about \"...they don't care about democracy. As long as they keep getting their fat tax breaks and deregulation\" (I'm para-phrasing). Are the politicians in the Democratic Party secretly hoping that the coup is finally successful in 2022, so that their profit margin from stocks and shares increases?",
            "polarity": 0.026250000000000002,
            "subjectivity": 0.618888888888889
        },
        {
            "body": "There is something seriously wrong with Americans who are devoted to a tyrant who praised Putin, belittled our POWs and gold star families, refused to commit to the peaceful transfer of power, undermined our democracy with the lie of a stolen election, and incited an insurrection against America.",
            "polarity": -0.125,
            "subjectivity": 0.7
        },
        {
            "body": "IN WAR, YOU DISRUPT THE SUPPLY LINES...DEMOCRATS ARE DOING THIS NOW, TO AMERICANS!!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "msnbc is complicit in this madness. the biden dictatorship and the socialist democrats pulling his strings paying up to...450,000 American $$  per to illegals while MILLONS of Americans are suffering !?!? If you're an American caught in the msnbc propaganda bubble...PLEASE..WAKE UP!",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.03333333333333333
        },
        {
            "body": "Ari, you interviewed a man that has correctly explained what's been happening all along since the tea party was around 😈👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Trump bussed people in, don't forget!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If a foreign country joined them at the Capitol, what would have happened to Democracy?",
            "polarity": -0.125,
            "subjectivity": 0.125
        },
        {
            "body": "Rupert Murdock is an ungrateful sob for co conspiring with Trump against the very democracy that made him rich 😡👎",
            "polarity": 0.2875,
            "subjectivity": 0.525
        },
        {
            "body": "If he quits then he's just letting the crazy people win!  That's very sad, and un-American! He needs to fight back not give up!",
            "polarity": -0.103125,
            "subjectivity": 0.575
        },
        {
            "body": "UCSB, send the money back and the plans marked with a big F. Not even a D-.",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.2333333333333333
        },
        {
            "body": "biden' planning to pay $450,000 per person to illegal immigrants who had been separated while Xing south border?  WTF, biden, you've gone mad.  That dog wont hunt",
            "polarity": -0.5416666666666666,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "The gift of Ronnie Regan - repeal of the 'Fairness Doctrine' - made Fox News possible.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "The Democrat Imperium has nothing to show in the way of accomplishments.  Just failure after failure; debacle upon debacle.  Recent polling confirms that most Americans see this.",
            "polarity": -0.033333333333333354,
            "subjectivity": 0.3375
        },
        {
            "body": "Rich people have plenty of things they could donate money to such as clean energy and climate change... The reason why they don't is because it's not as profitable for them to do so and they all have this mindset where they have to be the wealthiest person in the country so they strive sooo hard to increase theirs wealth that they end up sacrificing their humanity on the process.....",
            "polarity": 0.1125,
            "subjectivity": 0.6229166666666667
        },
        {
            "body": "How about you talk about what's happen now . The American people are tried of this administration",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The only reason we still have a democracy is because the insurectionest were incompetent. The next attempt might succeed.  We need to put Trump and his yes men in prison before they make another attempt.",
            "polarity": -0.11666666666666665,
            "subjectivity": 0.45555555555555555
        },
        {
            "body": "MSDNC is an absolute clown show. The joke of journalism.",
            "polarity": 0.2,
            "subjectivity": 0.9
        }
    ]
}