{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-30 20:51:43",
    "ups": "999",
    "downs": "31",
    "views": "31035",
    "top_comments": [
        {
            "comment": "Mussolini had brown shirts. the ex-president has brown-noses.",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "He should be arrested and tried for wrong think!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.625,
            "subjectivity": 0.9
        },
        {
            "comment": "Based on Local Building Codes, rooms have to have windows.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I can't believe we went from a president that people claim to be racist, to an actual president who is a known racist and kid toucher. Good job. Let's go Brandon.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.35,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment": "All the Republicans Trump and all the evangelists are traitors to America",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "What the GWB Republican mobs of election 2000 started. It's Republican, with imbecile free speech news broadcasting against other Americans, in sum effectively treasonous. Republican Party gotta go.",
            "polarity": 0.01874999999999999,
            "subjectivity": 0.7437499999999999
        },
        {
            "body": "They're sociopaths.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Watch the CCP world news with puppet Chris",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pass legislation to impeach all of Trumps traitors in Congress and preclude future candidacy from anyone who supports it. We have the power now, use it or lose everything.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Sorry to lose a great person like Kissinger.☹️",
            "polarity": 0.15000000000000002,
            "subjectivity": 0.875
        },
        {
            "body": "Make no mistake, the Republicans are no longer conservatives.  They are authoritarian power mad monsters who will take away all the freedoms of the majority and then take away all the freedoms of everyone but a very tiny group of elites.  We are looking at a coming enslavement of nearly every American.",
            "polarity": -0.13125,
            "subjectivity": 0.5125
        },
        {
            "body": "Stop calling authoritarians \"conservative\". They do not conserve; not life, or liberty, or property, or equality, or morality, or reason, or justice, or rule of law. Their very name for themselves is a Big Lie.",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "Last night I returned home with my body fully swollen! People are collapsing at work because of Serious Heavy Workload! I had to keep begging Customers to give me few seconds to breath!",
            "polarity": -0.20833333333333331,
            "subjectivity": 0.33333333333333337
        },
        {
            "body": "All the Republicans Trump and all the evangelists are traitors to America",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Biden's handlers have more power than Macron in France. The world watches Resident Biden hiding from questions again. What a leader. Go Joe 90.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Their is no we in politics. Theirs only me. It's me the person, not we the people. This is \"our country or is it\"?What about the true American, don't they have a say?",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.5499999999999999
        },
        {
            "body": "Brought to you by Pfizer",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Let’s Go Brandon!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I can't believe we went from a president that people claim to be racist, to an actual president who is a known racist and kid toucher. Good job. Let's go Brandon.",
            "polarity": 0.35,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Mussolini had brown shirts. the ex-president has brown-noses.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Based on Local Building Codes, rooms have to have windows.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He should be arrested and tried for wrong think!",
            "polarity": -0.625,
            "subjectivity": 0.9
        },
        {
            "body": "\"Fox News Canada, For Entertainment Purposes Only\"\nRun the search, they started running the disclaimer so they can't get sued. \nThey have nothing like the 1st Amendment covering thier @$$'$ in Canada.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Keep them with no outside contact including it window. Then you pipe in anything you want them to learn. Teach them violence killing an anti-government handsome medic falsehoods period Then they can all get together talk it over and get loud. They can all agree on destruction and disaster to everyone else. Disaster murder killing God's creations including each other. The Antichrist is Alive and Well working on America and the world. It's time to stand up for Jesus Christ and his teachings and God. The reality of Earth is reality that Jesus Christ has spoke to us. That's the truth that's the true reality not the one created by mankind and There ego",
            "polarity": 0.15416666666666665,
            "subjectivity": 0.5458333333333333
        }
    ]
}