{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-31 17:25:31",
    "ups": "1903",
    "downs": "53",
    "views": "82157",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "And yet they won’t pay their fair share.",
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "body": "Hold on!  Busses were there BEFORE backup to defend the seat of gov.???\nI want to know who ordered these busses an when!  Was it planned? If it was, it's officially a coup.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Does Bezos really need to be in space for 10 minutes and then treat his workers like slaves? Just one very little example.",
            "polarity": -0.021875000000000006,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "I think that you need to look into that Unger story a little more deeply. I think that you might find that Unger retains the building Management contract for the next 20 years. Lets see, 4,500 inmates paying $200 per week for 52 weeks is just $48 million. Plus services like occupancy loans at a very fair 10%, and then there is the Unger student loan company prospect. This will be a great passive income endowment for his kids. Payback period 5 years. After 20 the university takes over. Then there are the extra side incomes from the Kushner style Rental agreements where if a student drops out half way through year one, they still have to pay the rent to the end of the rental contract, and thank goodness you didn’t sign up for the full 4 years, ‘what?”, “ohhh you did? So you’d be assured of accommodation for the whole course?” . This will be rotten to the core, I would expect looking at the people involved. Greedy capitalists and gullible academics.",
            "polarity": 0.24058333333333332,
            "subjectivity": 0.4366666666666667
        },
        {
            "body": "A coup that goes unpunished is just a training exercise....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "When the vaccines were first rolled out the media launched this huge sprawling push to get black people to get over their fears and get the vaccine. They had Panel after panel after panel of commentators giving deep analysis about history and injustice. Going out into the community trying to convince people. Bring on black doctors and virologists, pastors, community leaders etc. so NOW that we know who’s really afraid and spreading the most disinformation…. Why isn’t the media focusing the same effort on that community? Just a question…",
            "polarity": 0.027083333333333362,
            "subjectivity": 0.503125
        },
        {
            "body": "For 45 hundred students, there are only two doors as well. A, quod cut out of the middle would give windows for all on the inside park , a quiet outdoor place to study and \"collaborate\". Half as many students, a whole lot nicer.",
            "polarity": 0.0888888888888889,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "God forbid there is a fire. FFS!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Democracy or Fascism. The fascists have taken off the gloves, it's time for the government to put those hands in handcuffs and throw them in jail from the top down. They will throw out any vote in any state when it comes down to it. Crush them before it's to late.",
            "polarity": -0.04222222222222223,
            "subjectivity": 0.3355555555555556
        },
        {
            "body": "The GOP represents Corporations and PEOPLE \"WHO WILL DESTROY DEMOCRACY TO KEEP THEIR TAX BREAKS and PROFITS!!! Well said Rep Gallego!",
            "polarity": -0.48828125,
            "subjectivity": 0.0
        },
        {
            "body": "I'm a diehard democrat. Yes I'm lazy I don't want to work i want all the free stuff I can get I am scared we will lose the house and senate in the midterms because we are not ready for Socializim",
            "polarity": 0.016666666666666673,
            "subjectivity": 0.7666666666666666
        },
        {
            "body": "Who? Nobody would have recognized or cared about him. Could have said he was doordash.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Traitors are real",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        }
    ]
}