{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-31 00:58:05",
    "ups": "1315",
    "downs": "40",
    "views": "44889",
    "top_comments": [
        {
            "comment": "At what point is it in America's best interest to just \"Take Care\" of the🍊🤡, and his CULT! You know JFK the🍊🤡!😅",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 1.0,
            "subjectivity": 0.3
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Those people are Caucasian Supremacist fascist calling themselves republicans\nand their goal is mob rule not truth or rule of law and if they can not have their way they will seek to destroy the United States of America full stop period.",
            "polarity": 0.07499999999999998,
            "subjectivity": 0.275
        },
        {
            "body": "Dangerous",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "body": "I have a real problem w/media network which is contributing to causing domestic terrorist attacks (mail bombs, death threats, mass shootings, pipe bombs, etc), hate crimes, and the destruction of American democracy by a propaganda station when the owner lives in the UK. Why r we allowing these foreign owners control over any news media? Fox is doing a similar thing in Australia. I wonder if he’s doing it in the UK to the same extent. It doesn’t they r from afar. We need limits for media companies. If they r lying/deceiving the ppl more than 1% of the time, if they r encouraging the public to send death threats or harm others in any way, if they don’t live in the country they r trying to destroy, they should be shut down and never allowed to own any media in the US again.",
            "polarity": 0.003986291486291474,
            "subjectivity": 0.31468253968253973
        },
        {
            "body": "You still have a problem because those people are out here propagating lies in the work place covertly all over America. They are using falsified reports and articles trying keep momentum on the lies fox New and Trump propagate. Its not just an attack against democracy it's an attack also on truth as common understanding in the public sphere and the court system.",
            "polarity": -0.05454545454545454,
            "subjectivity": 0.34040404040404043
        },
        {
            "body": "I bet any money that corporate people love being called \"over lord's\"!👎👎👹👹👹",
            "polarity": 0.3125,
            "subjectivity": 0.3
        },
        {
            "body": "It's better as a prison...",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Lying about the election and the January 6th insurrection is now intrinsic with what it means to be a republican. \r\n\r\nThose who participated and incited the insurrection have not been sufficiently punished. This will happen again.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "At what point is it in America's best interest to just \"Take Care\" of the🍊🤡, and his CULT! You know JFK the🍊🤡!😅",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "😳DO NOT VACCINATE YOUR CHILDREN!!!   THEY 💯 WILL END UP WITH HEART ❤️ ISSUES.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Those dorms look like fire traps to me.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Our power is coming to a close looking at what we are doing.  We are going to lose big time and we should.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "So what let's hear 1000's of more hours of jan 6th? What for? We have the power and we are basically screwing everything up with our Trump obsession. Enough of it already. Joe is a kook now putting in place things that are going to bring us down. Mark my words. The people in the middle that we need ain't going for lots of his kooky ideas. He don't care because he's almost gone anyways. Our future is dependent on him doing good.  You think people are happy with the inflation? Think the middle people love having millions of illegals coming in? We are just about done. The dems got it back from the reps just to throw it in the garbage. Good job.",
            "polarity": 0.2767676767676768,
            "subjectivity": 0.38308080808080813
        },
        {
            "body": "And those are the good guys🤥",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "This is valid!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's really hard to find All In highlights, but I keep looking.",
            "polarity": -0.2916666666666667,
            "subjectivity": 0.5416666666666666
        },
        {
            "body": "Billionaires are parasites and they need to be wiped out militarily",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "Any Secretary of State in the states that ignores the People’s vote the military should move in on them and execute them on the spot",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "See everyone who participated in that insurrection including Rupert Murdoch and others should be blind up on the national mall and mowed down with machine guns",
            "polarity": -0.3277777777777778,
            "subjectivity": 0.47777777777777775
        },
        {
            "body": "*AGREED!! 👍 EXCELLENT!! 👍 POWERFUL!!!* ❤️❤️❤️",
            "polarity": 0.79296875,
            "subjectivity": 1.0
        },
        {
            "body": "Or, like Rupert Murdoch, YOU DESTROY WESTERN CIVILIZATION!!!",
            "polarity": -0.1,
            "subjectivity": 0.0
        }
    ]
}