{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-31 09:11:44",
    "ups": "1649",
    "downs": "51",
    "views": "66034",
    "top_comments": [
        {
            "comment": "Hurry someone please help me .. This has been driving me crazy for the last 10 seconds.. Are Chris Hayes and Rachel mustache Maddow identical twin sisters?? Please don’t judge me.. The Russians sent me..",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.3,
            "subjectivity": 0.48333333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Are you kidding me?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pooor little rich boy,  Elmer Thud",
            "polarity": 0.09375,
            "subjectivity": 0.625
        },
        {
            "body": "Why is nobody shutting FOX down ?!",
            "polarity": -0.19444444444444448,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "Who ordered the buses?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "THE Republicans are holding this country hostage, what are the two senator's our state's have doing. Have they forgotten how they got in office? \nTo you republicans I gotta say.\nWas you afraid B.T? Before trump? What are you afraid of ? You can't use black folks to answer this question. They been in your life before you were born ok. Besides,\nThe police use that line .\nTrump came into your orbit maybe because he gave you your lose voice, trump had nothing to do with that, you know what stole your voice.\nYour afraid to say it right now, I know  you because I as you was afraid of getting popped up side the head.\nWhat woke me up, my son ask me what happen to the side of my face .\nMommy. We teach our children to lie early. Mmmmm.",
            "polarity": -0.21011904761904765,
            "subjectivity": 0.6711309523809524
        },
        {
            "body": "Been saying it for a while now...\n\nS L O W... C O U P...\n\nThey will not stop, there is too much at stake.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "The Demons are shedding their sheep's clothing and coming out in clear sight.  They have been waiting for sometime for this moment where the weak would reluctantly believe in them.  Believing in the Big Lie, voter suppression and blatant disrespect for the laws and our constitution.  Democracy is in peril, judgement day is right around the corner.  I know, it sounds crazy, but so does the GOP.",
            "polarity": -0.18154761904761904,
            "subjectivity": 0.5073412698412698
        },
        {
            "body": "WOW ! Congressman Ruben Gallego IS a National Hero !  What an Incredible American Patriot;  IT is Because of Rep. Gallego and ALL Americans who Believe in the Founding Principles of Democracy that OUR Nation WILL Survive and Clean up the MESS TREASONOUS trSCUMp made !",
            "polarity": 0.24083333333333332,
            "subjectivity": 0.5549999999999999
        },
        {
            "body": "STRAIGHT OUT OF TRUMP PLAYSKILL 🦇🏌️",
            "polarity": 0.2,
            "subjectivity": 0.4
        },
        {
            "body": "It is deeply unsettling to hear Congressman Gallego's explanation of the ongoing GOP coup to overthrow our government and establish permanent minority rule.  At the same time, it is eeply grounding to hear the truth.",
            "polarity": -0.25,
            "subjectivity": 0.4125
        },
        {
            "body": "Thank you Congressman Gallego for protecting the members of Congress during the assault.  Had members of Congress gotten on those buses they could have been kidnapped and possibly executed.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Trump Lost the election so go pound sand",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hurry someone please help me .. This has been driving me crazy for the last 10 seconds.. Are Chris Hayes and Rachel mustache Maddow identical twin sisters?? Please don’t judge me.. The Russians sent me..",
            "polarity": -0.3,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "This is what it is all about",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Doesnt look like America will never see justice for trumps attack or the testing of democracy. Americas DOJ and FBI sits back and do nothing while criminals walk free. But you'll charge the minions but not the top of the pyramid. Disgraceful.",
            "polarity": 0.3,
            "subjectivity": 0.43333333333333335
        }
    ]
}