{
    "time_posted": "2021-10-30 11:30:13",
    "url": "https://www.youtube.com/watch?v=j6ezLQnc1Kk",
    "time_now": "2021-10-31 21:32:47",
    "ups": "2005",
    "downs": "56",
    "views": "92316",
    "top_comments": [
        {
            "comment": "A coup that goes unpunished is just a training exercise....",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Hold on!  Busses were there BEFORE backup to defend the seat of gov.???\nI want to know who ordered these busses an when!  Was it planned? If it was, it's officially a coup.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "For 45 hundred students, there are only two doors as well. A, quod cut out of the middle would give windows for all on the inside park , a quiet outdoor place to study and \"collaborate\". Half as many students, a whole lot nicer.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0888888888888889,
            "subjectivity": 0.39999999999999997
        },
        {
            "comment": "Horrifying nightmare building. Hysterical.  I would not accept the building as a gift   Sometimes it's cheaper and wiser to say no thank you and take a pass.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.95,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Need to get big money out of Washington NOW!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "How many yachts can you water ski behind ?",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.6
        },
        {
            "body": "ps  we have Thousands of rubén gallegos   for each One  rafael \"ted\" cruz.  pray",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "nice  coordination:  So   they had evac buses Ready:  but no natl guard, no police, no fbi no cia no highway patrol - who Witnessed WITNESSED the chartered packed buses full of trompistas -;no cbp no secret service, capitol police undermanned  AND EQUIPMENT  P A D  L O C K E D SHUT.    niiice.    the surprise is that the  \"usa planners\"  are Not Already under political terrorist asylum in moscow havana caracas managua peking:  bad news they Know:  they will Not Be Granted Asylum.   meanwhile:  if One Imbecile shoots in an airport  ONE:  thousand of \"LEOs\": come grab the OverTime.   from hundreds of miles away   the LEOs   come   .   hungry .   trompistas golpistas must be already Ready  for the next  \"opportunity\"  to destroy the American Experiment.",
            "polarity": -0.01363636363636364,
            "subjectivity": 0.45606060606060606
        },
        {
            "body": "Those rooms are way nicer than the living quarters aboard CV-67.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Philanthropy.  Another way for narcissists to exercise their power.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Horrifying nightmare building. Hysterical.  I would not accept the building as a gift   Sometimes it's cheaper and wiser to say no thank you and take a pass.",
            "polarity": -0.95,
            "subjectivity": 1.0
        },
        {
            "body": "\"When the time comes, they will do what I want them to do.\" Lots of subliminal messages during this particular airing from msnbc(s)",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Now that you're not running for election you find your spine. Where was all that smoke before",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Add today's Republican Party to the list that includes Trump & Rupert Murdoch among enemies of democracy. \"If a political party does not have its foundation in the determination to advance a cause that is right and that is moral, then it is not a political party; it is merely a conspiracy to seize power”. - President Dwight D. Eisenhower, 1956, 4th Annual Republican Women’s National Conference.",
            "polarity": -0.04285714285714286,
            "subjectivity": 0.29714285714285715
        },
        {
            "body": "Democratic Party is trying to bring America down into Bankruptcy!!!",
            "polarity": -0.3038194444444445,
            "subjectivity": 0.2888888888888889
        }
    ]
}