{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 14:01:40",
    "ups": "41117",
    "downs": "1034",
    "views": "1050439",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I'm going through a breakup as we speak, my \" gf\" sleeps downstairs and I'm the upstairs bedroom. I work my AZZ off, pay her rent, put her in a newer car that I pay for, she got pissed off one day and stopped speaking to me.she never communicates when something is wrong, just shuts down. Now I'm to the point where IDGAF, she can keep her house and 20 year old lazy child that runs the home. I never had any say so, every time I say something about her kid, it's the end of the world. Now I just want to be left alone and focus on me, I'd rather be single and happy than deal with bullchit EVER again.",
            "polarity": -0.010997732426303848,
            "subjectivity": 0.5147392290249433
        },
        {
            "body": "✊🏿",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This was done on purpose, just like the feminist movement. To ruin the nuclear family",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "When the SHTF, they don't want testosterone fueled mobs of angry young men. They want impotent compliance",
            "polarity": -0.2,
            "subjectivity": 0.7
        },
        {
            "body": "Where have they gone?  Their own way.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "We r equal y'all don't need help",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "I'm \"Training\" my grandson to be a good man.  NOTHING happens by accident, guess what, it takes work.  He's the sweetest little boy and already feels like he should protect his \"dranny\" while also knowing how to use tools, fix things, help reload ammunition and work on firearms.  \"Manly\" things  don't equate with being violent whatsoever.  Poor parenting/lack of family structure does.  You can bet I was all over my own kids and NO they did NOT have any privacy on social media growing up.  I KNEW their friends, who they talked to, who they hung out with etc....",
            "polarity": -0.0090277777777778,
            "subjectivity": 0.6277777777777779
        },
        {
            "body": "We are done.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They  tired of growing incompetent matriachy",
            "polarity": -0.375,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Men would’ve intervened in the train if it were in the 90s to early 2000s. Feminization of men is not saving our women anymore.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "How did the Likes just go from 61K to 41K ?????  Big Tech at it again",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Didn't it come out the r thing on the train was falsely reported",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.6
        },
        {
            "body": "This is crap",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "Yet we don't talk about toxic feminity.    Who causes the most drama men or women?  Obvious answer 🙄",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "As a black man. Thank you. Real men are Courageous, strong, bold, compassionate and a bit wild sometimes...lol",
            "polarity": 0.18,
            "subjectivity": 0.5066666666666666
        },
        {
            "body": "The endurable dress ecologically damage because blanket connoly amuse outside a special airplane. lovely, labored slope",
            "polarity": 0.3142857142857143,
            "subjectivity": 0.4928571428571429
        },
        {
            "body": "A lot of us that remain can be found primarily in the mid-west and highly conservative states. We prefer heterosexual not as a lifestyle but as God’s directive.",
            "polarity": 0.28,
            "subjectivity": 0.52
        },
        {
            "body": "Gender ,male and female ,nothing more nothing less",
            "polarity": 0.08333333333333334,
            "subjectivity": 0.20833333333333331
        },
        {
            "body": "If a dude acts like a girl we can't talk ... You aren't on my level",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}