{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-03 07:14:15",
    "ups": "45680",
    "downs": "1171",
    "views": "1203526",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "They sure don't have a problem expecting females to conform to extreme standards of masculinity. What a confusing joke, your still suppose to coddle them like it's still the 50s.",
            "polarity": 0.025000000000000005,
            "subjectivity": 0.762962962962963
        },
        {
            "body": "Part of the problem is a lack of good men, but another major problem, perhaps a bigger one, is that no good deed goes unpunished. More than ever, in cities and states controlled by leftists, self defense is treated as a crime. Defense of others is even more risky, and you are likely to be punished more harshly than the actual criminal- if not criminally, then in a civil lawsuit, or maybe both. \n\nAnd if the criminal in question is of a darker skin color than you, on top of everything you will be immediately accused of racism, treated as guilty  until proven innocent, and most likely found guilty by the media and in the court of public opinion, even if there isn't a shred of evidence or even a coherent explanation to support the charges.",
            "polarity": 0.10059523809523808,
            "subjectivity": 0.6007936507936507
        },
        {
            "body": "This is why lions will eat their young often. They know that to keep the herd strong. Yet us men have sympathy for the weak ones as we have a protective instinct. Even for the Soy Boys in a cuddled society.",
            "polarity": 0.05277777777777778,
            "subjectivity": 0.5861111111111111
        },
        {
            "body": "Could it be that allowing yourself to be a naturally masculine is suppressed and therefore we have passive aggressiveness which is distorting reality and destroying the truth of who we are? We, as men, are naturally confrontational to seek the truth now and get it over with...not drag it out and hide it and twist it all up until men are confused...",
            "polarity": -0.1,
            "subjectivity": 0.29416666666666663
        },
        {
            "body": "They got stepped on by feminist legislature.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well, you know,  sometimes  girls need a reality check. These two girls are trying to rationalize what a man is. Unfukingbelievable",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Feminism : equality for an entire dinner, right up until the check comes ;-)",
            "polarity": 0.17857142857142858,
            "subjectivity": 0.7202380952380952
        },
        {
            "body": "They've gone indoors and are keeping thier mouths shut!  Men feel like women don't need them anymore.  Now, the women are the strong ones that can kick guys in the face (knocking them unconcensious) as they do a back-flip in their skin-tight superhero costumes.  Men are being trended out. Thank Trump you're not one of those angry masculine bulls Laura.",
            "polarity": 0.0111111111111111,
            "subjectivity": 0.6777777777777777
        },
        {
            "body": "It isn’t men’s problem to bail out women being attacked by fatherless men or to intervene when women talk smack to them.\n\nYou are independent.  \nYou are strong.  \nDo it yourself.",
            "polarity": 0.21666666666666665,
            "subjectivity": 0.42916666666666664
        },
        {
            "body": "Now women get drafted! 😉",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They were sold out to the state for 90%  child custody and alimony, and since even looking at someone to long is almost a form of assault good luck thinking any man is gonna put his life on the line for a stranger at the risk of bing incarcerated by the state. You ladies wanted equality well you got it",
            "polarity": 0.32499999999999996,
            "subjectivity": 0.5
        },
        {
            "body": "Y'all get a grip.. no house stands divided.\nFamily separation started in the 40s!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Right here, honey.",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "The men are either busy trying to become women or just not bothered to put up with the nonsense anymore and just work and stay home.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "They have all gone AFK.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Men don’t play rigged games.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "For evil to win is for good men to do nothing.\nThen there's no good men.",
            "polarity": 0.037500000000000006,
            "subjectivity": 0.65
        }
    ]
}