{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-02 18:52:22",
    "ups": "45123",
    "downs": "1158",
    "views": "1188823",
    "top_comments": [
        {
            "comment": "Real men are still around. They don’t don’t waste their time in long term relationships anymore. The opposition no longer have the skill set to make them a good life long partner. The only thing they have is that cat and they give that up so freely that it’s not worth the effort of pursuing a long term relationship. You haven’t been doing your part in the relationship for so long that you’re not welcome at our table anymore. Let’s not forget family court, alimony, giving up everything we worked for when the only contribution you’ve made was sexual. You no longer have a seat at the table. Get a job and provide for yourself. You made your bed, now lay in it.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.06538461538461536,
            "subjectivity": 0.5487179487179488
        },
        {
            "comment": "Men, let's go underground",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Five years ago if that would’ve happened in front of me I would’ve attacked him vitiously but we’re in 2021 and if you attack somebody with their skin color you get a hate crime and they will protest even though what he did was wrong",
            "polarity": -0.65,
            "subjectivity": 0.9
        },
        {
            "body": "I’ve lived in both north east Alabama and north east Vermont. Two seemingly completely different places and yet both very similar in that real men live there. I think the common thread is that neither place was anywhere near a city. To me this and the examples she even gives are all city folk. Get out of those cities people and start living normal American lives with good people around you.",
            "polarity": 0.1095959595959596,
            "subjectivity": 0.45222222222222225
        },
        {
            "body": "She mentioned how when that man hit that woman, nobody intervened.   Well if a woman were to hit a man would anybody intervene?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Create an appropriate place for them socially and they will return. Stop calling every male trait “toxic masculinity”. No wonder so many women between 25-40 aren’t married. They were convinced they want their men to act like women….no surprise they wont find that attractive long term. It’s a recipe for disaster",
            "polarity": 0.29047619047619044,
            "subjectivity": 0.40238095238095234
        },
        {
            "body": "the top 1% created this narrative to eliminate the threat to their power.  this has been in the works since  WWII.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "My Mom would tell me and my brothers and yes at times my dad, to \" Man up!\" 😆",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Down with the radical left!!!",
            "polarity": -0.07777777777777779,
            "subjectivity": 0.14444444444444446
        },
        {
            "body": "They have all turned into “women”…or some made up gender ….",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Finally the real men are waking up, falling back and letting the modern women/feminists “figure it out” on their own… when you ask a modern western women what makes them strong, those attributes are the same things that they say makes men toxic… women wanted to be equal to men and you’re seeing the results, it’s up to them to change back into their traditional roles, if not go “buy a dog, and die alone”.",
            "polarity": 0.09393939393939395,
            "subjectivity": 0.3416666666666667
        },
        {
            "body": "Men, let's go underground",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If you're looking for real a real man then I'm here in Toledo, Ohio",
            "polarity": 0.30000000000000004,
            "subjectivity": 0.45000000000000007
        },
        {
            "body": "Society turned it's back on men, in nearly every way. What did you think would happen?",
            "polarity": 0.05,
            "subjectivity": 0.2
        },
        {
            "body": "All this is a result of communist subversion. I'm convinced. Its perversion of the family unit, our school system, our government and corporate America. Our morals and ethics are under subversive attack at all levels. Up is down and down is up",
            "polarity": -0.10370370370370373,
            "subjectivity": 0.19259259259259262
        },
        {
            "body": "Sorry, but she asked for the slap.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Real men are still around. They don’t don’t waste their time in long term relationships anymore. The opposition no longer have the skill set to make them a good life long partner. The only thing they have is that cat and they give that up so freely that it’s not worth the effort of pursuing a long term relationship. You haven’t been doing your part in the relationship for so long that you’re not welcome at our table anymore. Let’s not forget family court, alimony, giving up everything we worked for when the only contribution you’ve made was sexual. You no longer have a seat at the table. Get a job and provide for yourself. You made your bed, now lay in it.",
            "polarity": 0.06538461538461536,
            "subjectivity": 0.5487179487179488
        }
    ]
}