{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-05 12:47:38",
    "ups": "46069",
    "downs": "1173",
    "views": "1213225",
    "top_comments": [
        {
            "comment": "Where have the men gone? Girl, have you listened to yourself lately?",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "comment": "Be careful!  The bible says, \"Fathers..... DO NOT exasperate, abuse your children .....because they will become downhearted (depressed!)\"!!   The worst kind of men are the caveman (uggh!) types,, and even football is  in many ways, a very false notion,,   that knocking another boy, or man down actually means something in real-life!?!?!  That's fugged up!!!   I was always a very strong young man, and was on the wrestling team, gymnastics team, and track & field team!  But, I NEVER abused anyone of my classmates in the SLIGHTEST WAY!!!   I was fortunate to have had 10 years of bible study that made me sensitive to the feelings of others, and Christs teachings firmly affected my view(s) on life!!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.012458043981481473,
            "subjectivity": 0.6601851851851852
        },
        {
            "comment": "They turned gender and now they watch cnn",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Bunch of bloody crybabies.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "comment": "I don't exist to defend young women I don't even know. If it were a family member, or a senior or child than yes.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 0.4
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Yes, women want men who are masculine men.  It's time for a shift back to old values, where good men put bad men in check.",
            "polarity": 0.040000000000000015,
            "subjectivity": 0.35333333333333333
        },
        {
            "body": "Good points. Did the radical feminist movement have anything to do with this ? You didn't bring race into this? Maybe if a man stepped up to this he would have been arrested for racism especially if he was Asian or American Indian or white your question is excellent the laws on the books the educational programs being taught have failed us miserably. Instead of pulling together the educational systems teach hate even religions are guilty.",
            "polarity": -0.05000000000000001,
            "subjectivity": 0.525
        }
    ]
}