{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-10-31 05:04:52",
    "ups": "30664",
    "downs": "736",
    "views": "737512",
    "top_comments": [
        {
            "comment": "Interesting how this has only become a mainstream concern after it became apparent that women are being negatively affected by it. If women were still in the clear, they'd still be cackling at the revocation of men's dignity and humanity in all spheres of society - cultural, political, and economic. Real men understand that all this concern about weakening masculinity amounts to yet another wave of female manipulation - it's not for the sake of men, but for the privileges of women.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.085,
            "subjectivity": 0.35000000000000003
        },
        {
            "comment": "Real men don't step in anymore because everyone is recording and the evidence will be used against them.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "comment": "I am here.?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "And where have all the women gone?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Traditional men don't want non-traditional women.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.75
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Be real kid just need more discipline when I was younger I kneeled on rice I had to pick out my own switch when I was acting up and if I didn't pick out a big enough one we had a Louisville slugger but my dad would take to the back of my shoulders. I was never a picky eater because if I didn't eat I would go to bed hungry and wouldn't be allowed out until dinner the next night. Kids have it too easy bring back the bat.",
            "polarity": 0.15757575757575756,
            "subjectivity": 0.293939393939394
        },
        {
            "body": "If you are gender fluid stop calling yourself trans, go make your own community",
            "polarity": 0.3,
            "subjectivity": 0.55
        },
        {
            "body": "This is why our boys are now pussys",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Real men have given up on women and marriage after decades of being financially and emotionally decimated in divorce courts and custody hearings.  Divorce statistics prove that marriage is almost guaranteed in being years of strife followed by having a man's life ripped out from under him.  Real men are telling women to be the independent equals they claim to be, and refusing to allow women to trap them into marriages that put a man at the mercy of a woman's fickle feelings, with his kids and everything he's built held hostage to make sure he capitulates to whatever she wants.  Feminists have succeeded in killing chivalry, romance, and men believing in an institution of marriage that has become nothing more than a method to rip off men.  As for protecting a woman, they are self-proclaimed equals who don't need protection against anyone.  Women defined the rules, so they shouldn't complain that men are following them.",
            "polarity": 0.17777777777777778,
            "subjectivity": 0.329320987654321
        },
        {
            "body": "I’m a real woman who admires and loves real men! They are usually Patriots to boot!",
            "polarity": 0.04583333333333334,
            "subjectivity": 0.2833333333333334
        },
        {
            "body": "Soyboy beta-males",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is not about good men or women it is about your values. There are no values anymore, no self respect. All empty shells.",
            "polarity": 0.3,
            "subjectivity": 0.55
        },
        {
            "body": "The attack against men have been going on for far longer than people think.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "We are still here.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And where have all the women gone?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "After the two men in Portland were killed after intervening to help an innocent woman, men are probably wary about stepping up.  By innocent, I mean she wasn't arguing with her harasser.  The woman on the NYC subway had been harassing the guy she told to chill so the video shown only presented part of what happened.",
            "polarity": -0.002083333333333335,
            "subjectivity": 0.63125
        },
        {
            "body": "I am here.?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Real men don't step in anymore because everyone is recording and the evidence will be used against them.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "6:45 Virtuous men are vilified in society now and the nutcases all get a pass. So who is the one that gets in trouble for saving someone? Yep, men. Imagine if it was a white guy trying to save this attack? The legacy media would have a field day about it turning into a racial attack. The savior might lose his job, be slandered, etc. Is that worth it? To some people, not anymore.",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.10000000000000002
        },
        {
            "body": "Interesting how this has only become a mainstream concern after it became apparent that women are being negatively affected by it. If women were still in the clear, they'd still be cackling at the revocation of men's dignity and humanity in all spheres of society - cultural, political, and economic. Real men understand that all this concern about weakening masculinity amounts to yet another wave of female manipulation - it's not for the sake of men, but for the privileges of women.",
            "polarity": 0.085,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Traditional men don't want non-traditional women.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "“A real man combines courage and tenderness with a contempt for bullies and oppressors.” That quote is by one of your American presidents. Those sad sack excuses for men in the train when the ‘man’ punched the woman should be ashamed of themselves. He needed to be dealt with swiftly and harshly. He was a grinning coward.",
            "polarity": -0.125,
            "subjectivity": 0.5
        }
    ]
}