{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-04 12:04:40",
    "ups": "45918",
    "downs": "1172",
    "views": "1209327",
    "top_comments": [
        {
            "comment": "There is no left and right..freemasonry and zionists runs all these media outlets..get real..this is them mocking us asking us this question after destroying all men with the Rockefeller foundations fem lib..Laura Ingraham the reporter is a male to female transgender as well..just look at that trachea and jawline..and fake wig.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.13999999999999999,
            "subjectivity": 0.2533333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Those two incidents on the trains and your question \"where were the men to help\" struck a nerve with me. Why should any man risk something for a woman who has nothing to do with him? As men we are all described as evil and toxic human beings in our modern world. According to mainstream media women can do anything men can and even far better. So the question should really be, where were all those strong and independent women who are more competent and more powerful than any man?? I would never help a woman I don't personally know, to avoid any claims of unwanted attention and what not. You Go Girl and fight for yourself.",
            "polarity": 0.17179487179487177,
            "subjectivity": 0.5326923076923078
        },
        {
            "body": "Are YOU Laura really looking for a MAN? Wink.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Masculinity cannot be toxic because it is natural male characteristic",
            "polarity": 0.011111111111111113,
            "subjectivity": 0.3222222222222222
        },
        {
            "body": "Stop watching tv, movies like those, and much less, don't allow children to keep the school satanic indoctrination in their minds. Re teach children!",
            "polarity": -0.20833333333333331,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Of course, feminizacing males, makes them not prone to use their masculinity, therefore we don't have warriors, family defenders, country heroes to stand up for America, American nor their own women and families.",
            "polarity": 0.3,
            "subjectivity": 0.5
        },
        {
            "body": "There is no left and right..freemasonry and zionists runs all these media outlets..get real..this is them mocking us asking us this question after destroying all men with the Rockefeller foundations fem lib..Laura Ingraham the reporter is a male to female transgender as well..just look at that trachea and jawline..and fake wig.",
            "polarity": -0.13999999999999999,
            "subjectivity": 0.2533333333333333
        },
        {
            "body": "All you men need to have more confidence and most of you lack any form of masculinity, crying in comment section..like that’s gonna solve your problems. All you so called men sound like women in the comments on YouTube. All of you are too afraid to show emotion in real life so you wine In the comments...you guys be more in your feelings than us women!",
            "polarity": 0.2035714285714286,
            "subjectivity": 0.5285714285714286
        }
    ]
}