{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-02 14:45:04",
    "ups": "44812",
    "downs": "1152",
    "views": "1182092",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Vulnerability is the most courageous thing you can do in world of angry dangerous humans. It shows confidence and comfort not only with your sexuality but with yourselves. They’re just projecting everyone is just projecting and not doing anything",
            "polarity": -0.15,
            "subjectivity": 0.85
        },
        {
            "body": "MOST ADDICTS MALE ADDICTS TODAY ARE STIGMATIZED BY THEIR “Manhood” . You will always be a man that’s just innate, but trying to say being responsible protective and mentally strong is just for Men is stupid and regressive.",
            "polarity": 0.06666666666666668,
            "subjectivity": 0.5766666666666667
        },
        {
            "body": "There is hypocritical question...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "doll, you couldn't be more wrong.",
            "polarity": 0.0,
            "subjectivity": 0.7
        },
        {
            "body": "Hellyweird likes to make men out to be limp-wristed incapable fools, and women to be tough and sharp. They'll show a 5-foot 98 lb actress scantily dressed in heels kicking the butts of a circle of men. It's off the charts stupid.",
            "polarity": -0.4379629629629629,
            "subjectivity": 0.8611111111111112
        },
        {
            "body": "It's funny with the anti-bullying is being minded by bullies,,,whiney little BETAS that cant step up to the plate and BE A MAN!",
            "polarity": 0.0078125,
            "subjectivity": 0.75
        },
        {
            "body": "It goes beyond the radical left, the question we need to ask is, who is supporting the radical left? What do they stand to gain from the destruction of manliness and masculinity? Ultimately...weak men lead to easy to control societies. God help us.",
            "polarity": 0.17083333333333334,
            "subjectivity": 0.27083333333333337
        },
        {
            "body": "Dr Ellis, if she is involved. No words can define a Doctor that would harm her patient. If not, I am not her friend and she has an attorney.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I looked up Jacey Fortin from that article about traditional masculinity. Jacey is a woman, so how the heck is she going to tell us about how men should behave? I thank God for the men in my church who have no apologies for being strong men who rule, protect, and provide for their homes in accordance to scripture. I thank God for my husband, and that he's not weak and effeminate. I am the woman of the house. I don't want to feel like I'm more of a man than my husband is. I'm happy to feel safe with a real man in the house. (And my dad always made me feel safe. God bless the manly men.)",
            "polarity": 0.3901041666666667,
            "subjectivity": 0.6135416666666667
        },
        {
            "body": "They have gone to my house, because I am an attractive homosexual.",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "So Laura two fold, medical malpractice in hospitals and every network has a pornography charge.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The question is Why should i put my life in danger for someone i don't know?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Megyn Kelly is making simple minded conclusions so God is a dumb banal Creator.",
            "polarity": -0.225,
            "subjectivity": 0.4523809523809524
        },
        {
            "body": "Man u guys in the West are messed up they tribe I belong to our last name we take from our mother side and yet no such thing as feminism or masculine toxicity etc etc is seen any where in our society God so thankful to be born here. I feel sorry for u guys",
            "polarity": -0.1,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "All this must have been set in motion many *decades* ago by \"bad actors\" determined on playing the \"long game\" in bringing down Western civilisation infiltrating colleges, and then institutions, both commercial and civil, and removing any opposition to them.",
            "polarity": -0.11507936507936507,
            "subjectivity": 0.32222222222222213
        },
        {
            "body": "Dana Perino, I never gave her permission to address me. So a Fox slander charge.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It all began with the miniskirt , then propaganda  in womens magazine n finally music which directed the women to live her life n let go of the family style n with the help of drugs mission accomplished…",
            "polarity": 0.012121212121212116,
            "subjectivity": 0.5333333333333333
        }
    ]
}