{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-04 16:11:49",
    "ups": "45954",
    "downs": "1172",
    "views": "1210011",
    "top_comments": [
        {
            "comment": "There is no left and right..freemasonry and zionists runs all these media outlets..get real..this is them mocking us asking us this question after destroying all men with the Rockefeller foundations fem lib..Laura Ingraham the reporter is a male to female transgender as well..just look at that trachea and jawline..and fake wig.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.13999999999999999,
            "subjectivity": 0.2533333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Very true. Well said. They demanded that they are Equil but soon realize that they're not fisicaly. Just look at the Olympics or any other sports.",
            "polarity": 0.16499999999999998,
            "subjectivity": 0.6100000000000001
        },
        {
            "body": "I'm over here, Laura. Get your cute face to Los Angeles. I'll show ya where the real men are!",
            "polarity": 0.375,
            "subjectivity": 0.65
        },
        {
            "body": "It’s still men out here. All the young ones realize the girls of their generation have no value, the middle age men are all working and are on their purpose and have no time, and the older men are married or single and looking at stuff like this shaking their heads in disbelief and disgust. Men are still here. They’ve just been pushed into the shadows and they are ok with it.",
            "polarity": 0.15753968253968254,
            "subjectivity": 0.28293650793650793
        },
        {
            "body": "We have to get back to being tough men.\nWe have to get back to patriarchy.\n\nThe fatherless are lost.",
            "polarity": -0.12962962962962962,
            "subjectivity": 0.2777777777777778
        },
        {
            "body": "If they're so weak, how are they rising? I, for one, am not worried about weak people taking over anything ;-).  Stop worrying. We men aren't going anywhere.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.75
        }
    ]
}