{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 22:16:19",
    "ups": "43122",
    "downs": "1098",
    "views": "1125212",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Biden what happen in Italy? Today",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No one helps a woman because they will end up being the one sentenced in court... Helping a stranger in general is no longer worth it. That's the sickening truth of it all.",
            "polarity": -0.18333333333333335,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Chivalry is dead and women killed it. - Dave Chappelle",
            "polarity": -0.2,
            "subjectivity": 0.2
        },
        {
            "body": "I'm sure there will be woke people online praising that man for striking the woman on the train. They'll say he was a white supremacist who got what she deserved.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6296296296296297
        },
        {
            "body": "the fact that there is a gender studies is how fked US is",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I heard today on Hannity that single moms get more for child care if the remain unmarried.....which by definition the man must be out of the house! Where children need them! I hope to God people see through this and forget these tricks the govt plays with our lives",
            "polarity": 0.3549107142857143,
            "subjectivity": 0.35714285714285715
        },
        {
            "body": "They all moved to the cities or grew up in suburbs and no one ever taught them to do anything except send emails.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We've been busy moving our families and businesses to Texas.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "Unfortunately too many are now handicapped....literally.  thanks to career wars.   And get in a jam.....and you're gonna want that toxic masculinity around....that Alpha male presence is necessary.",
            "polarity": 0.04,
            "subjectivity": 0.5599999999999999
        },
        {
            "body": "China PROPAGANDA",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "Nice message",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "lawyers are part of the problem about being sued and then you have the DA who wants to put good people who defend themselves or others in jail, that is the problem",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.23333333333333336
        },
        {
            "body": "I blame \"Wonder Woman\" she started it all.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You couldn’t storm the beaches of Normandy with the young men we have today. Half would be wondering if they could keep in their TikTok ear rings and wondering if they could paint their nails.",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.2833333333333333
        },
        {
            "body": "Men are walking away from the woke hysteria, a lot of today's college is a cesspool of wokeness.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Let me know if you need a good man Laura.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "We all live and grew up in the South !",
            "polarity": 0.17045454545454544,
            "subjectivity": 0.5
        }
    ]
}