{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-02 06:30:47",
    "ups": "44404",
    "downs": "1143",
    "views": "1170830",
    "top_comments": [
        {
            "comment": "\"Where have all the men gone?\"\nThey went their own way and checked out of society. They aren't in the dating pools. They aren't part of the feminism ideology rat race. They are mostly staying to themselves now. I'm not going to work myself to the bone to help people who won't lift a finger to help themselves. I'm not going to protect someone who demonizes me for doing so at all. I'm going to look out for me and my son and the rest of the world can burn as far as I care and I'm not alone in that feeling. I'm not going to put in tons of hours in overtime to keep up with the Jones's. I can, and will stand on my own, and I'm not going to lift a finger to help profit a system, ideology, and society that wants me gone.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4000000000000001,
            "subjectivity": 0.72
        },
        {
            "comment": "A man talking about his feelings doesn't make an attractive man a woman would want to shack up with, but instead would make them into more of a female that women would feel comfortable talking to and not someone they'd be attracted to. Women talk about their feelings while men do not",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.42500000000000004,
            "subjectivity": 0.6166666666666667
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "An appendage between your legs doesn't make you a man.  Look inside your toolbox.  Oh - you don't  have toolbox. Guess that settles it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"Where have all the men gone?\"\nThey went their own way and checked out of society. They aren't in the dating pools. They aren't part of the feminism ideology rat race. They are mostly staying to themselves now. I'm not going to work myself to the bone to help people who won't lift a finger to help themselves. I'm not going to protect someone who demonizes me for doing so at all. I'm going to look out for me and my son and the rest of the world can burn as far as I care and I'm not alone in that feeling. I'm not going to put in tons of hours in overtime to keep up with the Jones's. I can, and will stand on my own, and I'm not going to lift a finger to help profit a system, ideology, and society that wants me gone.",
            "polarity": 0.4000000000000001,
            "subjectivity": 0.72
        },
        {
            "body": "A man talking about his feelings doesn't make an attractive man a woman would want to shack up with, but instead would make them into more of a female that women would feel comfortable talking to and not someone they'd be attracted to. Women talk about their feelings while men do not",
            "polarity": 0.42500000000000004,
            "subjectivity": 0.6166666666666667
        },
        {
            "body": "\"Strong men create good times. Good times create weak men. Weak men create hard times. Hard times create strong men.\"",
            "polarity": 0.11666666666666664,
            "subjectivity": 0.625
        },
        {
            "body": "Yeah, that's  a very good question 🤔,  where have all the men, gone!!!",
            "polarity": 1.0,
            "subjectivity": 0.7800000000000001
        },
        {
            "body": "Weak & Divided",
            "polarity": -0.375,
            "subjectivity": 0.625
        },
        {
            "body": "Still here grinding and working. Not participating in society though lol.",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "to 👹\nto🦉\nto 😇",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We are all busy working jobs we don't want to go to, but do it anyway.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "I beg to differ I think if a statistical analysis was cast they would find out most up and coming young white republican manly men raised with good american values have been demonized by liberals and think on a much different plane . Shown disciplinary actions right through school and life not awarded for real achievement and intelligence and treated with biase in the laws eyes in democratic areas  . I think these scenarios like a the kavaugen closet party and phoney allegations is much more common than they publicize while true victims are not even validated . And most likely liberal momma love hippie was on the scene nurturing the sentiment .",
            "polarity": 0.23826530612244895,
            "subjectivity": 0.4775510204081633
        },
        {
            "body": "Curious Laura Ingraham talks about men, yet she is unmarried by choice.",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "This homophobia is so 1950. Ranting about “effeminate men” and emphasizing that kids are raised best in a home with a MAN and WOMAN. Let people be who they are. The real hidden epidemic in America is the Karenization of American adults. 🏳️‍🌈🏳️‍🌈🏳️‍🌈",
            "polarity": 0.25,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "Come get Some!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "IM HERE LADYS!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They uhh... Seems like they all jumped on the 5 o'clock MGTOW Train to Liberal City. Had a 50 year layover in the town of Feminist-Foment, and upon arrival, they chased down an anti toxic-masculinity Parade riding an LBGTQ+ Horse into the sunset shouting, \"Me Too!!!!\"\n\nToo soon?\n\n     |||||\n  ./👀\\.\n {.  ∆.  }\n  '\\ ~  /'\n      ∆\n\n\nIn other words. God made men and women similar but different on purpose. Everything and everyone that cannot see that is blinded and or possessed by Satanic Ideology. Literally. Our original nature was not to dominate at all. Satan changed that and Jesus is rectifying the situation. In the mean time, things are going to get dicey. Read your Bible. Or get one and read. Best instructions on Masculinity and Feminity there ever was and ever will be.",
            "polarity": 0.021449110243055555,
            "subjectivity": 0.45434027777777775
        },
        {
            "body": "Bla bla bla",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Laura reminds me of cruela devile but I agree",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}