{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-02 10:37:53",
    "ups": "44590",
    "downs": "1149",
    "views": "1177637",
    "top_comments": [
        {
            "comment": "grrrrrr",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "*Paul Elam* (\"An Ear for Men\") has been warning us for decades about the anti-men teachings of Kimmel and his accomplices.\nGlad to see this reach Fox. ✌️😄",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Newt Gingrich is a divorced man in the Catholic Church.......",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Women can protect themselves now. It's not like women are willing to protect men??",
            "polarity": 0.25,
            "subjectivity": 0.75
        },
        {
            "body": "It's ironic that traditional masculinity has been destroyed , but somehow these social engineer types still expect society to be fixed and women rescued by strong men. But that won't happen. Actual men are made , not willed into existence at need and put into storage when the crisis is \"over\".",
            "polarity": 0.12777777777777777,
            "subjectivity": 0.4583333333333333
        },
        {
            "body": "We have a bunch of feminazis trying to tell men how to be men.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Women want to be strong and independent right🤔",
            "polarity": 0.21666666666666665,
            "subjectivity": 0.42916666666666664
        },
        {
            "body": "We are here Laura! Just a little older, scattered within the pajama boys.",
            "polarity": -0.010416666666666671,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "*Paul Elam* (\"An Ear for Men\") has been warning us for decades about the anti-men teachings of Kimmel and his accomplices.\nGlad to see this reach Fox. ✌️😄",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Right here , doin Reno’s 7 days a week a lot of late nights , couldn’t be happier. Still crushing on Ingraham though",
            "polarity": 0.1285714285714286,
            "subjectivity": 0.6785714285714285
        },
        {
            "body": "Feminism happened. Almost all feminist don't want equality. They want superiority",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Everything Laura said was true. But the core problem is that violent men feel empowered to attack women. That's because they know they won't be held legally accountable. Crime is soaring in every US city. Leftist politicians have changed the laws. It's increasingly futile for the police departments that haven't been de-funded to arrest criminals who commit crimes like these. When they are arrested, they're immediately released, on low or no bail. Plus if the assailant is black and the victim isn't, anyone who wants to intervene, does so knowing they'll be labeled a 'racist', and then doxxed, fired or even arrested. Being a Good Samaritan no longer means being brave in the moment. It means risking your livelihood. This is what happens in the intersection of \"woke\" culture + pro-criminal laws.",
            "polarity": 0.10075757575757574,
            "subjectivity": 0.44848484848484843
        },
        {
            "body": "HEY LAURA!!!!!!!;-----MEN BE HUMBEL????----HA!!!!!!!!!!;-----LADIES FIRST!!!!!!!!!!!!!!!!!!!!!!!!\n---YOU DON'T DO THE LIFTING????-------\n----YOU DON'T TELL ME WHAT TO DO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "polarity": 1.0,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "John 6:47 \"verily, verily I say unto you, he that believes in me has everlasting life.\"-Jesus.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Take it easy on the Botox hotdog head.",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "grrrrrr",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "we're checked",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It starts with genital mutilation.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Is this society worth protecting, sacrificing and providing for?\n\nIMO, not really \n\nSure, _if_ you have kids you _have_ to do all those things because now you’re locked into the system. Even if it’s not an ideal system \n\nBut there’s a lot of guys out there who were raised in subpar conditions (poor-single parent household), and grew up inhibited because of that. Now they’re adults, or soon will be. \nAnd more of them are going to start feeling resentment towards society, especially if it doesn’t have their best interests in mind.\nEnjoy the Decline, live your life",
            "polarity": 0.37329545454545454,
            "subjectivity": 0.5986111111111111
        }
    ]
}