{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-10-31 00:58:02",
    "ups": "27617",
    "downs": "656",
    "views": "614466",
    "top_comments": [
        {
            "comment": "6:15 to be fair she asked for it 🤷🏽‍♂️🤷🏽‍♂️🤷🏽‍♂️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "comment": "they went somewhere where they cannot see you or hear you, my dear",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "\"I say this as a single mom myself\"\nNo surprise. The fundamental problem is women voters being misled into disempowering and alienating their male counterparts. There is no easy solution. I would like to see the states organize a constitutional convention, but watch our Supreme Dictators declare it unconstitutional! And if the Deep State military supports them, we will just have to cope. A constitutional convention won't solve our fundamental problem, but we would last longer.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1060374149659864,
            "subjectivity": 0.2877551020408164
        },
        {
            "comment": "Its not that good men domt want to act. Its the fact that we are prosecuted and most often found guilty for defending ourselves/others. I was sentenced to 18 months for defending myself and beleive me the prosecutor did everything SHE could to make me into the bad guy, and was succesfull...when i got out i was told verbatim by my PO that even if i was the one to get attacked i would be sent back to prison.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 2.2204460492503132e-17,
            "subjectivity": 0.5533333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "SO, let me get this straight, an opinion host on a conservative talk show is now doing specials on masculinity?  Or is it just a slow news days and you want to take snippets from some random conversation and say that \"liberals\" are crazy\" for your baby boomer viewers to lap up like good little cult members.",
            "polarity": -0.11458333333333337,
            "subjectivity": 0.55
        },
        {
            "body": "Women left the kitchen now any real man doesn’t want a work mate. Don’t tell me equal nonsense either who wants to work who wants to cook and clean it’s called doing your part in a relationship. Women have kids if they had a few they would be home half there young adult years already they aren’t bringing the bread home. People have to stop living in a perverted reality life is tough get over it",
            "polarity": 0.037373737373737385,
            "subjectivity": 0.29545454545454547
        },
        {
            "body": "Brilliant Laura.   Great article.  Any one who leaves you a single mother is a fool.  You are beautiful smart and educated.",
            "polarity": 0.5385714285714286,
            "subjectivity": 0.7214285714285714
        },
        {
            "body": "Ingraham it all comes down to most kids not having fathers. A mother has her own benefits and she can help her son in many ways as he grows up. However her son will never take her serious and never fear her like he would his father. It all comes down to the fact that fathers are better at discipline, teaching a man how to be a man, and helping his son go through his phases in life. A woman/mother would never understand this. Just as a father would never understand his daughter fully. This is why we as a race were made to have Male and Female. They both compliment each other in different ways.",
            "polarity": 0.12095959595959598,
            "subjectivity": 0.45328282828282823
        },
        {
            "body": "Thank Rs.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd stand up to any of these people who do these atrocities...buuuuut, I live in NOVA and I'm 99% sure I'd be charged with assault and be locked up longer than the actual criminal. THAT is what keeps me from intervening...",
            "polarity": 0.05909090909090908,
            "subjectivity": 0.5097222222222222
        },
        {
            "body": "Natural Roles leave us alone",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "We're going our own way.  See ya.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Its not that good men domt want to act. Its the fact that we are prosecuted and most often found guilty for defending ourselves/others. I was sentenced to 18 months for defending myself and beleive me the prosecutor did everything SHE could to make me into the bad guy, and was succesfull...when i got out i was told verbatim by my PO that even if i was the one to get attacked i would be sent back to prison.",
            "polarity": 2.2204460492503132e-17,
            "subjectivity": 0.5533333333333333
        },
        {
            "body": "Your not getting these pussies to run into bullets off of a Higgins boat in Normandy. Whom without these Real Heroes they wouldn’t have a platform to act out on",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "\"I say this as a single mom myself\"\nNo surprise. The fundamental problem is women voters being misled into disempowering and alienating their male counterparts. There is no easy solution. I would like to see the states organize a constitutional convention, but watch our Supreme Dictators declare it unconstitutional! And if the Deep State military supports them, we will just have to cope. A constitutional convention won't solve our fundamental problem, but we would last longer.",
            "polarity": -0.1060374149659864,
            "subjectivity": 0.2877551020408164
        },
        {
            "body": "I tell my boys that now all the time",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "they went somewhere where they cannot see you or hear you, my dear",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "6:15 to be fair she asked for it 🤷🏽‍♂️🤷🏽‍♂️🤷🏽‍♂️",
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "body": "I’m so blessed to have 4 men n my life (my husband, two sons and grandson) who know how to look after and be protective of me while also knowing that I can handle myself when I need too. They feel protective of all women, and of that I am very proud.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "No babies with out abortion. Jared Polis converted all the men.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Chaos they want.chaos they create. So stop talking! If you not act right now it's to late!",
            "polarity": -0.04464285714285715,
            "subjectivity": 0.5678571428571428
        },
        {
            "body": "GIVE ME JOHN WAYNE! TOUGH BUT TENDER!",
            "polarity": -0.4861111111111111,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "If by men, she means immature bros, good riddance, if by men she means stioc traditionalists, were out here building the country",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Toxic masculinity? Man splaining? Patriarchy? We're lucky for the few men still willing to be identified as such.",
            "polarity": 0.09583333333333333,
            "subjectivity": 0.5458333333333334
        }
    ]
}