{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 01:40:11",
    "ups": "37445",
    "downs": "912",
    "views": "940923",
    "top_comments": [
        {
            "comment": "Lucky Gets It . . . Take Charge , Command , Mount , Giddy-Up , and Ride for Sunset .\n     Agree ?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Don't be a girl in a boy's body.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I guess I do not fit their mold, I served in the military carrying an M-16 daily, and then served 20 years with my local Sheriff's Office working in the county jails. I was counseled once by a female sergeant to not be so assertive in protecting my female counterparts. I agreed the women needed to be able to protect themselves, however I was refusing to stand by as an inmate was trying to take advantage of my partners. I was taught this as a young boy, I beat up two neighborhood boys that were picking on my three year old sister. My Mom and Dad praised me for my efforts and I didn't get in trouble. I would still some 60 years later defend my sister if she asks for my help. However my kids have seen me cry when I needed to, oh yes and admit when I am wrong, apologize and most of all, I know that I badly need Jesus Christ as my savior, this guy is not perfect nor will I be. It is okay to be tough when it is needed, but to hide your feelings is wrong. God gave men and woman the ability to cry on purpose. Thank You Laura for this video, ALL men and women need to watch this!!!",
            "polarity": -0.10363618827160494,
            "subjectivity": 0.4199074074074074
        },
        {
            "body": "That big black boy that hit that small white lady is a punk, now I say boy because he is, for nobody doing anything against him, straight up I'm not into guns but a knife under the chin you can turn and see the white of his eyes go dark, bul 't that people don't even try anymore.",
            "polarity": -0.05238095238095237,
            "subjectivity": 0.24761904761904763
        },
        {
            "body": "Lucky Gets It . . . Take Charge , Command , Mount , Giddy-Up , and Ride for Sunset .\n     Agree ?",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Real men in this country endure. We carry the message of American exceptionalism and raise our sons to do the same. \n“We came from the West Virginia coal mines and the Rocky Mountains and the western skies. And we can skin a buck; we can run a trotline, and a country boy can survive.”\n-Hank Williams Jr",
            "polarity": 0.05,
            "subjectivity": 0.10625000000000001
        },
        {
            "body": "Ask the female supremacist female narcissists man shamers man haters where we went? The Tik tokers the facebookers.. the snob Millenial feminist who say they bathe in men’s tears and act masculine forcing there agendas on the world..",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.2111111111111111
        },
        {
            "body": "I remember being told not to be a drama queen, really pissed me off but I'm thankful",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Yeah , its for laughing, The world is not lost what is lost are  the people that want to scream about everything in this life !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Boys who are more disciplined grow up to be disciplined men.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Real men are constantly under attack. Look what they did to Trump.\nRemember when they attacked him for going to a night club and grabbing women by the p---y? There was no condemnation for the women who went to night clubs to let men grab them by the p---y.\nToxic masculinity is horrible, but there's no condemnation for toxic feminism.",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.5444444444444444
        },
        {
            "body": "Would be nice to see men grow some kahonas and stand up for whats right and decent, instead of cowering to the woke and leftist mobs.",
            "polarity": 0.2505952380952381,
            "subjectivity": 0.700595238095238
        },
        {
            "body": "Toxic masculinity is a problem .... in today's women. Toxic femininity is a problem.... in today's men. IMO!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I raised my two boys telling them, \"Man up!\";  \"Stop acting like a girl!\"; and you know what, they did.  They love and take care of their families.  They love and take care of their friends.  Everyone around them love and appreciate their \"Alpha\" attitude when it comes to doing anything.  They never say, \"I can't!\".  They always say, \"I got this!\".  My daughters are head over heals for them and when they look at my two boys, all I see in their eyes is admiration with pride.  I taught them that yelling only builds walls so they don't ever yell at their wives or friends.  They stay calm and have a real conversation with empathy with everyone.  They don't get involved in stupid things like Social Justice or gender conversations.  They usually just blow it off saying, \"good for you!\".  Then they walk away knowing that it is never going to be a conversation, just accusation.  They focus on important things like taking care of loved ones.  They work hard, they provide not only materialistic stuff but provide love with security.  My two boys are what everyone keeps saying are \"Evil\" and \"Disgusting\".  Well it what they are doing is evil and disgusting then I guess we all are in my family.  Oh yeah, \"good for you!\".",
            "polarity": 0.01537698412698412,
            "subjectivity": 0.6813492063492063
        },
        {
            "body": "Men still exist, we just don't want to deal with feminists and other drama queens",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "I would have been right in the guy's face on that train. Here courtesy would not be an option.",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "My parents never told me to \"be a man\", or not to cry. My maleness came naturally.",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "Sorry.....Tuned out when she used the shaming words \"real men\". Who gets to define that? Her?. \n    The people that have been parasitizing and treating men as disposable bullet sponges and walking ATMs for more than a century?\n      The meltdown is going to be epic. Atlas isn't just going to shrug he is going to go full Samson on the temple. Enjoy what you asked for.",
            "polarity": 0.30999999999999994,
            "subjectivity": 0.45
        }
    ]
}