{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-03 23:43:33",
    "ups": "45850",
    "downs": "1170",
    "views": "1207471",
    "top_comments": [
        {
            "comment": "I am here \nI wear the pants but treat my wife great!\nShe loves me",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "comment": "Better to be raised by a mother and a father not two mothers",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "We're still here going to work and supporting our families and doing whats right, while the lefts are offended and crying in the corners with their hurt feelings and seeking safe space asylum.",
            "polarity": 0.2089285714285714,
            "subjectivity": 0.4714285714285714
        },
        {
            "body": "I feel like saying women are strong and independent and like the bad boys and to be hit on, but women have complex emotions and don’t really know better, but it’s just Heart retching to see a powerless and reserved woman get abused by bad guys the words chill or take a chill pill doesn’t mean hit the person who said it let alone a woman, even if she is loud and verbally obnoxious you shouldn’t hit her, now if she is getting out of hand on an independent strong woman tip and feels bold enough to put her hands on you first, then it would be okay to return the favor with a non lethal and non hospitalization love tap, actually try walking away first and if she follows you and continues hitting record her, and it that don’t work than the love tap",
            "polarity": 0.07437500000000001,
            "subjectivity": 0.5085416666666667
        },
        {
            "body": "Revolt against the modern world!",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "They are all turned into simps and beta soy boys thanks to the left",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "You didn't have bastard children so you aren't a single mother.   \nA well established person adopting children alone isn't the same thing. \nIt USED TO BE that male family members stepped up and helped widowed, divorced and single mothers \nbut today they are missing in many communities.  They are family after all.  Family members in the past \ndidn't encourage single mothers to keep having bastard children, they encouraged them to get married first or often\nmarried family members ADOPTED their nieces etc baby so BOTH the mother and the baby would have a normal life. \n\nBy trying to call widows and divorced mothers single mothers Liberals hoped to make being a single mother more respectable.\nIt didn't work.",
            "polarity": 0.09955357142857144,
            "subjectivity": 0.28623511904761906
        },
        {
            "body": "All the men have become women 😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You can’t step in to help, these days you could end up being arrested and the assailant goes free",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "This is America😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}