{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-10-31 17:25:28",
    "ups": "34428",
    "downs": "833",
    "views": "859761",
    "top_comments": [
        {
            "comment": "So it’s OK for a woman to exhibit masculinity and become butch more craziness and men always had the role of a hunter gatherer or is that part of history they want to remove!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.5625,
            "subjectivity": 0.5
        },
        {
            "comment": "women are equal they can help themselves now in 2021",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "comment": "A Christless society can only give you unrestrained hate and thuggery. \n\nMothers are the first line of defense, especially in single parent families and when they fail their moral duty, others down the path of their children, will suffer the consequences, with or from those children. \n\nOur society is expressing the lostness of its spiritual soul and is right back where Christ said it would lead in the last of the last days, \"as in the days of Noah,\" where violence filled the earth.\n\nIf you think what Laura shared was repugnant, then you will be shocked just how more hideous the world is going to get.  Everyone who understands what is unfolding, should be preparing themselves for the worse case scenario and your children need to be brought up to speed as to what is obviously coming their way.\n\nWomen, need to accept the fact that they are not living in a safe society and that they need to conduct their affairs in a proactive, defensive posture. \n\nAlmost every misery facing the world, has democrat fingerprints on the evidence and people are still supporting them, because they think there's something free to be had, if they do.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.0056349206349206316,
            "subjectivity": 0.4576587301587301
        },
        {
            "comment": "We left the cities and corporations. We are being pushed out of society. My son will be raises to be strong without city school influences",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.21666666666666665,
            "subjectivity": 0.36666666666666664
        },
        {
            "comment": "This is the result of ---> THE FEMINIST going to FAR",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Lol as a kid I watched old black and white movies where the leading man slapped hysterical women in the face and then they would make out. As a teen we had Phil Donahue. Go figure.",
            "polarity": -0.04444444444444443,
            "subjectivity": 0.38888888888888884
        },
        {
            "body": "3:00 How come you're no longer in a relationship ?  With those \"uni directional laws\" given, the opportunity of applying \" The law of the least effort\", will always prevail. We're getting, so brain lazy. What kind of example are we giving our kids ?",
            "polarity": 0.016666666666666646,
            "subjectivity": 0.7666666666666666
        },
        {
            "body": "We left the cities and corporations. We are being pushed out of society. My son will be raises to be strong without city school influences",
            "polarity": 0.21666666666666665,
            "subjectivity": 0.36666666666666664
        },
        {
            "body": "U mean white men because us niggas ain’t went no we’re. Hispanics definitely are here to stay. So who exactly are you taking about lol.",
            "polarity": 0.14750000000000002,
            "subjectivity": 0.42750000000000005
        },
        {
            "body": "As a man I walk through this world with no apologies....unfortunately this generation is not built Ford tough. Lack of fathers, promotion of homosexuality everywhere, feminized men all over TV, demonizing boys for being boys. This once great nation has collectively lost its mind.",
            "polarity": 0.20555555555555557,
            "subjectivity": 0.7916666666666667
        },
        {
            "body": "This is the result of ---> THE FEMINIST going to FAR",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "This is a case of too much time on your hands people need to mind their own business and stay in their Lane my cousin intervened with a couple arguing where the man struck the woman several times with a closed fist my cousin asked the man to take it easy the man pulled out a 9 mm shot him and killed him at a Walmart Christmas Eve with his wife inside buying a dress she comes out to my cousin dead the punk that killed my cousin 25 years old sad excuse for a man now he's in the state prison with taxpayers footing the bill that's the business America is in housing inmates privatized jails humans all over the world are going to get a wake-up call and realize what is important",
            "polarity": 0.04027777777777779,
            "subjectivity": 0.3986111111111111
        },
        {
            "body": "We are all faithfully taken 😆",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "women are equal they can help themselves now in 2021",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "What is going on now, I would blame the educational system… why?\nSeveral occasions, I have heard the report regarding a situation… of which if a person appears to be showing themselves as an idiot, no one steps into the situation so as to help… but what they do is… post it on the internet?  So as to make light and humor of someone’s error.\nSo where has compassion disappeared to?  It like the educational system is teaching the newer generation to ‘show no concern’ -except for yourself!  Focus on your own needs, others are questionable… don’t trust the strangers… because you never know if they are an enemy!\nSo is love, kindness, compassion but as characteristic of the past?  Do these have any value?  Or are they just old-fashioned elements of history which are become ‘archaic’.\nBut then observe how democrats are handling issues… I think it’s near time for a different nature of intervention.",
            "polarity": 0.10871212121212123,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "I agree with her 100%",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "0:22 correlation =\\= causation\nIn this case it’s the other way around.\n\nBoys who are falling for the self-victimization culture are having a hard time becoming real men",
            "polarity": 0.058333333333333334,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "Men are learning that if you help someone you will most likely  be charged and thrown in jail doubly true in states like NY",
            "polarity": 0.1875,
            "subjectivity": 0.5375
        },
        {
            "body": "A Christless society can only give you unrestrained hate and thuggery. \n\nMothers are the first line of defense, especially in single parent families and when they fail their moral duty, others down the path of their children, will suffer the consequences, with or from those children. \n\nOur society is expressing the lostness of its spiritual soul and is right back where Christ said it would lead in the last of the last days, \"as in the days of Noah,\" where violence filled the earth.\n\nIf you think what Laura shared was repugnant, then you will be shocked just how more hideous the world is going to get.  Everyone who understands what is unfolding, should be preparing themselves for the worse case scenario and your children need to be brought up to speed as to what is obviously coming their way.\n\nWomen, need to accept the fact that they are not living in a safe society and that they need to conduct their affairs in a proactive, defensive posture. \n\nAlmost every misery facing the world, has democrat fingerprints on the evidence and people are still supporting them, because they think there's something free to be had, if they do.",
            "polarity": -0.0056349206349206316,
            "subjectivity": 0.4576587301587301
        },
        {
            "body": "So it’s OK for a woman to exhibit masculinity and become butch more craziness and men always had the role of a hunter gatherer or is that part of history they want to remove!",
            "polarity": 0.5625,
            "subjectivity": 0.5
        },
        {
            "body": "That’s sad",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Depends on city and state...certain cities, towns, regions, if a woman was attacked the assailant would be held, arrested, or some form of payback. People who live in these towns don't wonder if woman would be protected, but just watch, the honor to defend her honor is instinctive.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "What happened to the Generation of hard working masculine men who couldnt communicate with their sons and everything  said had to through the mother? Men who didnt discuss their \"Feelings\" but drank instead...now men will hug their sons ..ew",
            "polarity": -0.09583333333333334,
            "subjectivity": 0.4208333333333333
        }
    ]
}