{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 09:54:08",
    "ups": "39820",
    "downs": "996",
    "views": "1023563",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Some are going to transfer their gender.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Trans people be like I hate both women and men let’s start our own gender",
            "polarity": -0.10000000000000003,
            "subjectivity": 0.95
        },
        {
            "body": "No one intervened on the train because the perp was black. We all know what happens when u strike a black man even in self defense",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "Anyone lives for policy in this world",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No kidding. They are all hiding.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I don’t think this is just a male issue, (well it is) what I mean, this whole showing your true emotions and just having to be sensitive 24/7. What the hell is wrong with being stoic?",
            "polarity": -0.02708333333333333,
            "subjectivity": 0.60625
        },
        {
            "body": "Do multi-generational  PIMPS like tRump TRASH count ?  I didn't watch much TV for years due to long hours & studies.\nThe first time I saw the \"adult women of FOX:\". The were dressed like  'CHEAP STREET WALKERS' @6 AM\nARGHHH. NO WONDER the BLOATED TOAD DIED AFTER HIS REIGN OF TERROR.  ALL the LEGAL OFFICERS.....",
            "polarity": 0.1392857142857143,
            "subjectivity": 0.3583333333333334
        },
        {
            "body": "As a new parent myself now, I've noticed how weak the male characters in my son's cartoons today have become. When I was a child, cartoon heroes were strong, dashing men and wise, inspiring women. Now, their neither.",
            "polarity": 0.23244949494949493,
            "subjectivity": 0.635479797979798
        },
        {
            "body": "That is not a man! What a wimp!👎🏼",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Where have all the men gone?\n\n55 millions Americans were butchered in the womb since 1973! May be half of them were men! \n27.5 millions men went straight to mud from their mothers womb!\nCan we call them mother.....\none day that so called mother has to stand before her son or daughter! What a terrible moment it could be!",
            "polarity": -0.2986111111111111,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "Also Soy plastics etc all lowering test!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "HA HA the end is nie",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Try punching my wife while I am standing anywhere near and see what happens... in fact, try punching any woman at all, even a complete stranger when I am anywhere around and see what happens... I grew up in a household where it was drilled into my head since birth that you DO NOT ever hit a woman for ANY reason. I've been told it is a \"sexist\" attitude... but what is sexist about having the desire to protect another human being that isn't physically as strong as I am?",
            "polarity": 0.15833333333333333,
            "subjectivity": 0.4083333333333333
        },
        {
            "body": "Radical fem!n!$m'$ negative effects on culture and law has lead to men with the capacity to provide or protect being far more selective with who or what they are willing to do it for.  This is a sensible choice to protect themselves emotionally, mentally, and physically, from a more hostile environment, that seems particularly more emotionally, financially, and legally hostile on average than what it was in the past.",
            "polarity": 0.10416666666666669,
            "subjectivity": 0.40357142857142864
        },
        {
            "body": "You asked for it, you got it.  The draft is also coming.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Did the women jump to help her?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bad things happen when good people stand by and do nothing.",
            "polarity": 5.551115123125783e-17,
            "subjectivity": 0.6333333333333333
        }
    ]
}