{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 18:08:55",
    "ups": "42205",
    "downs": "1066",
    "views": "1094553",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Oh my, oh my men need to wake up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Men are taught to be protectors, providers, model figures to the family, an example. If you do NOT appreciate these things in a man..you deserve to be alone!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Good job Laura.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Why don’t you shut up and tell the truth interest of be a shill for Fox.  Trump won Biden is not even a real president",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "It's your fault, ladies.  OWN IT.  There were probably a few good men in close proximity to every heinous incident, but what man wants to risk facing the real possibility of incarceration for being falsely accused by the same woman they choose to defend?  The game is severely lopsided in favor of women, so men are leaving the game.  Thank the movement, the courts, and big daddy government because they have replaced the \"real\" men women claim they don't need anyway.",
            "polarity": 0.04545454545454542,
            "subjectivity": 0.36590909090909096
        },
        {
            "body": "men have realised that every thing good they do they get payed in negativity in this cursed world so they stop and live their own life, you people who are deceived by the devil you can do whatever you want to do just don't apolige or cry when you realise you were wrong on judgement day!",
            "polarity": 0.20284090909090907,
            "subjectivity": 0.75
        },
        {
            "body": "send those bright haired feminist bimbo's to fight crime.",
            "polarity": 0.7000000000000001,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "they are walking around in dresses claiming to be women 😒",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I think what we need to do is allow our young men to be able to speak their feelings. Yes we need our boys to be men, but we were raised by men who weren’t thought how to speak their feelings. You know who a man cries to? A woman he loves. You need to talk more about degeneracy. That is what is making young men worse.",
            "polarity": 0.16000000000000003,
            "subjectivity": 0.505
        },
        {
            "body": "None of this will be solved because we're 60 years deep in leftist administrators taking over all govt agencies. Almost makes me want to become a black Amish.",
            "polarity": -0.07222222222222223,
            "subjectivity": 0.4777777777777778
        },
        {
            "body": "Read the book \" Iron John\" ( Blye)\nMs. Ingram if you're looking for a man you won't find one in \" high society\" or \"low society\" or most people under 60.\nWomen want their cake and eat it too at all times. If they met a \"real man\" they would likely find him \" threatening \".Women like homosexual males because they find them less \"threatening \".",
            "polarity": 0.11555555555555558,
            "subjectivity": 0.4511111111111111
        },
        {
            "body": "Are you talking about Man or Mankind..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They stopped hunting, fishing, and working on cars. They now wear flip flops and play video games. But don't worry, they are still a few of us left out here. Strong men are good men! We try to do what's best for our families. And we will stop anything bad from happening to a lady. We still open doors for women. This country will go down without us!! Don't forget that.",
            "polarity": 0.14565972222222226,
            "subjectivity": 0.3986111111111111
        },
        {
            "body": "PUSSIFICATION OF AMERICA CONTINUES!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He knocked feminism right out of her head",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "Bullsquat, being traditionally masculine does not negatively affect men's mental and physical health. What negatively affects them is being told that you can't be a man and that being one is to the detriment to those around.",
            "polarity": -0.03,
            "subjectivity": 0.28857142857142853
        },
        {
            "body": "Men are still here…..we just aren’t playing the game because it’s stacked against us. \nYou can thank feminism. \nLook at the percentage of men in prison that were raised by a single mother. It’s very high. Women raise children, men raise adults.\nNobody really cares about us men anyway. \n“Women, children and dogs are loved unconditionally. Men are loved when they provide something”.",
            "polarity": 0.22276190476190474,
            "subjectivity": 0.5193809523809524
        },
        {
            "body": "They got what they wanted !! Strong, independent and equal !! You get equal rights and lefts now",
            "polarity": 0.10833333333333332,
            "subjectivity": 0.33958333333333335
        }
    ]
}