{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-05 21:02:39",
    "ups": "46100",
    "downs": "1176",
    "views": "1214254",
    "top_comments": [
        {
            "comment": "No one saved chill pill girl because the guy was black and everyone's got s**t to do and places to go",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "comment": "I don't exist to defend young women I don't even know. If it were a family member, or a senior or child than yes.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "comment": "Whats in it for men to risk themselves for random women. Seriously why?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.41666666666666663,
            "subjectivity": 0.5833333333333333
        },
        {
            "comment": "I feel like they make the assumption you can't have both masculinity and feelings. Even the toughest of men can break down, we are all human. Masculinity is not inherently toxic just like femininity, however like anything there can be extremes of everything. For example, we have seen instances of toxic feminism but you don't see that being talked about. This is just one of those scenarios where a few bad cops labels all of them, but instead, a few bad toxic men creates a \"toxic masculinity\" issue that really isn't even there.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.25079365079365074,
            "subjectivity": 0.30317460317460315
        },
        {
            "comment": "Be careful!  The bible says, \"Fathers..... DO NOT exasperate, abuse your children .....because they will become downhearted (depressed!)\"!!   The worst kind of men are the caveman (uggh!) types,, and even football is  in many ways, a very false notion,,   that knocking another boy, or man down actually means something in real-life!?!?!  That's fugged up!!!   I was always a very strong young man, and was on the wrestling team, gymnastics team, and track & field team!  But, I NEVER abused anyone of my classmates in the SLIGHTEST WAY!!!   I was fortunate to have had 10 years of bible study that made me sensitive to the feelings of others, and Christs teachings firmly affected my view(s) on life!!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.012458043981481473,
            "subjectivity": 0.6601851851851852
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Don't have kids if you can't get your own life straight first. Do you rely only on church and schools to teach your kids ? Both parents are equally responsible to teach their kids what is right and wrong.",
            "polarity": 0.14795918367346936,
            "subjectivity": 0.6741496598639456
        },
        {
            "body": "Recommend a book titled \"Man of Steel and Velvet\" by Aubrey Andelin",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just as the gospel is given to us freely and it is the good news.\nThe way this advertisement is being advertised it's like it has one of God's blessings for sales.\n\nIf you are trying to profit from one of God's gifts then you're just as bad as the devil.\n\nIf it's so true this help people then give the information away.\n\nSTOP MARKETING GOD'S GIFTS OF KNOWLEDGE EXPLOITING THE SHEEP!",
            "polarity": 0.20937500000000006,
            "subjectivity": 0.6791666666666667
        },
        {
            "body": "I feel like they make the assumption you can't have both masculinity and feelings. Even the toughest of men can break down, we are all human. Masculinity is not inherently toxic just like femininity, however like anything there can be extremes of everything. For example, we have seen instances of toxic feminism but you don't see that being talked about. This is just one of those scenarios where a few bad cops labels all of them, but instead, a few bad toxic men creates a \"toxic masculinity\" issue that really isn't even there.",
            "polarity": -0.25079365079365074,
            "subjectivity": 0.30317460317460315
        }
    ]
}