{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-10-31 13:18:26",
    "ups": "33136",
    "downs": "811",
    "views": "821565",
    "top_comments": [
        {
            "comment": "Nowadays you don't tell your sons to not be a girl. You tell them don't be a boy pretending to be a girl",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I am a man.  I teach my son as I was taught.  The rules real men live by as you said: don't bully people, don't beat your wife or kids.  Be brave, be honest, be true to who you are.\nMy son is 13; we work out together, study martial arts together, go to the range together.  I teach him to love God, his Country, his Family and to cherish his Freedom.  If I were not around anymore, I know I have already raised a REAL, GOOD MAN.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.44829545454545455,
            "subjectivity": 0.6062500000000001
        },
        {
            "comment": "White women on their own. They stood up and marched for George Kirby, now you get the Haiti treatment. If you’re smart, flee the city bcuz no ones saving you",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2714285714285714,
            "subjectivity": 0.5476190476190476
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Men are scared because of all the liberal judges who would punish them for protecting others, how come that black man on the train wasn't arrested for assault are the police officers afraid the courts also",
            "polarity": -0.3833333333333333,
            "subjectivity": 0.6666666666666667
        },
        {
            "body": "No confidant man would ever buy into this “Toxic Masculinity” garbage. There are way to many overly sensitive people in this country that are dragging us down. Men and women alike need to grow a set!",
            "polarity": 0.13518518518518516,
            "subjectivity": 0.562962962962963
        },
        {
            "body": "Nowadays you don't tell your sons to not be a girl. You tell them don't be a boy pretending to be a girl",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "don't dare flirt with women either- that is aggressive. I'm at the point where I'm just going to shut up and make as much money as possible.",
            "polarity": 0.1,
            "subjectivity": 0.6
        },
        {
            "body": "White women on their own. They stood up and marched for George Kirby, now you get the Haiti treatment. If you’re smart, flee the city bcuz no ones saving you",
            "polarity": 0.2714285714285714,
            "subjectivity": 0.5476190476190476
        },
        {
            "body": "The U.S is losing it's mind. Too much of any good* thing(progressiveness) is always bad thing. Thank God it's not as bad in Europe.\n\nWhere I come from women are put on a pedestal (BUT only on the condition they behave like actual women, as in Feminine).\n\nThat culture is so deep in my heart, to the point where I feel weird if I don't hold the door, take out the trash or carry heavy stuff for a lady, even if i don'tknow her. \n\nI still get the surprised and fewer times weird looks every now and then when I offer to help, but at least its better than being vilified.",
            "polarity": -0.10769230769230767,
            "subjectivity": 0.6102564102564103
        },
        {
            "body": "Women chose child support!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You know if you’ll bother to actually read the Bible and read how it actually was before the massive flood you will see the way this world is going was exactly how it was , Noah and his family were the only non toxic unmoved by that times. It says absolutely everyone did evil continuously , there was no good in the world except for you guessed it Noah and his family who still believed and obeyed God!! The world is heading exactly down that slope to hell so be warned that like it was in the time of Noah that is the way the world will be at its end stage!!",
            "polarity": -0.14367283950617285,
            "subjectivity": 0.5820987654320987
        },
        {
            "body": "The government got rid of em! 🚮✌🏾",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "At this rate, demasculation of men is inevitable. \nPublic crisis will force middle and lower income children into isolated virtual reality, where any intellectual talent will be stolen by big data enterprises and fed into AI machine learning. \n Minimal resources will be used to house and feed people of lower and middle class. \nMating and selection will occur in a virtual world; thus reducing population. Surplus resources will be used by wealthy and elite. \nMiddle and lower income generations will be wiped out. \nAn array of catalysts (the Catalyst Array) have already been planned and will be used at the appropriate time when online behavioral matrices suggest control must be implemented. \nIt's parents faults for allowing their children to become addicted and raised by smartphones.",
            "polarity": 0.07272727272727272,
            "subjectivity": 0.3878787878787879
        },
        {
            "body": "They hide them from the media",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Christians of the world have known about the attack on families and man- hood for the past 60 odd years. That's why the NWO don't like Christians.",
            "polarity": -0.20833333333333331,
            "subjectivity": 0.25
        },
        {
            "body": "🤔 All those whimps missed their opportunity to be Mike Tyson on camera, and probably could of got away biting his 👂 off too...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am a man.  I teach my son as I was taught.  The rules real men live by as you said: don't bully people, don't beat your wife or kids.  Be brave, be honest, be true to who you are.\nMy son is 13; we work out together, study martial arts together, go to the range together.  I teach him to love God, his Country, his Family and to cherish his Freedom.  If I were not around anymore, I know I have already raised a REAL, GOOD MAN.",
            "polarity": 0.44829545454545455,
            "subjectivity": 0.6062500000000001
        },
        {
            "body": "You said you didn’t need one remember",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Most men want to be men. However, women only want the things that they like. Therefore men have given in and are taking a back seat as they do as they are told. Real men are a thing of the past and there are few left these days. Sad, how men have been stripped down and don't want to upset the situation anymore because they might get yelled at for whatever the inconvenience may be to their significate other.",
            "polarity": -0.053055555555555564,
            "subjectivity": 0.3813888888888889
        },
        {
            "body": "Wait?  I thought Ingraham was a man?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ITS CALLED ''ATRAZINE'' LAURA.........",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The government killed em! 🚮",
            "polarity": -0.25,
            "subjectivity": 0.0
        }
    ]
}