{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-03 03:07:01",
    "ups": "45610",
    "downs": "1170",
    "views": "1200253",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "The demasculation of men has been slithering through society for years. Part of the a gen da.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm right here, Laura.  ;)",
            "polarity": 0.26785714285714285,
            "subjectivity": 0.7678571428571428
        },
        {
            "body": "Toxic masculinity is the enemy here, not masculinity. Which by the way means something diffrent to everyone. What I find masculine might not seem masculine to someone else. For example hunting does not make you a man, not crying does not make you a man (stupid), cooking does not make you less of a man. Cleaning does not make you less of a man. I can go on and on. Obviously yall don't know what toxic masculinity is. Thinking a household is blessed because the first born is a boy. Thinking God created women for the men. That stuff is what is bad. PEOPLE stop being stupid. It's annoying.",
            "polarity": -0.2621212121212121,
            "subjectivity": 0.5212121212121213
        },
        {
            "body": "OML a female that understands this crap AMAZING teach the rest of your sisters ! I am 100% what feminists & lefties HATE ! A good OLD masculine alpha male that will do ANYTHING to protect women & children of ANY decent society & allied countries. 1 of the last dinosaurs right here, Exactly what society has relied on to save their citizens in times of war. Let's see how fast these loser woke idiots change their views next time their country & safety is in threat OR do they think they can rely on their ABDEFGHIGAYLK+++++ people to save them lol Heads up they won't wanna break their fingernails your gunna be screaming for real men 100% !",
            "polarity": 0.05896358543417368,
            "subjectivity": 0.46386554621848736
        },
        {
            "body": "oof, woman don't need no man. strong and independent",
            "polarity": 0.21666666666666665,
            "subjectivity": 0.42916666666666664
        },
        {
            "body": "Where are all the real women at these days",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Unfortunately women have vilified “good men” as being weak, soft, boring, and corny. You wanna know why that black dude got away with hitting that woman? Because women have also uplifted the “bad man” as strong, exciting, and a sight to behold. Women, especially those of the womanist movement, have also made it difficult for men to step in without facing retaliation for assisting. In the end, as the angle pointed out, it’s still the women who lose and it’s unfortunate.",
            "polarity": -0.18402777777777776,
            "subjectivity": 0.7673611111111112
        },
        {
            "body": "She said a month full",
            "polarity": 0.35,
            "subjectivity": 0.55
        },
        {
            "body": "My dad would always say, don’t be such a puff. Makes perfect sense.",
            "polarity": 0.5,
            "subjectivity": 0.75
        },
        {
            "body": "Two pansies that have never done a day of hard work in their life, discussing what it is about to be a man... I wish the asteroid would hurry up and get here",
            "polarity": -0.2916666666666667,
            "subjectivity": 0.5416666666666666
        },
        {
            "body": "Love this woman. Wish she was a neighbor.  I have a feeling she is a lot of fun when she is drinking.  🤣🤣",
            "polarity": 0.4,
            "subjectivity": 0.4
        },
        {
            "body": "Kaitlyn jenner is what happened to real men in this New weirdo society.",
            "polarity": 0.16818181818181818,
            "subjectivity": 0.3772727272727273
        },
        {
            "body": "Cant wait til Laura's on Truth Social!",
            "polarity": 0.041666666666666664,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "There's no place for masculine men. Women made it that way, and with all the bad press and corporate Indoctrination men were forced to let it happen, so you want men, stop being so offended by everything. Know your self worth and own your life. Good luck out there",
            "polarity": 0.1,
            "subjectivity": 0.4095238095238095
        },
        {
            "body": "THANK YOU!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Feminists are future cat ladies.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "\"Trust the experts\" 🙄",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "THANKS.",
            "polarity": 0.2,
            "subjectivity": 0.2
        }
    ]
}