{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-11-01 05:47:14",
    "ups": "38998",
    "downs": "969",
    "views": "993521",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "So this is why, me the old man, who anyone can see I do not have deep pockets at all, tend to get bothered by women in their 20's from time to time. And here I thought they have either vision problems or is confused about the age gape I am not willing to jump. Now I understand. Maybe they, both women and men of the new age should stop bothering with social media and the current TV shows and movies and start watching TV shows and movies from the 70's to the early 90's before all this nonsense started. That will never happen...",
            "polarity": -0.019412878787878795,
            "subjectivity": 0.4089015151515151
        },
        {
            "body": "The good looking, responsible white men have gone out to marry Asian and Latina women.  Now, you settle for the leftovers there.",
            "polarity": 0.22499999999999998,
            "subjectivity": 0.28750000000000003
        },
        {
            "body": "I can't help being masculine. I was born this way.",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "Away from women indoctrinated by The Left, that's where they've gone.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You can keep the men you raised.  A product of society.  I am from the USA, but left over a decade ago.  Asia raises better men, and found myself a feminine wife.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "As a young widow I been asking that for a few years.  PLEASE GOD SEND ME A REAL MAN!",
            "polarity": 0.049999999999999996,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "What women want is a fairytale because they're raised like princesses. Well, life ain't a fairytale. Grow up and have some realistic expectations.",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "People forget that one person makes a move and then signs on coconspirators. No one has to agree with odd people who need and feed on the lonely symptoms of their ways. \n\nIt’s almost like the losers and invisible found a lawyer and are suing the world of the “visible”. You know those guys…the guys who stand out as protectors and don’t require a lawyer or a problem to be “seen”",
            "polarity": -0.15555555555555553,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "Not to mention men today know our \"Justice\" system will prosecute men defending innocent people, looking for any technicality they can find to punish the unfortunate do-gooder.  Felons however are glorified, so why bother?",
            "polarity": 0.0,
            "subjectivity": 0.85
        },
        {
            "body": "This coming from a woman who used to date Keith Olbermann.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'D LIKE TO KNOW WHERE ARE THE BEAUTIFUL WHITE WOMEN GONE?",
            "polarity": 0.425,
            "subjectivity": 0.5
        },
        {
            "body": "I'm tired of toxic femininity",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "The hippies are getting old, and they run the country now.",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "The pussification of America.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Sipping Tea talking about manhood smh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Liberals have started the pussifaction of a Nation! My boys are both Marine’s my daughter is only 13 so we shall see? Oorah!",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Real men don't let their kids become a radical democrap.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "There is such a paradigm shift.  Women want a man who is a MAN, yet the \"woke\" PC folks want to water down what consitutes a \"man\".  And AGAIN.....even the woke, PC women deep down, want a man who behaves like a classical \"man\".  And society wonders why young men are having such a tough time?????  So, do the modern, \"woke\", PC women want a milk-toast sort of guy?  OR do they want a strong, reliable, tough, strong guy they can count on to defend them and stick up for them???  Sorry femi-nazis you can't have it both ways.....choose........",
            "polarity": -0.03247863247863249,
            "subjectivity": 0.523931623931624
        }
    ]
}