{
    "time_posted": "2021-10-30 13:00:08",
    "url": "https://www.youtube.com/watch?v=Jan2QRtEtkk",
    "time_now": "2021-10-31 09:11:41",
    "ups": "31983",
    "downs": "777",
    "views": "788295",
    "top_comments": [
        {
            "comment": "Brace your selfs , things will get worse .\nToxic Feminism has won .",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "comment": "You can’t be a man, you’ll get cancelled. Why is a woman talking about manhood and what it’s like to be a man? That’s like me posting a video talking about pregnancy or menstrual cycles. Like shut up lady.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "It's all about Equality until somegirl gets hit far to late to say we need men",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.09999999999999999,
            "subjectivity": 0.8
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I’m here ms. Ingraham.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "we miss Ingraham I'm still here.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "These snowflakes are \"NOT Cobra Kai material!\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fox is a toilet.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.0
        },
        {
            "body": "Btw I was in a situation where woman was attacked by multiple attackers , I have stepped in and pulled them apart , then one of the attackers falsely accused me of hitting them .\nIt’s hard to stand straight when you get hit all the time and it feels that there is no one to help .\nI fear the future that awaits you folks , most will not make it .",
            "polarity": 0.0013888888888888746,
            "subjectivity": 0.3611111111111111
        },
        {
            "body": "It's all about Equality until somegirl gets hit far to late to say we need men",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.8
        },
        {
            "body": "Slain a woman boxer on train - get charges as a criminal...",
            "polarity": -0.4,
            "subjectivity": 0.55
        },
        {
            "body": "That's fukcd up man. How could no1 on that train do nothin? Puss1es. Shlt,I nearly got stabbed for steppin in on a guy beating his Mrs n I wouldn't of even cared if I did,cause atleast it saved her from a beating. N I grew up seein my mum get beat by my drunkazz deadbeat dad everyday n seein the hurt,suffer n pain in her eyes n seein how it affected her n how she suffered as a kid. I could never jus stand by n let it happen ever if it were to happen in front of me. Even at the risk of my life I'd stop it in a heartbeat. Men need to man tf up.",
            "polarity": -0.05,
            "subjectivity": 0.5
        },
        {
            "body": "Texas, Oklahoma, Arkansas.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The decrease in fathers sticking around the increase in crime in fatherless families will rise",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Matthew 5:6\nBlessed are they which do hunger and thirst after righteousness: for they shall be filled.",
            "polarity": 0.4,
            "subjectivity": 0.9
        },
        {
            "body": "The real problem is toxic feminism.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Laura needs to undergo intense sensitivity training and several courses of political re-education. What she’s doing is very dangerous and harmful to people of color particularly trans people of color. She just can’t see it because she occupies a place of privilege due to the fact that she is a cisgendered white person",
            "polarity": -0.07690476190476192,
            "subjectivity": 0.4011904761904762
        },
        {
            "body": "You can’t be a man, you’ll get cancelled. Why is a woman talking about manhood and what it’s like to be a man? That’s like me posting a video talking about pregnancy or menstrual cycles. Like shut up lady.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Everytime I see a WWII documentary I see a TON of white male masculinity. Thank God too!\nNew Army recruitment commercials show nothing but little girls and minorities. We'll pass the baton. Good luck guys. \n0311 USMC",
            "polarity": 0.10814393939393939,
            "subjectivity": 0.2757575757575758
        },
        {
            "body": "Brace your selfs , things will get worse .\nToxic Feminism has won .",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "These clowns are those who got punched in the face in childhood and instead of defending, they sat on the floor and cried. Now they want to change the concept and mock everyone who wants to be man or tough. Get a valuable life you moron.",
            "polarity": -0.32962962962962966,
            "subjectivity": 0.6444444444444445
        },
        {
            "body": "Its because admission committees (all white women) at colleges are breeding the beta-males for the last 10 years. Go to look at the couple of male students they accept into programs, any mother in Russia or China would be crying if they were their son.",
            "polarity": -0.05,
            "subjectivity": 0.19166666666666665
        },
        {
            "body": "The radical left are going to decimate the west ,leaving the door open to countries who have let their men be men  Russia and China must be pissing themselves",
            "polarity": 0.0,
            "subjectivity": 0.25
        }
    ]
}