{
    "time_posted": "2021-10-30 15:35:23",
    "url": "https://www.youtube.com/watch?v=JgXMUPW6T8o",
    "time_now": "2021-10-31 09:11:48",
    "ups": "1717",
    "downs": "14",
    "views": "22031",
    "top_comments": [
        {
            "comment": "Also I'm a total liar, my friend Mark just reminded me that I played in a Guildball tournament a couple years ago. That was likely my first tournament, but I forgot. Sorry!",
            "likes": 107,
            "number_of_replies": 4,
            "polarity": -0.09375,
            "subjectivity": 0.7708333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I actually went to my very first tournament at a local store a few weeks ago, after 20 years in the hobby. Was similar to your experience, small scale and friendly with no real try Garda (except for this one AdMech player 🙄) \n\nGreat video, loved the chill vibe",
            "polarity": 0.16499999999999998,
            "subjectivity": 0.3783333333333333
        },
        {
            "body": "I actually just had my first tournament about two weeks ago! I started playing 40k with friends back in 2020, but recently fell in love with the x-wing mini game (I think I’ve played 20ish games in the past month I’ve been playing) as I ended up trying it at my LGS. \n\nI was lucky that everyone I’ve met so far has been super friendly in the local league, and totally willing to lend me a unit or card to try a combo out. I ended up going 2-2 which I was super happy with, as even in my losses I learned a significant amount. I met a bunch of cool people and learned about some more unique combos. I didn’t really expect to ever play tournament style but I honestly would recommend it to everyone at least once!",
            "polarity": 0.21420454545454543,
            "subjectivity": 0.5397727272727274
        },
        {
            "body": "I'd love to get my first ever game in at some point. No idea when I'll ever manage it though.",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.4444444444444445
        },
        {
            "body": "I'm kind of in the same boat with you. I've been in this hobby for 10 years, and only attended one tournament in early 7th edition 40k before I stopped playing for a few years. I definitely saw some ugly unbeatable lists there, but I was pleasantly surprised by how much I enjoyed just playing the game for two days straight. All of my opponents were cool guys that were great to play against. I managed to get a best painted award as well as a first place overall due to some very lucky pairings (I was lucky enough not to play against White Scars - Thunderwolf Cavalry - Biker Librarian invisibility list, for those whe remember the dark days of 40k tournament scene) \n\nI'm actually going to my second big tournament with 100+ players next week, playing Nagash in Ossiarch army, looking forward to the event! For me it was a great way to push myself to paint said Nagash that I was putting off for so long, since the event I'm attending is a fully painted armies only event.",
            "polarity": 0.1324712643678161,
            "subjectivity": 0.4764367816091955
        },
        {
            "body": "Only tournament I played in was in like 1997 and for battle tech when I was a kid. I probably would play in a small tournament like you did for 40k some day if I coukd get some games in before.",
            "polarity": -0.125,
            "subjectivity": 0.7
        },
        {
            "body": "For me I wish I had done small tournaments. It was either Warmachine 2nd edition or magic the gathering tournaments. They were exhausting and I got burnt out. As I got older more narrative driven wargaming I enjoy more.",
            "polarity": 0.17708333333333331,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "I wonder, is Scott is measuring his tunnels in gauges or paint brand. \"Currently at a Scale75 but working towards a Citadel, but will probably end up with a FW ink\"",
            "polarity": 0.0,
            "subjectivity": 0.4
        },
        {
            "body": "I'm glad to hear about your positive experience. I'll have to try those myself. Looking forward to more tournament stuff from you as well!",
            "polarity": 0.45075757575757575,
            "subjectivity": 0.6818181818181818
        },
        {
            "body": "I saw your video on making a table top for this game and it seemed interesting and I loved the lore from the books so I gave it a shot. I haven’t had this much fun playing a tabletop war game since I started gaming 4 years ago. Thank you for exposing me to this game",
            "polarity": 0.11428571428571424,
            "subjectivity": 0.4571428571428572
        },
        {
            "body": "Very refreshing to have your channel kinda switch gears to more gaming now. Inspired me to actually think about getting into tournaments for the first time.",
            "polarity": 0.35,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "I used to do weekly Friday night tournaments back in 5th ed 40k at a now no longer running flgs called realm of legends. then 6th ed came around and at the time I didn't have the money spare to spend a fortune on a new core rule book and marine codex so instead i just kept playing a hybrid version of the 5th with a mate of mine that took what I knew of 6th and added it to 5th, so yeah i stopped playing 40k there though at the same time that flgs had to give up the lease on the massive showroom they had and moved to a much more cramped store and i also didn't like the suburb they were based in (but then showing up to a station an hour after a guy got stabbed there isn't the nicest experience",
            "polarity": 0.12727272727272726,
            "subjectivity": 0.4159090909090909
        },
        {
            "body": "I've played in a lot of local tounaments (the big 'uns are too far away), though the tournament scene has petered out recently, as has in-store gaming in general. Always had fun, but the most memorable had to be a 40k tournament at our FLGS. A friend and I decided to take identical armies, so after perusing our collections we decided on Eldar. I wrote up a backstory about twin farseers and made it general enough that it could go with either twin. We even wore matching GW t-shirts. The funniest thing that happened was that we played each other's first round opponents in the second round. Their dawning realization as we placed units was priceless! He went 3-0, while I got 1-2. I guess our lists matched his play style better. All in all it was a great experience!",
            "polarity": 0.20694444444444446,
            "subjectivity": 0.4615740740740741
        },
        {
            "body": "Eww septum piercing :(",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "body": "Been lookong to jump into this game and got some.friends who are going to.teach me eventually too. Once I do, I may have to.come.join your tournament to share in the fun :)",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.5333333333333333
        }
    ]
}