{
    "time_posted": "2021-10-30 15:35:23",
    "url": "https://www.youtube.com/watch?v=JgXMUPW6T8o",
    "time_now": "2021-10-30 20:51:47",
    "ups": "976",
    "downs": "6",
    "views": "10189",
    "top_comments": [
        {
            "comment": "Also I'm a total liar, my friend Mark just reminded me that I played in a Guildball tournament a couple years ago. That was likely my first tournament, but I forgot. Sorry!",
            "likes": 50,
            "number_of_replies": 4,
            "polarity": -0.09375,
            "subjectivity": 0.7708333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "\"No one was running a net list\"*\n\n*Except Curtis!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I know I know ... but WTF. Most of the armies in this tournament not painted. Why do we even bother :)",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "I know a couple of 40K players who have been tabled (wiped of the table by turn 3 lists) at tournaments and have never gone back to paly those list are great if all your playing is tournament play but if you there just for fun it's a big turn off.",
            "polarity": 0.196,
            "subjectivity": 0.24200000000000005
        },
        {
            "body": "I don’t think I’ll be visiting any tournaments with my hand painted d&d minis lol\nBut I’m glad you had fun!",
            "polarity": 0.5583333333333333,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "2 videos in a week wooooooooooooooooooo!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Liking the stubble!!!! Keep it up Scott",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Beards coming in nice!",
            "polarity": 0.75,
            "subjectivity": 1.0
        },
        {
            "body": "I should have known Miniac wasn't a fan of Meta XD or as he calls it \"net lists\" lol",
            "polarity": 0.4,
            "subjectivity": 0.35
        },
        {
            "body": "Fantastic view into what a local, small, game shop hosted tournament looks like for someone, like myself, that is pretty virginal to the hobby but has always been interested.  Like you, I've been curious what they look like, the type of crowd they attract, etc. so this was very eye-opening and may spur me on to get my ass in gear and join one!  Also, VERY refreshing to see unpainted minis Scott, now I don't feel so bad about my pile of shame.",
            "polarity": 0.03500000000000002,
            "subjectivity": 0.6166666666666667
        },
        {
            "body": "My first tournament was a Toys R Us Yugioh tournament!",
            "polarity": 0.3125,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "@Miniac Love the video! Only thing I wasn’t super into was the second camera on the side, it felt a little like a reality tv show.",
            "polarity": 0.15416666666666665,
            "subjectivity": 0.5533333333333333
        },
        {
            "body": "I probably won’t get into AOS despite loving the models, double turn is just something that makes zero sense in terms of gameplay so Kill Team it is !",
            "polarity": 0.3,
            "subjectivity": 0.475
        },
        {
            "body": "Awesome. I'm glad you both had a good time.I love this game to the point I'd rather lose a game of Song than win any other.\nOver on Blitz Minis you can see Ben destroying me in the 38 strong National Titles I co-ran in the last great con from The Time Before. I look like the ham-fisted noob I was. Still had a blast and Ben was an awesome opponent. I wish you good fortune in the wars to come",
            "polarity": 0.3791666666666667,
            "subjectivity": 0.5660714285714287
        },
        {
            "body": "Oh damn, Knights Watch is a faction? Uh oh, gunna make me act up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I want to get into some tournaments but my big problem is that I am in Europe for work and depending on where the tourney is I don't know if we will have a language in common.",
            "polarity": -0.15,
            "subjectivity": 0.3
        },
        {
            "body": "This has me stoked to play ASOIF",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The stereotype of a wargaming tournament being all extremely sweaty and serious tryhards who are there to win at all costs and not to make friends is just totally false in my experience. I've gone to so many tournaments across so many games for the past decades, and not once has this been my experience. \n\nEveryone is there to just play a bunch of games that they love. Sure, they might be trying to win, but people are very rarely dicks about it. \n\nTournaments are great, and I think it is a shame that this perception is preventing people from playing in them.",
            "polarity": 0.30680555555555555,
            "subjectivity": 0.6296296296296297
        },
        {
            "body": "\"They were very happy to see new people at the store\". \n\n\"Hey look, it's Miniac and some other guy\".",
            "polarity": 0.3371212121212121,
            "subjectivity": 0.6098484848484849
        },
        {
            "body": "I used to be quite heavily into X-Wing before the power creep and relaunch with version 2.\nThe local scene was great with a real mix of player types, lists and for the most part really friendly. There was only one player that \"net decked\" at every tourney and he was an absolute jerk to play against. Deliberately mumbling his way through action declarations, being shady with token placement, and having some dubious movement template usage. Needless to say he was normally in the finals and was a joy drain to play against as you had to watch him like a hawk and call out all his crappy behaviours.",
            "polarity": 0.15535714285714283,
            "subjectivity": 0.5017857142857143
        }
    ]
}