{
    "time_posted": "2021-10-30 15:35:23",
    "url": "https://www.youtube.com/watch?v=JgXMUPW6T8o",
    "time_now": "2021-10-31 05:04:59",
    "ups": "1540",
    "downs": "12",
    "views": "19697",
    "top_comments": [
        {
            "comment": "Also I'm a total liar, my friend Mark just reminded me that I played in a Guildball tournament a couple years ago. That was likely my first tournament, but I forgot. Sorry!",
            "likes": 93,
            "number_of_replies": 4,
            "polarity": -0.09375,
            "subjectivity": 0.7708333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "My first tournament experience was a Star Wars: Legion Grand Army team battles… we went 0 - 3, but it was a pleasant day in which I learned a lot. My 2nd was a SW:Legion Prime tournament in which I brought an illegal list because I was still a noob list builder. That seems to be my largest failing; making a competitive army to play with.",
            "polarity": 0.19666666666666668,
            "subjectivity": 0.5599999999999999
        },
        {
            "body": "Cmon Scott, you gotta have painted minis at a tournament!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Honestly, I think tournaments and highly competitive play is detrimental to the enjoyment of the hobby. When people play with their friends or random strangers are clubs, they're often just playing for fun. I remember when I was young and we played magic the gathering in high school. This was back when magic  was very very young. It was really fun, until I got to college, it was fun for a bit there too, but then everyone starting to get into fine tuned 2 turn stomp decks for competitive play. Gone were massive crazy theme fun decks. Playing became less about playing and more about your stats and you could see their disappointed when they didn't get the starting hand they wanted, and their minds would immediately go to tweaking the deck rather than enjoying the game in front of them.",
            "polarity": 0.10217391304347824,
            "subjectivity": 0.4833333333333333
        },
        {
            "body": "I got housed by phatasian in my first tournament. Been in therapy ever since.",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "I played in a Warmachine tournament, played 10 points down because I refused to play with my unpainted models (personal chose), and I came in second place. Lots of fun!",
            "polarity": 0.054861111111111104,
            "subjectivity": 0.19722222222222224
        },
        {
            "body": "Saturday video and an INTRO! YES!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My first and only tournament experience was with X-wing 1st edition, and while everybody was nice and smelled fine, the room was filled with the same 2-3 meta netlists and just wasn't much fun to play in. There was something about that game that really brought out the sweaty tryhards in my area. I'm currently into Marvel Crisis Protocol which has a much more casual vibe, so I'd like to try a tournament for that if I ever get the chance.",
            "polarity": 0.14722222222222223,
            "subjectivity": 0.5354166666666668
        },
        {
            "body": "Curtis, Jesus loves you and in Him you can have victory and a knowledge of your true identity and value to Him. Never again will you have to worry about your confidence or lack thereof :)",
            "polarity": 0.425,
            "subjectivity": 0.825
        },
        {
            "body": "You should have visited Chicago last month for the Chaos Cup.  There is no greater tournament community than Blood Bowl.  This year's Chaos Cup had 110 teams.  The World Cup in Dornbirn, Austria, had almost 1500 teams! It was GLORIOUS!",
            "polarity": -0.1953125,
            "subjectivity": 0.2833333333333333
        },
        {
            "body": "I played at a LGS tourney back at the start of 8th edition 40k. I played 3 rounds and what I really like about it was the fact I got to play against 3 armies I had never played against before.\nImperial Guard, Space Wolves and Harlequins.\nEveryone was super nice.\nThe Guard player won the event and crushed me game one. His list was very optimised and competitive unlike the majority of the players.\nHe was still very friendly though.",
            "polarity": 0.16510416666666666,
            "subjectivity": 0.4145833333333333
        },
        {
            "body": "So see you at LVO then?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}