{
    "time_posted": "2021-10-30 15:35:23",
    "url": "https://www.youtube.com/watch?v=JgXMUPW6T8o",
    "time_now": "2021-10-31 00:58:19",
    "ups": "1343",
    "downs": "12",
    "views": "16426",
    "top_comments": [
        {
            "comment": "Also I'm a total liar, my friend Mark just reminded me that I played in a Guildball tournament a couple years ago. That was likely my first tournament, but I forgot. Sorry!",
            "likes": 77,
            "number_of_replies": 4,
            "polarity": -0.09375,
            "subjectivity": 0.7708333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Thanks for sharing your experience! Just went to a tournament last week myself after not playing much for a decade. Attending these events really is a great way to get more out of the hobby and have fun playing too many games in one day. Cool to hear you \"did it right\" and went to your tournament tired and underprepared. Always more fun like that.",
            "polarity": 0.2988095238095238,
            "subjectivity": 0.4168650793650794
        },
        {
            "body": "Are you going to get the new vampire lady from GW out today? Great vid as always.",
            "polarity": 0.4681818181818182,
            "subjectivity": 0.6022727272727273
        },
        {
            "body": "welcome to try hard town <3 honored to have you",
            "polarity": 0.5027777777777778,
            "subjectivity": 0.8138888888888888
        },
        {
            "body": "My first tournament was back in the 90s at my local GW store in the arse end of the Midlands (UK), it was warhammer fantasy and I went in with a stupid list filled with whatever models I could use from my chaos collection, I'll admit I went a bit sweaty with a very broken Chaos Lord on horseback using a lance, backed up by the old plastic chaos warriors and beastmen, no ranged whatsoever so basically ran from terrain to terrain piece to avoid archers with my troops while my Lord ran up the battlefield as fast as possible to engage the enemy lord.\n\nThis worked well and I came 2nd or 3rd, dont remember which, and as a prize I got to take home a chaos sorcerer model for free, which was very cool as I didnt have one of those. Highlight was vs Wood Elves (who'd just got that big metal forest dragon model) and obliterating it due to afore mentioned broken Chaos Lord.",
            "polarity": -0.0024999999999999988,
            "subjectivity": 0.44208333333333333
        },
        {
            "body": "Ah Beard!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I've been to a smattering of Tournaments over the years with a wide spectrum of characters. I'm extremely wary to enter any tournaments. My outlook on Tabletop gaming is that all of these people have dropped so much time and money on this game, took the time to paint up their models, let's have a good time. I can crank up my gaming to various degrees of Tryhard Sweaty if that's what my opponent wants but I don't start at that level.",
            "polarity": 0.014285714285714275,
            "subjectivity": 0.4142857142857143
        },
        {
            "body": "My first tournament was back in 2004.  It was a small 8 person Warhammer 40k tournament at Airtraffic in Burnsville MN.  I brought T'au and lost every round but it was awesome.  You should check out Renegade Open in November just to see the community",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.4388888888888889
        },
        {
            "body": "How do you rate that Dreamers Vault Burnsville compared to the other 4?",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "Great vid, glad you’re enjoying ASOIAF. Hope to see more of these!",
            "polarity": 0.60625,
            "subjectivity": 0.7125
        },
        {
            "body": "Dreamers Vault is great! Now that I can get back out into the world again, that’s been my FLGS of choice! Tournaments NEED by rounds IMO for food and mental health breaks. My first tournament was at GenCon doing a new collectible miniatures game that didn’t last long called Dreamblade. It was a BRUTAL 8 rounds over 8 hours straight with no breaks. By the fifth round I just quit playing because I was so burned out, and I sold my miniatures at the Con and never played again. I don’t think my variety-craving adult ADHD brain can handle all-day tournaments regardless of the people types attending.",
            "polarity": -0.03374125874125876,
            "subjectivity": 0.42342657342657347
        },
        {
            "body": "HEY, what does pah pisipitated mean?",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "body": "Rule 1 for playing competitively: Do NOT buy what you want. Rule 2 Be prepared to \"Pay to Win.\"  Rule 3, prepare not to have much fun.  You may be having a better experience because you're not playing GW garbage, but the hobby changes ENTIRELY when you decide to play competitively (i.e., 'to win at tournaments.')  I can't do it.  I can't stand and play a game for 8 hours like it's my job;  My experience is that most of the people who play competitively aren't actually playing a game b/c they're primarily filling a personal need (to demonstrate to themselves some perceived superiority over others) rather than playing a game.",
            "polarity": 0.17500000000000004,
            "subjectivity": 0.39375000000000004
        },
        {
            "body": "Great vid! I’ve been in some non-official tournies but will be attending my first ‘official’ tourney in late November. Playing Kings of War! I’m hoping for the golden spoon award (since my win ratio is rather low….), but would be happy with a win. To me I think of tournies as ‘butt cracks on show’ and ‘deodorant stalls required’ which adds to the experience…..in saying that, I might need to shave my butt crack….hmmmm. Awesome vid!",
            "polarity": 0.571875,
            "subjectivity": 0.6229166666666666
        },
        {
            "body": "BTW I was inspired by your first video about ASOIAF to take up the game seriously (though I have yet to buy anything beyond the Stark Sworn Swords I’ve had for a couple of years so I’ve not done anything as yet beyond watch more ASOIAF videos). I hadn’t realised how much the sculpts have improved but I don’t know if there are any good ones for the Starks yet so I’ll be going for one of the more recently introduced factions, maybe even Greyjoys, despicable swine though they are.",
            "polarity": 0.13518518518518519,
            "subjectivity": 0.45000000000000007
        },
        {
            "body": "I went by your twitch channel and unfortunately it doesn't show any of the past streams. I was hoping to see you play the song of ice and fire game :(\nAnywho always a fan regardless, have a great weekend!",
            "polarity": -0.18,
            "subjectivity": 0.6799999999999999
        },
        {
            "body": "You placed third after two games and a bye? How many players were there? It would have been interesting to know the format, not that it would make a lot of sense to me in all likelihood. (No, I’ve never played in one).\n\nBTW as I write this I’m trying to remove coagulated plastic kit glue from the nozzle of an old but unused bottle so that I can assemble some Conquest : the Last Argument of Kings minis. The only thing I’ve assembled so far is a ball of useless glue. This seems like an apt metaphor for my life.",
            "polarity": 0.1444444444444445,
            "subjectivity": 0.4962962962962963
        },
        {
            "body": "four years, never played a single games\nnot having friends is............ all this",
            "polarity": -0.07142857142857142,
            "subjectivity": 0.21428571428571427
        },
        {
            "body": "I've been playing in tournaments for the last ten years, haven't tried an ASOIAF event yet but I'm keen\n\nMy main system is Epic Armageddon, I've competed in 27 tournaments to date, including representing the UK in both the European and World Championship (in fact I'm a team member of the current reigning world champions)\n\nI've even organised and run a couple of local tournaments\n\nIt's nothing like the try-hard, win at all costs events everyone is afraid of, and with a handful of warmachine events under my belt, I am starting to doubt the existence of such events... Overwhelmingly my experiences have been positive, win and lose.... I've made lifelong friends at tournaments, started friendly rivalries, won awards for best painted army, and had a great time. There have been a handful of games that my opponent has been a bit dodgy, but you can't let that sour the overall experience of tournament gaming.\n\nI think the people who turn their noses up at competitive play are probably just aware that they aren't good players and are probably sore losers to boot..... There are few better experiences than testing your skills against like minded folks, and losing games teaches you lessons\n\nApologies for the essay!",
            "polarity": 0.20375757575757572,
            "subjectivity": 0.35781818181818176
        },
        {
            "body": "Scott points out some of the best things about comps in any gaming genre; you will meet new players and face different armies, it will be an intensive tutorial in the rules so you'll come out knowing them much better.  \n\nIn any field of endeavor you want to improve your skills - within whatever framework you chose, be that moving from novice to competent or perhaps to world champion - your choice.\n\nIn nearly 40 years of competitions, mostly historical but some fantasy, I reckon I've met only two objectionable players to balance against the many friends I've made.\n\nAs Scott suggests, some competitions will be laid-back and small scale, some will be large where contestants play hard to test their skill.  I enjoy both.",
            "polarity": 0.2160755910755911,
            "subjectivity": 0.483957708957709
        }
    ]
}