{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-01 01:39:37",
    "ups": "12934",
    "downs": "46",
    "views": "145032",
    "top_comments": [
        {
            "comment": "I like to dive into Debussy whenever I can.  .)\nKapustin was intriguing, too.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30000000000000004,
            "subjectivity": 0.4
        },
        {
            "comment": "the first was I think in a radio fairy tale. It was called \"How Athens Was Made.\" and it fit in perfectly.👍 Great work, boys.❤️❤️❤️👍👍👍👍",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4833333333333334,
            "subjectivity": 0.49444444444444446
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "bro that kapustin piece sounded amazing",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "I like to dive into Debussy whenever I can.  .)\nKapustin was intriguing, too.",
            "polarity": 0.30000000000000004,
            "subjectivity": 0.4
        },
        {
            "body": "Just started my violin lessons again with the very same tutor I had when I was 10 and id only learned a couple years before I quit, it was always in my mind to do but you guys really had a big role in taking it up again so ... nice",
            "polarity": 0.16,
            "subjectivity": 0.49250000000000005
        },
        {
            "body": "One of my favorites is Chopin’s trio for piano, violin, and cello... especially the 1st movement . ❤️",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "I've danced to the first piece! It was for a ballet production of the little mermaid",
            "polarity": 0.0625,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "My absolute number one underrated favorite is the Adagio from the ballet „Spartacus“ by Khatchaturian",
            "polarity": 0.35,
            "subjectivity": 0.95
        },
        {
            "body": "I doubt this will happen but if you wan more haunting choral music, check out Paul Manz’s “E’en so Lord Jesus quickly come”",
            "polarity": 0.2111111111111111,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "Loved the video, thank you for the recommendations !",
            "polarity": 0.875,
            "subjectivity": 0.8
        },
        {
            "body": "I wouldn't say that Mahler 4 is under-rated. There are dozens of recordings of it and it's a regular feature in the concert halls of the world.",
            "polarity": 0.0,
            "subjectivity": 0.07692307692307693
        },
        {
            "body": "More, please.  I would also like to hear you play underrated violin pieces.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "As a professional oboist. I would rank Canon in D as the most underrated classical music piece of all time.\nAll professional musicians hate this piece, it's way overly played and gets way too much attention from non-classical music listeners.\nHowever, it is still a beautiful piece that deserves respect regardless of how annoying you think it is. And it is in fact more beautiful than most classical music and you can't deny that fact.",
            "polarity": 0.09230769230769229,
            "subjectivity": 0.5076923076923078
        },
        {
            "body": "I would really love if you could do this for underrated and actually unknown composers. Most of these pieces were by known composers like Projofieff or Debussy. I recently came to know Novak via youtube autoplay and since then looked for more unknown composers and found insanely amazing pieces. I feel a list of unknown composers could also help a lot of people already in into classical music.\nMy favs I recently discovered are Novak, Robert Fuchs, Janacek and Florence Price",
            "polarity": 0.18,
            "subjectivity": 0.48
        },
        {
            "body": "Twoset should add different curated playlists of classical pieces to their spotify. All the \"classical music\" playlists on spotify only focus on the really mainstream pieces.",
            "polarity": 0.04,
            "subjectivity": 0.36
        },
        {
            "body": "Prokofiev can be sometimes extremely harsh in terms of dissonance, and is many times very non-mechanical in terms of tempo and rhythm. My favorite example for this is his Sarcasms. Such impudent pieces, I love them!\n\nOther than that, some more suggestions :\n\n-The whole genre of Airs de Cour (late renaissance early baroque)\n-Ravel: trois poèmes de Stéphane Mallarmé\n-Lili Boulanger: psalm 130\n-Nadia Boulanger: Lux Æterna",
            "polarity": 0.18181818181818182,
            "subjectivity": 0.5249999999999999
        },
        {
            "body": "the first was I think in a radio fairy tale. It was called \"How Athens Was Made.\" and it fit in perfectly.👍 Great work, boys.❤️❤️❤️👍👍👍👍",
            "polarity": 0.4833333333333334,
            "subjectivity": 0.49444444444444446
        },
        {
            "body": "This is super great.  Next time please include woods and percussion",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.47222222222222215
        },
        {
            "body": "Definitely enjoy this type of video. Actually shed a tear (or several) for the Parry. Whoever recommended that to you has impeccable taste.",
            "polarity": 0.2875,
            "subjectivity": 0.3375
        },
        {
            "body": "“Debussy is superior.”\n\nMe, a Ravel fan: 👀👀👀",
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "body": "Thanks for inspiring me to play violin. I started in June and I've already had 2 luthiers and a teacher say there's no way I should be this good this fast. I just told them I practice 40 hours a day XD. (One of them replied with an \"iNtRiStInG!\")",
            "polarity": 0.4125,
            "subjectivity": 0.6
        },
        {
            "body": "Guys! How can you not know Hubert Parry!!? But also check out Herbert Howells ('Collegium Regale' for instance) for more wonderful English choral music.",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}