{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-10-30 20:51:07",
    "ups": "6812",
    "downs": "24",
    "views": "52957",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "i really was expecting to see sibelius 3",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "If I’m looking for pieces that would be great to run to, what would you guys recommend?",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Some underrated classical pieces to consider, based on my opinion:\n\nVaughan Williams - Concerto for Oboe & Strings in A minor\nMozart - Piano Concerto No. 26 in D (Coronation)\nDvorak - Czech Suite in D\nBrahms - Piano Concerto No. 1 in D minor\nMozart - Piano Concerto No. 12 in A (especially the 2nd movement)\nMendelssohn - Sinfonia No. 12 in G minor\nSmetana - Má Vlást (the Moldau) <3\n\nEnjoy!",
            "polarity": 0.16875,
            "subjectivity": 0.38749999999999996
        },
        {
            "body": "Here are a few obscure composers that I’ve discovered in the past few years that are truly, definitely worth knowing:\n\n- Lots of things by Giovanni Bottesini, including Elegies 1 & 2, Capriccio di Bravura, Tarantella, Bolero, Concerto #2. (The main impediment until recently has been mostly poor performances even from the “best” performers, who often turned the pieces into basically jokes if they could play them competently at all. But players like Mikyung Sung, Luis Cabrera, Wies de Boeve, Theotine Voisin and David Desimpelaere are really upping the quality of double bass performances and revealing the wonderful beauty and lively energy of these works.)\n\n- York Bowen: Viola Sonata No. 1\n\n- Józef Władysław Krogulski: Piano Octet\n\n- Dmitry Kabslevsky. I’d heard of Kabalevsky for many years, but never really knew any of his music, and still don’t. We hear all the time about Prokofiev and Shostakovich, but Kabalesky never seems to be mentioned, and rarely played. Yet every bit of his music I’ve ever heard has been consistently, immediately enjoyable.",
            "polarity": 0.18700159489633172,
            "subjectivity": 0.38684210526315793
        },
        {
            "body": "If you want some epic harp stuff, check out Ravel's \"Introduction and Allegro.\" Really beautiful piece. It's like a harp concerto.",
            "polarity": 0.475,
            "subjectivity": 0.7
        },
        {
            "body": "This is the best video I've seen from you! Thank you and I would love to see more :)",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "I'll happily watch another 2000 videos like this. Such wonderful music.\nAlso, I wonder if the last one has anything to do with Van Gogh's starry night ( the title means the same.)",
            "polarity": 0.36,
            "subjectivity": 0.5383333333333333
        },
        {
            "body": "Nice selection indeed!  I pride myself in knowing a lot of classical music despite not being a musician... but I just knew 3 of these .. probably because I don't like Debussy very much and I usually stop at baroque+romanticism.\n\nLet me give a warm suggestion to all those reading this: give yourself the best gift ever and listen at least 2 or 3 times to Mahler's second symphony!",
            "polarity": 0.2575,
            "subjectivity": 0.35124999999999995
        },
        {
            "body": "\"Never finish on Debussy!\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would also recommend the opera Maid of Orleans by Tchaikovsky.  Especially the first act.",
            "polarity": 0.125,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Yeah yeah yeah choral works 👏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Y'all should show off more Britten! One of my favorite composers ever!",
            "polarity": 0.625,
            "subjectivity": 0.75
        },
        {
            "body": "Crisantemi from Puccini is a piece for chords only. Excellent and underrated",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "i don’t know anything about music and idk what i’m doing here but i love it",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Glad they recomended Schumann. He is my favourite composer, and the piano quartet is one of my favourite pieces of him. The third movement is   so beautifull.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "I also adore: Fazil Say - The Earth",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "dare i say rachmaninoff symphony.. 1 belongs here?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "3:22 oo can you make a list of classical pieces for working out/running, i need a playlist lol",
            "polarity": 0.4,
            "subjectivity": 0.35
        },
        {
            "body": "U guys are lit. I play the cello. I love your videos",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I love you guys but I do wish you could mention some Baroque pieces once in a while",
            "polarity": 0.5,
            "subjectivity": 0.6
        }
    ]
}