{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-02 22:58:59",
    "ups": "15247",
    "downs": "51",
    "views": "181960",
    "top_comments": [
        {
            "comment": "If you say \"Mahler\" and \"underrated\" you're automatically talking about his 7th",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "What an epic video! Just from the snippets included in this video, I’m already loving how these pieces sound like - can’t wait to add them to my playlist and savour them! Thank you Twoset for the recommendations❤️!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.45,
            "subjectivity": 0.5833333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "This is a super cool idea there are definitely loads more underrated pieces out there so this could easily be a series",
            "polarity": 0.32333333333333336,
            "subjectivity": 0.63
        },
        {
            "body": "One of the best 2Set videos. It highlights their insight and expertise.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Gesualdo, Moro, lasso!  Al mio duolo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I’d prefer langlang’s Prokofiev 3 more, but YuJa or Argerich’s are good as well",
            "polarity": 0.6,
            "subjectivity": 0.55
        },
        {
            "body": "Sibelius is as its name say forest. If you go to the Finnish forest you have this atmosphere.🙂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "When are you guys going to make another video on subscribers' compositions? I mean, that was fantastic when you did that",
            "polarity": 0.04375000000000001,
            "subjectivity": 0.79375
        },
        {
            "body": "Yes, Brett and Eddy, I enjoy these kinds of videos.",
            "polarity": 0.4,
            "subjectivity": 0.5
        },
        {
            "body": "Kapustin's chord choices remind me a lot of Ryuichi Sakamoto",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Nice list! I had not heard of the Debussy Danses Sacrée et Profane until we played it with the San Juan Symphony last spring. Lovely piece! Very moving and beautiful. Thanks for the new discoveries as well! I've already purchased that recording of the Schumann piano quartet. So lovely! The musicians on that recording are some of the best in the world these days.",
            "polarity": 0.49116161616161613,
            "subjectivity": 0.5356902356902357
        },
        {
            "body": "Was awesome to see that you included Mahler 4. I have loved that piece since I was a kid. The sleigh bells always reminded me of Christmas. If you want to hear a pretty unknown composer of beautiful music, check out Jean-Joseph de Mondonville 1711-1772. His works are similar to Rameau, but has his own style. I do wish he was more popular now.",
            "polarity": 0.4888888888888888,
            "subjectivity": 0.8000000000000002
        }
    ]
}