{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-03 03:06:17",
    "ups": "15395",
    "downs": "52",
    "views": "184340",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "The symphony I work for will be performing Prokofiev's piano concerto no 3 next season! I'm looking forward to it 😀",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If you two were my teachers in college,  music class would have been easier to get through!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Isn't cowbells in Mahler symphonies 6 & 7?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "is it just me or does every debussy piece sound like clair de lune?",
            "polarity": 0.4,
            "subjectivity": 0.4
        },
        {
            "body": "As a recent return to listening to mostly classical music when Hilary Hahn released her Paris recording of Prokofiev’s Violin Concerto No.1 earlier this year I became obsessed with this composer! You’re right that it’s almost a more joyful dissonance type of composer. Love his works! And now, I feel compelled to listen to all of Mahler’s Symphonies so that I can decide which one is my favourite, although I do regularly listen to No. 5 and love it. So many great pieces to discover. Thank you TwoSet for this type of video!",
            "polarity": 0.2532467532467532,
            "subjectivity": 0.48296703296703297
        },
        {
            "body": "Hubert Parry you don't know?  OMG guys, how can I possibly know a composer you don't?  When compared to you I am an ignorama?  And such a famous song he wrote too, \"Parry's 'Jerusalem'\" -- so famous even Monty Python used it in a skit.  \"And did those feet, in ancient times (etc)\"",
            "polarity": 0.25,
            "subjectivity": 0.875
        },
        {
            "body": "YES \n\nI REALLY LIKED IT \n\nI love your \"funny\" content, games, reviews and stuff, but nothing beats you both talking about music and explaining it. I've got two new favourites from this video :)",
            "polarity": 0.3972727272727273,
            "subjectivity": 0.7709090909090909
        },
        {
            "body": "That Sibelius opening bars, strange, sounds almost like Gershwin...  or is it just me?",
            "polarity": -0.05,
            "subjectivity": 0.15
        },
        {
            "body": "P.S. -- Some underrated pieces I like are Weinberg's Opera Schwanda the Bagpiper (the entire opera is stellar!); The Wood Nymph by Sibelius; Horoscope Suite by Constant Lambert, and Kalinnikov's Symphony #1",
            "polarity": 0.10416666666666667,
            "subjectivity": 0.40277777777777773
        },
        {
            "body": "I love these types of videos, you should make this a regular theme! \nThat first one by Debussy is just beautiful; I'll definitely be looking that one up!\n\nAs I'm not a musician, when I like a piece, it generally comes from a place of pure emotion, as I have no knowledge of the mechanics, so it's fascinating to hear you describe the qualities of different composers, and your reasons for appreciating certain pieces, from a musician's point of view.  \n\n(I've already been name-dropping Mahler; his 7th symphony is my favorite so far! ;-)",
            "polarity": 0.28104395604395604,
            "subjectivity": 0.6562834601296139
        }
    ]
}