{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-05 04:32:52",
    "ups": "16316",
    "downs": "51",
    "views": "199925",
    "top_comments": [
        {
            "comment": "I just want to hang out with you two. I think your enthusiasm is infectious. I love your personal comments. I will bring the beer and listen to clips for an evening?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.44999999999999996
        },
        {
            "comment": "i'm so glad you guys included kapustin in there. he's one of my favorite composers just from the groove he has",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment": "Bantock, Celtic Symphony, last movement. Rachmaninov, O Mother of God vigilantly praying. Rued Langgaard, String Quartets 2, 3, 6 and Variations on 'Mig Hjertellig nu Lenges'. Petris Vasks, violin concerto, Distant Light. Mendelssohn, Sonata in B flat. Some of my favourite underrated works for classical music.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.05500000000000001,
            "subjectivity": 0.24833333333333335
        },
        {
            "comment": "Honourable Mentions: Devil's Trill Sonata",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Two quick comments:\n\n1) Mad props for including choral music (I'm a choral conductor). Please share more cool vocal and choral music on this channel (and if you want some pointers, get in touch 😃). Parry is considered to have had an impact on Elgar's music, and he also taught Holst and Vaughan Williams! He has a lot of really great vocal and church music.\n\n2) Sibelius' Sapin is part of a collection (op.75) of five short piano pieces. Sibelius did indeed write stuff like this basically to make money, and didn't care too much for the piano. The piece is really nice though, and the other ones in the opus are interesting too!\n\nPlease keep making more videos like this Twoset!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3064393939393939,
            "subjectivity": 0.5704545454545454
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Guys, I absolutely love your work and especially this type of program.  I don’t know if you noticed but in these selections, there was a lot of quite audible harp. I love it.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "I love videos like this. My favorite videos (besides the ones of you playing) are the ones of you talking about music. I love classical music and there's so much out there, it's hard to know what to do besides go on through the basics.\n\nI'd like to add Alban Berg, String Quartet 3 to this list of underrated classical pieces!",
            "polarity": 0.20119047619047617,
            "subjectivity": 0.42023809523809524
        },
        {
            "body": "Thanks for including Sibelius piano music. That is some of the most underrated and unjustly criticized music. I find his best piano work to be so characteristic of his writing.",
            "polarity": 0.4083333333333333,
            "subjectivity": 0.36666666666666664
        },
        {
            "body": "Parry was unexpected - “I Was Glad” and the Te Deum are sublime",
            "polarity": 0.3,
            "subjectivity": 1.0
        },
        {
            "body": "i'm so glad you guys included kapustin in there. he's one of my favorite composers just from the groove he has",
            "polarity": 0.5,
            "subjectivity": 1.0
        }
    ]
}