{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-01 09:53:33",
    "ups": "13440",
    "downs": "47",
    "views": "153506",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Love seeing some choral stuff, Parry's I was Glad is one of my favourites to sing! There's some really epic organ stuff too, Widor's Toccata, Gigout also has some epic stuff which I love playing.",
            "polarity": 0.36500000000000005,
            "subjectivity": 0.6
        },
        {
            "body": "i love this type of videos 😍",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Can I recommend some pieces? My composition professor once recommended to me Ottorino Respighi - Pini di Roma. It's part of the Roman Trilogy, but we listened to that particular piece. It's a 4 part piece, and it ranges from light and airy, to dark, to epic and heavy. It's brilliant. \nAlso, I've dabbled in Ravel's Quartet & Miroirs No. 3, \"Une Barque sur l'Ocean\". That's only a part of my favorite classical pieces, I can name a lot more than that. Love you guys, I've been a fan for quite some time now. You give classical musicians a breath of fresh air! Peace!",
            "polarity": 0.2450320512820513,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "🖤",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "you guys should react to darksouls music and bloodborne music, they are videogames by the same company but they have some intense orchestral pieces and some really beautiful pieces too id love to see you guys react to some of the best pieces in those games",
            "polarity": 0.51,
            "subjectivity": 0.605
        },
        {
            "body": "I wonder who the 46 dislikes are!!! and why!?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "One of the best videos you've posted! Do it again. I'd love to submit my own suggestions. Thanks again!",
            "polarity": 0.5875,
            "subjectivity": 0.525
        },
        {
            "body": "Prokofiev always makes me think of a magical story. Like fantasia.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "You never play any of the organ fantasias by Sweelinck!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Whoa cool...sounds like it'd be off Final Fantasy",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Danse sacrée et danse profane sounds a little like traditional Chinese music to me.",
            "polarity": -0.0625,
            "subjectivity": 0.4166666666666667
        }
    ]
}