{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-01 05:46:39",
    "ups": "13209",
    "downs": "46",
    "views": "149653",
    "top_comments": [
        {
            "comment": "I like to dive into Debussy whenever I can.  .)\nKapustin was intriguing, too.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30000000000000004,
            "subjectivity": 0.4
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The Kapustin piece reminds me of Attack of Titan.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm a bit disappointed that we still don't have any piece by Debussy in a hiphop version called Claude DeBUSSIN",
            "polarity": -0.75,
            "subjectivity": 0.75
        },
        {
            "body": "Everything by Ola Gjeilo.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "so happy to see Britten getting some recognition!! he's my favorite composer",
            "polarity": 0.75,
            "subjectivity": 1.0
        },
        {
            "body": "I heard that Britten piece before on a quartet recital I went before Covid and it was wonderful! Now I need to give a listen to that Mahler Symphony Nº4 ☺️\n\nI also may have trascended a bit with the Parry piece 😌 Send me to my grave with this piece, guys. Make of of these videos! Lately I’ve been listening to a lot of Elgar so I gotta thank you guys for it! 💕",
            "polarity": 0.3125,
            "subjectivity": 0.8
        },
        {
            "body": "Please pronounce the name of your favorite composer properly -Debussy accent on the last syllable and the 'u' is not oo but a short French 'u' like in the French 'rue'.",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.24444444444444446
        },
        {
            "body": "My 10 Underrated Classical Pieces:\n\n1.  Klavierkonzert [Piano Concerto] No 2. in C Minor. 1884 - Marie Jaëll (French 1846-1925) \n\n2. Concertino pour flûte [Flute Concertino] 1902 - Cécile Chaminade (French 1857-1944) - \nfave recording: Jae Lyoung Na\n\n3. Symphony No. 1 in E Minor 1932 - Florence Beatrice Price (American 1887-1853)\n\n4. Nocturne 1911 for violin and piano -  Lili Boulanger (French 1893-1918) \n\n5. Piano Trio in C Major  Op.29 for violin, cello and piano 1910 - Dora Pejačević (Croatian 1885-1923) \n\n6. Nonet in E-Flat Major 1849 for string quartet and wind quintet -  Louise Farrenc (French 1804-1875) \n\n7. Violin Sonatina in A Minor [sometimes written as Sonatine, depends on the recording] - Pauline Viardot (French-Spanish 1821-1910) \n\n8. Albatross (piece for solo piano) 1933 - Iris de Cairos-Rego (Australian 1894-1987) \n\n9. Ballade for Piano and Orchestra 1920 - Germaine Tailleferre (French 1892-1983)  (also check out her Sonata for solo Harp 1957)\n\n10. Talyllyn (piano solo) - Morfydd Llwyn-Owen (Welsh 1891-1918)",
            "polarity": -0.0019230769230769236,
            "subjectivity": 0.12307692307692307
        },
        {
            "body": "I love Nuit d'etoiles! A gorgeous piece. I remember reading that Debussy was inspired to use parallel 5ths when he heard a Gamelan ensemble at an exhibition in Paris. I cannot remember where I read that, it was back when I learnt La Fille au cheveux de lin, during the peak of my obsession with French Impressionists. Lol my wild teenage years. I still adore Debussy, I've just branched out a bit with my piano repertoire. 😄",
            "polarity": 0.278125,
            "subjectivity": 0.325
        },
        {
            "body": "Debussy is my favorite composer ever,  next to Ravel and Saint-Saens. There’s is something about French impressionism that is incredibly magical and makes it so ethereal and light. In love with that musical era",
            "polarity": 0.2714285714285714,
            "subjectivity": 0.4714285714285715
        },
        {
            "body": "More, please!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "Can you do a list of your favorite anime violin soundtrack music?",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Definitely would love more Underrated Piano/String/Brass/Woodwind/Etc Pieces videos!",
            "polarity": 0.375,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Kapustin is so good",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "It's rare that I comment or like a video in general, but guys, you really gave an opportunity to an ex classical musician to turn back, and have bittersweet memories of past loves and struggles You have given me a spark of nostalgia of what playing/singing this kind of pieces did and what deep down still does to me. The moment of pure bliss that a good piece of music gives you is something I haven't felt in years, and you shared these with me and countless others. A part from the comedic pleasure you guys give, after many, many videos, this is my absolute favourite. As it gave me the shivers, and more than one moment of musical enlightenment, just listening to classical masterpieces that otherwise I would never have heard. So thanks guys, thanks for sharing your passion and appreciation.\nLove yah, and hope you keep doing what ya've been doing, with my absolute support.",
            "polarity": 0.20266955266955272,
            "subjectivity": 0.42449494949494954
        }
    ]
}