{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-10-31 00:57:27",
    "ups": "8574",
    "downs": "31",
    "views": "77806",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Thank you so much I really enjoyed this video!!",
            "polarity": 0.78125,
            "subjectivity": 0.7
        },
        {
            "body": "If you namedrop Mahler it doesn't necessarily mean you are a music connoisseur- it could just mean that you are a Twoset connoisseur. Which is still pretty epic.",
            "polarity": -0.06875,
            "subjectivity": 0.69375
        },
        {
            "body": "Do I like this sort of thing? YES‼️\nMore please.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Please do more of this",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "You can tell this was Eddie's idea. Or at least he enjoyed it more",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Most organ pieces are overlooked.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "You need to listen to Arnold Bax's Elegiac Trio for Flute, Viola, and Harp.   That's amazing, underrated, and somewhat unknown...  even though Bax was famous in his time, in the early 20th century.",
            "polarity": 0.22000000000000003,
            "subjectivity": 0.5599999999999999
        },
        {
            "body": "This was an awesome video! If you could make more like these—that would be great!",
            "polarity": 0.8333333333333334,
            "subjectivity": 0.75
        },
        {
            "body": "This comment section is the best and most educational part of Internet for me",
            "polarity": 0.5833333333333334,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Mahler's symphony no.4 is really underated, and is my personal favourite ngl. The movement's so smooth and I have to say it doesn't sound like Mahler at all.",
            "polarity": 0.25,
            "subjectivity": 0.35
        },
        {
            "body": "i loved the video and part that you try to explain the taste of the pieces/songs.",
            "polarity": 0.7,
            "subjectivity": 0.8
        },
        {
            "body": "Please do more videos like this! My humble addition to the list: Abendlied by J. Rheinberger. Truly a underrated masterpiece, great writing and beautiful harmonies. And if you like French impressionists, try the Catalan composer Eduard Toldrà. Second movement of his string quartet “vistes al mar” is sooo beautiful.",
            "polarity": 0.41785714285714287,
            "subjectivity": 0.5214285714285715
        },
        {
            "body": "We need another playlist. Waiting for someone to create it. lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "~ bloch concerto grosso 1st mvmt is one of my faves",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Voces8 does a lot of Hubert Parry. If you like them…I think they are otherworldly.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i love that schumann quartet!!!!! theres a collection on spotify of op. 44 and 47 together (on period instruments!) and there are lot of really beautiful, really fun pieces between them :)",
            "polarity": 0.6625,
            "subjectivity": 0.7
        },
        {
            "body": "I think Debussy Arabesque 1 is also very underrated. I'm not sure how many people know it but it's so frickin beautiful",
            "polarity": 0.325,
            "subjectivity": 0.6722222222222223
        },
        {
            "body": "I just love watching two classical musicians nerd about classical music\nI don't play any instruments and I usually listen to a variety of musical genres, but I adore this channel and all the music you recomend <3",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.30833333333333335
        },
        {
            "body": "Man that harp really sounds like a piano at the end oh my gosh",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Lovely choices — more please 🥰",
            "polarity": 0.5,
            "subjectivity": 0.625
        }
    ]
}