{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-10-31 09:11:06",
    "ups": "10742",
    "downs": "39",
    "views": "108761",
    "top_comments": [
        {
            "comment": "Schumann's piano quartet is a Samsung ring tone",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "What I learned today: Prokofiev is the most Metal composer",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment": "Twoset could add Villa Lobos in that list so we can save Brazil",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Wonderful choices! I hadn't heard the Sibelius before...it's lovely. And my favorite Mahler symphony is the 7th.",
            "polarity": 0.6666666666666666,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "Schumann's piano quartet is a Samsung ring tone",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "你好陈先生和养先生! 我在学校学简化汉语。 你的视频太棒了! 尊重!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Eddy is sooooooo cute here ❤️❤️❤️",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I've been waiting for this 🤩🤩",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No cowbell in Mahler 4 boys, sleigh bells is an important part at the very opening and the finale. Good choice though!",
            "polarity": 0.4916666666666667,
            "subjectivity": 0.6333333333333334
        },
        {
            "body": "If you only made films like that from now on? I would not complain! ;) So educational! So pleasant to watch! Thank you! <3 Some pieces to check out: \"Roxana's Song\" by Karol Szymanowski, \"Modlitwa\" by Wacław z Szamotuł, \"People my people\" by Miłosz Bembinow, Lyric Pieces by Edvard Grieg.",
            "polarity": 0.46875,
            "subjectivity": 0.8111111111111112
        },
        {
            "body": "As a pianist I would much rather Argerich’s interpretation on Prokofiev 3rd concerto for piano 😁",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "My suggestions are Louis Moreau Gottschalk’s Pasquinade. Brett should try to learn that. Another suggestion is Alan Hovhaness’s Symphony No. 2, Mysterious Mountain.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "It would be amazing if this kind of video becomes a series on this channel. It's one of the most inspiring videos of TwoSet. Like, I now want to listen to them all, and also the analysis is super interesting. Also it'd be awesome if you just listen to one piece and analyze your thoughts on the spot. We love you and we have to thank you once again for inspiring us <3",
            "polarity": 0.6033333333333333,
            "subjectivity": 0.8066666666666666
        },
        {
            "body": "Twoset could add Villa Lobos in that list so we can save Brazil",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just curious, do you listen to League of Legend champion themes?",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Hymn of the cherubim by Tchaikovsky is one that i like very much",
            "polarity": 0.26,
            "subjectivity": 0.26
        },
        {
            "body": "I hope I don't get roasted but I feel like the first piece Debussy must have influenced the composer for Disney's Beauty and the Beast prologue (the 90s one). It would make sense as they probably looked to French composers as inspiration for a film set in France.",
            "polarity": 0.125,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "What I learned today: Prokofiev is the most Metal composer",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Check out Gordeli's piano concerto, second movement",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why haven't Brett and Eddie reacted to Little Einsteins? 🤔",
            "polarity": -0.1875,
            "subjectivity": 0.5
        },
        {
            "body": "Thank you! More recommendations, please!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "My picks:\n-Revueltas' Sensemayá: epic.  I've heard it called \"the Mexican Rite of Spring,\" which has some truth, but it's also totally unique.  It took me a couple listens to really like and appreciate it, but now I love it.  The Dudamel rec with the Simon Bolivar youth orchestra is the best recording I've heard on YouTube so far\n-Price's Ethiopia's Shadow in America, the 2nd movement specifically: absolutely beautiful, so so pretty, Price's slower pieces in general are some of the most beautiful things ever composed\n-Beach's Piano Quintet: so epic and beautiful\n-L. Boulanger's Faust et Helene: so good, it's for orchestra and 2 or 3 singers, the way their voices compliment each other is just unmatched from what I've heard\n-Coleridge-Taylor's arrangement of Deep River: so so pretty\n-Takemitsu's Between Tides: like Sensemayá it took me a while to like and appreciate, but now I love it\n-Lavista's Reflejos de la Noche: string quartet, but only uses harmonics.  The effects are so so cool and the piece overall is beautiful\n-Alvarez's Metro Chabacano: rhythmic, quite approachable, very cool",
            "polarity": 0.34819999999999995,
            "subjectivity": 0.6148
        }
    ]
}