{
    "time_posted": "2021-10-30 15:13:19",
    "url": "https://www.youtube.com/watch?v=jVixdD4ABIk",
    "time_now": "2021-11-05 21:01:57",
    "ups": "16466",
    "downs": "53",
    "views": "202773",
    "top_comments": [
        {
            "comment": "Bantock, Celtic Symphony, last movement. Rachmaninov, O Mother of God vigilantly praying. Rued Langgaard, String Quartets 2, 3, 6 and Variations on 'Mig Hjertellig nu Lenges'. Petris Vasks, violin concerto, Distant Light. Mendelssohn, Sonata in B flat. Some of my favourite underrated works for classical music.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.05500000000000001,
            "subjectivity": 0.24833333333333335
        },
        {
            "comment": "Two quick comments:\n\n1) Mad props for including choral music (I'm a choral conductor). Please share more cool vocal and choral music on this channel (and if you want some pointers, get in touch 😃). Parry is considered to have had an impact on Elgar's music, and he also taught Holst and Vaughan Williams! He has a lot of really great vocal and church music.\n\n2) Sibelius' Sapin is part of a collection (op.75) of five short piano pieces. Sibelius did indeed write stuff like this basically to make money, and didn't care too much for the piano. The piece is really nice though, and the other ones in the opus are interesting too!\n\nPlease keep making more videos like this Twoset!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3064393939393939,
            "subjectivity": 0.5704545454545454
        },
        {
            "comment": "i'm so glad you guys included kapustin in there. he's one of my favorite composers just from the groove he has",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "comment": "Honourable Mentions: Devil's Trill Sonata",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "No Wind instruments:<",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This list is really awesome. There's a critique about movies that goes \"to change a movie's structure, a director must know this structure intrinsically, otherwise the movie may end up making no sense.\" I feel like this list represents the same, but with classical music. All the pieces showed are, in one way or another, going against the rules to create something magnificent.",
            "polarity": 0.5,
            "subjectivity": 0.53125
        },
        {
            "body": "I love Mahler's 4th symphony!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "You should do a composer profile series. Like ten prices of prokofiev, bach, debussy and others.\nTHANK YOU",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}