{
    "time_posted": "2021-10-30 14:15:01",
    "url": "https://www.youtube.com/watch?v=jyWzBQ5RKUo",
    "time_now": "2021-10-31 00:57:47",
    "ups": "6501",
    "downs": "23",
    "views": "74595",
    "top_comments": [
        {
            "comment": "Follow me on Twitch If you want to catch some classic Skyblock Modpack streams!\nhttps://www.twitch.tv/xisuma",
            "likes": 103,
            "number_of_replies": 1,
            "polarity": 0.20833333333333331,
            "subjectivity": 0.16666666666666666
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "\"if youve ever used dispensers for this kind of thing...\" \nwas sure he was going to talk about the pain of crafting large amounts of dispensers",
            "polarity": 0.4380952380952381,
            "subjectivity": 0.739153439153439
        },
        {
            "body": "Doc is definitely not playing vanilla mc… #hacks",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "You and Pearl are having the same string issues xD snow takes over everything",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "I recently found three spider spawners that I can hook up altogether.✌💚😎",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "Can i ask, why not using trapdoor?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "0:45 - I was just commenting about that word.... and then you realized your mistake. XD",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That map is totally not up to date lol.",
            "polarity": 0.4,
            "subjectivity": 0.725
        },
        {
            "body": "uhmmm... 17:15 ????????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "use waterlogged trapdoors instead",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Minecraft developers: String will be great for crafting items like bows and fishing rods. And they can use it for tripwires.\nPlayers: Begon fowl frozen perception! The power of spider butt compels ye!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "At 9:30 instead of iron bars you can use honey blocks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "23:48",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "lol you should use google translate and click the speaker thing so you know how to properly pronounce acacia.",
            "polarity": 0.4,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "Cub has been really going at it with the red sand huh",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "#TeamSeas",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "can you do a tutorial for the spider farm?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wounder if you can make my dream come true, hermitcraft has inspired me and Im a new content creator. Im trying to work out what people wanna see and if im on the right path. \n\nIf you don't mind, no pressure of course, checking out a few of my upload and letting me know what you'd wanna see ect. Would mean the world to me. Thanks a million\n\nSee u soon I hope",
            "polarity": 0.07659632034632033,
            "subjectivity": 0.43795995670995674
        },
        {
            "body": "I think hermitcraft this season does way too many command things. I like the cosmetic custom model data things, but then it gets weird when commands and specific mods are used that aren't just utility/visual. Like with Doc's thing, that's just not vanilla, which I think kinda takes away from the idea of the server",
            "polarity": 0.0,
            "subjectivity": 0.5416666666666666
        },
        {
            "body": "9:17 what a sweet little interaction with Doc. It's the small things that make this server a Family.",
            "polarity": -0.029166666666666674,
            "subjectivity": 0.5166666666666666
        }
    ]
}