{
    "time_posted": "2021-10-30 15:02:59",
    "url": "https://www.youtube.com/watch?v=Ku8L9no2xSk",
    "time_now": "2021-11-01 01:39:51",
    "ups": "7010",
    "downs": "25",
    "views": "75727",
    "top_comments": [
        {
            "comment": "So other hermits know where to pay make the item frams invisible so they see the barrels",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "comment": "#PayInTheBarrel",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Day 5 of asking Rendog to play scrap mechanic again.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As soon as you showed the coupon barrel at the first spider I announced \"that's friggin' awesome!\" to the room just now. I hope the furniture in my room appreciated that, because apparently my cat did not.",
            "polarity": 0.375,
            "subjectivity": 0.4458333333333333
        },
        {
            "body": "Maybe don’t cover a barrel in signs so they can’t even see the barrel",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Question: Why did you make a snowy island? Just kidding Ren, I know it is meant to be spilled milk",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hermitcraft season 8 map dowloand bedrock in survival no creart",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You should move the diamond and derpcoin picture frames so they don't cover up the barrels, keralis was very confused",
            "polarity": -0.52,
            "subjectivity": 0.9099999999999999
        },
        {
            "body": "How does he just have the cords available without the rest of F3?",
            "polarity": 0.4,
            "subjectivity": 0.4
        },
        {
            "body": "The problem isn’t the size of the signs, but the lack of specifics. Which barrel are they supposed to use? Add arrows!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "#PayInTHISBarrel",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And i also feel Octagon deserves a \"How to shop at Otcagon\" tutorial video, idk something short and funny like mumbo's odea site with tutorials on how to build the contraptions. This little video can be posted on hermits discord server and yt just 4fun",
            "polarity": 0.020833333333333332,
            "subjectivity": 0.6
        },
        {
            "body": "This terraforming Project reminds me a lot of ashes, and looks like the ocatgon burned everything to the ground before settling in, and i think this feels like an amazing lore! The octagon its too powerfull and will take everything down in his way :pp",
            "polarity": 0.2972222222222223,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "#PayInTheBarrel",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Maybe make the item frames on the barrels invisible so that the barrels are more visible.",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}