{
    "time_posted": "2021-10-30 15:02:59",
    "url": "https://www.youtube.com/watch?v=Ku8L9no2xSk",
    "time_now": "2021-10-31 13:18:04",
    "ups": "6035",
    "downs": "22",
    "views": "59504",
    "top_comments": [
        {
            "comment": "#PayInTheBarrel",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "REN dog best",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Doc rules",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Did Sahara in season 6 teach you nothing??? Hermits do not pay attention, then they break things.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Go Blue Bats! Hope you win MCC all stars Ren!",
            "polarity": 0.5,
            "subjectivity": 0.25
        },
        {
            "body": "\"...otherwise the server will crash..\"\n\nCrashing the server is now a casual thing for Doc now.",
            "polarity": -0.5000000000000001,
            "subjectivity": 0.8666666666666667
        },
        {
            "body": "I love how casually Ren just flew into bed",
            "polarity": -5.551115123125783e-17,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "If Hermits don't use the barrel they should put named armour stands in the shops so it comes up as a unavoidable pop up",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Write pay in the barrel using a different color. It is still invisible",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "I have a cure for your problem. \nScrap the old system and keep buttons on its place\nNow the hermits have to click buttons and pay diamonds in a barrel to receive their stuff. Now that they don't find a shulker box, they have to pay in barrel\n\nJust switch your system from pick your item to press for your item",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "With all that white powder covering the Island and the talks of running a protection racket I'm afraid Doc and Rendog will turn into ScarDog/DogFace and the DocFather/GoatFather \"again\"\nalso a system where the payment system is too complicated for customers to use.... Where have I heard that one before....",
            "polarity": -0.3666666666666667,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "THE PRICE IS TOO HIGH FOR SHULKA BOXES !",
            "polarity": 0.2,
            "subjectivity": 0.5399999999999999
        },
        {
            "body": "Dis lekker om n Afrikaanse Minecraft YouTuber tesien\nDis nog altyd my droom om n Minecraft YouTuber teword maar n PC is nie goedkoop nie 😂😂\nEk love jou vids Ren.. dis die beste en so exciting om dit tekyk.. lekker Sense of humor 👌 hou so aan... jy gaan binnekort 1mil subs kry 😆",
            "polarity": 0.4,
            "subjectivity": 0.7
        },
        {
            "body": "1:37. The tilt was exactly how my phone was tilted 😂",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "My class advisor from 5th grade once said during a midterm exam \n\n\"Not following instructions is considered wrong\"",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Birdshit Island.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Ren your videos are just the best mood-improver!  I feel happier as soon as the theme music kicks in lol.  Bam!  I’m loving the content / narrative you and doc are spinning this season.  You both put in an immersive effort and the video production is top notch. Huge thanks and admiration.",
            "polarity": 0.6166666666666667,
            "subjectivity": 0.5916666666666667
        },
        {
            "body": "The white concrete actually reminds me not of snow but of ash. Like a forrest after a devastating wildfire.",
            "polarity": -0.2125,
            "subjectivity": 0.35
        },
        {
            "body": "On the terraforming project, I’m just going to say, as an Australian who has spent time around The Great Barrier Reef and Geographer. There are well known islands around the reef (such as Whitehaven Beach) that have pristine white sand so I think the white concrete powder was a good choice. \n\nAlso, on Whitehaven the sand makes a strange noise as you walk across it. The Indigenous people in the area call it whispering sands. Although, I’ e heard some locals refer to it as ‘barking spiders’. Pretty fitting considering you have a scary 8 legged creature standing on your island.",
            "polarity": 0.14583333333333334,
            "subjectivity": 0.4083333333333334
        },
        {
            "body": "should start selling leaves in your log shop.\nrename it to log and Leaf~",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "#PayInTheBarrel",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}