{
    "time_posted": "2021-10-30 15:02:59",
    "url": "https://www.youtube.com/watch?v=Ku8L9no2xSk",
    "time_now": "2021-11-01 09:53:47",
    "ups": "7284",
    "downs": "27",
    "views": "79829",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "0:53 it looked like as if ren has a super cool hat",
            "polarity": 0.3416666666666667,
            "subjectivity": 0.6583333333333333
        },
        {
            "body": "So the problem with hermits not paying in the barrels… is because they can’t see them.\n\nThe framed derp coin and framed diamond camouflage each barrel. Most don’t realize those spots don’t simply explain the value of each item but actually are where they need to pay. I suggest either moving the price frames or moving the barrels to a more noticeable place.\n\n(Noticed after watching Keralis try to figure it out in his video)",
            "polarity": 0.25,
            "subjectivity": 0.3642857142857143
        },
        {
            "body": "It could help to hide the item frames around the barrels to make the barrel itself more visible, as it currently looks like signage. Could have been a facetious Keralis gag, but he was complaining about having trouble spotting the barrel. Of course he simply recommended a payment barrel in front of the module, equally elegant. If you have some spare levels you could always rename your octagon brand shulkers for your products all pay in the barrel, but I think you have communicated thoroughly, just have a visibility issue.",
            "polarity": 0.16,
            "subjectivity": 0.49142857142857144
        },
        {
            "body": "Awesome episode! Aw sorry people are not paying in the barrel hope the new sign will fix that. I know I would definitely shop there and the log shop as well! Can’t wait to see how the custom biome turns out! Nice marketing plan! Keep up the awesome work! Have a fantastic week! See you later!",
            "polarity": 0.36079545454545453,
            "subjectivity": 0.7318181818181819
        }
    ]
}