{
    "time_posted": "2021-10-30 15:30:12",
    "url": "https://www.youtube.com/watch?v=L1i-_4oyxDQ",
    "time_now": "2021-11-03 15:28:50",
    "ups": "1971",
    "downs": "32",
    "views": "17783",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Beautiful.  That black wash is fantastic.  Going to try that on an oak armoire I want to update.",
            "polarity": 0.36111111111111116,
            "subjectivity": 0.7777777777777778
        },
        {
            "body": "My husband and I are new at flipping furniture so we had no idea about not mixing oil based poly and water based paint but after yousaid it,it made complete sense.  My mother-in-law gave us all her furniture that is at least 50yrs old so we are redoing them, thank you for the info.  I loved the color of the old version but yours was really beautiful and done correctly, lol.",
            "polarity": 0.31079545454545454,
            "subjectivity": 0.5193181818181818
        },
        {
            "body": "That's gorgeous. .I love the black wash and can totally see the rage with pottery barn ..👍🤩",
            "polarity": 0.2583333333333333,
            "subjectivity": 0.6708333333333334
        },
        {
            "body": "I used to think white was my favorite but now I’m not so sure. The black looks amazing!",
            "polarity": 0.3166666666666667,
            "subjectivity": 0.6444444444444444
        },
        {
            "body": "I did a black wash on a small table top (pine) and painted the bottom full strength black for my personal use and I love the wash look. I was wondering how it wood look on a whole piece like this. I love it. Maybe for those tired of white will go for it, but I still like your natural off white/beige look too.",
            "polarity": 0.09722222222222225,
            "subjectivity": 0.4430555555555556
        },
        {
            "body": "I love it!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Debbi here.  I love how this turned out however I have a question.  Why did you choose to not sand out the white primer that remained on the inside of the drawer frames.  It seems like such a small detail but I couldn’t help thinking that it made as a difference.  Love your work!",
            "polarity": 0.175,
            "subjectivity": 0.42000000000000004
        }
    ]
}