{
    "time_posted": "2021-10-30 15:30:12",
    "url": "https://www.youtube.com/watch?v=L1i-_4oyxDQ",
    "time_now": "2021-10-31 05:04:59",
    "ups": "1064",
    "downs": "15",
    "views": "7126",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Any reason why you didn't use a paint stripper? There are eco and low odor ones out there",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "This is now my favorite wash. Absolutely gorgeous!!!",
            "polarity": 0.75,
            "subjectivity": 0.95
        },
        {
            "body": "I love looking be this wash💕 But I have to say I like the white wash better. I don’t think I could pull this off so I’ll stick with what I know LOL! What happened to Last Saturday’s post?",
            "polarity": 0.4,
            "subjectivity": 0.37333333333333335
        },
        {
            "body": "Gorgeous! I am was obsessed with washes. Love the black!!!!!",
            "polarity": 0.09159342447916669,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "Super pro",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "🖤🤎 love it! I’m a sucker for all washes though 😊 beautiful job",
            "polarity": 0.39166666666666666,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "Beautiful!!! That is gorgeous! 💕💕",
            "polarity": 0.9375,
            "subjectivity": 0.95
        },
        {
            "body": "Ok, I didn't think I was going to like the buffet after seeing how streaky it was. I sat here thinking \"No, you sanded for years & now your streaking it up. Jeez.\" Thank goodness I was so wrong. After it dried and you sealed it... voila, it looks sooo expensive. This wash thing is pretty cool. I watched you do a white piece, I liked it best. But if I had extra money right now, I definitely make you an offer on this. It's gonna sell here in Nashville so quickly. Looks great, on trend, and solid wood. One of your best pieces. I wish you would do an end of year compilation of all your favorite pieces. Cost, time, selling price, days it took to sell, techniques, etc. I'm curious what you liked best, plus it'd be great content. All the best. 🙂",
            "polarity": 0.3508658008658009,
            "subjectivity": 0.562987012987013
        },
        {
            "body": "I am obsessed with the black wash, too! Can’t wait to experiment! ❤️",
            "polarity": -0.3802083333333333,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "I love the black washed look. Your piece turned out Beautiful! I’ve been waiting for the right piece to do this to. Hopefully one I can keep 😉",
            "polarity": 0.40476190476190477,
            "subjectivity": 0.6422619047619047
        },
        {
            "body": "So good!",
            "polarity": 0.875,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "This video is absolutely great. So much info in it. The clear coat was absolute pleasure to watch😍👍.",
            "polarity": 0.325,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "Divine!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love how this piece turned out!!!❤️",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Wow I like it.  I have a piece I’m now in between doing in a natural finish or this dark wash",
            "polarity": 0.016666666666666673,
            "subjectivity": 0.6
        },
        {
            "body": "Beautiful, great color choice and very well done. I love using the zibra brushes.",
            "polarity": 0.5874999999999999,
            "subjectivity": 0.6625
        },
        {
            "body": "Holy smokes! This looks AWESOME!!",
            "polarity": 1.0,
            "subjectivity": 1.0
        }
    ]
}