{
    "time_posted": "2021-10-30 15:26:03",
    "url": "https://www.youtube.com/watch?v=LfoHTnfnNNE",
    "time_now": "2021-10-31 17:25:21",
    "ups": "564",
    "downs": "12",
    "views": "7743",
    "top_comments": [
        {
            "comment": "The French have been stealing fish for year's that's why some boats don't have a licence because they were never registered,think how much fish that would amount to over the years they should be taken to court and fined",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 0.1
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "What a refreshing idea to have someone from the media expressing support for Britain. Can’t imagine the same from the BBC!",
            "polarity": 0.25,
            "subjectivity": 0.5625
        },
        {
            "body": "make them pay, close the border to France, so the UK can enjoy its food stamps before X-mas...because the UK government dont care for people...starving or covid, its just the way nature is... they will die anyway...!",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Punishing? How can we be punished? we hold all the cards and they need us more than we need them. It does not add up, were these two statements false then?",
            "polarity": 0.04999999999999996,
            "subjectivity": 0.55
        },
        {
            "body": "Very good points raised. The EU Army was coming before we left thank God. A United States of Europe ? It would need a President of course.....\nMr.Blair ?",
            "polarity": 0.45499999999999996,
            "subjectivity": 0.39000000000000007
        },
        {
            "body": "The problem between France and UK concerns mainly fishing around Jersey and Guernesey. Just look at the size of territorial area of the Channel Islands, and everyone will have understand the problem between brexit for french fishers.",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "And the British government has not invested in it's own people,  to educate them, so obsessed are they with suppressing the working class of Britain, import everyone and tell the working class that they are lazy or drug addicts or racist or anything else they can throw at us, it must be becoming obvious to people as to what has been going on for decades if not longer",
            "polarity": 0.049999999999999996,
            "subjectivity": 0.725
        },
        {
            "body": "If the French don't want migrants in France, close the soddin' borders where they are getting in from Italy, Spain or anywhere else.  That is THEIR problem",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}