{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=LhHtchAY4M4",
    "time_now": "2021-10-31 17:25:31",
    "ups": "6308",
    "downs": "86",
    "views": "98430",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Defund the squad.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "LET'S Go BRANDON!!!! FJB",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He is only telling half the truth. Dems or Republicans are the same. Both are bought and payed for by corporations and lobbies. All they can do to keep it up is to have  people fight each other over crumbs. Our government does not represent us and the media has taken sides, either on the right or left. That means neither give you info if it against there party. Both sides are full of it. I had to finally admit to myself even the media and politicians I listen to are full of it. I also finally decided I am not going to hate my neighbor because they listen to lyes by the right or left. Totally independent now, tv off, and back to liking everyone again. This country has always found its strength in the people not just a had full of greedy politicians who lye more then lawyers. Just my two thoughts!",
            "polarity": 0.06792717086834733,
            "subjectivity": 0.4654761904761905
        },
        {
            "body": "How can anyone downvote this video? What Brian is saying is for all to see, are the lefties SO delusional that they can't accept what we all see? For the sake of America, do the right thing and admit that this shitshow of a presidency must end, for the sake of you, your children and America as a whole!",
            "polarity": 0.26785714285714285,
            "subjectivity": 0.46785714285714286
        },
        {
            "body": "Absolutely true. The Democratic Party has NEVER cared about the public. It has been a self-interested party from the beginning, with a goal of controlling people. It goes back to the Knights of the Golden Circle, and their desire to become wealthy aristocrats with a slave empire.",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.44333333333333336
        },
        {
            "body": "Agree with you  ... Bryan",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Neither does Trump",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Inmigrants gonna keep crossing bathe border and living with government benefits",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It is abuntly clear that biden does not care what happens to American and can be seen easily in the recent biden town hall . His answers to questions make it clear that implementing his view and plan are of more importance than dealing with the dangers of the fall out.",
            "polarity": 0.18888888888888888,
            "subjectivity": 0.39166666666666666
        },
        {
            "body": "A Bill 1600 pages long ? Who writes these things ? Some long deceased Russian authour ?",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "Problem is that we have far too many Republicans in the same vane; they proved that when they had both chambers and the White House and did virtually nothing to undo some of the damage Obama had done and/or got measures passed that would be beneficial to Americans. I would guess that is due to either they were afraid of doing damage to their OWN careers or they agree( which I think is a lot of it ) with socialist polices themselves. I’m not sure that those who consistently stand up for the people could fill up both hands. So all in all they for the most part are DISASTERS!!!!!!!!",
            "polarity": 0.14750000000000002,
            "subjectivity": 0.5538888888888889
        },
        {
            "body": "What are Republicans doing to address any of these problems?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Gee and my butt really hurts today, oh well can’t win’s all",
            "polarity": 0.5,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Burn their cities and THEY'LL LISTEN! Tke a clue from the criminals and obstructionists until we can permanently ouster these Pelosi puppets",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Who the hell voted for this idiot?\nIDIOTS THATS WHO!",
            "polarity": -0.9,
            "subjectivity": 0.8
        },
        {
            "body": "All politicians are corrupt idiots.  Including Trump.  All puppets to the corporations and establishment.",
            "polarity": -0.65,
            "subjectivity": 0.9
        },
        {
            "body": "Turn Virginia & New Jersey \nRed 🇺🇸🦅☝️",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.22727272727272727
        },
        {
            "body": "Let’s Go Brandon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Rep. \"Potato Head\" Pressley\". What, is she trying out for a Spud light  commercial ? For all you do this spuds for you. LMAO",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "What the hell is wrong with Biden?  Is he really that stupid and  hates this country so much that he is trying to ruin it.  He does not speak for himself.  Someone else is telling him what to say.  I hope that in 2022 the Republicans take over the house and senate and elects governors who are running.  Please",
            "polarity": -0.22499999999999998,
            "subjectivity": 0.5750000000000001
        }
    ]
}