{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=LhHtchAY4M4",
    "time_now": "2021-10-31 21:32:46",
    "ups": "6439",
    "downs": "91",
    "views": "101204",
    "top_comments": [
        {
            "comment": "Is that my tax money? I'm a big NO. They're gonna to get the money and go back to their country and AMERICA will be the 4th world COUNTRY. Stop the madness. Peace",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.05
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Might be time to have another \"Million Man March\", with all races included.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I’m surprised they’re not passing out Halloween Candy at the Border this week! 🎃 🍬",
            "polarity": 0.125,
            "subjectivity": 0.9
        },
        {
            "body": "Unbelievable",
            "polarity": -0.25,
            "subjectivity": 1.0
        },
        {
            "body": "OMG  GET THIS  CRAZY ADMINASTRATION  AND BIDEN OUT. THERE RUINING OUR GREAT COUNTRY.  THEY DON'T GIVE A DAM ABOUT US  CITIZENS OF AMERCIA. THEY CARE ABOUT ALL THE ILLEGAL IMMIGRANTS .WILL BE 2 MILLIO.N SOON IF NOT ALREADY. THEY GET 450 THIUSAND PER PERSON IN FAMILIES.  THEY DO MORE FOR ILLEGAL IMMIGRANTS THEN THE US CITIZENS OF  amercia. And border will be wide open, NO one knows how long. Maybe untill we vote the. The hell  out of office, ALL OF THEM.",
            "polarity": -0.05624999999999999,
            "subjectivity": 0.55625
        },
        {
            "body": "Agree 100%. When are Republicans going to stand up snd fight the Bank/IRS bank bill and 85 mil to weaponize IRS??",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's a Democrat soldiers thing about us they wouldn't be trying to take all our rights away",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dems don't care about you... they want billionaires to pay for your kids child care and grandparents care... just go back to work so I can make MORE money on my investments in the stock market.... great segment Brian",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "This women should  shut up and go home  grow some  hair",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jeez, what an ugly sight!!! Go Fund her to get a been, at least- the glare is discomforting!!!",
            "polarity": -0.79296875,
            "subjectivity": 0.7
        },
        {
            "body": "It is clear to me the only plan Dems have is to obtain power and keep it at the cost of everything",
            "polarity": 0.05000000000000001,
            "subjectivity": 0.6916666666666667
        },
        {
            "body": "Too many nutjobs in our government. Any real American patriot has got to be pissed off with the way these radicals are destroying this country.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "Man give them more money than my wife and I have",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Anyone look at the latest VAERS data?  Over 17k dead and even more disabled!  Not worth taking it unless if you like gambling with your health.",
            "polarity": 0.08,
            "subjectivity": 0.44000000000000006
        },
        {
            "body": "Is that my tax money? I'm a big NO. They're gonna to get the money and go back to their country and AMERICA will be the 4th world COUNTRY. Stop the madness. Peace",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "body": "She s a LOM.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Brings new meaning to the phrase \"tilting at windmills\".",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Democrats are reigning in communism. It's obvious to anyone who hasn't stepped foot on an American university campus.",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "if you vote for any democrats you fail.",
            "polarity": -0.5,
            "subjectivity": 0.29999999999999993
        },
        {
            "body": "Democrats create problems!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey, Joe how about $450,000 for each person whose businesses were looted and destroyed in last summer’s riots? Let’s Go Brandon!!",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        }
    ]
}