{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=LhHtchAY4M4",
    "time_now": "2021-10-30 16:46:00",
    "ups": "3869",
    "downs": "63",
    "views": "43861",
    "top_comments": [
        {
            "comment": "Wake up Americans !!! \nWe are lost !!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The massholes are never getting enough",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "They are literally taking this out of the, “How to become a Tyrant”, handbook!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Sadly,, Today's majority in leadership of This so called \"DEM\" party doesn't give two shits about America, and certainly its citizens.  They are as corrupt,, self promoting,; self consumed,, power crazed, disrespectful and destroying of Personal rights,, disloyal,, and just Criminal,, as could be imagined.  Take that TRUTH, from THIS past 25+ year Dem, from the proud Party of JFK,, MLK,, JLL,, ETC... My Party no longer exists!!  The name was hijacked by CAREER, POLITICAL, CRIMINAL, Scum. ( THOSE LIKE HILLARY CLINTON, LIZ WARREN,, OBAMA, BIDEN, PELOSI,,,THE SO CALLED \"SQUAD \" ,, ETC..)  This is Why I'm a PROUD registered  ( I ),, Who votes Libritarian the majority of the time.  It amazes me the numbers of people,; like myself,, that jumped that Titanic ship!  Whats more amazing,; the numbers of good people,  still within that mess, that KNOW BETTER!!   IT'S PASSED TIME,, TO WAKE FROM THE WOKENESS!!  TRUMP'S Policies,, and any that think like minded,, are needed now more than ever!!",
            "polarity": 0.17058531746031746,
            "subjectivity": 0.5498015873015872
        },
        {
            "body": "You better get your brains together people or we're all going to be in Chains except for the swamp they'll be rolling in money",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Seems to me that no politician cares about you. There's no difference between the two parties; they're exactly the same behind the scenes.",
            "polarity": -0.05000000000000001,
            "subjectivity": 0.35833333333333334
        },
        {
            "body": "The democratic party does not care about the people. Democrats care about backroom deals, special interests, and their own ruling class of nepotism. Read that again.",
            "polarity": 0.47857142857142854,
            "subjectivity": 0.7857142857142857
        },
        {
            "body": "If he doesn't like borders of walls, maybe he shouldn't have the government be building him a $455000 fence for beach house !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Your brain ought to be on inner structure",
            "polarity": 0.0,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "It goes further than that-The dem party wants us all dead they have a demonic hatred for all things Christian, the unborn, conservative, and freedom",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "The entire premise is wrong.  They aren't Democrats they are Socialist.  So the Socialist party doesn't care about you.  Or any of is.",
            "polarity": -0.25,
            "subjectivity": 0.7625
        },
        {
            "body": "By the time enough people try to stop them it will be too late.",
            "polarity": -0.15,
            "subjectivity": 0.55
        },
        {
            "body": "I feel sorry for members of Congress who have to look at these hideous democrat women. These nasty women are another attempt to demoralize and disrupt this country's institutions.",
            "polarity": -0.75,
            "subjectivity": 1.0
        },
        {
            "body": "You could have used the free college from biden..did you graduate from high school brian",
            "polarity": 0.28,
            "subjectivity": 0.6699999999999999
        },
        {
            "body": "I feel sorry for members of Congress who have to look at these hideous democrat women. These womens' appearance are another attempt to demoralize and disrupt thos country's institutions.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "NO DAMNED POLITICIAN CARE ABOUT THE PEOPLE..\n...NONE....😐",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why do The Squad have such power?  They are a pathetically tiny part of Congress.  Perhaps they will bring about the end of The Democrats through their infantile bullying behavior.",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.45
        },
        {
            "body": "Wake up Americans !!! \nWe are lost !!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Brian, someone needs to investigate who can be a member of congress for the people of the USA. I feel as tho our government has been turned over to foreigners. What day you?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Biden: \"If you don't vote for me then you're ain't black\"\n\nMe: \"That's racist in so many ways\"",
            "polarity": 0.16666666666666669,
            "subjectivity": 0.4666666666666667
        }
    ]
}