{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=LhHtchAY4M4",
    "time_now": "2021-11-01 14:01:43",
    "ups": "6919",
    "downs": "102",
    "views": "112985",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Ayallah Pressley is a conehead.  She's more interested in social welfare on Proxima Centauri.",
            "polarity": 0.2611111111111111,
            "subjectivity": 0.35555555555555557
        },
        {
            "body": "We know that FJB don’t give a dam about anyone.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Joe Biden is a complete failure. Illegal entry says it All, a lot of these kids as I recall were put on trains by there own parents....the attorneys making these arguments should be disbarred!!!\nImpeachment the entire administration!!!",
            "polarity": 0.056666666666666664,
            "subjectivity": 0.5650000000000001
        },
        {
            "body": "She had hair when she ran for congress, that's the hair analogy of taking the mask off once you have power.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "DEMOCRAP COMMIES ARE TOO FAR OUT...we will do nothing this admin and obiden want.,..we all hate them for taking us down the toilet....lets go brandon ...close the borders",
            "polarity": -0.2851851851851852,
            "subjectivity": 0.7296296296296295
        },
        {
            "body": "450,000 payment  is bs!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "how about compensation for all citizens that have lasting psychological trauma because the government has turned the country into a chaotic prison yard leaving us to fend for ourselves - and be held accountable for saving our selves because the government are a bunch of cowards hiding in the safety of their fortresses! say to the tune of reimbursing us our taxes - all of them, a vehicle of our choice and all the remodeling, building of our homes, and a million in precious metal... forget cash, that shits about to be worthless. nobody wants a wheel barrel of paper money that might buy a loaf of bread next year..",
            "polarity": -0.016666666666666673,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "WOW COMMUNISM!!! SO BRAVE AND STONG!🤩🤩🤩",
            "polarity": 0.49765625,
            "subjectivity": 1.0
        },
        {
            "body": "Thank you for interviewing a Democrat",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Progressive; a revised term by the communist party USA to be more acceptable to the US population then communist/marxist. Call them what they are!!!",
            "polarity": 0.9765625,
            "subjectivity": 0.5
        },
        {
            "body": "The demrats know they don't need to worry about elections. They can do whatever they want and no one can do nothing about it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kilmeade comes across as a used car salseman, picture him in a car yard",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We need to stop paying taxes......",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}