{
    "time_posted": "2021-10-30 12:00:11",
    "url": "https://www.youtube.com/watch?v=LhHtchAY4M4",
    "time_now": "2021-10-31 13:18:29",
    "ups": "6162",
    "downs": "99",
    "views": "94833",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "They aren't even citizens. They have no grounds to sue the government for something they put themselves through.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The fact that this \"administration\", and I use that word jokingly, it's actually a dictatorship, is a bunch of greedy, selfish, disorganized, activists; is the only thing working for the benefit of the American people right now. If these people all stopped the petty squabbling and infighting and were all on the same page of the communist guide to authoritarianism they would be unstoppable in the worst way possible. The American experiment would be over as we know it. \nThe time is now, these are the days they'll write about, in the history books. And when they do, they'll talk about how average Americans held the fort. We the people does not mean the government joe, they were referencing us. \n🇺🇸🇺🇸 LET'S GO BRANDON! 🇺🇸🇺🇸",
            "polarity": -0.10627029220779222,
            "subjectivity": 0.5316558441558442
        },
        {
            "body": "That comic looks exactly like the government propaganda in the old Soviet Union.",
            "polarity": 0.125,
            "subjectivity": 0.2625
        },
        {
            "body": "Holy smokes she looks like Louis Gossett Jr. in the movie 'Enemy Mine'.\nRight in time for Halloween, scary stuff!",
            "polarity": -0.16964285714285715,
            "subjectivity": 0.7678571428571428
        },
        {
            "body": "Nothing she mentioned is infrastructure.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We dont give a EFF about them either!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What's your view on human woman Rights?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Is Fox News for Womans human Rights?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Bro. Whats your salary? My buddies salary is zero..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Buddy do I have your permission to take a knee?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What do you care for Buddy?? Womans human rights maybe?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "News flash: 🗣️ neither does the republican party.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Ok your dictator let a deadly virus come to America wipe out most dock workers and production workers and teachers people working at crude oil refineries. And your trying to blame all the crap that was the cause of a virus. The crap at the border of mexico was caused by Trump stopped travel from Mexico four years ago. And your bringing in over 200 thousand people from Afghanistan that can be ISIS sleeper cells 😂😂😂😂😂 great joke cover-up to stop people from watching trump and 3/4 of the GOP going to prison",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.6785714285714286
        },
        {
            "body": "This is why we need to stop this administration and the only way to do it before things get any worse, and things will get worse, is to use those Constitutional Rights to fight these tyrants and their tyranny.",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "How is Brian making up so many lies?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "All the broken campaign promises. But these idiots are convinced that they actually care about the lives of poor idiots.",
            "polarity": -0.4800000000000001,
            "subjectivity": 0.54
        },
        {
            "body": "They said just like traitorous lying didn't give a dam about the people who he murdered at the capital building",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This headline is 100%.  So with that in mind wTH are they injecting people with ? Does not seem to be working as a vaccine but they still want EVERYONE to get them.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Protecting America ? Answer is NO ! Democrats your FIRED !",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}