{
    "time_posted": "2021-10-30 14:06:44",
    "url": "https://www.youtube.com/watch?v=lt__tsWNOXk",
    "time_now": "2021-11-04 03:50:56",
    "ups": "7208",
    "downs": "394",
    "views": "108564",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I like to wear what Walmart has to offer!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Flannels will never die",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "But what I want to know, what are your thoughts on long cabal knit cardigan sweaters?? 🤔. Thrifted both of my sweaters, simple and warm, and people always give me compliments on them.",
            "polarity": 0.18333333333333332,
            "subjectivity": 0.4523809523809524
        },
        {
            "body": "A man of style who understands fit, will wear turtlenecks, Chelsea boots, flannel and look stylish. A man can waste a lot of money following trends. If you want an ECONOMICAL, versatile wardrobe, you keep your classics, such as turtlenecks and Chelsea boots, and occasionally add items that may be on trend, if it fits YOUR aesthetic. That way, your wardrobe is always fresh. \n\nBuy quality, versatile, staple items,  make sure you get the fit right, and use a little creativity, and not only will you look stylish, you may very well be the best dressed guy in the room! \n\nSometimes bucking the trend, makes you MORE stylish, than all the other followers!",
            "polarity": 0.2548402255639098,
            "subjectivity": 0.5434001670843777
        },
        {
            "body": "I agree with the Chelsea boot, ripped jeans, and the skin tight joggers, but you can never go wrong with a dope bomber jacket, flannel and turtleneck, all timeless pieces when worn correct!✊🏾",
            "polarity": -0.3392857142857143,
            "subjectivity": 0.5928571428571429
        },
        {
            "body": "chelsea boots out of style? LMAO you high as fuck my guy!",
            "polarity": 0.08666666666666667,
            "subjectivity": 0.7133333333333334
        }
    ]
}