{
    "time_posted": "2021-10-30 14:06:44",
    "url": "https://www.youtube.com/watch?v=lt__tsWNOXk",
    "time_now": "2021-10-31 09:11:52",
    "ups": "4660",
    "downs": "230",
    "views": "59816",
    "top_comments": [
        {
            "comment": "Jose: Bombers are out of style..\n\nMe: Owns all 4 ESNTLS Bombers from his 8th collection",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "🤍🤍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Honestly it's your choice to choose what's in style or not",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "I can’t agree on the bomber one. They just hit that sweet spot between casual/clean/simple/stylish",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "Definitely have to disagree with the Chelsea boots",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I thought all joggers were skin tight",
            "polarity": -0.17857142857142858,
            "subjectivity": 0.2857142857142857
        },
        {
            "body": "Bomber jackets are not in style; they are in fashion. There is an important difference. Fashion comes and goes, but style remains style and can last a lifetime.",
            "polarity": 0.2,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Every trend that he recommended in the past few years, and now he's redacting them all 🤦🏻‍♂️",
            "polarity": -0.225,
            "subjectivity": 0.175
        },
        {
            "body": "I love how he insist first every one to try one and later on next video boom it's out of fashion z😂",
            "polarity": 0.1875,
            "subjectivity": 0.23333333333333334
        },
        {
            "body": "hey jose just my 15 years of life i,ve hardly seen 5 or 6 people wearing Chelsea boots sooo i still think they are in the game",
            "polarity": -0.3458333333333333,
            "subjectivity": 0.4708333333333333
        },
        {
            "body": "I have a tip for everyone. How about you wear whatever makes you feel and look good. Not everything works for everyone . Wear what you think looks good on you",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Lmao what??? Bombers are back strongly just with a different way to style them 😅 If you are into fashion you’d realize that pieces don’t really change most of the time. It’s the style and aesthetic that does.",
            "polarity": 0.28888888888888886,
            "subjectivity": 0.5055555555555556
        },
        {
            "body": "His hoodie is not out of style though lol\nThere is not such thing as chelsea boots or turtleneck out of style ever",
            "polarity": 0.4,
            "subjectivity": 0.6
        },
        {
            "body": "Jose: Bombers are out of style..\n\nMe: Owns all 4 ESNTLS Bombers from his 8th collection",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I can't do anything about 1 to 5... Am sorry, I love these items, they make me look good, they fit perfectly with my body type and I feel confident whenever am in them. I can experiment with the new stuff... but I can't replace",
            "polarity": 0.39090909090909093,
            "subjectivity": 0.6982683982683983
        },
        {
            "body": "Jose Pls drop an updated shoe collection or closet tour video. Btw love your content brother, keep growing. ❤❤",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Sir Please do a giveaway all over the world!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "MY GUY I agree with u on everything EXCEPT MY DAMN CHELSEA BOOTS 🤣😂🤣 I’m not giving them up",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}