{
    "time_posted": "2021-10-30 14:06:44",
    "url": "https://www.youtube.com/watch?v=lt__tsWNOXk",
    "time_now": "2021-10-30 16:46:09",
    "ups": "2165",
    "downs": "88",
    "views": "17333",
    "top_comments": [
        {
            "comment": "Bro I just bought a Flannel from H&M 2 days ago",
            "likes": 2,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Bruh, I just bought my first ever bomber jacket😐😂",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "puffer jackets are common in new york lol",
            "polarity": 0.21212121212121215,
            "subjectivity": 0.5515151515151515
        },
        {
            "body": "Shirt jacket, some nice fitted jeans, and some cowboy boots. 👍",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "I don't understand why people like or shop at H&M. The quality of clothing is horrible. It's all \"trendy\" so it goes out of fashion in less than a year. (If it lasts that long) And everything is ridiculous expensive, for what the quality is. Walmart and Target both have better quality clothing . And at a fraction of the price",
            "polarity": -0.1357142857142857,
            "subjectivity": 0.6523809523809524
        },
        {
            "body": "Bruh, I just bought my first ever bomber jacket😐😂",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Bro, your profile pic is literally you wearing a flannel 😭 and they are \"played out\"? no credibility.\nFlannels and turtle necks are not even trends, but timeless classics.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Maybe they are played out in other major cities and states but not here in KC. Sometimes I really feel over dressed 😂. In fact, I got a Halloween event tonight at the arboretum and it's going to be cold and I'm going to rock the Chelsea boots, black chinos, black turtleneck with gold chain and my gray overcoat. I will agree that flannels are over played but I like the look but I'm definitely digging the shirt jacket that was shown!",
            "polarity": -0.11369047619047619,
            "subjectivity": 0.49166666666666675
        },
        {
            "body": "Love the content! You should’ve said “No way Jose” when talking about the bomber jacket lol missed opportunity there",
            "polarity": 0.7125,
            "subjectivity": 0.6499999999999999
        },
        {
            "body": "Telling people to ditch classics and chase trends is horrible advice.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Any link for the boots?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I was bored with bombers too! I love the shirt jackets!",
            "polarity": 0.0,
            "subjectivity": 0.8
        },
        {
            "body": "Just wear what you want cos chances are all these “out of trend” clothes will be trendy in a year or 2",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "Bro I just bought a Flannel from H&M 2 days ago",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Long and short, don't listen to Jose",
            "polarity": -0.025,
            "subjectivity": 0.35
        },
        {
            "body": "As a girl his tips are on point. Most guys I know don't put much effort into their style so any guy that does stands out in a good way, even if you're wearing the played out fashions. But if you are a guy that's really into fashion his suggestions don't miss, the old styles look nice also, but the new ones do look more elevated.",
            "polarity": 0.3670454545454545,
            "subjectivity": 0.45681818181818185
        },
        {
            "body": "Nah bruh they’re aren’t out of style lol. That’s like saying Honda civics are out of style cause everyone has them. It’s true that lots of ppl have them but they’re classics and versatile. Gonna have to disagree with this video. Much love tho.",
            "polarity": 0.5499999999999999,
            "subjectivity": 0.65
        },
        {
            "body": "Info on the hoodie? Esntls?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lol shameless marketing hm while bashing the same styles he’s promoted not too long ago 😅",
            "polarity": 0.25,
            "subjectivity": 0.4083333333333334
        },
        {
            "body": "Jogger & ripped jeans 👎. I'm wit ya  my guy. But the rest can't be played out if there also classics. To strong a word.  How about phrasing it like this \" Boys these style are common , what to stand out try this instead. Using absolute wording is not always necessary especially when it comes to fashion .",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.8266666666666665
        },
        {
            "body": "Some great points you've got there! 😉👌🏻",
            "polarity": 1.0,
            "subjectivity": 0.75
        }
    ]
}