{
    "time_posted": "2021-10-30 14:15:00",
    "url": "https://www.youtube.com/watch?v=MSPdvM4eQ5A",
    "time_now": "2021-11-01 05:46:59",
    "ups": "19780",
    "downs": "256",
    "views": "433658",
    "top_comments": [
        {
            "comment": "Once again, thanks to #AceDefender for sponsoring this video :)\nUse the link below to try it out and support the channel:\nhttps://mtchm.de/vcomd",
            "likes": 405,
            "number_of_replies": 44,
            "polarity": 0.35,
            "subjectivity": 0.6
        },
        {
            "comment": "I kept so annoyed when you wouldn’t replace the floor of the mob farm, you made it out of slabs. They don’t spawn on slabs.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.4,
            "subjectivity": 0.8
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Warum hat Australien die meisten Millionäre der Welt? https://youtu.be/ZJh3-PAORDg",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "you should continue this series",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey Mr.yeah can you pls make part two day 200",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "*Hey, to you reading* .... you are loved in this moment, just as you are, here's how we know:\n\"For God so loved the world, that he gave his only begotten Son, that whoever believes in him should not perish, but have everlasting life.”",
            "polarity": 0.4666666666666666,
            "subjectivity": 0.8666666666666667
        },
        {
            "body": "when you find diamonds before iron....\n\n\n\n\n\n\nEUH",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "best video idea Ive ever seen, please continue",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I believe AFK fish farms were nerfed in 1.16, so that you can only get fish and other common loot, none of the enchanted books. You need to be in an open ocean for that to work, I think",
            "polarity": -0.10625,
            "subjectivity": 0.59375
        },
        {
            "body": "Yeah Joran : * finds diamonds but cant get them thanks to lava\n\n\n\n\n\n\n\nwe i also fall for that sometimes",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "This man one shotted a creeper on day 32",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "the lore for a comman charater: scammer man caught scammera\n\nthe lore for a super uber ultra rare sumon: scammer man caught scammer whilst scamming a scammer who was scamming a scammer who was also scamming a scammer whilst scamming a non scammer who was getting this first scam while scamming a scammer who scamed a scammer while scamming the first scamming who scamed a non scammer who tried scamming a non scammer but failed only to find out he was not the real first scammer scamming a scammer who was trying to scam the ultimate scamming then failed to scam the scammer of ultimate when scaming the scammer of the scammer he met the scammer god who told him scamming is a art not a skill and to become the ultimate scammer he must scam a scammer scamming a scammer while scamming a non scammer trynna get his first scam who is also trynna scam the ultimate scammer who got scammed by the ultimate scammer and was scamming the god scammer who met the eveil scammer and the hero scammer who killed the eveil scammer and saved the scammer verse but the scammer verse is about to get scammed by the scammer god who tried to scam the scammer father and the scammer father would control the scammer god and would become the scammer universe who was scamming the scammer mother while she was giving birth to the scammer child who scammed the ultimate scammer and then the the scamming father got scammed by the ultimate scammer then scammed the scammer lord who scammed the scammer vampire lord who scamed the lifeo ut of scammers who are scamming people scamming fools who killed the scammer god trying to scamm the scamming mother then the scamming child got older and scammed the scamming lord trying to avenge his father who was scamming trained with the universal scammer who scammed the omipoitent scammer then died when he took revenge the scamming child now has to scamming the scamming lord and the omipotent scammer he will he have his revenge or will he fail at another space in the unverse the omipotent is gathering the strongest scammers ever who will win find out next time on dragon ball z:?\r\nu fool",
            "polarity": 0.035869565217391305,
            "subjectivity": 0.5521739130434783
        },
        {
            "body": "this was one of the most entertaining videos that’s I watched lmao. I can’t believe you made friends with pigs lol\nedit: cool I got likesssss thanks",
            "polarity": 0.49166666666666675,
            "subjectivity": 0.6250000000000001
        },
        {
            "body": "It would be cool if you made a video where it starts with 1000 blocks and every day the border shrinks and you have to get a specific item before time runs out",
            "polarity": 0.175,
            "subjectivity": 0.3875
        },
        {
            "body": "200 days? Like this is a really cool concept having the border increase every day",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "jaron \"i've got a sweet spot for polished diorite\" impulseSV \"so you have chosen... death\"",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "I kept so annoyed when you wouldn’t replace the floor of the mob farm, you made it out of slabs. They don’t spawn on slabs.",
            "polarity": -0.4,
            "subjectivity": 0.8
        },
        {
            "body": "Background music reminds me of respected man",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You know i had to breed them heheheh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "#TeamSeas",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You do realise mobs dont spawn on slabs right?  You built the mob farm out of FUCKING SLABS!!!",
            "polarity": -0.35714285714285715,
            "subjectivity": 0.6678571428571429
        }
    ]
}