{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-10-31 05:04:54",
    "ups": "4073",
    "downs": "211",
    "views": "198209",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Racheal is having another meltdown that discovery is happening, LOL",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Treason is 20 years!\r\n6 months to a year is pinky privilege.\r\nWhat sentence would they get if they were black?\r\nWE LIVE IN A GENERATION WHERE TEASING AND LAUGHING AT AMERICANS IS THE NORM.",
            "polarity": -0.015151515151515152,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "Jimmy Carter always insisted that Trump wasn't a legitimate president.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What a mess...and now are we better off??? We've got Biden who doesn't know his name...Chinese breathing down the backs of the western world...and where are America's priorities?",
            "polarity": 0.11481481481481481,
            "subjectivity": 0.262962962962963
        },
        {
            "body": "Jared tried to establish a back channel to Alpha Bank. I feel like I’m living in Groundhog Day. Where’s the law and order?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well, of COURSE Trump had servers communicating with Russia (Putin).  Remember when one of his first requests upon being sworn in was to ask for a back channel communication to the Russians?  And then he rammed through Jared Kushner's security clearance even though it was officially denied due to security concerns.  Remember that?\n\nAnd eventually we will find that Trump is in hock to the Russians and that's the main reason he wants (needs) to be President.  I suspect the deal that Trump has fashioned is that if he is dutifully \"useful\" to them, they will forgive the debts.  I shudder to think how much classified information he has already shared with them.\n\nWe could spend the rest of this century chasing down all the corruption Trump has committed as both a private citizen and as President...and we still probably wouldn't get through all of it.",
            "polarity": 0.09290123456790124,
            "subjectivity": 0.2228395061728395
        },
        {
            "body": "11:44 Haven't thought about it in Years!  (hahahahahaha)",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "LET'S GO BRANDON 🖕",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Manchin is not a democrat  in reality he is a infiltrated republican he doesn’t care for the por and the middle class people and he is going to be blocking everything that is in favor of the por so in reality the republicans have the majority",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Total panic and desperation as Durham closes in on her and others \"trump-russia\" lie- who knows? Maybe \"madcow\" will lose her FCC license?",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Wow the real story is how a Gov't worker in America is not safe.  They are treated terribly for doing their jobs and are not paid very well for doing it.",
            "polarity": -0.15,
            "subjectivity": 0.6199999999999999
        },
        {
            "body": "Lock him up !!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Durham must be a dumb lawyer - isn't that the first rule of lawyering;  *\"Don't ask a question unless you know the answer\"* .\nLet's hope Durham keeps asking questions so we get to the bottom of this....not the way Trump may want, but.......at least scrape the bottom.",
            "polarity": -0.14166666666666666,
            "subjectivity": 0.41111111111111115
        },
        {
            "body": "They should ask Killary about servers, she can provide good advice on hiding data.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Trump is super bad and wish he get locked up.  Also How about Fauci, who was paid allot to help prevent a pandemic!  When is all the things he had done and not done, be revealed!",
            "polarity": -0.33333333333333337,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Rofl H. Biden is the one spending $25k on Russian ladies.",
            "polarity": 0.4,
            "subjectivity": 0.45
        },
        {
            "body": "Is it possible to change parties from Progressive and/or Democrat to Republican before the primary elections and then vote for literally ANYONE other than Trump as the canidate for the next presidential elections just to insure we stop that monster from doing our democracy any more damage? I'd be willing to change parties for that purpose alone if it is possible?",
            "polarity": 0.1464285714285714,
            "subjectivity": 0.5892857142857143
        }
    ]
}