{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-10-30 16:46:00",
    "ups": "1715",
    "downs": "78",
    "views": "48492",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "So in this convoluted charge by Durham is phoney and the Lawyer had the real stuff??",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Expell manchin n sinema",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Rachel, I love your reporting. What I want to know, what can you report on Trump that will sort him down and quiet him? So far, no news have reported that one thing that can send him to prison. Until that happens, I consider anything on Trump it's for entertainment purposes only. But I do enjoy your entertainment.😉",
            "polarity": 0.14074074074074075,
            "subjectivity": 0.6203703703703703
        },
        {
            "body": "Like we all didn't know that the pope didn't like Oompa Loompa Trump he knew right from jump just who he was the devil incarnated which is why he went and stand too close to him and spend as much time as he did with Biden that just made my day thank you😇😇😇😇😇😇💖💖💖🙏🙏🙏🙏😊😊😊😊",
            "polarity": 0.24285714285714285,
            "subjectivity": 0.3678571428571429
        },
        {
            "body": "All the crime trump barr durham got away with. Wow is this america!? They got away with crimes. Vote vote vote for democracy n justice",
            "polarity": 0.125,
            "subjectivity": 1.0
        },
        {
            "body": "So basically Trump was trying to overturn our democracy for... Russia Putin??!! So what we could become Russia and Russia could overthrow the United States that way she really makes you wonder",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Eamus Brandonus",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It will take another 10 years to find out all the crimes committed by Trump before and during his presidency. But Trump is unfazed by all of these. Just amazing!",
            "polarity": 0.7500000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "Durham is the bad actor trying to do a cover up for ex #45.",
            "polarity": -0.6999999999999998,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "FAKE NEWS PROPAGANDA.",
            "polarity": -0.3,
            "subjectivity": 0.55
        },
        {
            "body": "VOTE AGAINST ALL DEMOCRATS FOREVER.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "VOTE AGAINST ALL DEMOCRATS FOREVER.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "IN WAR, YOU DISRUPT THE SUPPLY LINES...DEMOCRATS ARE DOING THIS NOW, TO AMERICANS!!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "FAKE NEWS PROPAGANDA.",
            "polarity": -0.3,
            "subjectivity": 0.55
        },
        {
            "body": "My God you people start every news video with Donald Trump. Can someone answer why msnbc is so sickeningly OBSESSED with him ? I am so tired of hearing his name my godddddd",
            "polarity": -0.45,
            "subjectivity": 0.85
        },
        {
            "body": "msnbc is complicit in this madness. the biden dictatorship and the socialist democrats pulling his strings paying up to...450,000 American $$  per to illegals while MILLONS of Americans are suffering !?!? If you're an American caught in the msnbc propaganda bubble...PLEASE..WAKE UP!",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.03333333333333333
        },
        {
            "body": "Still on Russia? What about the reparations for illegals? Illegals.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We shouldn't get used to people getting threatened, it's terrorism.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Looks like DOJ needs to do some house cleaning. Hop to it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}