{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-11-02 18:52:25",
    "ups": "5840",
    "downs": "349",
    "views": "334233",
    "top_comments": [
        {
            "comment": "Again with Trump",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "How can everyone act like they don't realize the relationship between trump and Putin.  It was right in front of your faces folks. I am no scholar but even I can read between the lines on this one. Eric trump basically told us his family doesn't need financial backing from American banks because of the Russian Banks that his father uses. Deutsche bank? I had never heard of it before the trump family's involvement.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.07142857142857142,
            "subjectivity": 0.13392857142857142
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Biden's poll numbers are that high? ‘Life, liberty, and the pursuit of happiness.’\n Our nation was founded upon this set of inalienable rights that are provided to each of us, not by govt, but our divine Creator who made us all equal. From out of control inflation and rising prices, to the overreaching proposal that  allows the IRS to snoop into bank accounts, and SO MUCH MORE. Biden is nuts, the Dem's are socialist borderline Communist. Vote these barbarians out, every last one of them ASAP",
            "polarity": 0.27199999999999996,
            "subjectivity": 0.31133333333333335
        },
        {
            "body": "Yeah and Garland fell for Barrs B.S- HOOK LINE AND SINKER. THATS WHAT BARR WAS TALKING TO GARLAND ABOUT LAST YEAR...GARLAND NEEDS TO GO !!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Don’t  give up Rachel you’ll get Trump one of these days. Retirement is just a nice way to say “ I SURRENDER “",
            "polarity": 0.6,
            "subjectivity": 1.0
        }
    ]
}