{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-11-01 22:16:22",
    "ups": "5692",
    "downs": "327",
    "views": "317141",
    "top_comments": [
        {
            "comment": "I love the Streisand and boomerang effects thank you Rachel you tell them so well ✌💙from Montana",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "comment": "Biden was so charming with the pope. Nice to have a real statesman representing me.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.49999999999999994,
            "subjectivity": 0.7666666666666666
        },
        {
            "comment": "We see you",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "So what with all this proof.  Nothing is going to happen to them. These people get away with all their crimes.  Privilege.  Jan. 6 is a perfect example.  Criminal and mentally ill people run this sick country.",
            "polarity": -0.15357142857142858,
            "subjectivity": 0.8517857142857143
        },
        {
            "body": "Rachel, You are a scandal and a scandalous.  Folks We all know she's useless.",
            "polarity": -0.5,
            "subjectivity": 0.2
        },
        {
            "body": "LMFAO! I voted for Biden and this story is BS. 3:20 Michael Sussman was billing the HRC campaign for the meeting he had with the FBI. 3:20 \"Under 18 USC Section 1001, it is a felony to make a “false statement” to an agent or agency of the federal government in connection with a federal matter.\" ...Or whatever- Rachel Maddow",
            "polarity": -0.4000000000000001,
            "subjectivity": 0.6
        },
        {
            "body": "I LOVE ❤ how all the manipulated leftists come to fox News to comment about conservative parents at school board meetings but if you go to CNN or MSNBC and look for the comment section to say FACTS that the NSBA and AG Garland HAD ZERO COMPLAINTS OF ACTUAL THREATS OF VIOLENCE which the AG ADMITTED THERE WERE NONE ZERO NOT A SINGLE ONE the comment section dosent exist. Am I missing something or do they not want a comment section because they know their base is misinformed, manipulated or flat out pawns in their game?",
            "polarity": -0.12704081632653064,
            "subjectivity": 0.3556122448979592
        },
        {
            "body": "The problem with all of this negative noise is that the far right media doesn't ever share the truth.  The lies are told in public, and regardless of how and when they are disproven, the far right media has the video and audio clips to use to feed their flock.  The truth doesn't matter. You telling this story right now matters, but only if those who can see the truth will do something about it. They know they are lying - they are doing it because they get the lie recorded, just like all of 45's speeches and letters and press releases, etc - they get out there, like the WSJ 'opinion' that should never have gone to print - because now it is out there, and 45's followers will see that, and they aren't listening to anyone who will tell them the truth. The only way to stop the lies is to stop the liars.  Someone has to stop TC on Fox from doing what he's doing.",
            "polarity": 0.08412698412698412,
            "subjectivity": 0.6748677248677248
        },
        {
            "body": "I have often wondered what happened with this case, glad it back in the news",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Like I've said in previous posts, on previous videos, #45 was clearly working with Putin, and the fact that he went into a room with Putin without his transcriber speaks volumes. He's using the same tactics the Russians use. Disinformation, misdirection, lies, terrorism...",
            "polarity": -0.05833333333333332,
            "subjectivity": 0.21041666666666664
        },
        {
            "body": "Dump needs to be in prison soon.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}