{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-10-31 00:58:05",
    "ups": "3565",
    "downs": "170",
    "views": "160250",
    "top_comments": [
        {
            "comment": "Don’t forget the back channel Kushner was trying to set up with Putin.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "You are still  using Trump to cover Bidens fallacies? Get over trump and start covering more of Biden.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "When it comes to Russia, and the 2016 elections.  There is no solid proof other then hearsay.  Robert Muller ( a democrat ) investigated the Russia thing for months, and could not find a single thing other then Roger Stone making comments to a Russian ambassador that someone like Hillary Clinton also talked too.  I think this is just trying to cover up the 2020 election that was stolen from Trump.   Few Democratic counties that continued to count ballots past the election times.  Like Pennsylvania for example.  The 2020 election ended on that Tuesday, and one Democratic county in Pennsylvania continued to count ballots till Saturday.  That is 4 days past election day.",
            "polarity": -0.12767857142857142,
            "subjectivity": 0.2080357142857143
        },
        {
            "body": "MSNBC wants to constantly talk January  6 because Joe Biden is doing so bad and they want to keep the narrative on January 6. Hey MSNBC while you talk about Trump supporters Joe Biden is putting a real hurting on the people.Joe Biden has show how great a president Trump was to the American people.",
            "polarity": 0.08333333333333337,
            "subjectivity": 0.3583333333333334
        },
        {
            "body": "I know the translators are a pro forma fixture but English is such a widely spoken language that it seems ridiculous to me that the Pope wouldn't understand English.",
            "polarity": -0.08666666666666667,
            "subjectivity": 0.38
        },
        {
            "body": "It’s plain to see John Durham is a bad actor, he’s nothing but a Trump and William bar lackey",
            "polarity": -0.4571428571428571,
            "subjectivity": 0.5119047619047619
        },
        {
            "body": "Who made John Durham a legal Expert In Law ? The Same Club that Recommended Bill Barr to us 🇺🇸 \n(I also know what a Doctorate in Law Is) . So I am not intimidated .\n It is now Appearing Mr. DURHAM IS A RUSSIAN STOOGE !.... He is currently attempting to Impede Justice in this latest attempt to stop or Obstruct the Jan6th Subpenas !",
            "polarity": 0.16499999999999998,
            "subjectivity": 0.325
        },
        {
            "body": "Looks like the pope liked Biden.\nThe pope didn't seem to care for Trump at all.\nMy takeaway: The pope is a good judge of character.",
            "polarity": 0.6499999999999999,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Breaking News - Maddow shaves back hair live on air",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.25
        },
        {
            "body": "Rachel I have a question do you think that it’s right that Biden is giving 450000$ per each person for damages for them coming here in the United States and they can’t even give the American people seniors a monthly payment or for that matter any American person a helping hand for 6 months have nothing omg 😱 well tell us what you think of this ?😡thanks 💕",
            "polarity": 0.09523809523809523,
            "subjectivity": 0.17857142857142858
        },
        {
            "body": "Look, Madcow is wearing a black shirt with a black jacket for the 4673 time in a row.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "I love you Rachel Maddow!😊",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Biden has dementia",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Durham is attempting an even mopre half-arsed coverup than Barr's attempt with the Mueller report.  The stupid thing is that if all that has been found is pings it can be explained away as a mis-typed web address, by misrepresenting techniocal data he's just dug a hole which discovery for the case he's brought is going to sink him in.",
            "polarity": -0.7999999999999999,
            "subjectivity": 1.0
        },
        {
            "body": "LET'S GO, BRANDON FJB LETS GO BRANDON FJB 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hasn’t this all been looked at? I guess she can’t let Trump out of here head. How about the connection between Hillary and Russia. She was begging the fake Russia report. Rachel is so goofy! lol",
            "polarity": 0.30833333333333335,
            "subjectivity": 0.9
        },
        {
            "body": "**PRESIDENT **TRUMP *WILL **PREVAIL",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "PROGRESSIVES SHOULD VOTE NO. WE ARE TIRED OF CORPORATE DEMOCRATS AND CORPORATE REPUBLICANS. **CORRUPT POLITICIANS BELONG IN PRISON***SINEMA AND MANCHIN ARE CORRUPT AND BELONG IN PRISON**",
            "polarity": -0.27999999999999997,
            "subjectivity": 0.54
        },
        {
            "body": "Don’t forget the back channel Kushner was trying to set up with Putin.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The researchers should sue Durham for all he's worth.",
            "polarity": 0.3,
            "subjectivity": 0.1
        },
        {
            "body": "Durham is just leftover Trump filth.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}