{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-11-01 09:54:10",
    "ups": "5342",
    "downs": "332",
    "views": "292610",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Will Durham have to pay for his false claim? Did Barr have to pay for his false claim about the Mueller Report?\nWhy do those people get off scotch free?",
            "polarity": -0.1333333333333334,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "democracy is in danger because:\n1- in 2016 election some dems(including Hillary)  try to convince their voters that trump won because of Russia and spread. conspiracy theories.\n2-in 2020 election trump try to convince voters that the election is stolen and spread conspiracy theories and lies about election with help of some Republicans.\n\nso what we get is less people believe in our election system so shame on all people who try to undermine our democracy.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Duuuuh! Trump the commie!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is so great Trumps karma is coming to get him !!! Go good guys stand tall and proud we the people back you up!!! Patriots for a better America 🇺🇸",
            "polarity": 0.6,
            "subjectivity": 0.5700000000000001
        },
        {
            "body": "Great joke at the end! Love the honest humor of Biden",
            "polarity": 0.7000000000000001,
            "subjectivity": 0.75
        },
        {
            "body": "Karma comes around and rich pedophiles are above it!!! Patriots for a better America 🇺🇸",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.45
        },
        {
            "body": "It Is elder abuse to have this man be President of the United States at this point.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Today was a good day!! I just leftist Portland zoo. Awesome zoo if you haven’t been there fact-check it out.. It’s pretty crazy that they would have a orangutan named boomerang 🪃 that lives there. It’s worth a visit for sure..",
            "polarity": 0.3428571428571429,
            "subjectivity": 0.726984126984127
        },
        {
            "body": "Okay it’s been a crazy night Rach.. I woke up to a storm of thunder and lightning and Russian boomerangs 🪃 🪃🪃🪃please tell me that this is all a leftist lie..",
            "polarity": -0.03749999999999999,
            "subjectivity": 0.5
        },
        {
            "body": "Everything went crazy when the devil became President years ago, but his ending is near says the LORD GOD ALMIGHTY BECAUSE JESUS IS THE WAY TO\nSalvation, all of these RACIST AND EVIL DEMONS   ON BOTH PARTIES NEEDS TO REPENT AND ASK FOR FORGIVENESS ASAP! There is still Time!\nFALL ON YOUR KNEES AND PRAY LIKE YOU HAVE NEVER EVER PRAYED BEFORE!",
            "polarity": -0.5,
            "subjectivity": 0.7666666666666666
        },
        {
            "body": "What's sad is the Russel Brands and Dan Bonginos already ran with that 27 page doc to scream \"ah HA -- sEe PrOoF!!1!\" Even though all that doc did was blame the source and not say a thing about the actual facts.\n\nGuess what the GQP folks actually believe?",
            "polarity": -0.20833333333333334,
            "subjectivity": 0.4000000000000001
        },
        {
            "body": "Is that \"thing'' a man or a woman or is ''it'' not sure.",
            "polarity": -0.25,
            "subjectivity": 0.8888888888888888
        }
    ]
}