{
    "time_posted": "2021-10-30 12:00:23",
    "url": "https://www.youtube.com/watch?v=mwnMJkIfEQ4",
    "time_now": "2021-10-31 13:18:28",
    "ups": "4536",
    "downs": "262",
    "views": "234791",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Maddow is such a joke.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Would watch your show but every day your leading story is Trump I am done",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wow, that was a tough watch.  The TDS at MSNBC is running rampant.  If we want to get into Trump's business, maybe we should also get into Biden's.  The 'boomerang' is coming for the conspiracy democrats.  It will be fun next year when the adults regain control of the government.  Maybe a couple of impeachments would be on the docket?",
            "polarity": 0.002777777777777782,
            "subjectivity": 0.5083333333333334
        },
        {
            "body": "Julius Jones murdered Paul Howell in front of his children.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "She is part of the problem,she is a fountain of misinfomation.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Increased individual empowerment through technology has resulted in some individuals expressing themselves with malicious intent.  Through technology, a faction has succeeded to increase their wealth and influence on the earth beyond what was ever humanly possible in the past.  As their have been no benign, individual autonomy preserving, constructive interventions towards curtailing this, the reaction will be an increasingly dissident, wealth-excluded mob and then militarization with imposed control. Certain privileged and entitled wealthy individuals have little incentive towards preserving democracy despite the fact that they benefited from the freedom and opportunity it provided.  Our peaceful democratic collaboration requires that the participating individuals share in a sufficient trust and confidence in the system's general beneficence. These wealthy individuals wish to maintain their exclusive access to wealth and influence and are using the media to undermine the trust and arouse the masses into acting increasingly disruptively which in turn will trigger interventions to impose a top-down control.  Crime, political discord, and cries to increase centralized control are already escalating in many areas of the world while the government of the US appears in a state of paralysis to make the changes necessary to stave off the oncoming collision.",
            "polarity": 0.11262755102040815,
            "subjectivity": 0.5515306122448979
        },
        {
            "body": "Sounds like someone is scared of Durham... yeah lets see what happens... Im willing to Bet there will be Big Booms .. and the Boomerang  will be on the ones that created the Russia BS hoax.  I read  documents..",
            "polarity": 0.125,
            "subjectivity": 0.425
        },
        {
            "body": "Who watches this garbage",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "read the Documents then you know whats coming..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Find,em ,  File'em, F**k'em  !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It’s good enough until we can get more minorities an African-Americans in the senate. Minorities and African-Americans only no more Joe Manchin  and the other one. We have to break the white dominance in our government",
            "polarity": 0.11785714285714285,
            "subjectivity": 0.49642857142857144
        },
        {
            "body": "FAUCI FLU (THE CHINA VIRUS) WAS MAN MADE & PLANNED & MADE IN CHINA!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "President Obama's 3rd term. President Biden is just the empty vessel. \nUnfortunately for our Beloved Republic.\nThe United States Of America should be front and center.\n Despite the rhetoric spouted by our apologetic left wing,   \nWe are a special place.\nModerates and independents don't fall for this agenda.\nJust open your eyes.\nSince January 20th 2021,\nPoint to anything that is better than just one year before?",
            "polarity": 0.08571428571428572,
            "subjectivity": 0.41714285714285715
        },
        {
            "body": "Look at that adams apple",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hurry someone please help us it’s Russian boomerangs again 🪃🪃🪃🪃",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Everthing Trump and Barr did should be nullified since they never actually did anything for the benefit of this country. Leftover trash like Durham and Dejoy need to be disposed of immediately.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Joe is a Russian boomerang 🪃 🪃🪃🪃",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Boomerang 🪃 🪃🪃🪃🪃🪃🪃🪃🪃",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "One more Boomerang 🪃 🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃🪃",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}