{
    "time_posted": "2021-10-30 16:00:09",
    "url": "https://www.youtube.com/watch?v=Noh8dd2i32c",
    "time_now": "2021-10-31 17:25:35",
    "ups": "2205",
    "downs": "16",
    "views": "33956",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Excellent video",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I am a sheet hoarder\nThe 300tc type. \nSo i swap them every single week and having fun with different combos 😝",
            "polarity": 0.07619047619047618,
            "subjectivity": 0.33809523809523806
        },
        {
            "body": "The trouble I have with this video is the bedrooms you suggest are twice the size at least of my bedroom, which is 8x10 and no closet as it’s Britain so a wardrobe needs space..so, could you do similar for SMALL bedrooms on poverty level budget could just walk into their bedroom and feel like it has a wow factor? Please?",
            "polarity": -0.13,
            "subjectivity": 0.48
        },
        {
            "body": "Here’s a bedroom “storage hack” that works for me so I thought I’d share: you know the hall trees that usually go in a mud room or entryway? They usually have a little bench, some shelves, hooks for coats, scarves, maybe a bar to put hangers on. Get one for the bedroom. \n\nIt may seem unorthodox, but I find it super practical. While Nick is absolutely right to point out under-the-bed storage, that works really well for seasonal stuff, like he said, but there’s every-day storage that can make a room messy: I need a place to put a couple decorative pillows I don’t use for sleeping (I don’t just want to throw them on the floor), or what about clothing items you pull out of the closet and wear them for a bit; they are not ready to go into the laundry bin just yet, but you don’t want to put them back in the closet with the fresh cloths. What about your nightwear or loungewear? Where does that stuff go during the day? For me, a hall tree is a great solution to keep all these things organized in one place and prevent my bedroom AND closet from becoming a mess. It even goes well in your bathroom if you have an on-suite. The hall tree is a great transitional space for keeping your transitional items (items not quite in need of storage but not in immediate use) organized and neat. And they come in such varieties of design styles that you can probably find one that looks like “it belongs” in your bedroom/on-suite. I highly recommend it.",
            "polarity": 0.13540922619047618,
            "subjectivity": 0.4604613095238095
        },
        {
            "body": "The best decision I've made regarding my bedroom is a wooden bed, not a boxpring. It adds so much more character",
            "polarity": 0.5,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "I love, love, love your videos Nick!  I just bought a new home and as I’m trying to design it I keep thinking  “what would Nick do?!”",
            "polarity": 0.44886363636363635,
            "subjectivity": 0.5636363636363636
        },
        {
            "body": "I regret not have wall sconce or pendants placed in our new build!!",
            "polarity": 0.2130681818181818,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "I was honestly getting kind of annoyed that the bedroom is the only place in my apartment with warm light because it was making my color scheme difficult to pick, but I'm glad it actually has a purpose lol",
            "polarity": 0.25999999999999995,
            "subjectivity": 0.77
        },
        {
            "body": "This one is SOOOOO GOOOOD thank you!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So the dog is in the bed and that's all I needed to know. Any man that cuddles w his dog is alright with me. No wonder I subscribed to your channel longtime 🤣😭 sincerely, a dog owner who cuddles w their dogs 🙏✨",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}