{
    "time_posted": "2021-10-30 16:00:09",
    "url": "https://www.youtube.com/watch?v=Noh8dd2i32c",
    "time_now": "2021-11-01 01:40:17",
    "ups": "2468",
    "downs": "18",
    "views": "40005",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Speaking of sheets, I hate that sheets are too short to tuck deeply under the mattress. When I buy new sheets, I take 18\" of the old top sheet to sew across the bottom of the new sheet with french seams. That whole piece tucks firmly under the mattress. No short sheeting.",
            "polarity": 0.006611570247933876,
            "subjectivity": 0.3917355371900827
        },
        {
            "body": "Video suggestion: we send in our interior design questions and you give us advice",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You do a FABULOUS job of explaining what you are describing AND giving visual examples. 🙏  watch ALL you content ❤️",
            "polarity": 0.2,
            "subjectivity": 0.5
        },
        {
            "body": "Ha ha, I just changed the sheets on my bed and said I am throwing these sheets out after this go round.  They look terrible and don’t feel good on my skin.  I think I bought them in 2006😁",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "To me, slight asymmetry in shared bedrooms reflects not only interest but that the space is shared by 2 equally strong individuals: they obviously have a lot in common but ultimately do things slightly differently, no? \nThanks for what you do Nick, not only your ideas but also the background work you put into this, the timeline, the detail of items... while still keeping your wit and unique throw away lines that always make me smile. ♥",
            "polarity": 0.14015151515151514,
            "subjectivity": 0.6545454545454544
        },
        {
            "body": "I like the idea of different bedside tables to add interest and pizazz ⚡️",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "Question for you Nick. The bedside tables I covet are not as high as my mattress - is that a huge no, no? My current ones are fine, but not fabulous. The only reason I’m  keeping them at this stage is because of the height match.",
            "polarity": 0.12944444444444447,
            "subjectivity": 0.7233333333333333
        },
        {
            "body": "Bed perfection for me: Queen size bed, cotton sheets, silk pillowcases on the two soft pillows and linen or cotton on the two firmer pillows, linen doona cover, cashmere throw, spare velvet reading cushion.",
            "polarity": 0.1,
            "subjectivity": 0.35
        }
    ]
}