{
    "time_posted": "2021-10-30 16:00:09",
    "url": "https://www.youtube.com/watch?v=Noh8dd2i32c",
    "time_now": "2021-10-31 09:11:47",
    "ups": "1800",
    "downs": "13",
    "views": "26001",
    "top_comments": [
        {
            "comment": "So I know rugs on carpet is a faux pas, but how do you feel about a rug on carpet in a bedroom?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Loved the sheet set till I got to the pillows and only option was DOWN. 😩 you don’t have to be vegan to know you don’t want to sleep on feathers ripped out of geese",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.18148148148148147,
            "subjectivity": 0.6962962962962963
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Can you put a rug in your bedroom if you have carpet?  We have hardwood in the rest of the house.  But it’s a higher pile (if that’s the way to explain it) carpet. But really light. Or would it be strange to maybe have a rug that is at the foot of the bed but under the legs of a chest that’s there?  We have two black labs and when they aren’t sleeping in the bed they are somewhere near it. Just trying to keep the light colored carpet light, too.   Damn dogs. (I couldn’t live without them ❤️). Thanks for your videos!  Glad I found you! :-)",
            "polarity": 0.25860881542699726,
            "subjectivity": 0.5712121212121212
        },
        {
            "body": "With our tiny bedroom we cannot add anything but we did invest in great sheets/duvet cover sets that match the chocolate brown wall I painted. I was really hoping you'd mention the position of the bed. We stayed with several family members in America this Summer and every single guest room had the bed directly under the window. So every morning we lay there staring at the ceiling or a blank wall or a single painting. I never realized how unpleasant that was but when we got home it was almost euphoric to lie in bed looking our our big windows at 3 trees of different colors with birds in them.",
            "polarity": 0.027922077922077945,
            "subjectivity": 0.35714285714285715
        },
        {
            "body": "Here in rural France we get beautiful mid C20 linen sheets for a dollar or two in charity shops. Often you can find unused wedding sets kept for best and still in their packaging.   Warm or cold outside, there's nothing like sleeping in linen.  Sometimes old sheets are the best!",
            "polarity": 0.3277777777777778,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "I love how you focus on function, not just looks",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Before buying sheets, look into high quality cotton sheets that have a high thread count. Ive been using thread counts more than 500 and wow, the quality of feel is amazing. You wont go back to the cheap sheeta",
            "polarity": 0.2742857142857143,
            "subjectivity": 0.5971428571428571
        },
        {
            "body": "Such great ideas!",
            "polarity": 0.5,
            "subjectivity": 0.625
        },
        {
            "body": "After attic renovation, we ended up with a very large, high ceilings bedroom, so we even had a space for reading corner with coffee table. That was before Corona. Now our bedroom has three office desks 😭😭😭 (each for partner and I, and one for my kid's school (so we keep an eye she doesn't play games during lessons). I can't wait to get back to normal and to have my reading nook in our bedroom again. 🙄",
            "polarity": 0.14714285714285716,
            "subjectivity": 0.4367857142857142
        }
    ]
}