{
    "time_posted": "2021-10-30 16:00:09",
    "url": "https://www.youtube.com/watch?v=Noh8dd2i32c",
    "time_now": "2021-10-30 20:51:46",
    "ups": "859",
    "downs": "2",
    "views": "8961",
    "top_comments": [
        {
            "comment": "My whole place is drab and completely empty atm... I had to declutter for major renovations. After i got rid of everything that was ugly, useless or broken, there's nothing left and i love it. Now however, it's as stressful to find all the pieces of missing furnitures. It will be time consuming and costly because i only want beautiful and useful things.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0010416666666666675,
            "subjectivity": 0.4708333333333334
        },
        {
            "comment": "This is perfect timing! I am remodeling my bedroom and I was so lost. Thank you so much! I like how you show a number of different styles to exemplify. Classic, minimalist, industrial, which is really useful to be able to imagine an interesting space that is also coherent with the rest of the house.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.40208333333333335,
            "subjectivity": 0.47395833333333337
        },
        {
            "comment": "You explain things so well. I recently put a wool blanket across my bed to add color and texture. It made a HUGE difference. Thank you!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25000000000000006,
            "subjectivity": 0.575
        },
        {
            "comment": "Your Adorable.💗",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Brooklinen does not carry queen-size pillowcases, only standard and king-size. So I would either get pillowcases that are too large or too small. So I will buy from a company that actually caters to the luxury market.",
            "polarity": -0.007142857142857145,
            "subjectivity": 0.3857142857142858
        },
        {
            "body": "Would you still do a rug if the room is carpet?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "One of your best videos Nick. I did all sorts of rearranging during this video and my spaces look better!!!",
            "polarity": 0.98828125,
            "subjectivity": 0.4
        },
        {
            "body": "I love how you just get straight into your video content! Love your stuff!",
            "polarity": 0.4583333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "I love my storage ottoman where my purses are stored.  And my full length wall mirror definitely makes the room look bigger.",
            "polarity": 0.2125,
            "subjectivity": 0.5375
        },
        {
            "body": "A bench at the foot of my platform bed would look odd, but I do like that look for other bed types.",
            "polarity": -0.14583333333333331,
            "subjectivity": 0.3125
        },
        {
            "body": "Question ... What about a small rectangular rug beside the bed instead of a big one to encompass the whole bed, wasting the underneath?",
            "polarity": -0.016666666666666663,
            "subjectivity": 0.3
        },
        {
            "body": "For my reading chair task lighting, I just go with the overhead light, because I found that a floor lamp next to it (the only viable option) broke up the space too much and stopped the eye, making the room feel crowded.",
            "polarity": 0.15000000000000002,
            "subjectivity": 0.475
        },
        {
            "body": "I use my phone as my alarm clock so yeah, it's beside my bed. I also really like that black bedroom!",
            "polarity": -0.004166666666666652,
            "subjectivity": 0.31666666666666665
        },
        {
            "body": "As much as adding a rug on top of carpeting is a home decor faux paus (Did I even spell that right?), doing so was a huge improvement over the carpeting, which I promise myself to replace with the flooring that matches what's in the rest of the house.",
            "polarity": 0.3464285714285714,
            "subjectivity": 0.5339285714285714
        },
        {
            "body": "My bedroom is so narrow that with my queen size platform bed, the only way to have a night stand of sorts (for now) was to add a floating shelf slightly above the headboard and put two matching lamps on it.  The design on the dark grey accent wall behind the headboard that the lamp lights throw on the wall above the bed is magnificent, and goes amazingly with my subdued checked design scheme for the room.  A surprise treat!  The shelf doesn't provide the best functionality, but with remote outlets for the lamps, at least the lighting element is a convenience, and provides a layering of lighting options along with the dimmable overhead light for the room.  The final piece of the puzzle will be having 4\" wide × 3 ft long custom night stands built in on both sides of the bed for stowing cell phones, cups of water and/or reading glasses. (Yes, unfortunately, 4\" is not a typo!)  I just have to find the right contractor.",
            "polarity": 0.13323412698412695,
            "subjectivity": 0.5353174603174604
        },
        {
            "body": "You explain things so well. I recently put a wool blanket across my bed to add color and texture. It made a HUGE difference. Thank you!",
            "polarity": 0.25000000000000006,
            "subjectivity": 0.575
        },
        {
            "body": "No mirrors in the bedroom, especially not facing the bed",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "My whole place is drab and completely empty atm... I had to declutter for major renovations. After i got rid of everything that was ugly, useless or broken, there's nothing left and i love it. Now however, it's as stressful to find all the pieces of missing furnitures. It will be time consuming and costly because i only want beautiful and useful things.",
            "polarity": 0.0010416666666666675,
            "subjectivity": 0.4708333333333334
        },
        {
            "body": "I add texture by not making the bed. Visual impact! Today's sponsor: Brook-no-side-eyes.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is perfect timing! I am remodeling my bedroom and I was so lost. Thank you so much! I like how you show a number of different styles to exemplify. Classic, minimalist, industrial, which is really useful to be able to imagine an interesting space that is also coherent with the rest of the house.",
            "polarity": 0.40208333333333335,
            "subjectivity": 0.47395833333333337
        },
        {
            "body": "Wonderful video, overviewed every element.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Fur, really ?",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Your Adorable.💗",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I’m not loving all the space our king takes up in the bedroom. Plus there is a hump in the middle. OMG we have turned into our parents, lol. Desperately need a new mattress, have you touched on this topic before? I’ve been subbed since you had a few thousand subscribers. Congrats on over 250k ✌️",
            "polarity": -0.02727272727272727,
            "subjectivity": 0.5340909090909091
        }
    ]
}