{
    "time_posted": "2021-10-30 16:00:09",
    "url": "https://www.youtube.com/watch?v=Noh8dd2i32c",
    "time_now": "2021-10-31 00:58:18",
    "ups": "1296",
    "downs": "5",
    "views": "16811",
    "top_comments": [
        {
            "comment": "I found a 60's table lamp at a thrift store & put it on my nightstand months ago. I love it so much it makes me happy every time I look at it. It's just gorgeous. But it's apparently one-of-a-kind. \nI'm looking for another lamp for my husband's nightstand to replace his old boring one.\nI'm hoping nightstand lamps that don't match will look ok.",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.23125,
            "subjectivity": 0.59375
        },
        {
            "comment": "I wish I was rich enough to have a bed that looked like any of these pictures and the time to rearrange pillows but I'm a shift working medical professional so I'll just have to hope I don't die before I retire and achieve this level of 'bed goals' one day 🙃👍🏻",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.11875,
            "subjectivity": 0.3375
        },
        {
            "comment": "Why does no one ever mention how tall your night stand should be? Beds and night stands come in all different heights. What's the ideal height pairing?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.45,
            "subjectivity": 0.8
        },
        {
            "comment": "Hey Nick, during your asymmetry bit, I was hoping to see an asymmetrical bedroom. But I saw symmetrical bedrooms with touches of asymmetry. I’d love for you to do some truly asymmetrical bedrooms, as I have one by room size necessity, and am curious how my design fares with the experts.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2,
            "subjectivity": 0.8
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Any tips for dressers? Probably the other most common piece of furniture in the bedroom.",
            "polarity": 0.025000000000000005,
            "subjectivity": 0.4583333333333333
        },
        {
            "body": "Loved the sheet set till I got to the pillows and only option was DOWN. 😩 you don’t have to be vegan to know you don’t want to sleep on feathers ripped out of geese",
            "polarity": 0.18148148148148147,
            "subjectivity": 0.6962962962962963
        },
        {
            "body": "Great video Nick! Would love to hear you about all things dining room!",
            "polarity": 0.8125,
            "subjectivity": 0.675
        },
        {
            "body": "Why does no one ever mention how tall your night stand should be? Beds and night stands come in all different heights. What's the ideal height pairing?",
            "polarity": 0.45,
            "subjectivity": 0.8
        },
        {
            "body": "I was feeling self conscious for using a pendant light over the nightstand in my guest room, but I’m feeling a lot better about it now! I always love designer validation. Lol",
            "polarity": 0.485,
            "subjectivity": 0.6
        },
        {
            "body": "The main rooms in my 1900 flat are large, but the 2 bedrooms are tiny. The one I sleep in is barely big enough for my queen bed, two tiny nightstands, and my dresser drawers can just open. This is the bigger bedroom :-) Then add a long closet with bifold doors, and a lovely old cast iron radiator, and a large low window, and I have almost no space to work with. And did I mention there are only two electrical outlets?\n\nSeating? Hah! A rug? Double hah!\n\nDespite all that, there were some great tips I can use. Wall sconces, so I can free up space on my tiny nightstands. Lots of textures on the bed — if the bed is the whole room, it should be the most interesting thing! Smart lighting to mimic a sunset. Asymmetry. All good ideas, no matter how tiny the room.",
            "polarity": 0.19459706959706963,
            "subjectivity": 0.49070512820512824
        },
        {
            "body": "Next video should be bedroom design mistakes. You always have great tips.",
            "polarity": 0.4,
            "subjectivity": 0.375
        },
        {
            "body": "Hey Nick, during your asymmetry bit, I was hoping to see an asymmetrical bedroom. But I saw symmetrical bedrooms with touches of asymmetry. I’d love for you to do some truly asymmetrical bedrooms, as I have one by room size necessity, and am curious how my design fares with the experts.",
            "polarity": 0.2,
            "subjectivity": 0.8
        },
        {
            "body": "Thank you, Nick.My bedroom is tired and needs updating. I appreciate the tips!",
            "polarity": -0.5,
            "subjectivity": 0.7
        },
        {
            "body": "I wish I was rich enough to have a bed that looked like any of these pictures and the time to rearrange pillows but I'm a shift working medical professional so I'll just have to hope I don't die before I retire and achieve this level of 'bed goals' one day 🙃👍🏻",
            "polarity": 0.11875,
            "subjectivity": 0.3375
        },
        {
            "body": "If you do a follow up to this, it would be great to get some ideas for how (if possible, haha!) to style a bedroom with only one nightstand. For one, I'm single and always sleep on the same side of the bed, and for another, the nightstand I've got my heart set on is from a vintage set that I'll be lucky to be able to justify spending the money on ONE of someday, let alone two (the best price I can find anywhere is $1100!).",
            "polarity": 0.3124338624338624,
            "subjectivity": 0.5719576719576719
        },
        {
            "body": "On that note. Me and my wife thinks a bedroom is a huge waste of space, literally. I mean, having a whole room for being unconsious most of the time (apart from some fun activities, sure). Kinda stupid.\nSo we built a tiny room, the size of a double bed (hight about a meter), into the wall, into the next room (a storage room). It's elevated under the cealing, so there's some space for storage undernieth. Entrance from the first room,  with four steps tight to the wall leading up to a hole in the wall.\n\nThis sulotion is our best ever. We've kept all our rooms, and can make far better use of them. And our sleeping space is cozy as hell! 😀",
            "polarity": 0.11817226890756304,
            "subjectivity": 0.4850256769374416
        },
        {
            "body": "I found a 60's table lamp at a thrift store & put it on my nightstand months ago. I love it so much it makes me happy every time I look at it. It's just gorgeous. But it's apparently one-of-a-kind. \nI'm looking for another lamp for my husband's nightstand to replace his old boring one.\nI'm hoping nightstand lamps that don't match will look ok.",
            "polarity": 0.23125,
            "subjectivity": 0.59375
        },
        {
            "body": "Hey nick what is the color of your accent wall is it Tri corn black? what sheen?",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "I´m obsessed with linen sheets. They´re expensive, so I´ve bought a set, like once a year. I have 3 sets and a mixed linen cotton one. They´re so beautiful that I rarely use a bedcover on top. Plus they get softer and lovelier with every wash/dry cycle. I mix them up with quality cotton fitted sheets and pillows and I love it. But I have a cupboard stuffed full of other sheets that are just sitting there, I need to do something about that...",
            "polarity": 0.1527777777777778,
            "subjectivity": 0.6527777777777777
        },
        {
            "body": "Jesus is your way to heaven Believe in him and you will have life after death. He shed his blood for your sins to be forgiven.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jesus is your way to heaven Believe in him and you will have life after death. He shed his blood for your sins to be forgiven.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"play with asymmetry a little bit in the bedroom\" would be so hilarious out of context 🤣",
            "polarity": 0.15625,
            "subjectivity": 0.75
        }
    ]
}