{
    "time_posted": "2021-10-30 15:00:58",
    "url": "https://www.youtube.com/watch?v=npp_zOrau0w",
    "time_now": "2021-11-01 05:46:42",
    "ups": "11553",
    "downs": "238",
    "views": "115837",
    "top_comments": [
        {
            "comment": "Well, we have to admit that Chucky is way sexier than Dave",
            "likes": 628,
            "number_of_replies": 11,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Amazing cover, but.... guys... you totally blue-ballsed me on the drum fill.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30000000000000004,
            "subjectivity": 0.825
        },
        {
            "comment": "Sh!t, I’m not a psychopath doll 😔",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "That's one of the creepier things I've ever watched. The implied imagery of suicide gets a trigger warning, but the blatant satanic imagery and psychologically torturing a guy for revenge is totally cool? Look, I think trigger warnings are generally stupid things, but this is very adult content, even for Halloween. If you're going to put it on there, at least be consistent. The original song's pretty dark. It's basically about wanting revenge for kids who stood by and let someone die instead of try to help. This one takes it up a notch though, doesn't it? It's one thing to wish death on someone as a sort of karmic justice. It's another thing to torture a guy until he ends his own life. Complicated emotions that I'm sure many of us have had with someone we've loved but felt betrayed by - definitely adult content.\n\nOn second listen with no visuals, your vocals are, as usual, powerful and emotional. The collab is excellent. Melodicka Bros does an impressive job with the remix and some mood added to the original. Talented artists for sure and you worked well together. Others have commented on leaving out the drum fill. I think it works to keep the song more harmonious and keeps the mood more consistent. And by the time you're hitting the crescendo in the original, the power part of the power ballad, you're already starting the fade, which sort of makes me feel cheated at the end, like I'm missing the exclamation point on the end of the story - though, I suspect given the visuals, that's intended. The catharsis, the \"victory\" isn't satisfying. It's hollow and empty.\n\nIt's dark. It's good art. I'm not sure if I \"like\" it yet - but that may be the point. Maybe I'm not intended to \"like\" it, just to understand it?",
            "polarity": 0.19337837837837837,
            "subjectivity": 0.5934234234234236
        },
        {
            "body": "You fucking killed this Violet! I would pay to see this live",
            "polarity": -0.05681818181818182,
            "subjectivity": 0.25
        },
        {
            "body": "Oh wow!! Violet, this is your best video yet! I am simply stunned! Thank you for sharing your immense talent with us!",
            "polarity": 0.2890625,
            "subjectivity": 0.6642857142857144
        },
        {
            "body": "❤️‍🔥",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "this sounded amazing, but how they going to do a cover of this song and not put the dum dum... dum dum.. dum dum.. da da ..dum dum dum dum in there? 10 inches",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "Sh!t, I’m not a psychopath doll 😔",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Phil's original version is perfection. And this is straight up dark perfection. Bravo!",
            "polarity": 0.12916666666666665,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "Did I miss the drum part?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Really love this version..In This Moment has a version and as much as I love Maria Brink Violent really killed it..",
            "polarity": -1.3877787807814457e-17,
            "subjectivity": 0.55
        },
        {
            "body": "This insipiration by film chuky WHYy",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i wish i was that chuky",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Read a story a while back that this song was something to do with impending divorce.  But this darker take works as well.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "He must have 10 inches . . . . lmao",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Had I known about the wedding, I would've sent a gift.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "OMG Andy and karen would Not approve that you take such good care of him. 🤘",
            "polarity": 0.35,
            "subjectivity": 0.55
        }
    ]
}