{
    "time_posted": "2021-10-30 15:00:58",
    "url": "https://www.youtube.com/watch?v=npp_zOrau0w",
    "time_now": "2021-11-03 11:20:39",
    "ups": "14391",
    "downs": "305",
    "views": "167498",
    "top_comments": [
        {
            "comment": "Well, we have to admit that Chucky is way sexier than Dave",
            "likes": 784,
            "number_of_replies": 14,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "You should do a cover of Repay, by The Plot in You.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Holy mother of god violet your voice has become legend",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Prawda to ty, a co za tym idzie wiarygodność utworu jego możliwości to, co potrafi zrobić z człowiekiem wpłynąć też na niego zmienić, dając mu wiele doznań, które zostaną na zawsze zapamiętane? Najczęściej zapamiętane utwory to prawda o życiu wszystkim sobie też? Najlepsze są własne z własnego jestestwa osobowości doznań wiedzy? Takie sobie dzielenie z ludźmi, przekazując swoje wartości siebie to, czego się doświadczyło, nauczyło przez lata swojego życia doznań? Odtwarzając, kopiując kogoś też trzeba nią mieć? Jest to bardzo ważne, jak się wpływa na innych, będąc publiczną osobą? Odpowiedzialność to ty, i to, co z niej będziesz miał? Każda zmiana, którą człowiek poczyni też wpływa i staje się częścią jego życia? Brak prawdy to pustka, więc jaki jest utwór z pustki? Życzę tych najlepszych zapamiętanych swoich, bo stać cię na cholernie więcej jesteś bardzo dobra, w tym, co robisz, lecz? Życzę ci miłego dnia zawsze i wszędzie jesteś super osobą bądź wielką sobą.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "best cover of this song",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Wait-wait-wait ... dude killed himself AFTER Chucky was animated, soooo ... whose soul was in the Good Guy doll in the first place?",
            "polarity": 0.25,
            "subjectivity": 0.3111111111111111
        }
    ]
}