{
    "time_posted": "2021-10-30 15:00:58",
    "url": "https://www.youtube.com/watch?v=npp_zOrau0w",
    "time_now": "2021-10-31 17:24:54",
    "ups": "10294",
    "downs": "206",
    "views": "95570",
    "top_comments": [
        {
            "comment": "Well, we have to admit that Chucky is way sexier than Dave",
            "likes": 564,
            "number_of_replies": 10,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I tend to always feel something in the air almost every other night. Though especially on mischief night and Halloween!! I get really high naturally from the energies going on around right now. Wonderful and at times horrible to feel with no boundaries between humans, animals, nature, environments, and even time. Just know your not alone devine children, and you don't even need a phone to be connected. Even being alone, I'm very much so connected. On a different level than the internet. It's much more far out and interesting too!. Much love, the cover is very enjoyable for the timing  right now!",
            "polarity": 0.22752380952380952,
            "subjectivity": 0.6417619047619048
        },
        {
            "body": "Why the Trigger Warning - the urban myth about this song (denied by Phil Collins) is that it's about someone who was witnessed at a party not helping another party guest who was drowning in a swimming pool.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wow",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Can you make a cover of my mother told me, it’s that one Viking song",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is a beautiful. Это по настоящему прекрасно, спасибо за вам за такое прекрасное исполнение",
            "polarity": 0.85,
            "subjectivity": 1.0
        },
        {
            "body": "nice violet good cover",
            "polarity": 0.6499999999999999,
            "subjectivity": 0.8
        },
        {
            "body": "Dig it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Whoever they're just ruined a classic by my favorite singer so sad",
            "polarity": 0.055555555555555546,
            "subjectivity": 0.7222222222222223
        },
        {
            "body": "Honestly I was half watching for a while and thought she had a Whiteclaw in her hand during the ritual, not a candle. Didn't really think anything of it either 😂",
            "polarity": 0.2111111111111111,
            "subjectivity": 0.4222222222222222
        },
        {
            "body": "I felt this rendition of the song in a way that the original never moved me. So much better than the original.",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "That's... Weird. Good, but weird",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.8666666666666667
        },
        {
            "body": "Scariest part is no drop.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Phenomenal!",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "Evil Phil Collins be like:\n\nNo drum break.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "The cover was amazing, but I have to admit, the video is a bit much for me. Needs some warnings. Demonic ritual to animate a doll and suicide... leaves me terribly uncomfortable. The editing was great though, and really enjoyed the collab. You guys are out of this world talented.",
            "polarity": 0.3833333333333333,
            "subjectivity": 0.7416666666666667
        },
        {
            "body": "Love this!!",
            "polarity": 0.78125,
            "subjectivity": 0.6
        },
        {
            "body": "Suitably gothic and deliciously dark af.",
            "polarity": 0.2,
            "subjectivity": 0.575
        },
        {
            "body": "fine I'm in love)",
            "polarity": 0.45833333333333337,
            "subjectivity": 0.55
        },
        {
            "body": "While I wondered how you would handle the famous drum part--which you did admirably and that move focused all my attention on the song as a whole--what really impressed me is how well you nailed the fade-out energy escalation. That showed, to me, an understanding of the song on par with the way Disturbed understood \"The Sound of Silence.\"\n\nHappy Halloween!",
            "polarity": 0.725,
            "subjectivity": 0.85
        }
    ]
}