{
    "time_posted": "2021-10-30 14:00:01",
    "url": "https://www.youtube.com/watch?v=Oa9q8UU5NpU",
    "time_now": "2021-10-31 00:57:49",
    "ups": "1372",
    "downs": "25",
    "views": "18328",
    "top_comments": [
        {
            "comment": "I appreciate how Kraid flips the bird as part of his death animation. That is to say, 'if' he did have a thumb; that last digit he was hanging on with would be the middle one.",
            "likes": 7,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.03333333333333333
        },
        {
            "comment": "Dread is such an instant classic! that's an incredible secret in it",
            "likes": 6,
            "number_of_replies": 0,
            "polarity": 0.14166666666666666,
            "subjectivity": 0.5866666666666667
        },
        {
            "comment": "So, I didn't completely softlock myself before battling Kraid afterall?  Oh well. X3",
            "likes": 4,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "comment": "What's the intro muisc james",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Being 40 years old, I take full credit for finding the SMW2 easter egg first. /s",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.2333333333333333,
            "subjectivity": 0.3611111111111111
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "0:00: What game is this from again?\n\n\nDepends on who you're asking. Some people hate The Shining for being overrated and not worth their hype, others hate it for not being book faithful, and a select number hate it for the mind screws there...\n\n\nGood old Scrat. Can't blame people for watching the movies only for his hijinks (you're better off watching either the first movie or the entire original trilogy though, like Pirates of the Caribbean)... is that the Remastered Crysis you're playing?\n\n\nThat started out cute, only to end in hell...\n\n\nThat's one weird cat... why'd they abandon the cat though (I think)?\n\n\nAh, Metroid Dread. This is going to be a GotY contender alongside Psychonauts 2... shame Nintendo is diehard on not porting their games to other consoles. Hopefully, they'll change their mind after the negative consequences of it bite them in the butt later on. Still, gotta love these easy boss fights in case you got a gamebreaker weapon early on due to Developer's Foresight.",
            "polarity": -0.02462121212121212,
            "subjectivity": 0.5950757575757576
        },
        {
            "body": "anticlimactic win choice is always funny",
            "polarity": 0.525,
            "subjectivity": 0.7
        },
        {
            "body": "I want to wish James and everyone who reads this a wonderful,safe and spooky halloween",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}