{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-11-05 21:03:01",
    "ups": "4040",
    "downs": "49",
    "views": "42428",
    "top_comments": [
        {
            "comment": "Dear Emily, I enjoyed the Charlotte Tilbury so much and know this one will be just as great. Good morning Violetta hope you have a great day, a fellow makeup junkie too.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.6,
            "subjectivity": 0.6
        },
        {
            "comment": "Emily, I now know why you adore It Cosmetics Super Hero mascara!! It needed to dry out after I bought it but now....it's amazing!! Thank you for the recommendation!! 🙌",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4847222222222222,
            "subjectivity": 0.7222222222222222
        },
        {
            "comment": "I can’t wait to see you use that other cover girl palette! It looks so pretty! I want to get it, but really want to hear your thoughts first 😉😉 as always, watching your videos is like a warm Emily hug. You always give me a sweet start to my day. P.s. loved seeing your family dressed up for Halloween. I miss the days when my kiddos went trick or treating. But now that I’m a Grammy, I’ll get to see my grandson trick or treat. Can’t wait for that! Big hugs, Brenda",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30390625,
            "subjectivity": 0.5072916666666666
        },
        {
            "comment": "I recently purchased CG's Clean foundation and powder. I still love the way they smell, and I thought it felt light, and looked great on my skin with a moisturizing primer. Natural, but evened out with a bit of coverage.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3611111111111111,
            "subjectivity": 0.5666666666666667
        },
        {
            "comment": "Omg Covergirl Clean liquid foundation takes me BACK!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.18333333333333335,
            "subjectivity": 0.35000000000000003
        }
    ],
    "comments_since_last_sample": []
}