{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-10-31 00:58:31",
    "ups": "2081",
    "downs": "17",
    "views": "16214",
    "top_comments": [
        {
            "comment": "Emily I would love for you to do a full face of Makeup by Mario. I don’t care if it’s 1st impressions or not. I’ve tried a few things & the brand is just STELLAR! 💜💚❤️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.24062499999999998,
            "subjectivity": 0.375
        },
        {
            "comment": "I love that her response to the smell of the cover girl clean foundation is, “classic,” as if she welcomes the nostalgia, instead of being like, “in 20 years you really haven’t figured out how to fix this?” 😂😂😅",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30833333333333335,
            "subjectivity": 0.4166666666666667
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Emily I would love for you to do a full face of Makeup by Mario. I don’t care if it’s 1st impressions or not. I’ve tried a few things & the brand is just STELLAR! 💜💚❤️",
            "polarity": 0.24062499999999998,
            "subjectivity": 0.375
        },
        {
            "body": "My skin has gotten dryer with the weather.  Would this makeup work  with normal to dry",
            "polarity": 0.04166666666666667,
            "subjectivity": 0.625
        },
        {
            "body": "What do you think of the new nyx serum concealer? Have you tried it yet?",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "I used to really love the CG sensitive formula in that bottle.  I can no longer find it.  I guess it was discontinued🤷‍♀️🤷‍♀️🤷‍♀️",
            "polarity": 0.3,
            "subjectivity": 0.75
        },
        {
            "body": "I used that foundation in high school.  they had one for acne that had salicylic acid in it that I used.  maybe I will buy one for fun",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.37
        },
        {
            "body": "I love the Covergirl clean make up lol. But I'm old school myself. Almost 50! Takes me back too!  God bless all!",
            "polarity": 0.35833333333333334,
            "subjectivity": 0.44000000000000006
        },
        {
            "body": "I was reading the description of one of those Covergirl TruNaked palettes recently and it said the shadows are “baked”. I’ve never tried them… can anyone confirm or deny the “baked” claim? \n\nThanks for another great video Emily💜. I hope your parents are doing well:)",
            "polarity": 0.375,
            "subjectivity": 0.55
        },
        {
            "body": "🧡🎃🧡",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love that her response to the smell of the cover girl clean foundation is, “classic,” as if she welcomes the nostalgia, instead of being like, “in 20 years you really haven’t figured out how to fix this?” 😂😂😅",
            "polarity": 0.30833333333333335,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "Will you be picking up the bh cosmetics Xmas pallet? I just got it today, I've only done one look but so far I'm just as impressed as I was with last years.",
            "polarity": 0.275,
            "subjectivity": 0.7666666666666667
        },
        {
            "body": "Really appreciate you showing us drug store products.  Some You-tubers would act as if the drug store products were beneath them...not all of us can pay $75+ for a make up brand or feel that we even should.  Greatly appreciate your down to earth manner!!...hope you have a great week-end!!",
            "polarity": 0.46111111111111114,
            "subjectivity": 0.49722222222222223
        },
        {
            "body": "Leaving for Florida on Monday, had  to get my Em fix. And I must say that Cover girl foundation looks amazing on you , dare I say better than some high ends!",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.6466666666666666
        },
        {
            "body": "Yes been using the clean fresh covergirl foundation since early summer.. it still has noxzema smell, but brings me back to the 80's..🥰. luv it! You look wonderful!😍👍",
            "polarity": 0.19166666666666668,
            "subjectivity": 0.37500000000000006
        },
        {
            "body": "Love your video's...application of the darker blush on top of the others kinda erased the rosy tone.  That dark lipstick was a bit much...thanks for showing so many products...you really know how to make a face come alive.  Glad your mom is better.",
            "polarity": 0.33125000000000004,
            "subjectivity": 0.5125
        },
        {
            "body": "Really? Another neutral/berry/autumnal eye? When I saw the two different palettes, I was so in hope you would try something you don’t usually do. I don’t know why we need to see the application of more of the same. It’s not only you, but many influencers keep doing the same look. If that’s all that’s going to be showcased, why bother watching or buying anything else? Cheeks, lips, eyebrow preparations, all new things get a try. But when it comes to eyeshadow, let’s run to the same old same old. \nYes, you may try the other palette at some point in time, but when you didn’t try it today, seems like you view the colors as, “meh, maybe when I get around to it”. So disappointed and rapidly losing interest in the beauty community.",
            "polarity": 0.02742424242424244,
            "subjectivity": 0.3686363636363636
        },
        {
            "body": "Fun video and good to see you having so much fun.",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "You're taking me back with the CoverGirl clean makeup! First foundation I ever owned in my early teens. 😁",
            "polarity": 0.20208333333333334,
            "subjectivity": 0.33333333333333337
        },
        {
            "body": "Sorry to hear that your mom is ill. Prayers go to her from Seattle❤️",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "💜 I like that eye palette.  I have the  chocolate and the peach eye palettes by cover girl.  This one looks like a combination of both those palettes.  Did you notice that?  Still love 💕 your channel after sooo many years of watching.  Thanks for being a refreshing break.💜💜☺️",
            "polarity": 0.425,
            "subjectivity": 0.575
        },
        {
            "body": "Believe beauty has a bronzer sunstruck marbelized bronzer i use toasted bronze its a top notch bronzer its my go to over all my bronzers now you should try it EM ....keeping your mom in my prayers love you have a great weekend",
            "polarity": 0.6,
            "subjectivity": 0.6166666666666667
        }
    ]
}