{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-10-30 16:46:17",
    "ups": "1054",
    "downs": "6",
    "views": "5798",
    "top_comments": [
        {
            "comment": "Something I LOVE about CG is they are THEE ONLY brand that I’ve tried that offers an EXACT shade match for me no matter the time of year. I have a VERY COOL undertone & I get really tan in the summer. And their TruBlend line is absolute perfection I’ve never gotten a better shade match. The original formula (not matte) reminds me big time of the WnW Tinted Hydrator too which I also love.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.28,
            "subjectivity": 0.5222727272727272
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "That lipstick would be GORGEOUS on a darker skin tone but looks good sheered out on Emily too.",
            "polarity": 0.7,
            "subjectivity": 0.75
        },
        {
            "body": "I'm in the same age bracket  as Em and I would imagine many gals watching her channel are also in the same age bracket. It's not that we are not pretty without make up but, despite the face creams and care we do, make up just instabtly transforms that 37 yro skin in such a satisfying way. I even remember being a kid and wanting to get into my mom's make up bag. She used to tell me \"One day you will really need this stuff. Now you are just perfect the way you are!\" Nostalgia.....",
            "polarity": 0.259375,
            "subjectivity": 0.55625
        },
        {
            "body": "Something I LOVE about CG is they are THEE ONLY brand that I’ve tried that offers an EXACT shade match for me no matter the time of year. I have a VERY COOL undertone & I get really tan in the summer. And their TruBlend line is absolute perfection I’ve never gotten a better shade match. The original formula (not matte) reminds me big time of the WnW Tinted Hydrator too which I also love.",
            "polarity": 0.28,
            "subjectivity": 0.5222727272727272
        },
        {
            "body": "You should consider doing a video on makeup from your teens.  The early 00’s certainly had interesting makeup, although we certainly never had a ton of guidance.  It would be fun to see you do a more modern interpretation of what that girl from high school wore, especially as I’m sure you could make it wearable.  It’s also fun to look back and realize that stuff like the Scooby Doo movie was painfully accurate to the awkward style of the time, so a modern interpretation from someone who lived it would be a lot of fun.",
            "polarity": 0.23114285714285712,
            "subjectivity": 0.45441269841269843
        },
        {
            "body": "Em, we need a Q&A, I have questions, are you gonna have another baby to even out the number or is 3 the sweet spot? Has Bub ever let you do his makeup or has he ever done yours? 😆 Inquiring minds wanna know!",
            "polarity": 0.4375,
            "subjectivity": 0.65
        },
        {
            "body": "I'm loving this eye look with out such a defined outer V. I love when you let your eyeshadow be a little \"messier\". Also, love getting to see your PR. Hugs!!",
            "polarity": 0.33875,
            "subjectivity": 0.63
        },
        {
            "body": "So many interesting drugstore products! It's such a beautiful dark, Fall look!❣❣",
            "polarity": 0.36500000000000005,
            "subjectivity": 0.58
        },
        {
            "body": "I LOVE the lips.  Will try it with the finger dab.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Great video thanks for sharing this with us!",
            "polarity": 0.525,
            "subjectivity": 0.475
        },
        {
            "body": "“Shimmering Sands, here’s another thing the kids need to know about.” 😂 I was actually talking to a couple 12th grade girls in my class about makeup last week. One said she has no clue… I’m going to tell her about Shimmering Sands and to just play and have fun 🤩",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.12222222222222223
        },
        {
            "body": "Holy moly I didn't even think they made the clean makeup foundation anymore. I remember my mom using that makeup in the late 90's early 2000's wow.",
            "polarity": 0.06666666666666668,
            "subjectivity": 0.65
        },
        {
            "body": "Beautiful look. I love it.",
            "polarity": 0.675,
            "subjectivity": 0.8
        },
        {
            "body": "Timeless AF, Lynn",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My thoughts Today, beauty influencers, remember how Pretty Powerful it is to have someone who believes in you. Find someone to believe in. Bollacks Lynn",
            "polarity": 0.275,
            "subjectivity": 1.0
        },
        {
            "body": "Good morning Em. Perfect part of my morning. Hope you are having a Beautifully Blessed Day!♥️",
            "polarity": 0.85,
            "subjectivity": 0.8666666666666667
        },
        {
            "body": "Great video (as usual!). But man, I was rooting for that other CG eye shadow palette…I’m a purple girl😉 I look forward to seeing you use that one too!❤️",
            "polarity": 0.12083333333333335,
            "subjectivity": 0.4583333333333333
        },
        {
            "body": "All of the Covergirl products that smell like Noxema break me out SO bad! Makes me so sad! I’m really enjoying their new wrinkle blurring powder, I can even use it as a powder foundation. It’s great stuff.",
            "polarity": -0.012727272727272676,
            "subjectivity": 0.6942424242424242
        },
        {
            "body": "Ah the parent/teacher conferences.  My daughter is autistic and every year has an IEP (Individualized Education Program) meeting to assess and go over behavioural goals and whatnot.  I always hold my breath a bit before the conferences.  They have not always been completely positive but at 18 years she is evening out..I absolutely adore her.  Emily, thank you for your great videos. They give me wonderful and much needed breaks ❤️.  Also, I am going to CVS and will pick up the Covergirl eyeshadow palette.",
            "polarity": 0.37121212121212127,
            "subjectivity": 0.5992424242424242
        },
        {
            "body": "#BOOP I boop myself every dat! 🤣😅 #hoodedeyes",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Very pretty look 💖",
            "polarity": 0.325,
            "subjectivity": 1.0
        }
    ]
}