{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-10-31 13:18:44",
    "ups": "2756",
    "downs": "28",
    "views": "24061",
    "top_comments": [
        {
            "comment": "I'm learning that I am way more particular about my shimmers than I thought. I want the light shades to be as creamy as a Color Pop highlighter if possible! I'll build difficult dark shades but I lost all patience with flaky light ones. Since a lot of holiday looks really rely on those shimmers would you please point out which ones you think are creamy age friendly ones? I think this CG palette fit pretty well! ♡Love you! Prayers for your mom and all of you. 😌🙏💝☮🕉",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1983901515151515,
            "subjectivity": 0.6121212121212122
        },
        {
            "comment": "\"I've got a few things on my cheeks today.\" Em's Happy Place",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30000000000000004,
            "subjectivity": 0.55
        },
        {
            "comment": "I feel like those Milani powder blushes would be great to mix together and get whatever kind of tone you want! I feel like people often forget you can MIX blush and other face products. If a blush is too deep I just dip back and forth between my blush and my face powder and it lightens it!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.28500000000000003,
            "subjectivity": 0.485
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Blessings to your mom, you, and all the lovely subscribers you have cultivated with your genuine, loving, warm soul. ♥️",
            "polarity": 0.525,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "It's always a treat when there's a new Emily video!  Maybe a look sometime that isn't rust/brown/berry?  Seems like all the demo looks devolve to the same basis result.",
            "polarity": 0.08522727272727272,
            "subjectivity": 0.2897727272727273
        },
        {
            "body": "Beautiful!!   :)",
            "polarity": 0.75,
            "subjectivity": 1.0
        },
        {
            "body": "FIVE blushes at once….Yessss!!!  Love it!   So glad to hear your mom is recovering well.  Sending prayers.  💕",
            "polarity": 0.5625,
            "subjectivity": 0.8
        },
        {
            "body": "Hello! Good to read that your mom is better. I hope that she continues to recover from her surgery. Blessings",
            "polarity": 0.6,
            "subjectivity": 0.55
        },
        {
            "body": "Great products Emily :-)) oxoxox",
            "polarity": 0.65,
            "subjectivity": 0.875
        },
        {
            "body": "I have That's Rad. would love to see some inspiration to use it more.",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "Glad to hear your mum is recovering well. Emma x",
            "polarity": 0.5,
            "subjectivity": 1.0
        }
    ]
}