{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-11-01 22:16:40",
    "ups": "3557",
    "downs": "42",
    "views": "34111",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "no one ever uses the blue/green cool colors! lol it's always the same red/orange/yellow/pink and it's so sad. i love that purple/aqua palette (tho i can't figure out why they call it nudes lol).",
            "polarity": 0.33958333333333335,
            "subjectivity": 0.6291666666666668
        },
        {
            "body": "Loved the final look!! 😍❤️",
            "polarity": 0.35,
            "subjectivity": 0.9
        },
        {
            "body": "i tried the thats rad palette on my channel and i had mixed thoughts...love the colors (im a blue and purple girl) but not all of the formulas worked for me",
            "polarity": 0.0,
            "subjectivity": 0.175
        },
        {
            "body": "I saw that cover girl clean make up on another video and looks like they changed the cap color?  I loved the note a smell! I haven’t seen the foundation in any store near me because I want to revisit the foundation! That was my foundation back in mid 80’s and early 90’s! I am so interested in the Milan. I’ve been really loving their eye liner and eyebrow micro pencil!",
            "polarity": 0.31145833333333334,
            "subjectivity": 0.45624999999999993
        },
        {
            "body": "Every time I use Cover Girl or Maybelline foundation I become a walking zit.  I love the smell of CoverGirl.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I'm way older than you are (56), and even I used that foundation in high school! I only have to look at it and I remember that awful smell! 🤢. I love that Cover Girl is one of the few mainstream brands that are cruelty free. I mostly buy from Indie brands, but if I have to buy something from the drugstore I try to buy from Cover Girl. So glad your Mom is recovering well ❤️🚙🇨🇦",
            "polarity": 0.10666666666666666,
            "subjectivity": 0.5873333333333333
        }
    ]
}