{
    "time_posted": "2021-10-30 12:56:54",
    "url": "https://www.youtube.com/watch?v=pF-adaZ55zE",
    "time_now": "2021-10-31 17:25:47",
    "ups": "2903",
    "downs": "31",
    "views": "25687",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "It's chilly here in Maryland and we had a gas leak in the garage so we're waiting for the plumber to have heat and hot water. Watching you with a cup of coffee and two shirts on!!! Not a big drugstore girl but gotta watch whatever you do!!! I'm not surprised you got great reports on your lovely girls! They have great role models!!!❤",
            "polarity": 0.29475446428571433,
            "subjectivity": 0.7142857142857143
        },
        {
            "body": "Cover Girl clean pressed powder is amazing for blurring pores. I rediscovered it recently.  😌",
            "polarity": 0.32222222222222224,
            "subjectivity": 0.6166666666666667
        },
        {
            "body": "Happy Halloween everyone. Love your drugstore makeup videos , but Covergirl is never one of the brands l choose. I like the eye look you did here but those cheapo plastic packaging is such a turn off because l know it will crack or break in a week. Dont know what the price is on that palette but l would think between $10 to $15. That Milani blush is also a no for me for the same reason. I think you applied a bit too much blush here, but l realize your doing 2 palettes. Lipstick was also not great. Seen so much better looks on you, but glad your mom is doing better.",
            "polarity": 0.2888888888888889,
            "subjectivity": 0.5750000000000001
        },
        {
            "body": "Fun to see the PR you get. Could you do video like Allie Glines, Drugstore throwback favorites? With so much new stuff, does everyone just jump to the new products or repurchase old favorites?",
            "polarity": 0.16818181818181818,
            "subjectivity": 0.32727272727272727
        },
        {
            "body": "Holy cow! I did not notice you hit one million subscribers!! Congrats hun, that is awesome and well deserved!! ❣️🙌💯",
            "polarity": 0.3697916666666667,
            "subjectivity": 0.5833333333333334
        }
    ]
}