{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-05 12:47:34",
    "ups": "58950",
    "downs": "1655",
    "views": "2122834",
    "top_comments": [
        {
            "comment": "Finaly humans realize money isn,t everything 🥰🥰🥰🥰😇😇😇😇",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "lots of assumptions... one big flaw about working from home is that people tend to procrastinate",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "comment": "People are looking for simple and sufficient earning without extra efforts and stress. Youtube and Tiktok are one of them!!",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.2285714285714286
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "\"Money won't make you happy... But everybody wants to find out for themselves\" Zig Ziglar",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "lots of assumptions... one big flaw about working from home is that people tend to procrastinate",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Haha everyone in the world leaving jobs and in India there are no jobs.",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "I left Fujitsu and going to start my own business",
            "polarity": 0.3,
            "subjectivity": 0.5
        },
        {
            "body": "People are looking for simple and sufficient earning without extra efforts and stress. Youtube and Tiktok are one of them!!",
            "polarity": 0.0,
            "subjectivity": 0.2285714285714286
        },
        {
            "body": "This is So true 🥺🥺",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "In my case, it was the company itself who did not wanted me anymore, because of my belief that I own my own body",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "I also quit my job to study hard for the exam. I realised I was wasting my time working 9 hours a day 6 days a week and getting nothing.",
            "polarity": -0.2916666666666667,
            "subjectivity": 0.5416666666666666
        },
        {
            "body": "she is my all time fav media personality, God bless her and her beauty stays eternal",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I agree with some of the things she says but also this paradigm shift in this whole world inflation climate change and more viruses on the way we need you ubi universal basic income just to survive many of us will never own a home barely can own an apartment definitely won't on the car and definitely won't have health insurance politicians are painted themselves into a corner with their greed no more status quo",
            "polarity": 0.11818181818181817,
            "subjectivity": 0.4659090909090909
        },
        {
            "body": "I hate my work environment and I own my business,, so I totally relate..",
            "polarity": -0.0666666666666667,
            "subjectivity": 0.8833333333333333
        },
        {
            "body": "This is a good opportunity for unemployed people to Join the new companies.",
            "polarity": 0.41818181818181815,
            "subjectivity": 0.5272727272727273
        },
        {
            "body": "well done from Europe",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What about you? are you quitting your job?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd just say that this is a brilliant piece! I wasnt the one who thought would fall into this GR category, but over months I have seen changes in my workplace and that has made me change my decision. Yes paycheck isnt the only factor, after 10 years in the corporate world, I look for my job satisfaction and other points too..thanks for this video!",
            "polarity": 0.2109375,
            "subjectivity": 0.59375
        },
        {
            "body": "But nobody said ... Some many are quitting or resigning because they dont want to get wactination. Waccine rejection not because they do not want to work.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "i like this report...but we should know guys that this is only the other side of the coin...lucky are the people who can just up and leave their jobs..\nhow about the millions of people who were laid out of work because of the pandemic? those who have mouths to feed and a mountain of bills to pay? 😥 i only hope and pray that this pandemic will end sooner than later...more people all around the world are struggling every minute.",
            "polarity": -0.041666666666666664,
            "subjectivity": 0.7916666666666666
        },
        {
            "body": "I hv no job. Can I work as your body guard",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Finaly humans realize money isn,t everything 🥰🥰🥰🥰😇😇😇😇",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}