{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-06 05:17:18",
    "ups": "60525",
    "downs": "1716",
    "views": "2195943",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "The world will go back to the old normal in next one year !!!",
            "polarity": 0.0625,
            "subjectivity": 0.21249999999999997
        },
        {
            "body": "Are you quitting your job Palaki 😂?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I started a new job and realized I hated it. I plan to quit next year but also want them to let me go.",
            "polarity": -0.2545454545454546,
            "subjectivity": 0.38484848484848483
        },
        {
            "body": "I enjoy my line of work. But I also want to be respected and cherished by my employer. If I am giving my all to the work and I want the best to be given back to me.\n\nMoney is pretty important for me, I really miss the last company I worked at. Those people were really awesome. Unfortunately they didn't have enough budget to I had to leave them, but I know one thing for sure, that it was the best company I have ever worked at!",
            "polarity": 0.3541666666666667,
            "subjectivity": 0.562962962962963
        },
        {
            "body": "Many people  don’t agree with the mandatory vaccination, it goes agin the constitution.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "I am also going to quit my banking job very soon...it really sucks...I hate every aspect of it...don't know how I survived for 5 years...",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "The real matter is.... What IS this money thing? And WHAT is its function?  Seek people.  Seek.",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "Please don't resign your job after listening to this video. If you do, god bless you 🙏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🤩😻😻👋👋🥰🥰😊😊😍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I quit my job in 2019....reason?..integrity is paramount for me",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I think they all died due to coronoavirus and so did not return to work!",
            "polarity": -0.15625,
            "subjectivity": 0.375
        },
        {
            "body": "ThanK You 🌸Ms. Palki Sharma🌸 .. \nFor doing Right thing at Right place 🙏💐💐🌷",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "Work endless, no work life balance, take huge housing loans and get trapped into vicious cycle of disliking job. From past two decades Indians are working for loan lender banks and builders and not for themselves.",
            "polarity": -0.23499999999999996,
            "subjectivity": 0.58
        },
        {
            "body": "Being forced to take the jab !!!!time to quit 🥰",
            "polarity": -0.7324218750000001,
            "subjectivity": 0.2
        },
        {
            "body": "Doesn’t matter I need money to survive and can’t do anything else",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks for the article.\nDoes this mean that all people who are resigning  have money to afford for their living. Is it only the IT and IT related industry we are talking about. We should look at the other sectors like manufacturing and labor intensive industries. Work from home is a luxury that only a small percent can afford.",
            "polarity": -0.06964285714285715,
            "subjectivity": 0.5803571428571429
        },
        {
            "body": "Wow maybe the vaccine and Graphine Oxide has turned people into living antennas now in tune with the cosmos,it sounds like heaven,wow everyone cares and the compassion is outta this world,maybe if all bend over and take it rectally it will usher in the Maharishi Mahesh Baal.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "People don't want to work for paper the govt's are devaluing through inflation. They want something scarce... Like hugs... But no wants to catch covid.",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "There are always two sides of a coin. Covid has claimed many lives, on flip side covid made people to realize the importance of family and mother nature. Many employers were forced to do remote work but that become a boon. I am also one of them. I also need flexibility. Working in hybrid model like work in office fur 2 days and home for 3 days is a new trend.",
            "polarity": 0.14727272727272728,
            "subjectivity": 0.3709090909090909
        },
        {
            "body": "*Robots & 4th industrial generation*\nGovernments should starts to create funds for social incomes & robot taxes \n\nMachineries are getting  smarter than humans so its taking  human jobs!",
            "polarity": 0.016666666666666666,
            "subjectivity": 0.08333333333333334
        }
    ]
}