{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-10-31 00:57:57",
    "ups": "15388",
    "downs": "337",
    "views": "373849",
    "top_comments": [
        {
            "comment": "They quit because the vast majority of people don’t want to get sick from people who don’t want to take the vaccine plain and simple. The majority of Americans want to be safe and thus wants to avoid the republicans who are plainly stupid. It’s called “Common Sense.” Also they don’t want to accept the slave wages that Republicans want to shell out so they say to themselves, “screw them … I will dictate terms.” To work remote to be with the family is key … time needs to pass by in order to go back with other people. It’s called common sense!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.14835164835164835,
            "subjectivity": 0.518956043956044
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I'm quitting my job soon .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Because in the West we are told PREPARE TO DIE",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I think that very soon people will be willing to consume less and be happier. The way things are now is reminding  of slave riding.",
            "polarity": 0.09444444444444444,
            "subjectivity": 0.37222222222222223
        },
        {
            "body": "I am trying to convince my wife to quit her job as a nurse. I want to downsize our house and expenses and live a simpler life.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "Well maybe companies should be paying their employees instead of giving CEO millions more than they are worth,whose actually doing the work? It ain't some bean counting CEO that makes the company",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "People leaving work means less productivity, which means fewer goods, higher prices and shortages. The poorest will suffer most, and there will be more poor people. If governments continue benefits to unproductive people, they print money that will decrease in value, which means, in addition to already higher prices there will be hyper inflation, which means catastrophe. So... I don't really believe this \"great resignation\" is anything more than a fad, and hopefully not a fad that will last long.",
            "polarity": 0.2166666666666667,
            "subjectivity": 0.41666666666666674
        },
        {
            "body": "That's because of Work Life balance is ruined by employers in Work from Home conditions.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They work for others , not for themselves, meaning  ?? not much left for themselves and their families",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You are one Amazing Journalist!!!!!!!!!!!!!!",
            "polarity": 1.0,
            "subjectivity": 0.9
        },
        {
            "body": "They quit because the vast majority of people don’t want to get sick from people who don’t want to take the vaccine plain and simple. The majority of Americans want to be safe and thus wants to avoid the republicans who are plainly stupid. It’s called “Common Sense.” Also they don’t want to accept the slave wages that Republicans want to shell out so they say to themselves, “screw them … I will dictate terms.” To work remote to be with the family is key … time needs to pass by in order to go back with other people. It’s called common sense!",
            "polarity": -0.14835164835164835,
            "subjectivity": 0.518956043956044
        },
        {
            "body": "What a load of sht stats as if your actually recorded this and its the opression from govt covid hysteria pushdemic get the jab crap",
            "polarity": -0.4,
            "subjectivity": 0.45
        },
        {
            "body": "The Wuhan virus? Seriously? One would assume that by now you'd know what it's called. Please stop promoting the prejudice.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Incompetent management and paternalistic corporate culture are the biggest drivers IMO",
            "polarity": -0.175,
            "subjectivity": 0.18333333333333335
        },
        {
            "body": "I am one of the great!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "Another excellent coverage of the trends by WION...well presented by Palki",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Palki is \"rasmalaai\"....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Amazing, How you beautifully painted the news' canvas. Thanks sis",
            "polarity": 0.55,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "It's bit exaggerating the so-called great resignations \nI live in London and , trains buses,  underground,  pubs,  clubs and sports grounds are over-flowing . \nIt's false story . I have lived in England 40 years and  worked in U S A and Canada . Since late 70's U K is always short of Drs Nurses and hotel workers ( All East Europeans) or from Sri Lanka. \nThe native are not interested in hard work and thrift in Europe or north America they would rather stay on social security .\nAs long as they get enough money to eat and have beer and  lay about they're very happy. \nThey are not interested in made race to accumulate Dollars or Pounds to worry about getting married their children to great  \nfamily and counting their cars and a great game of finding beautiful tall fair daughter in law. So new generations of Indians are the same they are getting married to fellow Americans or British nd having great freedom and democracy.\nI live in london and visited 32 countries. I hope I haven't offended by fellow Brothers & Sisters back home.\n\nDr J S Pawar (Mithepur) london.",
            "polarity": 0.20003030303030303,
            "subjectivity": 0.4955151515151515
        },
        {
            "body": "Palki you look beautiful always but are looking awesome today.",
            "polarity": 0.925,
            "subjectivity": 1.0
        },
        {
            "body": "Ask the powers that be to move all sanctions on other countries",
            "polarity": -0.125,
            "subjectivity": 0.375
        }
    ]
}