{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-02 18:52:18",
    "ups": "50031",
    "downs": "1399",
    "views": "1715758",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "If you’re reading this message, I wish you get whatever you want in your life😇🌈❤️One love to all",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Thank God! I’m not alone planning the same 🤣",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "In india us based bcos corporates are paying for wfh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Elon musk is about to release synthetic help....ai",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Who is this anchor 😉",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love this talented lady. By the way, I needed to watch this video like RIGHT NOW. So, thanks💛💚🧡",
            "polarity": 0.49523809523809526,
            "subjectivity": 0.6785714285714285
        },
        {
            "body": "I have old parents at home whom I don't want to leave post WFH. They refuse to leave our hometown where they've lived all their life. I expect my company to offer Extended WFH. I am a pricing analyst and I work for 10 hours a day, I need time for my family too. 😞",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "If US employers are having as much difficulty finding skilled workers as skilled workers previously had finding employers, then maybe they should just accept that the previous dynamic has become inverted, and apply inverted methods to solve their problem. If they will participate in reverse internships by offering salaries for no work until workers decide they feel like working, I'm sure they can trust workers to eventually appreciate the value of those salaries, just as employers have always appreciate the value of interns' skills and always eventually hired them for pay, and workers will inevitably choose to work for the money. How could this win-win plan possibly not work if the previous plan worked as well as employers say it did?",
            "polarity": 0.12,
            "subjectivity": 0.47555555555555556
        },
        {
            "body": "👍👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I never understood the workaholic nature of many Asians",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Zoo          V. V",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Tell the truth!!! Many quit because of the force vinegar",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "It’s time to leave the worlds corruption and economic slavery behind. Now the populations are growing exponentially there is room for alternative living and governing. If the elite and their stooge politicians won’t become humane then humanity will leave them behind in their soulless properties and boardrooms. We the FREE people will not entertain them any more. 🐀 🐀 🐀 Rat race over",
            "polarity": 0.059999999999999984,
            "subjectivity": 0.58
        },
        {
            "body": "80% quit because of the mandate",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I left my job because of govt sanctioned discrimination.  In Singapore too the unvaccinated are discriminated against.  We are not allowed to rely on our immunity.  Our governments are bringing back HITLERISM, governments are NAZIS and we are the jews.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yes quiting job very necessary for us because companies are making us fool.....not giving profit to us.....only using us for their benefits.......",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "I quit my very first job within a matter of days right before the second wave began in india. Reason- long hrs and grumpiness , mental stress.  It was a 12 hour shift 6 days a week ( no further holiday) that left me little time to consider doing what I wanted to do most - study further. I had only 4 hours of my life in which I was awake and not at work. And 2horus of it will be dedicated to eating , and household chores . Therefore my life (personal life) only had a total of 2 whole hrs a day to waste in which I couldn't decide what to do. I have a similar job offer now after 7 months. SHould I take it?",
            "polarity": 0.04548319327731093,
            "subjectivity": 0.43641456582633054
        },
        {
            "body": "Only one thing that Covid 19 brought us. To look at what you really want in life and what you don't. The work n life balance is rubbish 5 days on and the weekend here in the UK. Definitely burnout too much micromanaging   by managers. Work is stressful and the commutes to get there each morning eat sleep and repeat.",
            "polarity": 0.1,
            "subjectivity": 0.475
        },
        {
            "body": "\"Vaccine Mandates\" is the real reason for the \"Great Resignation\".",
            "polarity": 0.5,
            "subjectivity": 0.525
        },
        {
            "body": "May the Almigthy God bless and protect you!!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}