{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-03 11:21:12",
    "ups": "52496",
    "downs": "1475",
    "views": "1831405",
    "top_comments": [
        {
            "comment": "Report on UK work sector wherein millions are laid off in fire and  rehire schemes on 0 hour contracts or minimum wage salaries...especially IT sector for Indians being exploited with 40% taxes..direlect buildings modified into concentration camps paying upto 30% of wages..and dumped  the Europeans in Brexit.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Jobs are for slaves.....",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Maybe just maybe they don't want to be forced to get an experimental mRNA vaccine?",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "am sure, most of us like the jobs they are doing but biggest problem is with managers. Often rightly said, employee leaves due PM's rather than company !",
            "polarity": 0.2823660714285714,
            "subjectivity": 0.5749007936507936
        },
        {
            "body": "I was working with a law firm....decent salary and perks but was not happy at all, now selling goods ...happy now",
            "polarity": -0.4,
            "subjectivity": 1.0
        },
        {
            "body": "Lets all quit and they will beg us to return. No more covid after that.",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Better to be healthy that to have a job.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "True..  i had a similar burn out... i resigned. My employer..  came out to me n finally gave an 1 month vacation.  I knew... i was missing something importamt in life...my cute little daughter..  my father who was ill...\nMy personal life came to a crash. Paycheck hardly matters.I know... very much i needed a break. Hope to get back to work with better energy.",
            "polarity": 0.03590277777777777,
            "subjectivity": 0.5168055555555555
        },
        {
            "body": "We are quitting as we have to have mandatory vaccinations in new Zealand so people are quitting.  Our govt is corrupt.",
            "polarity": -0.18181818181818182,
            "subjectivity": 0.7272727272727273
        },
        {
            "body": "Report on UK work sector wherein millions are laid off in fire and  rehire schemes on 0 hour contracts or minimum wage salaries...especially IT sector for Indians being exploited with 40% taxes..direlect buildings modified into concentration camps paying upto 30% of wages..and dumped  the Europeans in Brexit.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jobs are for slaves.....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "according to sanatan culture sef-employment is the best culture!!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Yes it's true in my case..I just looking for giving resignation and switch to follow my passion, my life I  don't want waste my life...it's easy for my case with \"0\" debt no liability and just waste my 3yr for the company who don't care about employee...now on my age meets 25yrs",
            "polarity": 0.09583333333333331,
            "subjectivity": 0.37083333333333335
        },
        {
            "body": "When everybody quits - who is doing the change?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Even the educational sector, teachers are quitting, shortage of teachers like never before!",
            "polarity": 0.3125,
            "subjectivity": 0.25
        },
        {
            "body": "We are the children of middle age our great war is spiritual war  our great  depression is our lives",
            "polarity": 0.4,
            "subjectivity": 0.4083333333333333
        },
        {
            "body": "so well put.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And a lot are leaving their jobs because they don’t want to get the experimental jab.",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "Absolutely 😊👍",
            "polarity": 0.2,
            "subjectivity": 0.9
        },
        {
            "body": "🤘",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Who will bell D cat... Who will ensure work life balance? Are labour laws in place followed properly?",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "In india so many young jobless graduates there for seeking job. They do anything for get job. Its very risk for current working staffs. Some experienced staff getting good pay and living with family. Corona pandemic leads most of them jobless. After resuming to normal situation getting worsen. Experienced person force to reduce their salary up to 30-40 percent. Current rising petrol diesel gas prices leads all commodities rising prices. Not able to live a life like before pandemic. Most of the middle class go down to simple life style. Most of the shops unable to run. New startup also not able to run sucessfully. Everything is worsen. I am working in architecture. I lost job later i seek job they didnt give standard salary and want to work 2-3 work persons to one with one third of salary. Not sure job is permanant. Instead i try freelance new comers drag market to deep low. Not getting enough projects struggle to run family. Savings are draining. Dont know how to run in up coming years. Lost my mother and father in law in corona pandemic. Dont know which way for good fortune. Ever field this scenario continues. .....",
            "polarity": 0.14511784511784515,
            "subjectivity": 0.43716149591149595
        }
    ]
}