{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-04 20:19:03",
    "ups": "56974",
    "downs": "1587",
    "views": "2039457",
    "top_comments": [
        {
            "comment": "Hello there I believe that the smoke screen that you are telling is of great Oscar winning because the majority of people quitting their job is down to the mandates were if you do not get vaccinatinated you don't have a job and others quit simply because they are feed up and exhausted not to mention the great reset i am sorry for the truth but I could  give you an Oscar for presentation and no other than Spain the country who seems to employ  as little people as possible so that they do not have to pay your pension please research properly because not everything is sky blue  rather quite bleak and filled with austerity which is the reason that protests are happening  all over the world so much shalom everyone always",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.03462962962962963,
            "subjectivity": 0.5847354497354496
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Seems like the employers will have to get some reality check and start to treat their employees like people and not their servants! The long hours, no flexibility and low wages for skilled jobs are exactly the reasons I quit my job as a high end kitchen designer and started to work as a housekeeper for a family. Less hours, more flexibility and more money!!:-D",
            "polarity": 0.21166666666666667,
            "subjectivity": 0.38208333333333333
        },
        {
            "body": "Maybe it has something with mandates. The magic mark of the beast.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "If people in America can do their jobs from home people in other countries can do the same job for less wages which some employers will consider hiring.",
            "polarity": -0.09722222222222221,
            "subjectivity": 0.18888888888888888
        },
        {
            "body": "Working hour is the biggest problem in IT field. No personal life at all.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "Even I am planning to switch my job due to very low salary.",
            "polarity": -0.0625,
            "subjectivity": 0.3825
        },
        {
            "body": "I Hope this goes viral!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lucky them living in a welfare state",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "I just resigned from the post of Computer Instructor. I asked my employer if I can take online classes for students by working at home but he said NO, so I literally slammed my resignation letter on his face and I quit.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Work allday because here in Greece , the money is not enough to surpport your family our goverment is a thief, as a women and a mother I can not stop or just leave, whish I could, love from Greece",
            "polarity": 0.25,
            "subjectivity": 0.55
        },
        {
            "body": "Blood sucker capitalism is responsible",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.675
        },
        {
            "body": "I finally can work from home since pandemic start, and only goes to office when necessary.\nEven tho I can work from home since day one at office as IT technician.\nNow I can be with my 3 years old son every day and still watching over my office,\nwhile also trading stocks, crypto and a Grab driver.",
            "polarity": 0.025,
            "subjectivity": 0.8
        },
        {
            "body": "Because treasonous Biden and his democratic cronies what it this way!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just don't serch *i feel fantastic* on YouTube",
            "polarity": 0.4,
            "subjectivity": 0.9
        },
        {
            "body": "Some resignations also happen because of employer asking them to resign, not because they want to!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Capitalism - particularly at this late stage - produces what David Graeber called \"bullshit jobs\" - meaningless, pointless, unrewarding jobs that contribute little to  society and function mainly just to maintain capitalist hierarchy - the status quo.  As Marx pointed out, competition between capitalists drives continuous uptake of technology and automation in the quest for improved productivity. That trend cannot abate for long or the system collapses. Most of the real needs of society are produced by a small subset of jobs. And it's a subset that's getting smaller and smaller.",
            "polarity": -0.042013888888888885,
            "subjectivity": 0.48888888888888893
        },
        {
            "body": "In the UK a similar thing started before the pandemic. Poor employers, excessive taxation, red tape, high stress, all worth nothing in the graveyard.\nGovernment and local authority aim of ransacking the economy has destroyed it. GONE FISHING!",
            "polarity": -0.027142857142857142,
            "subjectivity": 0.37714285714285717
        },
        {
            "body": "They new this was going to happen.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Hello there I believe that the smoke screen that you are telling is of great Oscar winning because the majority of people quitting their job is down to the mandates were if you do not get vaccinatinated you don't have a job and others quit simply because they are feed up and exhausted not to mention the great reset i am sorry for the truth but I could  give you an Oscar for presentation and no other than Spain the country who seems to employ  as little people as possible so that they do not have to pay your pension please research properly because not everything is sky blue  rather quite bleak and filled with austerity which is the reason that protests are happening  all over the world so much shalom everyone always",
            "polarity": 0.03462962962962963,
            "subjectivity": 0.5847354497354496
        },
        {
            "body": "I think it's work life balance that we all want. Nobody wants to be another human who priorities work over family time everyday. I hated that about my ex partner too.",
            "polarity": -0.225,
            "subjectivity": 0.375
        },
        {
            "body": "I was worked around 11 months as contract employee jn Accenture but I found that there should be strict implementation of labor law which were applicable in India.  Labor laws were floated on the air working hours were extended from 9 hours to 12 hours without any single amount of extra payments. But the thing is lack of communication regarding employee well-being only production oriented work culture created. Immediate positive and constructive action should be taken at Accenture to keep their resources with them. With all my respect and also request 🙏.  Bcz I got depressed and faced mental challenges finally I'm getting out from that trauma. And also I really thankful to Accenture for giving this space to engage with them.",
            "polarity": 0.04448051948051948,
            "subjectivity": 0.4199675324675325
        }
    ]
}