{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-02 10:37:49",
    "ups": "47429",
    "downs": "1340",
    "views": "1620328",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Ouiting Jobs or Termination",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "As usual, you skirt around the truth. The real elephant in the room is bigger than yours.",
            "polarity": -0.016666666666666663,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "INSIGHTFUL!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Missed out on the aspect of lack of growth due to gender bias or other biases.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "Forget even free time.. If you  have to get your bank work done or some work with the govt, you don't have time...You don't have time to deal with life itself...all you  have time for is the employer alone..\nMy husband actually already started negotiating a new model to cut down on no. of work hours if pay cannot be normalised..\nYes, the other side of the story is \" is the grass greener on the other side?\".. Very few ppl have a reasonably good vision or plan for their future...So nobody should copy those people.. They should think for themselves..",
            "polarity": 0.0713510101010101,
            "subjectivity": 0.3904292929292929
        },
        {
            "body": "I quit last week....I refuse to help this facistic regime change",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Best presenter in WION",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I like how they call corona virus \"Wuhan virus\" 🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Can I know why the price of petrol is high?",
            "polarity": 0.16,
            "subjectivity": 0.5399999999999999
        },
        {
            "body": "The EMPLOYERS have to first “Care” and it’s obvious that they DO NOT!",
            "polarity": 0.125,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "It is not \"pandemic epiphany\" it is \"mental cacophany\"Majority of people are lazy after few months on a job they get disenchanted and tardy. only 10% of working class is really productive they rest are there to earn a paycheck.",
            "polarity": -0.07,
            "subjectivity": 0.5
        },
        {
            "body": "They’re going to work for honest, fair, employers who don’t believe that they have the right to RUN their lives or their HEALTHCARE!  And they want to work for a company thats “morals & values” aren’t FOR SALE to the highest bidder.  There’s no stability in any of the jobs that revolve around government handouts, grants and donations like the airlines and the Medical Industry like hospitals, EMT’s, Dr.’s offices, Nursing Homes and Insurance Companies.",
            "polarity": 0.41428571428571426,
            "subjectivity": 0.5839285714285715
        },
        {
            "body": "Well narrated 🔥🔥",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am a middle manager and I hate having to listen to yelling and pressure from lousy upper management. They expect to filter down pressure. Now days there is no work life balance.",
            "polarity": -0.29111111111111115,
            "subjectivity": 0.3377777777777778
        },
        {
            "body": "I am the one who quit my job, adopted a minimalist life style and happily enjoying my life at home and pursuing my hobbies. There’s more to life than slogging in offices, 8 hrs a day, five days a week! One day, we will be all gone. Life is precious, every moment is precious. Do what you love to do in the limited time you got on this earth.",
            "polarity": 0.4255952380952381,
            "subjectivity": 0.6404761904761905
        },
        {
            "body": "You forgot to say 'pakistan terrorist nation' about twenty times.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Now people prefer quality of life.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yes,sure!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I don't hate my job just the racist who run it nonetheless i quit...",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "Vaccine mandates",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}