{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-02 14:44:59",
    "ups": "48859",
    "downs": "1360",
    "views": "1663623",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Why a record number of people have quit and had resignation from jobs now.? \"Because\" most people are only working at jobs that they dislike (hate) only for the money is why. This was just an opportunity to get out of something they hated in the first place and forced to do against their will in order to pay bills. Only problem is if some people do not have a net worth or not enough money saved up then they will be in financial trouble unless there is a better plan.",
            "polarity": -0.04642857142857144,
            "subjectivity": 0.4952380952380952
        },
        {
            "body": "May God bless them and they will find a better job. Aamiin.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "I quit my corporate job last year and are now working on contract from home! I love it!!! My time my rules. I was sooo burned out it took me months to recovered. My kids were suffering. I gave everything for my job and they kept taking more",
            "polarity": 0.369140625,
            "subjectivity": 0.29166666666666663
        },
        {
            "body": "thank you for saying, out loud, what has been simmering in the minds of today's workforce...you are exactly correct in your assessment..",
            "polarity": 0.175,
            "subjectivity": 0.525
        },
        {
            "body": "My sentiments exactly! Bosses still treat their workers like slaves and I am not surprised at all about workers quitting in the US. They are treated like shit there so I'm not surprised, same with Vietnam!",
            "polarity": 0.0024999999999999996,
            "subjectivity": 0.595
        },
        {
            "body": "Now lets talk about the unemployment crisis in India",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Almighty God is judging and condemning the evil corruption of the world. The world today is a chunk in the mess. Disasters are happening all over the world especially China the most disaster stricken nation.",
            "polarity": -0.16875,
            "subjectivity": 0.66875
        },
        {
            "body": "Eye opening!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Damn true... Actually these American service based industries don't value Indian employees...having no trust in their employees.",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.25
        },
        {
            "body": "Employment slavery should be stopped.There will be no unemployment if manpower is skilled without abuse&torture",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Palki you are too good,  Bhagavan bless you 🙏",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "I also want and i am doing this year.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "While this happen Kenyans are chocking with unemployment. \nPeople are dying to get jobs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Workholic makes us alcoholic 😊\nAlcohol first thrills then kills 👍\nStop some unwanted factories which emits carbon 👎 Make the world a better habitat 👍😊",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.4444444444444444
        },
        {
            "body": "No one likes his/hers job\nGrass in your neighbours house is always greener\nLook for a change is todays mantra\nNot for me i am old school",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "Very helpful program",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "Kuch bhi..kuch bhi..bathado..news banado..🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would love to be at home watching my grandchildren playing with my dog and my grandmother.\n    I am tired of being treated like I am stupid and I am older the boss and most of the people I qork with but they wantto treat me like I am stupid not pay well. I worked threw the virus never missed a day never been late \n   People arw tires of beibg crap all the while being treated like crap .\n     My children are everything they are growen my grandchildren are everything they need a d\nGood nanan qho teaches them manners cooks for them and  plays with them",
            "polarity": -0.2033333333333333,
            "subjectivity": 0.6933333333333331
        }
    ]
}