{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-02 06:30:42",
    "ups": "46062",
    "downs": "1310",
    "views": "1559039",
    "top_comments": [
        {
            "comment": "I left the job after I realised that Time is the most important in ur life.....Job SUCKS....NOW in my hometown and living happily and i am just 30 year old Man",
            "likes": 1,
            "number_of_replies": 3,
            "polarity": 0.36000000000000004,
            "subjectivity": 0.54
        },
        {
            "comment": "The real reason for this phenomenon is mainly due to the \"VAX\" mandates. Many people left their jobs because of their refusal to comply with this mandate!",
            "likes": 1,
            "number_of_replies": 2,
            "polarity": 0.14375,
            "subjectivity": 0.29375
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "BBB Plan should be:\n1. Livable wage permanent laws of $27/Hour and up for all Americans \n2. UBI of $3,000/Month for life for the first $36,000/Per Year ( tax free )\n3. BOTH these points to eradicate poverty,  homelessness,  suffrage of Americans",
            "polarity": 0.325,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "I realised and did this 17 years back to bring up my son",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No one is going to digest this report. Leaving jobs will diminish lifestyle and eventually decrease demand for products and this will hit the economy. If this report was true then RBI and world Bank would have decreased their GDP growth for future year. Resignation is just the iceberg, actually employee are compelled to resign and giving them stress is one of the old techniques. The whole truth is government across the countries are not able to create jobs and the obvious reason for this is no invention in past few years. Previously companies use to invent products which helped save time and energy. Current companies just want to earn money by investing our time, energy and health into them. Chanakya pandit - A king can happily rule it's subject only if they are engaged in God Consciousness",
            "polarity": 0.0011111111111111126,
            "subjectivity": 0.43666666666666665
        },
        {
            "body": "When it becomes difficult to put food on the table people will go back to work.There is no free lunch in life.",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.6
        },
        {
            "body": "Yes it's about valued......",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The real reason for this phenomenon is mainly due to the \"VAX\" mandates. Many people left their jobs because of their refusal to comply with this mandate!",
            "polarity": 0.14375,
            "subjectivity": 0.29375
        },
        {
            "body": "super wion......",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "India me kisiko dam nai rahega aisa karneko\nGareebi kafi he yaha",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Climate Waits for No One\nThirty years ago, a friend of mine got into the green energy business and tried to pull me into it. I asked him what for, it isn’t serious. He said, “You have no idea how much money is being poured into it. Everyone wants in on it, politicians, financiers, businesspeople, the lot.” He was right, of course. Yet, no one wants to promote green energy in order to save the planet, but only to swell up their pockets even more. The declarations, therefore, remain in the assembly hall where they are stated, necessary actions are ignored, and the climate waits for no one: It will keep deteriorating.\nThis week in Glasgow, Scotland, the 26th UN Climate Change Conference is taking place. Officially, it aims to “bring parties together to accelerate action towards the goals of the Paris Agreement and the UN Framework Convention on Climate Change.” In reality, the countries plan to do the exact opposite. This year’s UN Production Gap Report, which tracks the discrepancy between governments’ planned fossil fuel production and actual global production levels, states the following: “Despite increased climate ambitions and net-zero commitments, governments still plan to produce more than double the amount of fossil fuels in 2030 than what would be consistent with limiting global warming to 1.5°C [2.7°F].”\nEnergy sources and technologies do change, but not according to what is best for the planet. It changes according to the interests of politicians and money moguls, and it never benefits the planet or the majority of its inhabitants, namely all of us.\nSince the climate waits for no one, eventually, it will catch up with us. Earth is a closed system, and in a closed system, there are consequences to exploitation: it hurts the abuser as well as the abused.\nI don’t know when or at what cost, but eventually, we will all have to realize that we cannot take beyond what we need. We cannot keep exploiting Earth selfishly and thoughtlessly because it will turn against us.\nEarth is like a submarine: there is only so much oxygen on board. If some crew members take more than their quota, the rest will not have enough, they will die, and the submarine will sink along with those who exceeded their quota.\nWe need constant reminders that we are one system, and we are all dependent on each other. We need to genuinely grasp that selfishness hurts us just as being exploitative hurts others. If we constantly remind ourselves that we are interdependent, we will behave with more consideration, and we will avoid the punitive impact of climate change.\nThe other option is to keep working as the UN’s Production Gap Report states that we are planning to work, and suffer nature’s unforgiving response. I hope we wise up in time because everyone will pay the price for this mistake.",
            "polarity": 0.10562169312169312,
            "subjectivity": 0.36997354497354495
        },
        {
            "body": "I left the job after I realised that Time is the most important in ur life.....Job SUCKS....NOW in my hometown and living happily and i am just 30 year old Man",
            "polarity": 0.36000000000000004,
            "subjectivity": 0.54
        },
        {
            "body": "I got a raise earlier this year after a long wait but after I saw the paystub I realized most of it went to the government.",
            "polarity": 0.15,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "job ka ehmiyat hum berozgaro se pucho😓, humlogo ko appoint karlo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No I don't like my job.... I m just doing for my expenses....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I also want to resign \nNowadays it's every min there is burnout",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "True hero's and warriors your sacrifice will not be wasted",
            "polarity": 0.07499999999999998,
            "subjectivity": 0.325
        },
        {
            "body": "Rightly said work life balance is most important 👌",
            "polarity": 0.3952380952380952,
            "subjectivity": 0.6785714285714285
        },
        {
            "body": "Wuhan virus 👍🏽 brave mention",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "When you spend 3 hours a day commuting and 8 hours for hard working day where you have 30 mins for lunch and no any other break, constant stress and you back home unhappy ... Is it worth it? I quit and spend less money now. Pretty much i worked to spend a lot of money to make myself happy.",
            "polarity": 0.03666666666666669,
            "subjectivity": 0.45166666666666677
        },
        {
            "body": "I am seeing beautiful and exciting comments here it wonderful.",
            "polarity": 0.7166666666666667,
            "subjectivity": 0.9333333333333332
        },
        {
            "body": "Corona virus or Wuhan virus?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}