{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-05 21:02:33",
    "ups": "59940",
    "downs": "1684",
    "views": "2174307",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "This lady totally gets it! God bless her!",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Injustice evil laws against people.  This is the evil sign of the time in a society.  When justice returns people are happy. The present govt fails to see their own misery, pretending all is well to hell in blindness.",
            "polarity": -0.18333333333333335,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "My wife was asked why she wanted a different position at Citibank. She was honest and mentioned a few things including “work life balance” and the interviewer just frowned. This was around 2016 before all this. The biggest stress is the commute…45 minutes to an hour plus employers wanting people to stay late to change the font on a PowerPoint slide despite them knowing full well the employee needs to pick up their kids before 6pm. Anyway… Good video. 🙂👌🏻",
            "polarity": 0.19166666666666665,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "Alot of people don't want to be vaccinated",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Folks are resigning,  but going to work where they feel more fulfilled.  They're not unemployed. They are still working.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Because everyone wants us Vaccinated against our will",
            "polarity": 0.2,
            "subjectivity": 0.1
        },
        {
            "body": "Why did I resign?  There is no other way to stop supporting the government here.  I will look for opportunities as I enjoy working, but I have time, that is what saving allows.",
            "polarity": 0.23750000000000002,
            "subjectivity": 0.375
        },
        {
            "body": "Such an awesome report this is ✨\nMay all find the true purpose 🙏🏻✨",
            "polarity": 0.45,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "No truth is that so many peoples dont want to take technological industrial chemical injection । you are all liers who are hidding truth । you never told from last 2 years how many revolutions takes place in protesting against plandemic vaxin mask ।\nI tell you one day will come you have and must have to suffer consicuences of your lies you spoke everytime । may lord pardon you ।",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.35555555555555557
        },
        {
            "body": "Blood is thicker than water. Too much competition. Narcissism in the work place . Too much stress. Not worth the money for our mental health is priceless",
            "polarity": 0.22999999999999998,
            "subjectivity": 0.33999999999999997
        },
        {
            "body": "Yes I like",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Because they are unhappy and don't want to spend their life in a soulsucking place that steals from them and makes them a brainless robot.",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "body": "Keep your jobs",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What the pandemic did was to open peoples eyes...jajajajaja...\nWhere are we being directed to?\nI keep wondering.\nMachines are going to take over.\nIt's called new world order.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.4772727272727273
        },
        {
            "body": "If they Quitting ,why are you not Hiring then?? , All of them First Increasing the Competition just to quit . And People say Why unemployment Exists ?? This Whole Process is Messed Up.",
            "polarity": 0.225,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "It's about time this changes. Because we work to live and not live for work",
            "polarity": 0.03409090909090909,
            "subjectivity": 0.5
        },
        {
            "body": "The workers are saying kiss our asses..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"since the Wuhan virus struck\"....  !!!!!  This is straight out racism guys, didn't you notice it?",
            "polarity": 0.2,
            "subjectivity": 0.4
        }
    ]
}