{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-04 16:11:45",
    "ups": "56462",
    "downs": "1578",
    "views": "2009903",
    "top_comments": [
        {
            "comment": "People are waking up that they were trained since preschool to graduate school to be \"workers\", and that their god given rights were taken from them now sold back to them.\nHuman beings we're not created by the creator to be in slaved \"workers\"!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.05
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I am just here wondering if Nigerian employers would ever take this seriously.  It's like a jungle here. The mindset of most employers in Nigeria is that of a slave master. Most Nigerian employees have to work in a toxic environment because they don't have the option of quitting. Like who is going to support your family when you quit? Zero government intervention in social amenities, cost of everything is over 200% high, zero regulation on anything,  and nothing is ever coming down. This reality is the reason why Nigerian employers will not even consider this.",
            "polarity": 0.11740740740740742,
            "subjectivity": 0.42703703703703694
        },
        {
            "body": "Good stuff",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Thinks about karma. Racist and corrupt HR practices are going to suffer and pay because of how karma works. Who is laughing now?",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "People are quitting because the world is a rotting mess. 🤣",
            "polarity": -0.175,
            "subjectivity": 0.175
        },
        {
            "body": "Me also trying to move to rural village next year to stay away from pressures and tensions that my present job gave me with a low salary and no savings in the bank account but without  holiday ( except Sunday) the whole year.",
            "polarity": 0.04,
            "subjectivity": 0.13999999999999999
        },
        {
            "body": "A small pandemic woke employees up",
            "polarity": -0.25,
            "subjectivity": 0.4
        },
        {
            "body": "Ok very nice",
            "polarity": 0.64,
            "subjectivity": 0.75
        },
        {
            "body": "We socialize only online 😁",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Whatever you do, work at it with all your heart, as working for the Lord, not for human masters, since you know that you will receive an inheritance from the Lord as a reward.\n It is the Lord Christ you are serving.\nColossians 3:23-24\n\nNew International Version",
            "polarity": 0.04545454545454545,
            "subjectivity": 0.18484848484848485
        },
        {
            "body": "People are waking up that they were trained since preschool to graduate school to be \"workers\", and that their god given rights were taken from them now sold back to them.\nHuman beings we're not created by the creator to be in slaved \"workers\"!",
            "polarity": 0.0,
            "subjectivity": 0.05
        },
        {
            "body": "I quit working in June- UK This was partly due to ill health and caring a responsibility for my ASD daughter this clashed with work causing me too much anxiety and stress!",
            "polarity": -0.125,
            "subjectivity": 0.525
        },
        {
            "body": "LOL... She said Wuhan Virus.",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "After mentally torchering the employees in the name of WFH, I decided to rather work in a place where employees are treated as humans.",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "Happy diwali everybody",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "Very insightful report!",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "Excellent",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Honestly? I think people are just started in getting tired of living in big urban centers, the advertisement in the 90s was that is that it would be like \"Friends\" with hot mates and adventures, the reality is more like \"Joker\" living in the line of misery because everything is overprice and grind your sanity in broken society",
            "polarity": 0.07857142857142856,
            "subjectivity": 0.4928571428571429
        },
        {
            "body": "Check out the global Co-op Community Business plan, I think that's what everyone is saying.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}