{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-10-31 21:32:39",
    "ups": "35275",
    "downs": "945",
    "views": "1093959",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "One day our V.P. came to visit and was overheard say in a joking way \"who are we going to fire today\"?  Management doesn't care.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Slavery through low wages will soon be at an end",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "Why your ignoring mandates",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why are we quitting? Because of shit managers/businesses with shit pay. Pay us a minimum living wage and treat us like humans, not cogs in a machine, and then we won't quit. The pandemic showed the flaws and loopholes in U.S/Canada's current systems. Change it or the employment class will have the largest general strike in history.",
            "polarity": -0.0875,
            "subjectivity": 0.625
        },
        {
            "body": "NEW RESET BY DESIGN",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "I love the coverage. Just wished it was original. Most of the content I see here in many videos is copied from CNBC. I watch that everyday too, so it gets annoying when u watch a video on CNBC and after a few days, the exact same video is showed here, it happens way too much… She is a brilliant anchor, needs more original content.",
            "polarity": 0.225,
            "subjectivity": 0.5479166666666667
        },
        {
            "body": "Lower pay with longer hours while being treated like mongrels leads to misery.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "worldwide money crash",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am so happy to watch this video..palkhi speaks from her heart..",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "Most companies, especially Indians owners it's run 24/7, only those in the offices relax but we work 12/7....Thank God I quit...Thank you Sharma I love your end speech,keep on",
            "polarity": 0.25,
            "subjectivity": 0.775
        },
        {
            "body": "I agree you 💯 \nBut let me correct you, use a word COVID-19 ** not Wuhan Virus! If disease emerges from India ( since there’s high possibility due to population and pollution) we can’t call it Indian virus ok! Com on we are civilized people 21st century!\nRest: I agree with you 👍🏽 Job sucksss",
            "polarity": 0.21200000000000002,
            "subjectivity": 0.46299999999999997
        },
        {
            "body": "We havent seen are family due to pandemic in 3 years...then visa are cancelled..so money seems meaningless..",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "body": "It's not really rocket science. What any humane person wants. Those that say they don't know are just in denial, corrupt or sadly just don't care. For decades humanity a segment that is treated like cattle. I guess the inhumane thought it was going to last forever while they sip champagne, drive their cars and maneuver their boats.  Very simple treat others as you would like to be treated. Unite for humanity. All humanity.",
            "polarity": -0.2571428571428572,
            "subjectivity": 0.5329931972789116
        },
        {
            "body": "Well you didn't do full research, another major reason which all nations also need to fix is enabling people to work from any part of the world, or if you want family to move with you...your parents are included as part of family...",
            "polarity": 0.20625,
            "subjectivity": 0.525
        },
        {
            "body": "These days companies create narratives to influence government decisions and bailouts etc.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I want stop my job cus fad up standing long hrs cus they can’t provide us where to site down   In a long term of course it’s very dangerous for our  health",
            "polarity": -0.2588888888888889,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "We initiated these things years ago, most of our associates have been with the company for 20-30 years.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "I quit because of abusive work culture...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Is it merely coincidence that all these resignations are setting people up to embrace Universal Basic Income in near future? All the medical/nursing and other firings and lay-offs under the auspices of \"safety\" here in N America are setting people up to accept exactly the same thing. Incremental steps toward communism.The CCP have done their planning well...",
            "polarity": -0.034375,
            "subjectivity": 0.2375
        },
        {
            "body": "Life needs to happen in a joyful and balanced manner - simply sitting in artificial settings like offices is like taking paracetamol everyday. We need to be in contact with the five elements of the planet and do what’s needed in the community- not create more and more business . It’s time we focus on the wellbeing of all living beings 🙏🏼💛🙏🏼",
            "polarity": 0.039999999999999994,
            "subjectivity": 0.5914285714285714
        }
    ]
}