{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-10-31 09:11:37",
    "ups": "24840",
    "downs": "606",
    "views": "629524",
    "top_comments": [
        {
            "comment": "The importance of Mexicans",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "sanatani concept is reviving.sanatani  philosophy says have material how much u need,consume how much u want ,\n the less   materialism u have, the more u will  b happier.,\nmaterialism is nt the source of happiness bt 2 transdent the materialism is",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2866666666666667,
            "subjectivity": 0.23333333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "In india exploitation, unlimited working hours and mental torture make people to quit their job",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "I  m nt ready 2 send my children abroad 4 money on which idea my friends nd  relatives laughing at me.",
            "polarity": 0.2,
            "subjectivity": 0.5
        },
        {
            "body": "As long as you do not rely on public money handouts, then I agree with this.",
            "polarity": -0.025,
            "subjectivity": 0.23333333333333334
        },
        {
            "body": "I live in the US, and because of employee shortages I currently work 70-80 hours a week! I’m exhausted and have little to NO PERSONAL LIFE. I’m burnt out… I’m one of many seeking to switch jobs.",
            "polarity": 0.00814393939393939,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "Today main reason to quit job,\n\nStock and crypto trading.\nBusiness and startup.\nAnd Main reason u didn't mention that is huge voluntary resignation in IT industry",
            "polarity": 0.24444444444444446,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "The importance of Mexicans",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Because of these fascist VAX mandates...!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The recent past taught people that, no matter how much one gives to their job, or how much one is willing to tolerate, they can lose everything anyway. They can lose it to employer fiat, or to outside forces (such as the pandemic). People will no longer give and accept when they could lose everything anyway.",
            "polarity": 0.05714285714285715,
            "subjectivity": 0.31428571428571433
        },
        {
            "body": "1. Non toxic work environment\n2. Less politics\n3. Innovative and \"better\" work culture\n4. Pay pay pay\n5. Appreciation where it's most deserving",
            "polarity": 0.3866666666666667,
            "subjectivity": 0.5733333333333333
        },
        {
            "body": "Mandates are killing jobs.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "v-mandate mostly",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "sanatani concept is reviving.sanatani  philosophy says have material how much u need,consume how much u want ,\n the less   materialism u have, the more u will  b happier.,\nmaterialism is nt the source of happiness bt 2 transdent the materialism is",
            "polarity": 0.2866666666666667,
            "subjectivity": 0.23333333333333334
        },
        {
            "body": "why? because success in business lies in hiring people from your family or your colour, caste, religion, language and also diet",
            "polarity": 0.3,
            "subjectivity": 0.0
        },
        {
            "body": "Lock down n work from home was the game changer. My husband is comfortable with work from home, so v shifted to our native place last year. 2 months ago the company asked to return to work from office. My husband has asked to relieve him immediately saying he is not willing to return back. The company has asked him to continue till november last. My husband made this decision to quit bcoz inspite of him working so hard always a non-performer is rewarded based on the biased opinion of the manager. He silently tolerated this for 5 years and now he hates to return back to c the biased attitude  of the manager. He is eagerly waiting for the day his company will relieve him. For the first time its the other way around, his manager is requesting him to continue. Unimaginable.",
            "polarity": -0.03726851851851851,
            "subjectivity": 0.3101851851851852
        },
        {
            "body": "Thank you Shiba coin",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Whether you make it or not all depends on you.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "when are you resigning?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This concept TCS don't even bother.... TCS is client centric company... Not employees centric for which 20 Percent attrition rate increases.... It will continue cz they don't increase their salary... The Great Resignation is implied for TCS",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.31666666666666665
        },
        {
            "body": "I am working with one of the top financial firm. I reach home by 10pm working hour is like 9:30-10pm I don't see anyone at home 😂... Going to home is like going to a hotel for sleeping...",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.3
        },
        {
            "body": "Over smart and foul planners who brushed away employees concerns and that virus called Idiocity spread across industries and during this pandemic citing less demand, Laid off people they overburdened the limited workforce hoping people will come back begging for jobs but that lost sense of Loyalty didn't bring people back...so the foul planners/dumb strategists should be fired for better future of companies",
            "polarity": 0.06802721088435373,
            "subjectivity": 0.22534013605442177
        }
    ]
}