{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-04 07:57:41",
    "ups": "55274",
    "downs": "1558",
    "views": "1954808",
    "top_comments": [
        {
            "comment": "My advice to everyone is to invest in bitcoin now,  bitcoin is $62k it meant hit $70k soon",
            "likes": 1,
            "number_of_replies": 13,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "100 % correct, work/life balance is a huge problem! I'd rather be at home. Im too old to be doing what I'm doing. I love my actual work, but the technology, and overly hectic, rushing around, excessive training requirements make me ill from stress which takes away from the enjoyment of my actual work. I looked forward to getting back to work, but it's a parttime job that's taking over my life. I'll probably be one of the next ones to resign. The little money isn't worth my physical and emotional health. Companies and corporations with their ridiculous compliance standards need to lighten the hell up before they lose everyone who wants to work. I'm too old to be unhappy!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.018872549019607835,
            "subjectivity": 0.44075630252100845
        },
        {
            "comment": "Life is very short",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.39
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "wtf 95%",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Is Facebook (Meta) listening",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "My advice to everyone is to invest in bitcoin now,  bitcoin is $62k it meant hit $70k soon",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Does she read out this content or is it by rote?  But whatever it is.  She's brilliant.  Whatever be the topic she's so convincing.",
            "polarity": 0.7,
            "subjectivity": 1.0
        },
        {
            "body": "100 % correct, work/life balance is a huge problem! I'd rather be at home. Im too old to be doing what I'm doing. I love my actual work, but the technology, and overly hectic, rushing around, excessive training requirements make me ill from stress which takes away from the enjoyment of my actual work. I looked forward to getting back to work, but it's a parttime job that's taking over my life. I'll probably be one of the next ones to resign. The little money isn't worth my physical and emotional health. Companies and corporations with their ridiculous compliance standards need to lighten the hell up before they lose everyone who wants to work. I'm too old to be unhappy!",
            "polarity": -0.018872549019607835,
            "subjectivity": 0.44075630252100845
        },
        {
            "body": "For now the new trend will work. But no condition or situation is parmanent. There will a day when people will start taking advantage of the companies. Which will again lead to situation/ imbalance. It's a cycle. People will again change their way",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Paycheck is only piece of paper, why running too much behind it. As of now Pandemic taught us life , freedom and able to express is what makes us happy as human. No need of job until you are old age and another drama  named retirement party, which is basically expelling one after expirey of his resources.  This job is Modern slavery.👍🦄",
            "polarity": 0.17142857142857143,
            "subjectivity": 0.5607142857142857
        },
        {
            "body": "Atleast now big people are kicked by poor , now the rich will suffer the shock of it. Just wait many big surprise are waiting for the stubbornnes.",
            "polarity": 0.095,
            "subjectivity": 0.41
        },
        {
            "body": "Too much of expectations from Employers is not good at all. Atleast these followings decent expectations from employer is healthy expectations \n1. Good salary and bonus.\n2. Eight hours working hours \n3. 5 days working .\n4. Strong HR Policy.",
            "polarity": 0.275,
            "subjectivity": 0.55
        },
        {
            "body": "This is the greatest news channel 🔥🙏",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I am Civil Engineer,  I don't like my job. I am quitting my job",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What's the solution or any ideas slove the problems?  You're  just making the whole word ven worse.",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "body": "disagree, the elephant in the room is FORCED VAX",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.2
        },
        {
            "body": "Life is very short",
            "polarity": 0.0,
            "subjectivity": 0.39
        },
        {
            "body": "I don’t think it has any impact as job openings are less and they are more language oriented. It’s great Cost reduction rather than rejection.",
            "polarity": 0.37777777777777777,
            "subjectivity": 0.4388888888888889
        },
        {
            "body": "Are we still calling it Wuhan virus??!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Employers also need to address the huge salary gaps between Executive Management and all other employees.",
            "polarity": 0.13750000000000004,
            "subjectivity": 0.6375
        },
        {
            "body": "Many who couldn't work during covid, realised the hours, locations and type of work they were doing wasn't that fulfilling or necessary. Though some didn't want to be home at first, I think many people eventually found out they enjoyed it! And could do the exact same jobs at home with far less stress and effort!\n\nThat makes them angry for being a slave to the hamster wheel and realise they can save time and money from not travelling to a location they don't even like and doing strict hours when they'd rather be flexible. \n\nWork and life balance is probably more obvious now. People staying home with their children for the first time in their lives realise what they missed out on and how valuable they really are to their family and the upside of time together. \n\nA job is disposable, but people are not. Once the job is gone no one at work misses you. But when you're gone it is your family who miss you. Well they may stop missing you and give up eventually if you never come back to spend that time with them and put work first all the time.",
            "polarity": 0.1480392156862745,
            "subjectivity": 0.4348039215686274
        },
        {
            "body": "Its nothing, just people started understanding value of time.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Palki very well dressed\n...good content....\n\nNot just glittery lools",
            "polarity": 0.2,
            "subjectivity": 0.3
        }
    ]
}