{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-02 02:23:42",
    "ups": "44374",
    "downs": "1256",
    "views": "1506626",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Great topic..",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "No work no eating, vacationing, no home and there will be a broke country with no money I love this new movement and the mindless people.",
            "polarity": 0.14545454545454545,
            "subjectivity": 0.6515151515151515
        },
        {
            "body": "Any chance to get job there?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Man ! Is she good ? good wrighters  . . . team .Thaank Youu ! ! !",
            "polarity": 0.85,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "This video should be a compulsory training for C level execs as they dont seem to understand what is needed !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "UHHH probably because they’re being told to either get this vaccine or they’re fired. It’s not really resignation",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "In India employees are quitting jobs because of Owner attocities on employees \nGot my point?\nBecause of Covid jobs are very scarce in India and who are employees are treated like Thiers domestic servants .\nSalary has been deducted  duty hours has been increased ,extra job loads has been imposed \nIf you want to work it's ok \nOtherwise Be Off from here \nThis is the tendency of every employers now",
            "polarity": 0.175,
            "subjectivity": 0.25
        },
        {
            "body": "Americans are quitting their jobs in droves because of the vaccine mandates...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Are you sure they quit their jobs or were they forced to quit because of the vaccine?",
            "polarity": 0.09999999999999998,
            "subjectivity": 0.5444444444444444
        },
        {
            "body": "Thanks to those oppressive mandates I lost my job! And I really enjoyed that job!",
            "polarity": 0.4375,
            "subjectivity": 0.44999999999999996
        },
        {
            "body": "Yeah.. life is too short..enjoy it  to the fullest..the pandemic was the best thing that ever happened",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I am the one quit my Jan 20 after 24 years 8 more years to go. Now I am doing agriculture and online trading and feel very happy",
            "polarity": 0.75,
            "subjectivity": 0.75
        },
        {
            "body": "Solution is simple for companies. Just reduce the pay further.",
            "polarity": 0.0,
            "subjectivity": 0.4285714285714286
        },
        {
            "body": "The problem is the hard harsh boring jobs  have  decent if not good pay, nobody wants to be fixing figures on a computer for example, influencers job,opening a restaurants are what we want to do but they are risky and has an influx of others competing as well. how you balance your thought process is what makes a difference",
            "polarity": -0.24583333333333332,
            "subjectivity": 0.6013888888888889
        },
        {
            "body": "Wao I thought it was only in the usa",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Excellent reporting. Thank you",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Quit....Do nothing.....Eat beans the rest on your life!!!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I work for customer support and understood concepts of WFM, and I can tell you that based on our client's current contract with us, it's extremely difficult to maintain flexibility when a huge swarm of calls suddenly appear and we end up with a shortage and not enough agents to answer calls from customers.\n\nWe need as many agents to answer calls if we want to meet our clients' quota, or they will switch to a competitor who's willing to do better and they'll liquidate our account, leaving thousands of us unemployed.",
            "polarity": 0.14375000000000002,
            "subjectivity": 0.63125
        },
        {
            "body": "The heart of men there is riches/poor. Whom do you serve? In the veil of truth power has been unleash to mankind to be free from bondage and receive riches power and protection to add values in the society. The spirit lives in you discover it hear from the supernatural and open your soul to the veil. Illumiinati",
            "polarity": 0.18888888888888888,
            "subjectivity": 0.6222222222222222
        },
        {
            "body": "Only data from Western countries why not Eastern countries.",
            "polarity": 0.0,
            "subjectivity": 0.5
        }
    ]
}