{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-10-30 20:51:36",
    "ups": "13248",
    "downs": "257",
    "views": "283755",
    "top_comments": [
        {
            "comment": "*Investing in Crypto now is very cool now especially with the current rise in the market now*",
            "likes": 3,
            "number_of_replies": 1,
            "polarity": 0.15166666666666664,
            "subjectivity": 0.7483333333333334
        },
        {
            "comment": "Job is only to earn money... There is nothing to learn on how to live life happily and peacefully...\nIT sector is pathetic...",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.037272727272727305,
            "subjectivity": 0.8
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "No",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wow, awesome piece! Thanks so much for speaking for the common people, everywhere.",
            "polarity": 0.24,
            "subjectivity": 0.5800000000000001
        },
        {
            "body": "Everyone feels they have very little time left& even vaccinated people still fear getting covid!! I have never seen anything like it..",
            "polarity": -0.12187500000000001,
            "subjectivity": 0.325
        },
        {
            "body": "Shot, what shot.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "*Investing in Crypto now is very cool now especially with the current rise in the market now*",
            "polarity": 0.15166666666666664,
            "subjectivity": 0.7483333333333334
        },
        {
            "body": "Job is only to earn money... There is nothing to learn on how to live life happily and peacefully...\nIT sector is pathetic...",
            "polarity": 0.037272727272727305,
            "subjectivity": 0.8
        },
        {
            "body": "Britain has gone private the companies dont give a damn about workers they hire and fire on a daily basis the country doesnt care if you lose your job they say there are others who can take your place there no job satisfaction garanteed in UK they sack people even when they have been in the job 30 yes UK fire people like bullets there is too much friction in work places Britain has a high racist problem in work places and they say baggers cannot be chosers, even they have industrial tribunals the employers get away with lies one must remember Britain was and is a slave trading country. 👳‍♂️👨‍👩‍👧‍👧🤴👸🙊🙉🙈🎯🤪😠😡🥵🤬🥶☠💀👹🎅🤶🧞‍♀️",
            "polarity": 0.09,
            "subjectivity": 0.27874999999999994
        },
        {
            "body": "being fired for not being jabbed, and KIA from the jab.  because gates and fauci want it so.  AOC'S NEW GREEN DEAL IS ACTIVE AND IT S*CKS!\nBUT IT DOESN'T PAY THE BILLS................",
            "polarity": -0.07676767676767678,
            "subjectivity": 0.4515151515151515
        },
        {
            "body": "👏👏👏👏👍🏽",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Vaccine mandates could also the reason why a lot of people quitting their jobs ☺",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Many times my managers refused to allow me to work from home when I had the flu, they wouldn't allow me in the office too, that was before the pandemic, so I had to use both sick leave, annual leave and unpaid leave when sick or had to stay home with a sick toddler. Man, not only did they cut my salary but they would humiliate me for the number of unpaid leave days. Now I've been working remotely for 20 months and I do not have the intention to go back to the office ever again. I'd rather work longer hours from home than being away from my child or having to see those people every day.",
            "polarity": -0.14920634920634923,
            "subjectivity": 0.5634920634920636
        },
        {
            "body": "I work 75 hours a week.\nIf I work 40 hours I have to eat a cheese sandwich only\n\nIf I work 75 hours I can eat what I want to eat.\n\nFor me \nwork = food\nFood = survive\nQuitting = die",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "I quit because after working 50 plus hours a week the only persons getting more money was corporate executives,  while they were telling us work longer...but no getting a head for me  only the report to the shareholders and the executives.  My advice is keep away from franchises",
            "polarity": 0.125,
            "subjectivity": 0.625
        },
        {
            "body": "I have worked a bunch of different jobs . Because after a while you start to ask your self . This is insanity, to work 30 plus years to get a retirement plan  to pay for your funeral.",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "Very true 🙌",
            "polarity": 0.45499999999999996,
            "subjectivity": 0.8450000000000001
        },
        {
            "body": "Amazing. Thanks",
            "polarity": 0.4,
            "subjectivity": 0.55
        },
        {
            "body": "I dod already on last September 😀",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "People are tired of the rat race, they're tired of the exploitation by the rich",
            "polarity": -0.1416666666666667,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "for me I'm a single parents self-employed and I have quality time with my children I take them out for ice cream drop them to school and have fun time I don't need no full-time work and I am electrician",
            "polarity": 0.11428571428571428,
            "subjectivity": 0.20714285714285713
        }
    ]
}