{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-03 07:14:10",
    "ups": "51828",
    "downs": "1460",
    "views": "1798047",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "The great reset",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Well done 💯👍👏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Its the high time that each area should develop some or the other local business to provide earning so as one not to move towards big city and making the city over populated. Internet is easy accessible now compare to 10 years ago so online things can also be managed from remote location.",
            "polarity": 0.1061904761904762,
            "subjectivity": 0.3461904761904762
        },
        {
            "body": "I am not able to meet my little son who is at  Home and I am working far away with heavy leave restrictions. So I quit.",
            "polarity": -0.13437500000000002,
            "subjectivity": 0.65625
        },
        {
            "body": "this channel is begining to sound like fluff you get at cnn",
            "polarity": 0.15000000000000002,
            "subjectivity": 0.35
        },
        {
            "body": "Crypto bullrun of this cycle would end in March 22. Then???",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "A lot of people here specially  Indians are complaining about less pay and blah blah. Almost 70-80% of them didn't pay any wages to their maids/servants during the lockdown themselves. Always bargain aggresively with the vegetable/fruit vendor for every penny and then complain about companies not paying them enough!! Bunch of hippocrates. If you have excuses/reasons for your wrong doing then you have no right to blaim your employer for giving less hike than expected. Atleast they gave you hike even if it was 5% whereas you yourself didn't pay any to your maids/servants.",
            "polarity": -0.10272108843537416,
            "subjectivity": 0.4343537414965986
        },
        {
            "body": "Correct. Some person earning more than enough money by selling tea in remote place of Andhra .  If a few join hands they can make better for themselves like Chinese do..without narrow mentalities",
            "polarity": 0.07142857142857142,
            "subjectivity": 0.31428571428571433
        },
        {
            "body": "Facts about attrition in US:\n Due to the outbreak, bottomline for companies sunk. Because of which companies reduced the wages. People on daily wages were making less money than the unemployment benefits. So people decided to leave their job to sit at home to claim unemployment benefits. So that they make more money without having to work. This is for the short term. As the economy bounes back and bottomline improves. Companies will start offering better wages than unemployment benefits and those who left will join back. Funny how media is trying to paint the facts differently and giving false hopes to a disillusioned mass.",
            "polarity": 0.04652777777777778,
            "subjectivity": 0.3284722222222222
        },
        {
            "body": "Its about  time for corrupt corporations to get there head out of there ASS !!! THEY HAVE BEEN CHEATING working people out of there dignity. That time is over. Screw you that don't appreciate your employees that make you MILLIONS & BILLIONS in profits. And you degrade them not even a living wage. Your abuse is no longer acceptable.",
            "polarity": -0.9765625,
            "subjectivity": 1.0
        },
        {
            "body": "only the beautiful palki who will never leave her job.coz with her wion wont wion",
            "polarity": 0.425,
            "subjectivity": 1.0
        },
        {
            "body": "Crazy data",
            "polarity": -0.6,
            "subjectivity": 0.9
        },
        {
            "body": "No jab no job , I choose no job , democracy lives in the hearts of the free",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "My Q. is: as America does not have a welfare system to speak of are these ppl. willing to leave their jobs thru' self-funding. . how will they manage, or is this trend only a short term phenomenon?\nWhat I'm sensing from your words is that employers IE: the moneyed ppl. must now consider their workers not as possessions but as valued assets. \"Times they are a changing\" despite moneyed ppl.s' efforts to inhibit any changes.\nA thought I've often had is that if ppl. now do not have to work from offices and can do so effectively from home, won't that mean that much of the existing office spaces will no longer be required or economical to hold. These skyscrapers will now become somewhat obsolete, causing their values to plummet, if no one will rent these spaces do we implode the buildings as one Chinese construction company was forced to do or can we find a better use for them?\nIn the west and probably elsewhere, housing for ppl. is a major problem let alone quality housing, surely these structures could easily be refurbished/remodeled into affordable accommodations for the poorer ppl. I'm not talking about spacious apartments but affordable living quarters that allow ppl. the safety of NOT being destitute and on the streets. Even in western countries we now have a class of ppl. that are forced to live in danger on the streets due to ridiculously high rents.\nI wish I understood your name (maybe spell it for us) but I think you present what you say very effectively (apart from your name 🤣) Your message is clear and concise congratulations!",
            "polarity": 0.14134986225895319,
            "subjectivity": 0.5071843434343434
        },
        {
            "body": "When common sense is not common anymore in our work place",
            "polarity": -0.075,
            "subjectivity": 0.5
        },
        {
            "body": "Tokyo Rose.",
            "polarity": 0.6,
            "subjectivity": 0.95
        },
        {
            "body": "Pulky Sharma this is the video of yours I like most",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Toxic culture and living life Saturday to Saturday are the main issues!",
            "polarity": 0.20833333333333331,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "1.4 K Employers disliked the video",
            "polarity": -0.2,
            "subjectivity": 0.6
        },
        {
            "body": "I’m quoting mine in 3 weeks time when vaccines become mandatory on the 1st of December. And so are alotta my mates if they haven’t already. Maaaasive experience and skill shortage come December. Freakin idiots. Good luck without us.",
            "polarity": -0.050000000000000044,
            "subjectivity": 0.7000000000000001
        }
    ]
}