{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-03 15:28:36",
    "ups": "53229",
    "downs": "1490",
    "views": "1859206",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Are u quiting /resigning from ur job Palki Madam? ........ If not why a different approach from the discussed resignation  boom ?... Your own answer may throw more light on the subject",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.6266666666666667
        },
        {
            "body": "Nonsense. 95% of Americans are definitely not resigning.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "People finally saw da big pic,, they realize the     game is rigged. 🤣🤣",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "People are quitting because they want to self explore ,in terms of work also",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I too am trapped in my profession, just that I can't runaway from it...being a doctor.",
            "polarity": -0.2,
            "subjectivity": 0.0
        },
        {
            "body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wonderful news",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Excellent । quit। surviving just require very few things. I m planning. Good news, really good",
            "polarity": 0.5349999999999999,
            "subjectivity": 0.5825
        },
        {
            "body": "Wage garnishments.  Bosses who come from American Academia where they’ve never worked hard. Workplace rules including masks.  Corrupt judges issuing wage garnishments after taking bribes from debt collectors.  high gas prices.  Long commutes.  Lack of rewards.  Workplace scams like workers comp, medical savings accounts which you pay into and are robed by your employers.  Corrupt municipalities that pull over non-resident workers and write tickets. Safe lifting technique and other government regulations to harass workers.",
            "polarity": -0.08962962962962963,
            "subjectivity": 0.48407407407407405
        },
        {
            "body": "Well said. Excellent video",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I quit my job 9 years ago. And whats happening right now is something i can relate",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "why doesn't gravitas stop copying cnbc",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well said! 👏🏻👏🏻",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "A refreshing perspective on an ongoing, clearly overlooked transitionary period - affecting the whole world.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "Thanks for enlightenment",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "This will go on for a while.  Once these spoiled idealists that think someone owes them a living realize that the supply chain will end if no one goes to work, then what.\nThe government only has money to pay benefits if people are working and paying taxes.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Thanks for sharing truth to the world. \n I leave you with this peace of info with the permission of the United States lower case . Clerk of the the United States lower case Tammy be well",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Awesome content ,fit for present scenario. Self skilled people will quit but those who cannot stand on own self will abide by all rigid rules also .\nDays are not far away to demand pay for hours.Experts can earn easily   in this high tech world even from home.Only freshers may search job anywhere. Freedom is costlier than millions of currencies.Thanks for sharing this.🌟🙏",
            "polarity": 0.38041666666666674,
            "subjectivity": 0.6591666666666667
        }
    ]
}