{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-05 08:40:32",
    "ups": "58361",
    "downs": "1638",
    "views": "2098862",
    "top_comments": [
        {
            "comment": "Great analysis! Yes, I personally think companies should allow their employees to work from home (if it's possible). I love working like this, and I don't have to waste time and money on commuting.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.26,
            "subjectivity": 0.53
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "So many people are resigning these days so I thought I would do the same I resign from the world",
            "polarity": 0.25,
            "subjectivity": 0.3125
        },
        {
            "body": "Change the work policies. This should be recognised by the Govt.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It’s an interesting phenomenon",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "It’s an interesting phenomenon",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Why most quit. Innovation is hardly there in most of the work place. We human beings are genetically designed to excel..now a days it is hardly there in most of the work place.",
            "polarity": 0.15277777777777776,
            "subjectivity": 0.4472222222222222
        },
        {
            "body": "A great summary Ms...",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Yes, if possible I would like to quit job and do some thing from home.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "God bless. Zen mode.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks this is true 👍",
            "polarity": 0.275,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "I love todays job market I was fired from my job after 25 years but ended up hired on the spot for the companies competitor. I had a few other job offers but I was able to tell them that I would give them a call if I was interested, used to it was the other way around, the company would tell me they would give me a call if they were interested. No job is perfect but these days seem like the golden opportunity to get a job.",
            "polarity": 0.24499999999999997,
            "subjectivity": 0.4575
        },
        {
            "body": "Is Wion Hiring?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Great analysis! Yes, I personally think companies should allow their employees to work from home (if it's possible). I love working like this, and I don't have to waste time and money on commuting.",
            "polarity": 0.26,
            "subjectivity": 0.53
        },
        {
            "body": "Many people are quitting the working industries because they are self unfulfilled, unhappy and felt miss-used without appreciation for jobs well done. People are awakened and are taking their power back that had being stolen from them for so long by corporations everywhere. I applause the great awakened of mankind from be enslaved to jobs and materialism and neglected themselves for so long. Congratulations to all, my beautiful human race for waking up. It is time, this is your time to shine, raise up and take your power back. You are the light, you are the love, you are the truth, you are divine, you are! Your time is here NOW! God Bless. And so it is.",
            "polarity": 0.23920454545454548,
            "subjectivity": 0.48636363636363633
        },
        {
            "body": "people are leaving their jobs because of the experimental vaccine mandates",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "There will be shortage of food and shortage of other things.we are going back to the stone age.",
            "polarity": -0.0625,
            "subjectivity": 0.1875
        },
        {
            "body": "Wonderful insights. Thanks for the larger and bigger perspective.",
            "polarity": 0.3,
            "subjectivity": 0.55
        },
        {
            "body": "We want school revolt to school slaves",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I've quit 4 jobs during this period. 🤣🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Good job palki!...",
            "polarity": 0.875,
            "subjectivity": 0.6000000000000001
        }
    ]
}