{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-03 03:06:56",
    "ups": "50902",
    "downs": "1433",
    "views": "1768085",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Waiting to get job to quit 😟.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please do not use the wording \"Wuhan Virus\". It is Covid 19. Please leave politic aside",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I hope you don’t quit",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Reimagine work, Reimagine office culture, Reimagine Leadership. Flexibility is key.  Companies should not always think India as low paying country and offload 100% work to offshore  Make on-site fully free.",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "This is a very good report, but can you stop using these canned copyright free videos in between. They look stupid, just focus on the anchor or the statistics",
            "polarity": 0.17000000000000004,
            "subjectivity": 0.86
        },
        {
            "body": "They're quitting because of the authoritarian vaccine mandates, and rightly so",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "I'm not sure who is paying their bills...if I don't work we don't eat",
            "polarity": -0.25,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "I was so important in the warehouse. My supervisor offered me bj on my 15 break so she did not have to stay past midnight. Found out she offered this to 4 other guys. So i made her brush her teeth first since i was the night shift guy lol.",
            "polarity": 0.21500000000000002,
            "subjectivity": 0.5316666666666666
        },
        {
            "body": "It is because the coronavirus is still there. Governments haven't been able to handle it perfectly. That's the reason not everyone can just walk around wherever without fear of catching coronavirus or a variant of it!",
            "polarity": 0.75,
            "subjectivity": 0.8416666666666667
        },
        {
            "body": "I myself have been trying to get out of my 63 hour week job since the pandemic. When being interviewed, I explain to them the reason for quitting my current job is for me to have a work-life balance, they straight away reject me. Maybe companies still need people who flog themselves to work for long hours, maybe there's something lacking in me too. But as far as I know, smaller manufacturing sectors never pay attention to their employee's health (be it mental or physical). All they need is their system to go on as they want to. They need to understand that working for long hours wouldn't increase one's productivity, but instead decrease their ability to compete in the fast paced technological world.",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.44920634920634916
        },
        {
            "body": "why u are bothered.fakr news. people are leaving for better opportunities.ejy don't u mind u f..lng business",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Workers are quiting because the jobs suck and they feel hopeless. Just look at people walking around in pajamas all day.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love this.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "\"we\" are for US, not india. She forgets she is in india",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is good but the global economy is going to crash harder than the Great Depression in the next 4 years",
            "polarity": 0.27999999999999997,
            "subjectivity": 0.27
        },
        {
            "body": "A lot of companies that are losing employees are not career type positions. Most are stepping stone types of jobs like fast food restaurants. Not all but many. It's just too expensive to live in the developed world with all the corporate and government greed skimming profits any which way they can. Everyone in the household needs to work just to skim by.",
            "polarity": 0.13376623376623376,
            "subjectivity": 0.4428571428571428
        },
        {
            "body": "Something strange is going on here. You can't quit your job and collect unemployment, they won't pay you. So what do they do for income? Why are the cargo ships not being unloaded for real? \" Motha truckers\"say there is no trucker storage. How much of what she said is actually true? Worldwide quiting? Why the plandemic? Who's really behind defunding police?  Why all the racial confrontations & rioting BLM? Pitting us against each other. Abolish 2nd amendment? Why all of this at once? A lot has happened in the past 2 yrs I'm not a conspiracy theorist but It just seems like we're being played.. Once you're dependant on the government or any  entity they then control the dice. Personally, i feel the endplay is control. Here' a thought: how do you know for sure people are quiting their jobs internationally for real. No way to confirm it. All we have is the news telling us this.",
            "polarity": 0.052083333333333336,
            "subjectivity": 0.34282407407407406
        },
        {
            "body": "Only have a sister left everyone else passed away 😔.",
            "polarity": 0.0,
            "subjectivity": 0.5
        }
    ]
}