{
    "time_posted": "2021-10-30 14:32:09",
    "url": "https://www.youtube.com/watch?v=pOphIpddRAk",
    "time_now": "2021-11-01 09:54:03",
    "ups": "39864",
    "downs": "1127",
    "views": "1305489",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Forced vaccinations is why. Stop with the BS",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.2
        },
        {
            "body": "Don' t worry, there are enough poor people in the world to exploit. India setting the example.",
            "polarity": -0.2,
            "subjectivity": 0.55
        },
        {
            "body": "When they open up they forced employees to do double job at the same pay",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.20625
        },
        {
            "body": "If Many people are turning their hobbies in to full time job then it's great news for economy .... what's wrong in that companies should not worry about it ...and it's need guts and patience to build a company today they are quitting job and opening companies with some of save money but how many of them successfully make it big ... these people see instagram post and decide to do things when they face real problems how many of them sustain ...if all do sustain its great ... companies cannot allow people to do 3 hr job and take full day salary ...or a week's  salary .... if govt cuts unemployment money then their real strength is tested.... if their real will was to open a company they would have taken that risk first only ... they want to live billionaire life but without work and free...",
            "polarity": 0.3020202020202021,
            "subjectivity": 0.5601851851851851
        },
        {
            "body": "No one is quitting. They being forced to quit due to fascism and no freedom of choice from vaccine mandates.",
            "polarity": -0.21250000000000002,
            "subjectivity": 0.2875
        },
        {
            "body": "\"Four days a week is better\" options \n For working. 👍",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Her sequence is\n\nSpeak 5 word\nStop\nAgain speak 5 word\nStop\nAgain speak 5 word\nStop \n\nAnd so on\n😂😂😂😂😂😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There sick of the governent a is sing there rivhts all the time it’s no longer a employer market",
            "polarity": -0.7142857142857143,
            "subjectivity": 0.8571428571428571
        },
        {
            "body": "This news is just woww",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They want to make a good pay not working 80 hours a week spend time with there familly",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Many decided to follow god advice it’s way better then Biden’s",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "First of all if some one wants to quit its their decision... if some one wants to do freelancing it's their will and courage ... if people want to spend time with family it's their life ... people cannot blame company for their quitting or selecting their own process... if they want job they need to do as per laws of company if they don't want well they are free to choose their job or open themselves a company .... today they ask 4 job tomorrow they ask  1 hour job higher salary and time to spend with family without work... and some times companies have some confidential data they cannot allow work from home ... or may be some other reason ... it's a free world people can choose their own life ....",
            "polarity": 0.27749999999999997,
            "subjectivity": 0.5508333333333333
        },
        {
            "body": "Thank you Vv much wion",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "The democrats want you to quit. So they can put those illegals to work. But Biden wants to give them all 450 thousand to each illegal. Try and figure this stupid angle  out!",
            "polarity": -0.4333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Soo happy to see this 🫂. Happiness is something that we must rediscover",
            "polarity": 0.75,
            "subjectivity": 0.6
        },
        {
            "body": "Palki is great and cute we are all sitting at home watching entire world with wion",
            "polarity": 0.43333333333333335,
            "subjectivity": 0.7916666666666666
        },
        {
            "body": "seems you're not in support of people switching and trying new career path out of orthodox mundane work life carried since ages.",
            "polarity": -0.07676767676767678,
            "subjectivity": 0.4070707070707071
        },
        {
            "body": "Really?\nHard to believe!!!",
            "polarity": -0.5696614583333335,
            "subjectivity": 0.5416666666666666
        },
        {
            "body": "Once companies are owned by one family or set of investors for longer time now investors just switch every 10 years or less and make changes (cost cuts, firing, high work stress in the name of productivity) for short term benefits. There is no belongingness from management how can they expect it from employers.",
            "polarity": -0.002222222222222218,
            "subjectivity": 0.30222222222222217
        },
        {
            "body": "Working from the native place is the most important thing for me..\n\nYou have your base at your home town, you not need to invest in home, vehicles etc. Otherwise you are just paying EMI's.\n\nI started job for fun. Now i stuck in job because i have to pay EMIs for a lot of things.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.675
        }
    ]
}