{
    "time_posted": "2021-10-30 13:28:25",
    "url": "https://www.youtube.com/watch?v=qyLNCp8WnJ0",
    "time_now": "2021-10-30 16:46:13",
    "ups": "1457",
    "downs": "44",
    "views": "16709",
    "top_comments": [
        {
            "comment": "Bobby, I have really been missing your \"cook with me\" videos. Would love, love, love a Bobby approved Thanksgiving step-by-step planning, shopping and cooking, and serving video!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.325,
            "subjectivity": 0.41
        },
        {
            "comment": "Carnuba wax in Welch’s ? Car wax !",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I like to have my sardines on pork rinds with guacamole.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We love the Raos Sauce, thanks for the recommendation! Weren't you living here in Chicago before? Thanks for all the tips and keep up the great work!\nGale :)",
            "polarity": 0.49000000000000005,
            "subjectivity": 0.55
        },
        {
            "body": "Same rehashed video as las costco video.",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Visto immagini della Florida che bella e la vostra casa nuova molto bella, grande e luminosa. Bella la cucina più grande. Io adoro il legno e la luce e lo spazio nella casa. 👋",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Laird creamer is sold in all Hawaii Costco",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bello natale",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Per cucinare bene giustamente ci vogliono anche prodotti buoni. Ciao Bobby",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Siete già in Florida? Buona serata da Cinzia da Roma. Abbraccio a Rose 🤗",
            "polarity": 0.6,
            "subjectivity": 0.95
        },
        {
            "body": "This is why everything is always sold out 😒",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "LOVE Raos, buy it at Costco here in Washington (state).",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Bobby, I have really been missing your \"cook with me\" videos. Would love, love, love a Bobby approved Thanksgiving step-by-step planning, shopping and cooking, and serving video!",
            "polarity": 0.325,
            "subjectivity": 0.41
        },
        {
            "body": "Do you have a printable list of healthier items we should be buying & which suits are the best places to get them?",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Is it possible to list all the approved items on your website?  Would be nice to do a quick lookup, find new things to buy, and cross shopping between stores?  Thanks",
            "polarity": 0.21161616161616162,
            "subjectivity": 0.5257575757575758
        },
        {
            "body": "Bobby gets way too overboard with preservatives and neglects the harmfulness of sugar.  Organic California raisins have a lot of fructose sugar that only the liver can metabolize, and chronic fructose consumption forces the liver to convert it into fat around itself and other organs AKA NAFLD (Non alcoholic fatty liver disease).  Don’t eat any high sugar fruit!",
            "polarity": -0.10416666666666667,
            "subjectivity": 0.49416666666666664
        },
        {
            "body": "Thank you for sharing all your knowledge. I have learnt so much about sugars and oils. I do not have most of the stores you shop. But have found on line. Laird super foods is amazing. Use a lot of there products. I can’t have salt because of heart issues. Also high blood pressure.",
            "polarity": 0.35866666666666663,
            "subjectivity": 0.5613333333333334
        },
        {
            "body": "Hey Bobby, can you do a video on your journey towards your home becoming toxic free and list your products.?",
            "polarity": 0.42500000000000004,
            "subjectivity": 0.8250000000000001
        },
        {
            "body": "Carnuba wax in Welch’s ? Car wax !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Rao’s is available here in California’s Bay Area.",
            "polarity": 0.4,
            "subjectivity": 0.4
        },
        {
            "body": "North Pacific is safe for eating fish caught there?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Business man so what quit being a hater",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}