{
    "time_posted": "2021-10-30 13:28:25",
    "url": "https://www.youtube.com/watch?v=qyLNCp8WnJ0",
    "time_now": "2021-10-30 20:51:55",
    "ups": "2275",
    "downs": "67",
    "views": "36278",
    "top_comments": [
        {
            "comment": "We have had Rao's here in Santa Cruz, Ca, for years now. My son loves it. He often makes himself a bowl of spaghetti for a snack. We also get the Garofalo organic pasta, only ingredient is organic durum wheat semolina. Good stuff!",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.4375,
            "subjectivity": 0.8
        },
        {
            "comment": "I would like to know what to buy at Bj for low carb high protein. I'm a diabetic",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.08,
            "subjectivity": 0.41999999999999993
        },
        {
            "comment": "I love no mask. Mask dont work. 😁",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.6
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "We have Rao's here in Southern Maryland and have been purchasing it for a while...just used the last jar so tomorrow is my turn at Costco.",
            "polarity": 0.0,
            "subjectivity": 0.03333333333333333
        },
        {
            "body": "We have Rao’s here in San Antonio, TX.  I just picked some up too.  It is so good.",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "What about the Youtheory Turmeric supplements that are on sale for $8 off. Is there anything wrong with this brand. I e been buying these from Costco for years.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "Videolarda Türkçe alt yazı olsa keşke\nGüzel kızınızla olan videolarınızı çok beğeniyorum çok tatlı bir kız ona benden selam söyleyin.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Rao’s marinara sauce  is on sale at Costco in CA it is so much better than the Kirkland and other brands",
            "polarity": 0.1875,
            "subjectivity": 0.4375
        },
        {
            "body": "Bummer! I just went today and no sale on rao's!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love no mask. Mask dont work. 😁",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "HELP!!! 77 yr old female , not overweight at all. Just recently hit type 2. Really scary. I never ate lot of sweets!  So many different answers on what to eat. Very confusing!!",
            "polarity": -0.090625,
            "subjectivity": 0.4623809523809524
        },
        {
            "body": "Costcooo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Can you give us vegetarian pasta ideas with raos sauce!? Sending much love from Detroit!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Communist mentality:\nCollusion between PCSO and Costco\nPetition for Restraining Orders\n\nAssailant:\nL.D.\n\nCostco Employees:\nBradley P.\nRosina Y.\nBrianna D.\nSergio L.\n\n\nA Costco customer, Larry D. (Respondent), was annoyed by another customer, N. V., and after initiating an argument with Mr. V. assaulted him by unlawfully detaining him and striking him several times in the face with a closed fist.\n\nThe assault caused a large lump on Mr. V.'s forehead and abrasions on his arm. Photos were taken of these injuries.\n\nHad Mr. V. not escaped and indeed succumbed to Mr. D.'s punches and required medical attention and/or a Coroner, their false narrative would have had to be different. \n\nThe barrage of punches ceased only after Mr. V.'s shirt ripped and he was released from Mr. D.'s custody and continuing assault. \n\nNo assistance from bystanders, including the so-called witnesses who happened to be Costco employees, was provided during and after the assault. \n\nThe only statement from a Costco employee to Mr. V. at the time was that it was Mr. V.'s own fault he was beaten to the ground.This inferred to Mr. V. that the beating he received, despite rule of law, was perceived as an appropriate response to a verbal argument and the \nreports to police will be biased. \n\nThe Costco employees then proceeded to assist Mr. D. with any fist and emotional injury he may have incurred while ignoring the actual injuries and actual exacerbation of emotional conditions Mr. V. suffered. Mr. V. then left to address his injuries.\n\nThe injuries were later shown to police, who asked him if he went to a hospital for treatment of his injuries consisting of a lump on the forehead and abrasions on the arm from being struck repeatedly and falling to the concrete floor outside the entrance to Costco. Mr. V. declined to visit a hospital for an injury that was minor compared to ones he received in the past.\n\nCostco employees lied and told police Mr. V. was pushed into a wall and received injuries inconsistent with those of a face hitting a brick wall. The lie about the wall could be misconstrued as a typical witness' perception error were it not for it being in consensus with other so-called witnesses. \"Plausible Deniability\" is less in effect when witnesses report the same lie to police. \n\nMr. V. was not concerned with injuries enough to warrant a visit to the hospital. He only wanted go home to his family. Now these five people want to keep Mr. V. away from his\nfamily through incarceration. \n\nMr. V. is not an adherent to \"Conspiracy Theories\". However, four Costco employees and customer Mr. D. actually did conspire to prevent Mr. D. from being held accountable for physically assaulting a disabled US Marine who had no desire to protect himself by\ncausing injuries or worse to his assailant.\n\nConclusion:\nLarry D. already demonstrated his propensity for physical violence by repeatedly assaulting Mr. V.. \n\nLarry D. has shown his flippant attitude for rule of law by posing as a weeping model citizen in order to lay a foundation for his credibility lying to the police. \n\nThis deception towards authorities by concealing his assault on Mr. V. and modifying the incident just enough to have Mr. V. incarcerated for any amount of time was done with the assistance of the aforementioned Costco employees. \n\nCostco employees violated Mr. V.'s civil rights the week before when they refused to accommodate Mr. V.'s disabilities as required by Federal Laws, particularly the American's with Disabilities Act. Instead of directing him to an office where alternate accomodations can be discussed, at least three masked Costco employees surrounded him and, \ndespite federal laws preventing discrimination, escorted him off the premises while maintaining \"Social Distancing\" outside the store. \n\nIt was not bad enough that they treated Mr. V. like a criminal, but they followed him to his wife's car and recorded the vehicle tag while his wife was in the car waiting for him. She did not appreciate being treated like a criminal as well. \n\nIt is a shame that Costco's customer service training did not involve talking with customers instead of resorting to tieing up 911 emergency lines for customer relations disputes.\n\nMr. V. never intended to having Mr. D. charged with anything. He simply wanted to forget about the whole incident and chalk it up to experience.\n\nBut apparently the assault by Larry D. and subsequent damage to Mr. V.'s body and property was not enough retribution to satisfy Mr. D. for being annoyed. Mr. D. apparently needed to \nhide his assault on Mr. V. and trump up charges against Mr. V. to the extent that he and several Costco employees were willing to commit felonies to divert the blame and accountability from himself and have Mr. V. incarcerated for a misdemeanor. \n\nMr. D. lied to police in such a manner that when the police later pulled Mr. V. over while he was driving home, he was not permitted by police to tell his side of the story without reading him his rights. He was also told that charges were pending. \n\nMr. D. refused to sign a statement to police for obvious reasons. \n\nThe Costco employees provided signed statements with the exact same false narrative and total omission of the assault on Mr. V.. This lead Mr. V. to suspect collusion amongst Mr. D., the Costco",
            "polarity": 0.0008881330309901689,
            "subjectivity": 0.3885676492819351
        },
        {
            "body": "I have had health problems and your helping me both of us here got your cook book ( do you have others too) ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm going to do all the viewers on this page a great big favor. If you're truly interested in a healthy eating lifestyle type in Dr. Berg in your address bar. Your diet should be based on wise choices, not sales prices.",
            "polarity": 0.45,
            "subjectivity": 0.55
        },
        {
            "body": "Saq a video where you talked about Hu Chocolate. Found at a local store, but loaded with sugar. I was surprised you recommended it.",
            "polarity": 0.05,
            "subjectivity": 0.45
        },
        {
            "body": "We have had Rao's here in Santa Cruz, Ca, for years now. My son loves it. He often makes himself a bowl of spaghetti for a snack. We also get the Garofalo organic pasta, only ingredient is organic durum wheat semolina. Good stuff!",
            "polarity": 0.4375,
            "subjectivity": 0.8
        },
        {
            "body": "It’s kinda annoying that they add extra sugar on sugary fruits 🤦‍♀️",
            "polarity": -0.4,
            "subjectivity": 0.5
        },
        {
            "body": "We have Raos in MN.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I believe I saw Rao's pasta sauce in the Costco in Joliet/Plainfield, IL early this month.  Hopefully it will still be at the sale price you found when we make our next Costco run on Thanksgiving weekend.",
            "polarity": 0.05,
            "subjectivity": 0.15
        },
        {
            "body": "The gruel that Bobby made looks really unappetizing.",
            "polarity": -0.8,
            "subjectivity": 1.0
        },
        {
            "body": "I would like to know what to buy at Bj for low carb high protein. I'm a diabetic",
            "polarity": 0.08,
            "subjectivity": 0.41999999999999993
        }
    ]
}