{
    "time_posted": "2021-10-30 13:28:25",
    "url": "https://www.youtube.com/watch?v=qyLNCp8WnJ0",
    "time_now": "2021-10-31 05:05:07",
    "ups": "3314",
    "downs": "90",
    "views": "62341",
    "top_comments": [
        {
            "comment": "I will have to check my Costco to see if Raos is on sale.  I'm in Chicagoland area and I think of Bobby every time I see the Unreal Chocolate coconut bars.  He said he can't find them in Florida and if I weren't afraid they'd melt I'd send him some.  It's weird to see people without masks shopping, we are still required here.  It doesn't bother me anymore to wear them, I'm used to it.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.55,
            "subjectivity": 0.95
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "This is not about food or Costco (love Costco).\nWhat concerns me is seeing all those people not wearing masks. Florida had approx 13,000 Covid cases in the last week and about 870 deaths. My 90 yr old father recently moved there and I am worried about him living there. I'm afraid to go visit.  So, how can you feel safe not wearing a mask?",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.41944444444444445
        },
        {
            "body": "Bobby...love RAO's but also love the Kirkland Organic which is generally more for less, think the flavor is comparable...what do you think???",
            "polarity": 0.2777777777777778,
            "subjectivity": 0.3888888888888889
        },
        {
            "body": "How can you walk around Costco without a mask?! I know you're in Florida now and that's how \"they\" roll, but you don't have to.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You're too picky and fancy .  I buy what I like and that crap you're talking , you can just can it .  You're not the Continental , wow wee wow wow !",
            "polarity": -0.11875000000000002,
            "subjectivity": 0.95
        },
        {
            "body": "I subscribed and entered to win.  I enjoy watching your videos.  Thank you",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.45
        },
        {
            "body": "FyI, I went to Costco today right after watching this and Costco Burbank doesn't have the Rao's on sale. They do have the Bobby approved Laird's superfood creamer though! I think it was around  $18. Love your show , Bobby!!!!!",
            "polarity": 0.6785714285714286,
            "subjectivity": 0.5678571428571428
        },
        {
            "body": "I love these videos!  I have never had Raos, but we make our own sauce from organic tomatoes that I can myself.  I'll be looking into some of these.  Thank you so much!",
            "polarity": 0.4916666666666667,
            "subjectivity": 0.6
        },
        {
            "body": "The sardines are awesome over salad. I use the oil as the dressing.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "We have Rao's in Austin, TX - love it!  $7.99 at our store today.",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "What about morning summit cereal??",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Tacoma Costco has Rao’s",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Where is your mask?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hi Bobby!  Can you do a video on One Mighty Mill bread products?  Their tortillas have some ingredients I am not sure about.  Thank you!",
            "polarity": 0.04375000000000001,
            "subjectivity": 0.8944444444444444
        },
        {
            "body": "After talking about K cups and how nasty they are I have seen and ate frozen vegtables in plastic pouches. Adding this plastic pouch to the microwave has to be bad, right? The plastic concerns me.",
            "polarity": -0.47142857142857136,
            "subjectivity": 0.7341269841269841
        },
        {
            "body": "Raos sauce is wonderful!  Love it!  We can't get any Laird products here in north Idaho so I have a monthly subscription for their creamer.  I was really bummed when Costco stopped selling it.",
            "polarity": 0.6083333333333333,
            "subjectivity": 0.6
        },
        {
            "body": "Stop advertising Lairds in your videos. If you do, make it quick and do it without sneaking into your store deals videos",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5
        },
        {
            "body": "Isn’t that oatmeal product a bit high in sugar? Yuk yuk, all those preservatives in the dried fruit!  Welch’s?  Yuk.  This is drinking poison.  Thnx",
            "polarity": -0.045,
            "subjectivity": 0.57
        },
        {
            "body": "Rao's is at our store in North Miami :-)",
            "polarity": 0.5,
            "subjectivity": 1.0
        }
    ]
}