{
    "time_posted": "2021-10-30 12:07:22",
    "url": "https://www.youtube.com/watch?v=RcHvho0AymI",
    "time_now": "2021-11-02 14:45:06",
    "ups": "415",
    "downs": "29",
    "views": "31616",
    "top_comments": [
        {
            "comment": "Sorry for Aryan khan, people who consume drugs must send them to Rehab Centre. Jail is for Drugs  smuggling.",
            "likes": 4,
            "number_of_replies": 0,
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "comment": "He reminds of a great criminal lawyer in my country.. Malaysia..the late Mr Karpal Singh. These people have law running in their veins.",
            "likes": 4,
            "number_of_replies": 0,
            "polarity": 0.03333333333333335,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "Wow!! Former Attorney General & Advocate of the Supreme Court, after seeing the facts stated - NCB stretched the case too far against Aryan ? Aryan should not have been arrested ? So, it is true that NCB made an illegal arrest and was trying to frame Aryan. Wankhede certainly should be held accountable for damage caused to Aryan. NCB should take note.",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.0300595238095238,
            "subjectivity": 0.46904761904761905
        },
        {
            "comment": "So he didn’t have drugs  on him but decided to arrest him because Bhanushali said so. \n\nHe didn’t take drugs ( medical report not done)\n\nWhatsApp chats can be altered and all they had was so called WhatsApp chats from 2018 while ARYAN was studying at University of southern California Los Angeles. \n\nit’s very sad that this young gentleman had to spend three weeks in jail because they wanted to frame him. He shouldn’t even have spent an hour in jail. His father couldn’t work for three weeks . \n\nHis mother was physically sick because she was worried about her son being in there with India’s most notorious criminals. Extremely sad. If this would’ve happened in the United States her father would’ve sued The agencies for all the time and money spent and for the torture his son had to go through.\n\nDefamation of Aryan khan \nThe Key witnesses were all con artist and frauds. \n\nHow could a central agency arrest someone based on what a con artist says? Ridiculous\n\nIf the father has money he has every right to hire the best attorney for his son. Anyone would if they had that kind of money. He went through the legal system and got bail. If he wasn’t able to get bailed then everyone would say Indianlegal system is great. \n\nNow that this young gentleman was able to secure a bailpeople are blaming the system\n\nSo is the system only right when it accuses innocent people of a crime they did not commit because you don’t like them for personal reasons? Or that they are making money in the film industry and you don’t like them?\n\nThe other 1600 people were cleared to go on the ship and have a rave party.  The only person of interest was Aryan  khan. He didn’t even Board the ship \nWhy is gosavi aka con artist dragging Aryan khan? Isn’t that the NCB or another officers job? This proves how unprofessionally the entire matter was handled .\n\nHe was the responsibility of the central agency. He was mishandled by this fraud. In other countries were government officials act professionally they are handled and Arrested by other officers not so-called con artist witnesses.\n\nLaw of attraction says if you think money or people with money is bad that’s exactly why you don’t have money",
            "likes": 3,
            "number_of_replies": 1,
            "polarity": 0.06791819291819291,
            "subjectivity": 0.45372405372405383
        },
        {
            "comment": "He is a legal legend. Thanks, Zain.",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.2,
            "subjectivity": 0.2
        }
    ],
    "comments_since_last_sample": []
}