{
    "time_posted": "2021-10-30 14:16:22",
    "url": "https://www.youtube.com/watch?v=rP_WFckjkI8",
    "time_now": "2021-10-31 05:04:38",
    "ups": "2149",
    "downs": "32",
    "views": "43055",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "People seems to be eagerly waiting for the odin, when the odin is facing a ton of issues disguissed in optimism and tribalism. Powkiddy as bad as it seems, is out, it exists, it didn't require \"help\" from the community to be made (maybe there will be help from the community to make it, um, better). I no longer have much reasons to have faith in ayn, so i guess the only other device to cheer for is the anbernic rg352, atleast they get the controllers right and they won't asks us for money to build them...",
            "polarity": 0.026785714285714312,
            "subjectivity": 0.5462301587301587
        },
        {
            "body": "God I love your videos ETA. Emulation is just the best and so fun.",
            "polarity": 0.6,
            "subjectivity": 0.36666666666666664
        },
        {
            "body": "I would have to pass because it doesn’t have enough power probably to play Fortnite and pub G and maybe modern combat",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "I like it. The performance is good. This unit looks better than the GPD XD, and I have both versions.",
            "polarity": 0.6,
            "subjectivity": 0.55
        },
        {
            "body": "I think one is better off with a Galaxy S10e with a controller add on. Unless you are in love with the clamshell.\n\nBut maybe there is a clamshell clip on controller for Android. Haven't looked for one tbh",
            "polarity": 0.5,
            "subjectivity": 0.55
        },
        {
            "body": "This thing is inferior compared to what the next generation will be. The next generation will be far more powerful especially by graphics and will be more like the nintendo 3ds.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.5714285714285714
        },
        {
            "body": "So close to prefect. Just a little better SOC and improve those controls. One of the first emulation based arm devices that has actually got my attention. I'd not pick one up because my phone(Pixel 2 XL) and tablet (Samsung S7+) are both far more powerful and already do the job. If the price was lower I'd buy one just to play around with.",
            "polarity": 0.20892857142857144,
            "subjectivity": 0.5619047619047619
        },
        {
            "body": "Please do a Guide on websites to downloads Rom games for emulators",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The device looks like it was designed by Commodore in 1992 ;) \nThat silver nameplate isn't exactly upping the class either lol\n\nIncidentally - how on Earth isn't a hugely profitable game like Geishin Impact, not have configured controls for gamepads on Android by now??\n\nThat kind of thing takes minutes in config...\n\nThat really makes no sense\n\n\nEdit: Powkiddy too..... Nice name lads 😕",
            "polarity": 0.3375000000000001,
            "subjectivity": 0.6687500000000001
        },
        {
            "body": "Ive been interested in some sort of emulation device for a while. I was thinking a pi, but the more I think of it, an android handheld like this really interest me. Because I'd like to play android games as well as emulators",
            "polarity": 0.31666666666666665,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "So they decided to go with the Super Famicon color scheme for the buttons, but went with Xbox type of button arrangement?  Never seen more idiotic decision than this.  This is the kind of things that makes me steer well clear of the company's products.",
            "polarity": 0.1733333333333333,
            "subjectivity": 0.6566666666666666
        },
        {
            "body": "Test The Force Unleashed on PSP please",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "how much? how does it handel N64?",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Ill wait the odin console snapdragon 800",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Shit....",
            "polarity": -0.2,
            "subjectivity": 0.8
        },
        {
            "body": "I wonder if it's really a genuine android 11 or if they only spoofed the build prop file",
            "polarity": 0.2,
            "subjectivity": 0.75
        },
        {
            "body": "😁😁😁👍👍👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "bruh your android store works? when i got mine it doesnt work. even though ive updated it\n\nand not to mention there are a couple things within that device for me that softlocks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I think I'll pass... the performance is too low for me.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "When can we get one with a SD865+?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}