{
    "time_posted": "2021-10-30 14:16:22",
    "url": "https://www.youtube.com/watch?v=rP_WFckjkI8",
    "time_now": "2021-10-30 20:51:26",
    "ups": "1601",
    "downs": "23",
    "views": "26845",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "$170... for this shit? Lmao that's comical",
            "polarity": 0.3,
            "subjectivity": 0.9333333333333332
        },
        {
            "body": "No R3/L3? man. Makes it pretty much useless for cloud gaming and I was really hoping for an all in one retro + modern game handheld",
            "polarity": -0.05,
            "subjectivity": 0.42000000000000004
        },
        {
            "body": "Do you think this would be good for Steam Link?",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "cortex a75",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "2 Minutes in: \"Huh, I wonder how this compares to the A32 5G I bought after watching ETA Prime's video on it.\"\n4:15 minutes in: \"Yay! I get to find out!\" lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "The laptop console pretty ugly I wait for Odin",
            "polarity": -0.22499999999999998,
            "subjectivity": 1.0
        },
        {
            "body": "How do I add app icons on the home screen?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Definitely try Dolphin MMJR2, it's much newer and works very well",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "I'm just not a fan of how both PowKiddy and Anbernic are both going bigger with their new emulators.  I'd prefer something the size of the RG351MP or smaller ( Like the RG280V ).  Something that can fit in my pocket, and easy to take to work with me.  This and other companies are trying to make their new emulators look like the switch, which is just too large for my interests.   At these sizes, I'd rather just get a Steam Deck ( well, IF I could get one. Those will be hard to get for a while ).  And with my Launch day switch hacked, I have no need for anything nearing the size of the switch ( except for the steam deck ).  I could just take my switch to work with me.  \n\nBut that's just me.  If being able to carry thousands of games in my pocket means I don't get absolute perfect aspect ratio's...That's a trade-off I'm willing to make.  Also, smaller screens use less power.  So a bigger screen = bigger battery = more weight.  \n\nI hope some of these companies that are trying to make crazy small emulators that are too small to practically use, would make their units bigger, but with more modern hardware. For me, something in between the size of the Gameboy Micro and the RG351MP would be perfect.  I wish Anbernic would make an updated 280V, with slightly newer hardware.",
            "polarity": 0.13924408924408926,
            "subjectivity": 0.5383075258075258
        },
        {
            "body": "Can’t wait to see you review Retroid pocket 2 plus when it comes out",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please use Shenmue 1 and 2 for your testing! Would love to see it!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Take a drink every time he says \"As you can see here\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The new gpd XD is much better",
            "polarity": 0.3181818181818182,
            "subjectivity": 0.4772727272727273
        },
        {
            "body": "I was waiting on your review!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Still blows my mind no one has built a controller with a hinge that turns your phone into a clamshell console like this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ETA Prime was too kind with the controls. Probably because he didn't used it much as he quickly opted for using it as a TV console with a Xbox controller. Retro Game Corps did an in-depth review and found the controls to be utter trash. I guess we now wait to se Anbernic's $199 handheld.  I think it should be better than this. But they might opt for a RK3399 instead. At least I hope so.",
            "polarity": 0.12222222222222219,
            "subjectivity": 0.6166666666666666
        },
        {
            "body": "I do wonder how it fares being a remote control for drones?",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "🖨️🖨️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Could you emulate cyber hunter or super mecha champions",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        }
    ]
}