{
    "time_posted": "2021-10-30 12:04:22",
    "url": "https://www.youtube.com/watch?v=RqnFN8W8Ygs",
    "time_now": "2021-10-30 16:45:59",
    "ups": "254",
    "downs": "49",
    "views": "26683",
    "top_comments": [
        {
            "comment": "Ang magnanakaw at mandarbong magsasama anong mangyayari sa bansa think about it",
            "likes": 4,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "ANG KAWATAN AT MANDARAMBONG ,,MAG SAMA HUHUHUHU,,KALOLOOY GD ANG ATON BANSA,,,,,WAKE UP MAHAL KONG KABAYAN,,,,BE WISE,,,GOD BLESS US ALL,,,,",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "AYAW NINYONG IPAKITA ANG MGA COMMENT KUNG MAY TUNAY NA COMMENT SA INYONG MGA GUEST. NAMIMILI LANG KAYO NG COMMENT.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "BASTA MAAWAIN SA MAHIRAP, PWEDE NG LIDER, LAHAT PATATAWARIN BASTA MAHIRAP. NAPAKABAIT NA LIDER NI LENI. WALANG KASING BAIT. BASTA SIYA AY SA MAHIRAP KAHIT GUMAWA NG KASLANAN OK, BASTA MAHIRAP. MAHIRAP INTINDIHIN ANG BATAS NI LENI SA MAHIRAP.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "BATSA NI LENI, DADAMI ADIK NA MAHIRAP. SUHULAN OK BASTA MAHIRAP BOBOTO KA LANG AYON DAW SA KONSENSYA. MAY KONSENSYA BA ANG TUMATANGGAP NG SUHOL???PAREHO RIN IYON SA NANUHOL.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "KUNG LAHAT OK BASTA MAHIRAP, IYAN ANG BATAS NI LENI, HUWAG NA NATING IGALANG ANG BATAS NG TAO NA WLANG MAHIRAP O MAYAMAN.  HUWAG NG MAGLAGAY NG BATAS, TUTAL LAHAT NAMAN NAPAPATAWAD DIN SA HULI.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "ANG KAWATAN AT MANDARAMBONG ,,MAG SAMA HUHUHUHU,,KALOLOOY GD ANG ATON BANSA,,,,,WAKE UP MAHAL KONG KABAYAN,,,,BE WISE,,,GOD BLESS US ALL,,,,",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "KUNG HINDI BA NAMAN MAHINA SUHOLAN E OK. ABOGADO KA PAPAYAG DAHIL MAHIRAP. MAGSAMA SILA NG ALEX LACSON NA IYAN. PAREHO LEVEL NG IQ.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "KAYA SA SUSUNOD NA BILANGAN NG BOTO TALO SI LENI KAY BBM AT SA IBA PANG KANDIDATO.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "WLA NAG SIYA HINDI ANMAN MATAGUMPAY ANG MOTORCADE DAHIL ANG ISINISIGAW NG TAO BBM. DAHIL AYAW S KANYA.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "HINDI MABUTI SI LENI DAHIL HINAHAYAAN NIYA SI PERCY LAPID NA MANLIBAK SA IBANG KANDIDATO. KAYA SI LENI AT PERCY AY HINDI MABUTI.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ANYWAY HINDI NAMAN MANANALO SI LENI DAHIL BAGSAK NAMAN SIYA SA SURVEY AT WLA SIYANG NAGAWA NA MAG IIWAN NG LEGACY DAHIL MAHINA NGA SIYA PATI UTAK.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "IAALIS TALAGA NINYO. PERO NABABABS ANINYO KUNG GAANO KAGAGAO ANG GUEST NINYONG SI ALAEX LACSON AT VP LENI",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "AYAW NINYONG MALAMAN NG MUNDO KUNG ANO ANG TUNAY NA NAKIKITA NG ORDINARYONG TAO S AMGA GUEST NINYO. LALO NA KUNG TUNGKOL KAY LENI.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "AYAW NINYONG IPAKITA ANG MGA COMMENT KUNG MAY TUNAY NA COMMENT SA INYONG MGA GUEST. NAMIMILI LANG KAYO NG COMMENT.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "BAKIT NAGING ABOGAGO NA ANG IBA SA PILIPINAS?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Atienza hindi MO Alam sinasabi MO, bingi hindi na perceive Yung mga ginagawa ni duterte Kay vp Leni. kawawa si Pacquiao gagamitin Lang sya NG mga trapo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pacquiao is building his own political dynasty, too bad.",
            "polarity": -0.03333333333333329,
            "subjectivity": 0.5888888888888889
        },
        {
            "body": "Ang magnanakaw at mandarbong magsasama anong mangyayari sa bansa think about it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "atty, maniniwala ako kay VP leni na pwede syang makipagtrabaho kay marcos, sabi ni vp leni not negotiable. bolador ka atty.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "DUTERTE LEGACY UTANG NG PILIPINAS LUMUBO NA SA 11.92 TRILLIONS BAWAT BATANG IPINA-NGANAK MAY TAGLAY NANG UTANG NA 120.000 BAWAT ISA SAMANTALANG SAKO-SAKONG PERA ANG IPANG-MUD-MUD SA KAMPANYA MASIGURO LANG NA MANANALO LAHAT NANG ASO NYA!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}