{
    "time_posted": "2021-10-30 15:00:27",
    "url": "https://www.youtube.com/watch?v=sU5yI7Vhxok",
    "time_now": "2021-11-01 14:01:03",
    "ups": "6645",
    "downs": "57",
    "views": "52290",
    "top_comments": [
        {
            "comment": "It's always a pleasure dying in your videos",
            "likes": 885,
            "number_of_replies": 24,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "I'm going to date myself. I remember when this was released aby the Bee Gees. And it was good. I must say, I enjoyed your version much better 😊 and thank you for the warning at the beginning of your video. I'm sure the video is amazing, since you all sang so wonderfully!! However, blinking lights can bring on a vertigo attack (lol I don't even get those right. Instead of the room \"constantly spinning\" mine rocks. Like I'm on a rocking horse and I can't get off. And it can last anywhere from a few minutes to a month.) Anyways, can't wait to hear more of your music! So glad I'm a subscriber 🥰",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.446978021978022,
            "subjectivity": 0.6018925518925518
        },
        {
            "comment": "wow, this is a cool surprise, sounds great really enjoyed it, greetings from  new zealand",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.37727272727272726,
            "subjectivity": 0.7109090909090908
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Perfect!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Yeah I can dig it. This is awesome.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "You were right about the epicness! This was great! Even undead, Violet is amazing!!",
            "polarity": 0.7648809523809524,
            "subjectivity": 0.7285714285714285
        },
        {
            "body": "Zombie Violet looks like Evanescence Amy Lee, lol",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Brillant!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Mi si buggato YT. Vedevo questo video a metà schermo e Nell altra metà era mostrato il video precedente. Halloween style",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "👌👍💜😘💖💗💟😍💕💞",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}