{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-10-31 17:25:28",
    "ups": "10665",
    "downs": "104",
    "views": "103319",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 141,
            "number_of_replies": 86,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "DEATH TO THE CCP\nFREE TIWAN \nTIANAMEN SQUARE 1984",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "comment": "And this is just what we know? Can you imagine all the deep dark classified stuff we DON'T know about. If everyone in every single country knew what their leaders did, what they are doing, and what they plan to do, you would see a world wide revolution.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.08035714285714285,
            "subjectivity": 0.35357142857142854
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Working girl 😆😆😆😆 Chris I can't believe u watched that movie!!! I loved it when I was young",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Maybe it's because when all the characters in Chinese soap operas catch Wuhan flu you know that one way or another that's the end of the whole cast, they all die, no cliffhangers, no guessing who lives, who dies, who gets locked into their house to starve to death, etc, you know immediately no one survives, hence it's no fun, not really entertainment.  Whereas in Korea if they all catch Wuhan flu, there is still strong chance some, actually most of cast will survive.",
            "polarity": 0.14722222222222223,
            "subjectivity": 0.33888888888888885
        },
        {
            "body": "Yeah well that's why there was a documentary about a gentleman that was going to die you've been on a waiting list forever and his own insurance company said it go to China. He went there and he got in Organ and he is alive today.",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "FREE EAST TURKESTAN \nFREE TIBET\nFREE EAST MONGOLIA\nFREE PALESTINE\nFREE KASHMIR",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "Yo I completely forgot about that WWZ plotline. Good call-out",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.5
        },
        {
            "body": "Reminder Xi is harmless cuase he looks like winnie the poo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Chinese ego must be weak af 🤣",
            "polarity": -0.1875,
            "subjectivity": 0.3125
        },
        {
            "body": "Dont be surprised if he disappears one day",
            "polarity": 0.1,
            "subjectivity": 0.9
        },
        {
            "body": "And this is just what we know? Can you imagine all the deep dark classified stuff we DON'T know about. If everyone in every single country knew what their leaders did, what they are doing, and what they plan to do, you would see a world wide revolution.",
            "polarity": -0.08035714285714285,
            "subjectivity": 0.35357142857142854
        },
        {
            "body": "Got to keep it real folks the USA is doing the same shit as China.  We are live organ harvesting babies after they survive the fake abortion!  We need to clean up our act before we can talk about China because it is just as bad in the USA and now we have an administration trying to convert America into a CCP totalitarian government!  Lets Go Brandon!",
            "polarity": -0.1602813852813853,
            "subjectivity": 0.5845238095238096
        },
        {
            "body": "West Taiwan.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Traditional Chinese values you say? You mean the very same values the PRC has done away with since the Communists have taken over and have purged several times in favor of collectivistic nationalist schlock and propaganda? Taiwan has more in common with old China and Korea, Japan and other Chinese communities worldwide have their own spin on it through their contact.",
            "polarity": 0.030208333333333337,
            "subjectivity": 0.35625
        },
        {
            "body": "China.... the country that gives you new I Ryan's on demand and enhanced Corona virus.\nA long with che a p shoddy goods in Walmart.\nWhat's not to like about Chiba?",
            "polarity": -0.07121212121212121,
            "subjectivity": 0.4515151515151515
        },
        {
            "body": "Why don't you just admit you are the propaganda arm of the\"Epoch Times\" and the Falun Gong cult? Which has a bloody ax to grind with Jiang Ze-min?",
            "polarity": -0.45,
            "subjectivity": 0.5
        },
        {
            "body": "Chris Cheaplie is claiming now for some 5 years that there  is some sort of \"organ harvesting\" in China. Till now, he wasn't able to present a single bit of evidence supporting his claims. No surprise at all.",
            "polarity": 0.16964285714285715,
            "subjectivity": 0.2723214285714286
        },
        {
            "body": "I had an uncle in the 1st MarDiv.\nThe Chinese had decided that the destruction of the 1st MarDiv at Chosen would be a great propaganda victory.\nThe Chinese threw several divisions against 1st MarDiv.\nThe Chinese did force the fighting withdrawal of 1st MarDiv which due to poor high command decisions by Gen Ned Almond had been pushed too far forward without adequate flank protection and disregarding evidence of the infiltration of an initial surge of 300 000 Chibese troops across the Talu.\nFortunately Gen OP Smith one of the best Generals of that period was in command of 1st MarDiv.\nHe had provided for a line of withdrawal as well as an airfield for resupply.\nIt wasn't pretty or pleasant.\nBut 1st MarDiv extricate itself from the Chinese enveloping bring out its wounded dead and heavy equipment.\nI'm sure the Chinese propaganda movie presents the battle as a huge victory for the PLA.\nIn fact it was not as Maos objective of the destruction of 1st MsrDiv was not accomplished although an army unit at the Re s Ivor was essentially destroyed with some survivors being rescued and brought out by 1st MarDiv.\nWith the arrival of Ridgeway as the commander of the allied forces in Korea the situation stabilized and the Chinese began being forced back.\nRidgeway was given orders to stabilize the front at the e8th parallel which he did.\nThe Chinese human wave attacks were met by well dug in troops and massive firepower.\nBest estimates are that Chinese losses in the war were around 600 000 troops on top of the NK losses of at least 350 000.\nThe US lost 53. 000 killed \nSouth Korea was saved. The 1st Mar Div fights the US battles today with success and honor.\nSouth Korea is a successful and prosperous country.\nNorth Korea is poor dark at night and had nuclear we a Pons thanks to china and Pakistan.\nThe Chinese tactics in Korea were not after the initial surprise particularly successful and were wasteful of their soldiers lives. These soldiers were poorly equipped for the weather and suffer greatly from freezing to death and frostbite.\nAnd THAT is more or less a summary of the Korean War and the outcome.\nFrom the Chinese standpoint it's hardly the stuff of which legends are made although their individual soldiers were cert as only brave enough.",
            "polarity": 0.12220238095238091,
            "subjectivity": 0.3805753968253968
        },
        {
            "body": "DEATH TO THE CCP\nFREE TIWAN \nTIANAMEN SQUARE 1984",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "You mean they've been harvesting organs illegally for years???? Say it isn't sooo.... oh right, being called conspiracy nut for a while...",
            "polarity": -0.1755952380952381,
            "subjectivity": 0.5744047619047619
        }
    ]
}