{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-11-02 14:45:04",
    "ups": "13019",
    "downs": "128",
    "views": "134114",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 176,
            "number_of_replies": 90,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "jian looks so pale... some serious voodoo keeping him alive?",
            "polarity": -0.14777777777777779,
            "subjectivity": 0.4155555555555555
        },
        {
            "body": "Hong Kong movies in the past were of high quality. But Since China cannot make a movie or TV show that satirizes the problems of their society, they can never make works like Korean Parasite or Squid Game. Even though Chinese fanatical patriotic films have a huge number of viewers in China, no one in the world wants to see them.",
            "polarity": 0.01833333333333335,
            "subjectivity": 0.365
        },
        {
            "body": "Chinese version of the squid game - If you select O for Xi Jinping, you pass. Select X to eliminate.",
            "polarity": -0.2,
            "subjectivity": 0.2
        },
        {
            "body": "china stop forcing us to watch stuff",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "If there’s only a few hours to transplant the harvested organs, then how are they getting to the US if not from a closer location than mainland China?",
            "polarity": -0.1,
            "subjectivity": 0.55
        },
        {
            "body": "Anti china news. You are fool",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "1:50 Now, China plays less fair. They accused Chinese armys of fundraising millions of renminbi to put South Korean entertainment, in this case Kpop songs from BTS, on the top of USA charts, and that South Korea's government bribed the Grammys so BTS could be in there.",
            "polarity": 0.2583333333333333,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "1:50 I still remember In 2014 and early to mid 2019, people weren't saying the South Korean entertainment was manipulating the charts, pushed to popularity by the government, getting into charts with fundraising and bribes, or whatever like people say in late 2019, in 2020 and in 2021 now. Even accusing all the fans of South Korean entertainment of being children or bots and that it bought all the views. It seemed to be much better times for the South Korean entertainment.",
            "polarity": 0.07500000000000001,
            "subjectivity": 0.35
        },
        {
            "body": "1:50 China and USA may have won. Nowadays they say the South Korean entertainment is cheating so it's not really successful but only popular.",
            "polarity": 0.075,
            "subjectivity": 0.9500000000000001
        },
        {
            "body": "1:50 China's Cdramas are way better than the Korean ones. India's Bollywood also. Japan's also. Pakistan, France, UK, Brazil, Mexico Chile have good shows/movies. Many people just only know about the Korean ones. Same way the Kpop is popular even though technically Jpop, Indian songs, Cpop, Tanzaniapop, SouthAfricapop, etc. are better.",
            "polarity": 0.35,
            "subjectivity": 0.528125
        },
        {
            "body": "Well they could just pull organs out of the chest freezer! Certainly keeps the food fresh enough for about 2 months.",
            "polarity": 0.1714285714285714,
            "subjectivity": 0.5238095238095238
        },
        {
            "body": "China's Cdramas are way better than the Korean ones. India's also. Japan's also. Many people just only know about the Korean ones.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6666666666666666
        }
    ]
}