{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-11-01 14:01:40",
    "ups": "12140",
    "downs": "120",
    "views": "123273",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 158,
            "number_of_replies": 88,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "For the algoooorithm",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The UN being powerless to stop organ harvesting in China is proof that the UN is useless.",
            "polarity": -0.5,
            "subjectivity": 0.55
        },
        {
            "body": "fascinating yet eviscerating",
            "polarity": 0.7,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "A superiority complex (viewing the Han people as a superior ethnic group).\nViewing their culture as superior.\nPreaching how great they were in the past.\nClaiming countries like Taiwan, Korea, Thailand (etc) as Chinese and therefore, ripe for future invasion.\nKilling ethnic minorities in concentration camps within their own borders.\nBuilding an army and preaching hate towards foreigners (especially countries who's militaries intimidate them)\nSocialist and heavily Nationalistic.\n\nI do hope the younger generations get the historical context of what is happening there.  \nOtherwise, the older generations know what will happen ...",
            "polarity": 0.10119047619047619,
            "subjectivity": 0.5041666666666667
        },
        {
            "body": "the real background of \"World War Z\" was china.\nhollywood likes chinese money, so it changed its background to korea.\nthey remember the betrayal of hollywood.",
            "polarity": 0.1,
            "subjectivity": 0.15000000000000002
        },
        {
            "body": "The films HOSTEL comes to mind... People think this don't happen in real life 😕",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "This Horror Show Shows Who We Are\nA student of mine told me about a new show called “Squid Game.” It is a South Korean “thriller series,” as they call it, which has become a pop culture phenomenon and is the no. 1 show in more than 90 countries. The show presents several hundred people who are all in great financial debt and in dire emotional states. The producers pit them against each other, even if they are very close, and make them hate each other. The winner takes millions of dollars, and the others are killed. This show wouldn’t be so horrifying if it didn’t portray our true nature. The very fact that we watch such a show enthusiastically is proof that underneath the “civilized” façade, our nature is as the show depicts.\nIt works like a magnet. We love to watch the struggle between good and evil, as long as we are safe from the consequences of the battle. The thing is that in this show, there is no good; there is only evil. \nIndeed, humans are the worst being in reality. What makes us so uniquely evil is the fact that we explicitly want to harm others. We do not want to eat others because we will starve unless we do so; we want to see them suffer! We derive pleasure from others’ pain, and derive the most pleasure when we are the ones inflicting it.\nWe often say that reality is like a jungle, where the strong eat the weak. However, in the jungle, the strong do not want to destroy the weak; they want to eat. Once they are full, they want to sleep and play, and not kill or hurt for fun. In the human jungle, we do not want to eat other people; we want to see them hurting! This is why the natural jungle thrives without any laws while the human jungle, which we mistakenly refer to as “civilization,” is disintegrating despite the laws that strive to limit our barbarity.\nIf we had any hopes of finding goodness in human nature, “Squid Game,” and mainly its popularity, proves that we have nothing to hope for when it comes to human nature. If we can create such shows, and if they can be so popular, then we can do such horrors in real life.\nThe only possible good that can come out of such a show is the realization that it is not fantasy, but an authentic depiction of who we are. Maybe if we realize this, we will be willing to do something about changing ourselves.\nThe current trend is to dull our awareness of the human horror show we live in by making cannabis available and legal. Indeed, the more we learn about human nature, the more we realize that perhaps it is better to numb ourselves through life until it’s over.\nFor now, we’re cheering at the sight of other people suffering, much like people used to cheer at the sight of poor men fighting against lions in ancient Rome. Only if we realize that it is not okay to be like that, our minds might open to other options. If such a diabolical program can be the no. 1 show in more than 90 countries, it means that the entire world is immersed in unhinged viciousness.\nThere is a solution, but it is demanding and must encompass the entire world if it is to succeed. To change who we are, we must initiate a worldwide educational process where such programs are forbidden and pro-human-connection programs are produced and aired. Even if they are not popular, at first, we cannot allow ourselves to be exposed to the violent poison and culture of narcissism that we consume today. They may be sweet, but they are lethal.\nIf people don’t want to watch shows about human connection, they can put aside their media devices and simply talk to one another. This will already be a major improvement to the current situation.\nIt may not sound like fun, but what is the option? To live out the “Squid Game.” Besides, after some practice, we will discover that connection and care are far more rewarding and pleasant than destruction and cruelty, and do not carry the negative side effect that is our current culture.",
            "polarity": 0.031859184629803194,
            "subjectivity": 0.519450394965859
        },
        {
            "body": "it is true about organ harvesting in china. my mother got an offer from a hospital in china to give her a new kidneys asap so she does not need to wait. all she has to do is fly over to china and get the transplant. at that time that was around late 90‘s we are not aware that china had this evil program. all we know that the donor was a convicted prisoner that was in deathrow but luckily it did not push through my mom had her transplant here and her donor was a close relative.",
            "polarity": 0.024337121212121206,
            "subjectivity": 0.5859848484848484
        },
        {
            "body": "Jiang is an undead.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "👍👍👍👍👍👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I didn't know west Taiwan harvest Organs this much. So sad for the people",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Squid victory? That name reminds me of one of those Grand Theft Auto rip offs. they will always give it a verry bad name such as: Grand Theft Naruto.",
            "polarity": 0.07500000000000004,
            "subjectivity": 0.7916666666666666
        },
        {
            "body": "Dear Jesus, please help the CCP fear you. Amen",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}