{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-11-05 04:33:31",
    "ups": "13794",
    "downs": "144",
    "views": "145687",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 187,
            "number_of_replies": 90,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "Squid game is original it was based around the Japanese comic/anime call Kaiji which has a lot of the similar plots and themes and storyline...",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.0062500000000000056,
            "subjectivity": 0.38749999999999996
        },
        {
            "comment": "it reminds me of that x files episode ''Hell money''.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Do you know what Chinese say by feeding strange data even though Koreans share gene pools only with Central Asians, Indian, Turkey, some Hungarian, Scythians, Mongolian, Japanese?\r\nthey insist Koreans are Chinese.\r\nBut Korean, Japanese medical and genetic scientists showed results of  studies that proved that their genes are completely different from Chinese. \r\n99.9% original and normal Koreans are all busy avoiding Chinese while these normal Koreans share common values like international marriage each other, songs, drama, cultures, KPOP, Jpop etc with normal Japanese in youtube(not politics🙃⛈).",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0225,
            "subjectivity": 0.29375
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "2:34, why do I get father from my big fat Greek wedding vibes. ' give me a word, I give you Greek origin of the word'",
            "polarity": 0.0,
            "subjectivity": 0.03333333333333333
        },
        {
            "body": "Taïwan 🙌🇮🇹👍♥️",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So is the religions that are in camps the donors",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "After completely killing  10 million people and exporting Wuhan virus to world killing innocent Indian soldiers , unlawfully land grabbing , China your downtime has started 🐍💯",
            "polarity": 0.3,
            "subjectivity": 0.55
        }
    ]
}