{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-10-31 13:18:26",
    "ups": "10153",
    "downs": "106",
    "views": "97165",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 135,
            "number_of_replies": 83,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "So Xi is the slightly less evil option, compared to Jiang?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.5833333333333334,
            "subjectivity": 0.5333333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I don’t know if I remember that part.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Tried real hard to express how sick I feel about this criminal organization but could not \nbecause there's no word for it!",
            "polarity": -0.5505952380952381,
            "subjectivity": 0.7398809523809525
        },
        {
            "body": "So Xi is the slightly less evil option, compared to Jiang?",
            "polarity": -0.5833333333333334,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Squid game show is chinese since ancient times!",
            "polarity": -0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Oh no christ, not again!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "World war Z...the outbreak is caused by the flooding of the 3 gorges dam valley.  The bodies are released by the rising water.  they got to China from Japanese experiments during WW2.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why can't China make good dramas? Because they steal everything. Korean drama are popular because they are uniquely Korean. If you steal other people's stories, you lose your authentic voice and nobody is interested",
            "polarity": 0.3833333333333333,
            "subjectivity": 0.6875
        },
        {
            "body": "Best fake story ever.",
            "polarity": 0.25,
            "subjectivity": 0.65
        },
        {
            "body": "Kaiser Wilhelm II is currently spamming comments. Give him the best by responding \"u retarded\" to his comments.",
            "polarity": 0.06666666666666665,
            "subjectivity": 0.5
        },
        {
            "body": "Long live the democratic nation of Taiwan🇹🇼🇹🇼🇹🇼",
            "polarity": 0.043181818181818175,
            "subjectivity": 0.45
        },
        {
            "body": "I hate Chyna but i still Chinese soap more than korean drama",
            "polarity": -0.10000000000000002,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "Let’s Boycott Beijing Olympic by not watching it, even if it’s on tv",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Of course, it goes without saying that there's plenty of western people also profiting from this trade or rather, buying organs from this \"business\". I just hope the mainland Chinese people wakes from this nightmare and regain their true nation to what it once were, a shining beacon of asian civilization akin to the Roman Empire of the west.",
            "polarity": 0.0875,
            "subjectivity": 0.1625
        },
        {
            "body": "Fuck, every time I watch you I am so glad I wasn't born in China. Thank you God!",
            "polarity": 0.11249999999999999,
            "subjectivity": 0.8
        },
        {
            "body": "One more storyline in Squid Game the CCP doesn't like: there's a North Korean defector whose mother didn't make it out because.....can you guess the rest of the details?",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.45
        },
        {
            "body": "I'd like to see where the people buying the organs live. Who are they going to? I'd love to see names.",
            "polarity": 0.3181818181818182,
            "subjectivity": 0.55
        },
        {
            "body": "How come the ccp is allowed to do all this horrible stuff and the rest of is cant even say anything without a kneejerk reaction?? Seems retarded.",
            "polarity": -0.9,
            "subjectivity": 0.9
        },
        {
            "body": "When the state actively stamps out the creativity and passion of the individual, can you really be THAT surprised when content that has that actually becomes successful?",
            "polarity": 0.1527777777777778,
            "subjectivity": 0.525
        }
    ]
}