{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-10-30 20:51:40",
    "ups": "6570",
    "downs": "63",
    "views": "53290",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 91,
            "number_of_replies": 71,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "That sociopathic toad gives me the creeps. There should be a disclaimer before showing his picture. I wonder how many poor victims organs he has inside him.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.55
        },
        {
            "body": "The CCP is evil.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "i don't understand why countries don't flat out boycott China, Concentration Camps and Organ Harvesting ..... I don't blame China at this point, i blame America, i blame Europe, I blame Africa , i blame Europe. They need a blockade against them and other sanctions , till they stop the shit.. Yeah i said Europe twice.. cause they have no problem about keeping their people poor with high taxes for social programs such as Health care and so on cause they \"Care\" about humanity , very obviously bs its just to keep their elites , Elite and their Peasants , Peasants, the biggest proof they don't care about human beings is China.",
            "polarity": -0.06185185185185185,
            "subjectivity": 0.41740740740740745
        },
        {
            "body": "cool cant wait for season 1 to air of real games",
            "polarity": 0.275,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "hhhahahahahahahhaha I just realized your a shill for tai chi\n\nhahahahhahahhaah man you suck at selling out dude, you don't sell out to people who don't really value material possessions and just want to be left alone to do tai chi in the park.",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "omg, the way CCP is behaving is just like how South Korean government had behaved to the \"invasion\" of Japanese culture!  LOL",
            "polarity": 0.4,
            "subjectivity": 0.35
        },
        {
            "body": "Why South Korea can make such good drama stories all you have to do is look at their history and the North Korean stories of defectors",
            "polarity": 0.35,
            "subjectivity": 0.55
        },
        {
            "body": "Dude .\nAll you had to do is search the deep web.Theres all kinds of shit going on like this",
            "polarity": -0.1,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "I  could use a new kidney",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "The new Bond movie about a virus with Covid prancing about, Squid Games referring to stuff in China. I think Squid Games wanted to send the message of how people are sending messages through entertainment.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "I find it funny in a fucked up way that the ccp says they want to protect Chinese culture and values then go around destroying it",
            "polarity": -0.1375,
            "subjectivity": 0.425
        },
        {
            "body": "Toad Jiang Zemin must have received many organs himself.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "There were also Hong kongers that got kidnapped / murdered by ccp controlled hk police and their organs are taken by China to make profit as well",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lol it reminds me of this \n\nhttps://youtu.be/t6FP-irvPCM",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "Horrifying. \nThough, around here in the USA, we've had the acknowledgement of such, dysfunctional advise, ever since _before_ BLADE RUNNER, at least as old as I am...",
            "polarity": -0.27499999999999997,
            "subjectivity": 0.525
        },
        {
            "body": "Let's Go Brandon\nDown with the CCP",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "West Taiwan is so bitter.",
            "polarity": -0.1,
            "subjectivity": 0.5
        },
        {
            "body": "LMAO both Chinese and Korean dramas can have bad soap operas. A good portion of them treat women like crap and even have dating violence in them.",
            "polarity": -0.039999999999999994,
            "subjectivity": 0.6133333333333333
        },
        {
            "body": "I wonder how many red dash lines are around the squid game studio? \n\n((Also the lines around squid game losers organs with a note saying all your organs are now forfeit and belong to the C.C.P.))",
            "polarity": -0.1,
            "subjectivity": 0.3
        }
    ]
}