{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-10-31 05:04:52",
    "ups": "8943",
    "downs": "93",
    "views": "80369",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 118,
            "number_of_replies": 80,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "好棒的影片， 讚👍",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "the communist party is \"NOT\" terrified ......  they are the ones who have \"CONTROL\" of it .......   there's blood on their hands , targeting those who opposed their regime , and very much who ever gets incarcerated ...\ncommunism and other regimes, denied God and replace Him with the \"man god\" , that is how this mess got to be",
            "polarity": -0.013333333333333327,
            "subjectivity": 0.27
        },
        {
            "body": "Milosevic is innocent though",
            "polarity": 0.5,
            "subjectivity": 0.7
        },
        {
            "body": "It's amazing a toad could live with so many transplanted organs. Hes at least 40% Falun gong by now.",
            "polarity": 0.23409090909090907,
            "subjectivity": 0.575
        },
        {
            "body": "That \"frog\" living till 95, must be all those organ transplants he had gotten to boost his life.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just a reminder :-\n台湾是独立国家!\n(Taiwan is an independent country!)\n天安门大屠杀发生在1989年6月4日\n(Tiananmen Square massacre happened on June 4, 1989)\n西藏和中国是分开的！\n(Tibet is separate from China!)\n自由香港！\n(Free Hong Kong!)",
            "polarity": 0.25,
            "subjectivity": 0.4625
        },
        {
            "body": "Great show Chris! Maybe one day the Chi-comms will finally just go away.. Watch out for Jin Pings thugs Chris, we worry about ya!",
            "polarity": 0.5,
            "subjectivity": 0.875
        },
        {
            "body": "Chris is my favorite reporter 🤣💪 thank u Chris",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "The economic crisis these COMMUNISTS animals are about to suffer will be so bad that they will put UYGHURS on the menu. However; once the UYGHUR supply is gone the CCP will target the common man. \n\nXi and his 🐀s are to blame for all  the suffering in china but once the CCP starts to take the heat, they will turn on Xi. The PLA is most likely planning how to get rid of Xi AND the CCP.\nThe PLA may throw Xi into the street were citizens will string him up and perform DEATH by ONE THOUSAND CUTS on him. It will be just died.",
            "polarity": -0.05999999999999996,
            "subjectivity": 0.5733333333333334
        },
        {
            "body": "It’s just a fad…it’ll fade away just like most fads…",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "600 Canadian soldiers fought off 5,000 Chinese Communist soldiers in the Korean War  . Battle of Capyioung if have the spelling correct  . 1952 .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "好棒的影片， 讚👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I don’t get it.. the CCP is basically a Chinese mafia, if Xi doesn’t like someone in his party why doesn’t he assassinate him? He’s the leader of the party surely he has all control?",
            "polarity": 0.25,
            "subjectivity": 0.4444444444444444
        },
        {
            "body": "I didnt know about the world war z stuff. Interesting and makes sense",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "When I was in my early or mid teens, sometime in the first decade of the 2000s, while visiting DC I met someone at the national mall handing out papers to raise awareness about falun gong persecution in China. Never heard much about it since then. Nobody cares anyway, because China makes everything we buy so what would people do, say 'oh well sucks for them' and then go get Chinese junk from Walmart.... same thing with the Uighurs in Xinjiang, even if more people were aware what would change, probably not much... because of the economic realities China can't be sanctioned like Russia or Iran because they sell us so much stuff, and they're too militarily powerful to push around now, I don't see much leverage the USA has on the ccp... if they want to harvest organs from political prisoners or colonize Xinjiang and Tibet or build bases on the spratlys or conduct espionage and cyber attacks, what's the USA going to do?",
            "polarity": 0.12000000000000001,
            "subjectivity": 0.2605555555555556
        },
        {
            "body": "Can't believe I've been following this channel for 6 years now",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "I wonder how pissed-off the ccp will be if taiwan made a hit tv drama🤣🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Chris - could you do an episode on how China is trying to claim parts of Korean (both traditional and pop) culture as their own? I'm South Korean and this issue really irks me.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.65
        },
        {
            "body": "I’ve suspected the organ harvesting racket in China for a while now. As for the Squid Games, it’s only a matter of time before THOSE become real. And possibly even legal in some countries.",
            "polarity": 0.1,
            "subjectivity": 0.625
        }
    ]
}