{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-11-02 02:23:47",
    "ups": "12662",
    "downs": "124",
    "views": "129900",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 170,
            "number_of_replies": 88,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "Hey Chris. Good call-out on organ harvesting.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "remember. only few members of Squid game were harvesting organ and it doesn't include others.",
            "polarity": -0.20000000000000004,
            "subjectivity": 0.5
        },
        {
            "body": "You mean its finally revealed, what myself and many others have been saying for years?\n\n\n\nOf course it's true. The media brushed it off as racism. Someone I know who's been, has even admitted they do that. He's been there, several times. He says everyone knows about it. It's common knowledge.\nThey just don't speak openly about it or against it, or they'll be harvested next.\n\nWhat they do, are atrocities against nature itself.",
            "polarity": 0.02638888888888889,
            "subjectivity": 0.4375
        },
        {
            "body": "This is why I said to start a battle, not just to say.\r\n\r\nIf the whole world prohibits the spread of knowledge about the tools of war, these people at the bottom of China will not be able to obtain information to resist. Various taxes and violence threaten every day.\r\n\r\nMy suggestion is to give them knowledge of making tools so that they have the ability to resist.\r\n\r\nClick \"Like\" to let me know if this comment is banned.",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.5083333333333333
        },
        {
            "body": "Jiang Zemin is nearly immortal.",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "Looking forward to the Beijing Olympics.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The organ harvesting myth has already been debunked by experts from the West.\nFalun Gong is a dangerous cult. Only in the West can people be so silly as to think of them as poor victims. \nhttps://www.youtube.com/watch?v=1JaPzJKycxc",
            "polarity": -0.375,
            "subjectivity": 0.84375
        },
        {
            "body": "Your video makes no sense at all. If only you knew how silly you come across...",
            "polarity": -0.25,
            "subjectivity": 0.9375
        },
        {
            "body": "I really hate this prick. Yes you Chris. Long Live the CCP.",
            "polarity": -0.2378787878787879,
            "subjectivity": 0.6
        },
        {
            "body": "Totally agree.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Sick to kill one person to save one. I pray the people that do this adoption suffer bad slow death with those stolen organs.. sick people",
            "polarity": -0.6071428571428571,
            "subjectivity": 0.6952380952380952
        }
    ]
}