{
    "time_posted": "2021-10-30 13:00:33",
    "url": "https://www.youtube.com/watch?v=t3hbVyF9VyE",
    "time_now": "2021-10-31 09:11:41",
    "ups": "9593",
    "downs": "100",
    "views": "88761",
    "top_comments": [
        {
            "comment": "Thanks Grimoire Weiss for your support on Patreon! We couldn’t do this show without your support and the support of our other viewers. If you like the show and want to see it continue, head over  https://www.patreon.com/ChinaUncensored\nhttps://chinauncensored.locals.com",
            "likes": 130,
            "number_of_replies": 83,
            "polarity": 0.0625,
            "subjectivity": 0.2875
        },
        {
            "comment": "I always had the feeling that squid game was actually a parody of the ccp look:\nPeople are gathered together in a place controlled by a PINK army and they are make belive that inside they are all equal meanwhile the boss of the place don’t respect this rule and can do whatever they want . Participants are also make playing deadly game to survive and they are convinced to do it under the promise of a better life with capitalistic value (money) abandoning all kind of honor, pride, friendship, loyalty for money. This plus the organ harvesting thing seems like a good reenactment of the life of Chinese peoples.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.09999999999999999,
            "subjectivity": 0.38333333333333336
        },
        {
            "comment": "China WOULD be the perfect setting for Squid Game, season 2, though.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3,
            "subjectivity": 0.7
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I knew this episode was coming",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "China is the cancer of this generation",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "CCP are cowards! They never owe up to what they did & blame other countries for their crime or cover it up or use propaganda. They are so twisted!",
            "polarity": -0.2833333333333333,
            "subjectivity": 0.4916666666666667
        },
        {
            "body": "This is crazy…to crazy not to be real.",
            "polarity": -0.19999999999999998,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "I wish u had pronounced his name - Slobbered on my knob ya b, and not looked back.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You hurt your central goal by being so Right-wing. Smart organizations stay in the middle and get support from all sides! Not half or one side! Chinese are smart. So why act dumb? Your rich masters are only half-hearted against the CCP. And whole-hearted for the 10% rich, pro-Corporate, Republican. And for these low-power, out of power fools! Trump! Pompeo, Cruz and Paul. You know these are low power, low quality fools! Trump only wanted bribes from China, He was angry because they didn't give enough. Trump signaled he would betray Taiwan and Chinese for his worship of Xi and CCP. Nixon and Republicans betrayed Taiwan for CCP money and business! Taiwan's Pro Republican, Pro Business Party wants closer CCP ties for money! Taiwan Democrat side is the only that pushes away from CCP China! Republicans love the CCP authoritarianism and want to imitate it in America. From Republican, Nixon to now to the future: Republicans are for business and money in China, IGNORING Chinese human or civil rights! Dems are imperfect, in Taiwan and America, but only Dems care about Chinese people and human rights! You are either idiots not to know this, CIA financed, Corporate financed or just dumb to be right-wing. If whole-hearted you would know these obvious points and implement them. You work AGAINST democratic Chinese gain! Censor this, as China censors! But it will remain true - and you know it.",
            "polarity": 0.01753792242703533,
            "subjectivity": 0.4283026113671275
        },
        {
            "body": "You're wrong! They are not killed. The organs are taken from living 'prisoners'. who then die on the table..  There are testimonials from doctors who performed the atrocities...",
            "polarity": -0.2625,
            "subjectivity": 0.45
        },
        {
            "body": "I always had the feeling that squid game was actually a parody of the ccp look:\nPeople are gathered together in a place controlled by a PINK army and they are make belive that inside they are all equal meanwhile the boss of the place don’t respect this rule and can do whatever they want . Participants are also make playing deadly game to survive and they are convinced to do it under the promise of a better life with capitalistic value (money) abandoning all kind of honor, pride, friendship, loyalty for money. This plus the organ harvesting thing seems like a good reenactment of the life of Chinese peoples.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.38333333333333336
        },
        {
            "body": "Philadelphia is of Japan an Karen's trade rut .  Ie spane  got its charter through Japan.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Karena is a trading rut of Japan  . Around  China.    For centuries.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Well, the fact that the CCP have a frog 🐸 in a high position of power shows how forward-thinking they are. They're frog leaps and jumps ahead in their thinking",
            "polarity": 0.16,
            "subjectivity": 0.5399999999999999
        },
        {
            "body": "Karen culture is Japan not China  ie Karen's  defeat  China evry times  . For centuries.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Professional and informative chris great job",
            "polarity": 0.45,
            "subjectivity": 0.425
        },
        {
            "body": "China WOULD be the perfect setting for Squid Game, season 2, though.",
            "polarity": 0.3,
            "subjectivity": 0.7
        },
        {
            "body": "Imagine a Korean Netflix movie triggering a collapse of the CCP",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "They should call it Octopus Carnival ...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Next up ... CCP televises Squid games and sell television rights",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "💣💣💣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "whatever lies you told, I will forever love CCP. Long live glorious Xi Jingping!",
            "polarity": 0.20681818181818182,
            "subjectivity": 0.5
        }
    ]
}