{
    "time_posted": "2021-10-30 13:34:18",
    "url": "https://www.youtube.com/watch?v=tpUH-cJpiNc",
    "time_now": "2021-11-06 09:24:42",
    "ups": "8723",
    "downs": "100",
    "views": "117641",
    "top_comments": [
        {
            "comment": "Would always always love how Shen says \"My Girl\" thatssss sooo cute....loveeeeee to seeee youuuu guyssss together!!! May God blesss you both❤️❤️❤️",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.9765625,
            "subjectivity": 0.6
        },
        {
            "comment": "Aaliyah - get involved in some work that will bring meaning to your life. Shopping, partying, makeup are short-lived pleasures that do not add to a human being's purpose on this planet. You come across as a sensible kid, as does Shane - but you are lost in this make-believe world of pleasure. Do find your way back and work for a meaningful cause. Sending good vibes your way.\n\nAlso, all the commenters who are celebrating your lifestyle are doing you a disservice. This is not a life worth emulating. Work for a noble cause, it will help others and it will help you. Plus you can do it!",
            "likes": 3,
            "number_of_replies": 1,
            "polarity": 0.375,
            "subjectivity": 0.3666666666666667
        },
        {
            "comment": "So just out of curiosity who is paying for the food and plush hotel rooms ...plane tickets ...Clearly you have anxiety to even finish your school and Shane doesn't look like he works and your tube earnings won't be able to pay off all the bills 🙄",
            "likes": 2,
            "number_of_replies": 3,
            "polarity": 0.5,
            "subjectivity": 0.625
        },
        {
            "comment": "you should have covered the engagement a little more. Showed us your friends. The essence of vlogs lies in the details",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.15625,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": []
}