{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-01 22:16:22",
    "ups": "2943",
    "downs": "441",
    "views": "158533",
    "top_comments": [
        {
            "comment": "This is the BBC propaganda film. Kuwait has always been a very hot country. Northern and Eastern Europe has always been cold. Summer 2021 was even cooler there than it used to be in previous years. Let her remove those ugly tatoos from her hands and she will feel at once much cooler.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.17361111111111113,
            "subjectivity": 0.5777777777777778
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "BBC is so out of touch , there are people form South east Asia living in underground bunkers in Kuwait who's passports are taken up by their sponsors and are victim of modern day slavery . but let's interview irrelevant influencers",
            "polarity": -0.125,
            "subjectivity": 0.45
        },
        {
            "body": "Influencer??? The media especially the BBC has to stop giving airtime to these narcissits if it wants to be taken seriously.",
            "polarity": -0.04444444444444443,
            "subjectivity": 0.5888888888888889
        },
        {
            "body": "Only trees can save our planet, if you think we have another alternative of fossil greenhouse gases you are out of your mind unless you suggest we go back to pre industrial era. Traveling with Camel, lives without electricity and blah blah blah. Rainforest should be protected at all cost.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "What I don't get is why they build dark colored roads for such a place that gets that hot. Can't you use different colors? Heck, even red would be better.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "We were frying eggs on car bonnets in Dhahran back in the 70's and 80's, it's the Gulf, it's hot!!! Always has been.",
            "polarity": 0.244140625,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "Kuwait got rich hearing the earth.",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "And they still send the Indian workers out all day in this temperature. Cruel world",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Poor girl. Im realy feeling sorry for her. What a miserable life. Lets al  donate some money for her so she can have a better life.  I think she is not going to survive this lifestyle she is living. She has to turn on the ac before starting her car. Can you imagine what kind a struggle she has. 🤦‍♂️",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.6833333333333335
        },
        {
            "body": "Qayama't day is fast approaching",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "Devil of the earth BBC.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Next video , the unbearable heat of Sahara bruh go to school and learn how to make news",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "paint all the buildings white",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "for those of you who are not familiar with \"Celsius\".\n30 degree is pretty hot.\n40 degrees is unbelievably hot\n50 degrees, I've never heard of anywhere, it maybe worth to pay to go to a movie theater and watch a same movie 5 times in a row.",
            "polarity": 0.14375000000000002,
            "subjectivity": 0.5708333333333334
        },
        {
            "body": "I hope the tree project takes off, that woman has dedicated so much time and effort to it",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "The only lady worth listening to was that lady in Burka. Come on bbc don't be a huge BBC. Could you not find any other better person like um naief? The lady in the begining is a rich privileged person and for some reason rich people always feel more hot than the others even if they are sitting inside a deep freezer. You should have talked with the guys working in labour who has to work outside in that heat hanging to a scaffolding putting tiles and cleaning windows hundreds of feet above the ground, close to the sun. They would have given you much better idea about the ground situation there, and they don't whine a lot like that rich lady even though they live in cramped labour camps smaller than chicken coops and the a/C's there barely work.",
            "polarity": 0.16868686868686866,
            "subjectivity": 0.5319444444444443
        },
        {
            "body": "The retired woman's expense is $100 a month's for watering the plants. The govt can do much better. Save your country.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "There are hundreds of videos showing poor people suffer , so why are every one complaining",
            "polarity": -0.4,
            "subjectivity": 0.6
        }
    ]
}