{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-01 01:40:14",
    "ups": "2540",
    "downs": "380",
    "views": "129624",
    "top_comments": [
        {
            "comment": "Plant more trees like the lady did",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Solution to the problem is to Plant trees 🌳🌲🌴🎋Plant trees 🌳🌲🌴🎋Plant trees 🌳🌲🌴🎋Plant trees 🌳🌲🌴🎋Plant trees 🌳🌲🌴🎋Plant trees 🌳🌲🌴🎋",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We dream of (terra forming) A new world when we are destroying our perfect one.",
            "polarity": 0.3121212121212121,
            "subjectivity": 0.48484848484848486
        },
        {
            "body": "This \"influencer\" is absolutely insufferable. All she did was complain about her own insignificant luxury problems...",
            "polarity": 0.4,
            "subjectivity": 0.95
        },
        {
            "body": "Why should we even be interested in this 'influencer's' petty problems? It's too hot for her little doggy, so move. What is she being paid for anyway?",
            "polarity": 0.10416666666666667,
            "subjectivity": 0.6166666666666667
        },
        {
            "body": "Kuwait government didn't even bother to plant trees dismissing it as imposible. Om Naif proved the oposite. The world has the wrong leaders.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "What's up with those tattoos, horrific.",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "It gets hot in the desert.",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "Seriously ? couldn’t they ask street cleaners as they spend much more time than influencer who is indoors all the time. Why her in particular¿ is it because she looks less Arab¿",
            "polarity": 9.25185853854297e-18,
            "subjectivity": 0.41111111111111104
        },
        {
            "body": "Kuwait is hot?\nHuh...🤔",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "Kuwait's population is slightly above the Islamic average, increasing 6-7 fold since 1950.  The madness of Climate Change requires the world to drastically reverse it's population growth,  otherwise many countries will suffer food/water insecurity as well as unbearable heat waves in coming decades.  Islamic nations, Africa and Central America are top population hot spots.  Everyone's survival, demands a  change in attitude towards family planning,  This requires a universal min marriage age, 21 in China, a universal maximum family size, compulsory birth control and equal rights to women.   The latter is singularly absent in Islamic society but necessary to reduce the birth rate.",
            "polarity": 0.1,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "No point even commenting on this youtube channel. BBC don't care LOL",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "iraq is same or more sometimes",
            "polarity": 0.25,
            "subjectivity": 0.3125
        },
        {
            "body": "The hadith does record that arabia will once again be green",
            "polarity": -0.2,
            "subjectivity": 0.3
        },
        {
            "body": "The woman in the high-jab and nigh-kab is amazing. So blessed.",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "Plant more trees like the lady did",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "It has always been so hot. The only thing that has changed is awareness of the fact brought on by modern means by which to measure the temperature. As well as the ability to communicate to the world about it. Power of the Internet. Cover the deserts with solar panels to convert the sunlight into electricity. Going about at night, instead of during the day, would be a good idea too. Nocturnal like as our ancestors used to be. When we measure the temperature it is required to put the thermometer in the shade of a \"Weather Box\" : What is a weather box ? You will need some sort of a box to protect some of your instruments and to keep the direct sun, rain and wind off them. The weather box should be placed so that the bulbs of the thermometers (or sensors) are 1.25 meters above the ground. ... What are the characteristics of Stevenson screen ? The Stevenson screen holds instruments that may include thermometers (ordinary, maximum/minimum), a hygrometer, a psychrometer, a dew cell, a barometer and a thermograph. Its purpose is to provide a standardised environment in which to measure temperature, humidity, dewpoint and atmospheric pressure.",
            "polarity": 0.125,
            "subjectivity": 0.46875
        },
        {
            "body": "Well, there's a reason that the original tribal people in the Gulf are so few in number....it's always been an inhospitable place for human existence, and this is Earth's way of reminding the Gulf people of that fact. Emiratis & Qataris are barely 10% & Kuwaitis 30% of their country's populations ,so they'll find ways to cope or else they'll migrate permanently away from the Gulf. Everyone else in those countries are foreigners anyway so they'll just move on or move home. The problems get much worse the further north you go, into the Iraqi river basin, where millions more locally-born people live, and it's burning up at a similar rate to Kuwait, temperatures in Baghdad are even more terrifying in Summer now than they normally were.\nHumans don't settle in Death Valley and they don't settle in the Danakil in northern Ethiopia, cos they're too damn hot to support life. Imagine if there was no AC, Dubai,Abu Dhabi,Kuwait City & Doha would barely even continue to exist.",
            "polarity": 0.02938311688311688,
            "subjectivity": 0.4749999999999999
        },
        {
            "body": "Bbc has lost the plot . How do we tackle climate change while we discuss Climate change in AC rooms 🤔",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Their oil makes co2 pollution. Now it comes back to them.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "يارباه.. أنى لها أن تتمتع بطيب العيش في ذاك السموم؟ كم هي الحياة قاسية على الأغنياء... رفقاً بهم",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}