{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-03 07:14:18",
    "ups": "3532",
    "downs": "487",
    "views": "195985",
    "top_comments": [
        {
            "comment": "This feels like a futuristic insight into a post-climate-crisis world where people have to live and work around the environmental extremities. \n\nSad thing is: it's happening right now.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.025974025974025983,
            "subjectivity": 0.6785714285714285
        },
        {
            "comment": "I bet VAMPIRES would hate this place.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.8,
            "subjectivity": 0.9
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Been in Kuwair 1984 to,1990 no,internet before,no one ever wallk outsude coz of weather so hot we only go out at night.",
            "polarity": 0.125,
            "subjectivity": 0.925
        },
        {
            "body": "Sorry not sorry, Kuwait is in the business of climate change... suffer",
            "polarity": -0.125,
            "subjectivity": 1.0
        },
        {
            "body": "One word: Bullcrap \n\nThe narrative the this documentary is trying to potray is exaggerated. The main focus was on Ascia, and how she has presented the situation is overblown. Essa Ramadan is a credible source, as he is the weather man of the countey, so no criticism towards him. \n\nNow back to the main focus of the video. We here in Kuwait, true we avoid the heat. Without AC is indeed stressful, but not life threatening or traumatizing, and during summer at the peak the heat wave, we either travel abroad or go to resorts or go to the beach. The heatwave does not prevent us from living our normal life. And you were still in the elevator, how on earth did you heat up imside the building when literally ACs are everywhere?\n\nAnd as for the car, you dont wait 30 mins or to cool down, 5-10 mins would've been a more accurate statement, and that is not to mention the quality of the car (fun fact: one of the main dealbreakers when buying a car is a ice cold ac). And who the hell takes their dog on a walk in the afternoon? At 11 am to 4 pm is the peak of the heat. Unless your crazy, or you dont have free time in the evening, no average Kuwaiti goes on a walk in the afternoon, we do that in the evening when the cool air kicks in.\n\nI wanna adress two more points worth brining up:\n\n1) Yes, it is true that the average heat has increased, but the quality of life and living standards are on average good. Which is a good segway to one of my major criticisms of this documentary.\n\n2) A huge thing that this documentary has missed to present is that not all people live in luxury. And one thing Ascia said that is true is that not everyone can \"Afford\". There are many low income workers, who not only live in accommodations that are difficult to bare, but they are also work under the sun during summer. I belive during this year's or last year's summer, a laborer dies due to a heat stroke. So if you wanna talk about struggling in the heat, BBC should've approach those folks, which brings up another domestic issue we have in this country which I belive they intentionally avoided in this documentary.\n\nLastly: The weather, right now, at the same time period as when this video has been released. The weather is cooling off. This period is camping season, where people wear thick jacket (Farwa) that cover the whole body due to how cold the weather can get in the desert. Perfect timing for a barbecue.",
            "polarity": 0.11059580397815694,
            "subjectivity": 0.46551509492685966
        },
        {
            "body": "I bet VAMPIRES would hate this place.",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "0:46",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "..the lady and her team who planted trees in Kuwait are real heroes in decreasing temperatures and motivating others to do the same..its really a concern for the entire world to overcome climate change..",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.375
        },
        {
            "body": "فما بالكم ب\"نارٍ تلظى لا يصلاها الا الأشقى الذي كذب وتولى\"\nتاب الله علينا وهدانا إلى سواء الصراط",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}