{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-04 12:04:43",
    "ups": "3892",
    "downs": "515",
    "views": "212483",
    "top_comments": [
        {
            "comment": "Influencer that  has 2.5M followers? that's all u got to say? Do nothing and keep complaining\nnow u know  Om Naief, help her  create a go fund me account,use your followers",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "“Some rich, with access to A.C., Gen Y’er complaining about the heat and hostility of Kuwait?………….That’s cute”!\n\n-Desert Storm vets",
            "polarity": 0.5,
            "subjectivity": 0.875
        },
        {
            "body": "just normal summer in middle east.....",
            "polarity": 0.075,
            "subjectivity": 0.32499999999999996
        },
        {
            "body": "English Class\nClass 6 to 12",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jes Wept, you lost me at influencer,,,,",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "9:36 ok, you need to rent a tanker to watering the plant with usd100 per month..how about the poor people who cannot afford to pay the water bills just to watering plant.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.55
        },
        {
            "body": "Oh no, the poor influencer girl is hot and dehydrated...",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.7250000000000001
        },
        {
            "body": "So the lady pays for getting desalinated water for her trees? Can one support her (costs? names? efforts?), so that she can broaden her endeavour? If more people did like she does, and as the meteorologist wants to do (create the forest in the north) it would really make an impact *_* I want to support that!\n\nEdit: Just heard the influencer talk about the fear for what the children's future looks like (I feel you sister).. Now, I don't know what research she has done on what SHE can do, but I hope she goes and does some and then gets herself and her family immersed in making a change. For starters, turn of the AC, move out of the high rise and stop consuming luxury (IMPORTED) items. Easier said than done, but doable.",
            "polarity": 0.22199999999999998,
            "subjectivity": 0.293
        }
    ]
}