{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-02 18:52:26",
    "ups": "3351",
    "downs": "470",
    "views": "185700",
    "top_comments": [
        {
            "comment": "DOGS ARE FORBIDDEN IN ISLAM THE PROPHET HATED THEM AND SAID THEY SHOULD BE KILLED.",
            "likes": 1,
            "number_of_replies": 2,
            "polarity": -0.55,
            "subjectivity": 0.35
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Good old auntie (BBC) Another long winded, boring report .Totally out of touch with normal people and their problems.",
            "polarity": -0.020000000000000025,
            "subjectivity": 0.5700000000000001
        },
        {
            "body": "It's only just begun \nIn the next few years you won't be able to venture outside became of the \nBlistering heat, where your shoes start to melt on the \nGround",
            "polarity": 0.06,
            "subjectivity": 0.35500000000000004
        },
        {
            "body": "You shouldn't walk dogs in heat. They have a different metabolism to humans and it can kill them.",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "The \"influencer\" is so out of touch. She is what I hate about tik tok and the new generation.",
            "polarity": -0.33181818181818185,
            "subjectivity": 0.6772727272727272
        },
        {
            "body": "As far as I'm aware they're not doing anything to stop climate change. That would be a great start for Arab nations who are some of the biggest polluters. We can't live in this small mind where the world is a couple thousand years old and Allah will take care of everything. Sadly this is the mindset of many. No hate, but if we wanna survive as a species we all need to step up and become far more evolved and aware.",
            "polarity": 0.19886363636363635,
            "subjectivity": 0.6041666666666666
        },
        {
            "body": "DOGS ARE FORBIDDEN IN ISLAM THE PROPHET HATED THEM AND SAID THEY SHOULD BE KILLED.",
            "polarity": -0.55,
            "subjectivity": 0.35
        },
        {
            "body": "Notice the difference between the thot influencer that produces and creates and contributes nothing, vs the proactive Niqabi mother who plants trees",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Planting trees 🌳should also be a priority   in Dubai,  not only skyscrapers.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Climate change make rich people\nActivity but bite poor people's without kind",
            "polarity": 0.19166666666666665,
            "subjectivity": 0.75
        },
        {
            "body": "It makes you wonder how the poor live",
            "polarity": -0.13181818181818183,
            "subjectivity": 0.55
        },
        {
            "body": "Karma for fossil fuel irresponsiblity! JMHO.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Arab countries esp in d Arabian peninsula has to invest in planting more trees to cool down the temperature.",
            "polarity": 0.23148148148148148,
            "subjectivity": 0.47962962962962963
        },
        {
            "body": "Meanwhile in sub-Saharan Africa(Sahel region) we topping high 70s to low 80s  most days now \nThis year is even worse we were in the high 90s to low 100• Fahrenheit now that’s hot",
            "polarity": 0.09571428571428572,
            "subjectivity": 0.5185714285714286
        },
        {
            "body": "I just don't trust BBC, ITS LIKE BEST BULLI CHANNELS.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Its, nothing for people like us, we walk around 14 to 15 km every day during our job.\nFor our families and the responsibility we may feel like, \"ya today a bit too hot,\" and continue the flow.\nMy job is fair compared to delivery guys, cleaning staff, restaurants chef, oilfield and construction workers etc.\nR they not humans.\nThey just don't care.\nThey follow the flow and continue their job, because they love it.\nU guys are far better and lucky.",
            "polarity": 0.3972222222222222,
            "subjectivity": 0.7805555555555556
        },
        {
            "body": "I once worked in Kuwait 2016 to late 2018 in Al Manqap,their i experienced nosebleeding always,very hot outside during  summer,...but in 2019 they had experienced heavy raining and flooding right?blessing",
            "polarity": 0.225,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "Still another country that suffers exceptional heat.",
            "polarity": 0.033333333333333326,
            "subjectivity": 0.85
        },
        {
            "body": "when you have the realization that the world is heating up for you... why do you keep bringing more children into it ????",
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ]
}