{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-31 21:32:46",
    "ups": "2463",
    "downs": "366",
    "views": "122416",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Planting tress is the only option we have left now, but government across the world are still not investing in this but others.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "People who watch BBC are considered somehow educated .. there for it s very in your face to show the difference between people..  all bliss for the tree lady indeed.. only because she proves smthg instead of giving up on it (without A/C 🤦)\nit makes sense to makes this episode .. it s only so divided by your own perception.",
            "polarity": 0.22000000000000003,
            "subjectivity": 0.6599999999999999
        },
        {
            "body": "Ok",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "I've lived in many hot humid places through out Africa in my 50 years. Places where 40C° is normal in the hottest month (Feb), it has pushed the needle to 45C° every now and then but the average would be 35C° a temperature that became normal to me. As I got older it really got to me, you live and work in air conditioned places and seldomly venture outside, you don't even bother to swim because the water is too hot, it becomes ridiculous, you just dont get fresh air. We recently moved to a coastal town a couple of hours away from Cape Town and it is bliss. The winters are mild and we will have a 30C° plus summer's day now and then, it is mostly mild and cool in summer and I love it. I could never be able to live in this kind of heat in Kuwait even though I'm used to heat. Imagine 50C°!😰",
            "polarity": 0.2186363636363636,
            "subjectivity": 0.5504166666666668
        },
        {
            "body": "\"Ooooh baby are you hot,we should go home uurgh ,when you have BEST completion\"\n😂😂😂😂😂😂😂I swear this is so funny it's real..I mean,why dont you go and ask people who works under the sun",
            "polarity": 0.625,
            "subjectivity": 0.65
        },
        {
            "body": "The women planted 5-10 trees and made workers water them by hand. This is not a sustainable project, good for her for doing it but how many people can you find to water 10K trees for 200-300$ a month?",
            "polarity": 0.6,
            "subjectivity": 0.55
        },
        {
            "body": "Try \"influencing\" people to consume less, stop driving and flying, and stop procreating.",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "നിങ്ങൾക്ക് എന്തെങ്കിലും ചെയ്യണമെങ്കിൽ അതിനെക്കുറിച്ച് ചിന്തിക്കരുത് അതിനെക്കുറിച്ച് ചെയ്യുക",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Global warming 🌡️🤒",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The  lady planting trees needs a go fund me account for real.  She needs to plant bamboo trees, those spread fast",
            "polarity": 0.2,
            "subjectivity": 0.45
        },
        {
            "body": "What a joke they are taking interview of people who all day in air conditioner .....😜😜😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "جزاج الله خيرا يا أم نايف",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "BBC. Switch off the comments. Everyone hates you.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Living in North Florida, actually everywhere in the states, all the houses have gardens in front and back. but the people plant lawns, monocultures of a grass that gives nothing to the animals and makes it a desert for any type of life. With the change in climate, one would think people would be eagerly planting fast growing trees, flowers that are attractive for bees, butterflies and moths, create an ecosystem for the creatures around here, but no.  They prefer their monoculture that needs to be mowed every 3 weeks, takes a lot of water and gives nothing. Seems to me the govt should be putting out public services announcements re this situation.  But nothing but apathy and inaction , everywhere. My house looks like a cottage in a forest.. it is absolutely beautiful with the trees, lablab beans, milkweeds for the butterflies, and 4 or 5 other plants with lots of greenery and flowers , offering food and shelter to the creatures.  I wish someone would do something about this. It makes me so frustrated, because that monoculture covers all areas cement does not cover. Are we all that stupid , really?",
            "polarity": 0.042500000000000024,
            "subjectivity": 0.4541666666666667
        },
        {
            "body": "Plant trees. Lots of them. Paint the buidings soft green.  put covers on the playgrounds and parking lots. For America, wake up everybody... fill with trees and plants your revolting monocultures.",
            "polarity": -0.05,
            "subjectivity": 0.32499999999999996
        },
        {
            "body": "Life below zero here in Scandinavia",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Allah's Messenger (ﷺ) said, \"There is none amongst the Muslims who plants a tree or sows seeds, and then a bird, or a person or an animal eats from it, but is regarded as a charitable gift for him.\" - Sahih al-Bukhari 2320",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "This girl garnered her influence from being the perfect middle eastern Hijabi no joke 5 years ago. Now she looks like a valley girl. Complete with a designer dog. One of the many reasons I don't pay TV license, BBC is abusing the funding they receive in peddling influencers as advocates for climate change with no real credibility or merit. What a joke.",
            "polarity": 0.3,
            "subjectivity": 0.44000000000000006
        },
        {
            "body": "The Holy Quran\n\nOne\nSurah 39:4\n\nLight\nSurah 24:35\n\nLord of The Heavens \nand The Earth\n\nSurah 19:38\nThey Will Hear and\nSee The Day\n\nSurah 19:65\nWhat is in Between\n\nOne\nSurah 37:4\n\nPharaoh\nSurah 10:88\n\nKing James Version\n\nRevelation 22:18-19\nThis Book\n\nExodus 24:7\nThe Book\n\nLIGHT\nIsaiah 60:1\nThe Glory of The\nLord\n\nGod is The Lord\nPsalm 118:27\n\nRoman 8:28\nLove God\n\nLight\nPsalm 118:27\n\nGod and Father\nEphesians 1:3\n\nGod\nPsalm 99:9\n\nOne Is Your Father\nMatthew 23:9\n\nGod is Light\n1 John 1:5\n\nEphesians 1:4\nUs In Him\n\nLight\nGenesis 1:3\n\nLight\nJohn 12:36\n\nThe Mighty One\nIsaiah 1:24\n\nMale and Female\nMatthew 19:4\n\nLight\nPsalm 90:8\n\nIn Him we Live\nActs 17:28\n\nOne People\nGenesis 11:1-9\n\nChildren of Light\nEphesians 5:8\n\nThe Holy One\nIsaiah 43:3\n\nChildren of Light\n1 Thessalonians 5:5\n\nOne God\nEphesians 4:4-6",
            "polarity": 0.33116883116883117,
            "subjectivity": 0.6119047619047621
        }
    ]
}