{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-01 18:09:03",
    "ups": "2877",
    "downs": "437",
    "views": "153097",
    "top_comments": [
        {
            "comment": "This is the BBC propaganda film. Kuwait has always been a very hot country. Northern and Eastern Europe has always been cold. Summer 2021 was even cooler there than it used to be in previous years. Let her remove those ugly tatoos from her hands and she will feel at once much cooler.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.17361111111111113,
            "subjectivity": 0.5777777777777778
        },
        {
            "comment": "Bravo to the lady who planted those trees, she should be an influencer to the people of Kuwait not the so call Instagram influencer showing  her and kids lifestyle. \nGREEN VEGETATION CAN MAKE A BIG DIFFERENCE IN KUWAIT.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.2
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Start painting the roads white instead of the blacktop - that will help a couple degrees I think.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is the BBC propaganda film. Kuwait has always been a very hot country. Northern and Eastern Europe has always been cold. Summer 2021 was even cooler there than it used to be in previous years. Let her remove those ugly tatoos from her hands and she will feel at once much cooler.",
            "polarity": -0.17361111111111113,
            "subjectivity": 0.5777777777777778
        },
        {
            "body": "#TeamTrees",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How can a place like this be 100% powered by fossil fuels?! Hard to be sympathetic really. You reap what you sow - in this case - literally.",
            "polarity": 0.1361111111111111,
            "subjectivity": 0.5805555555555555
        },
        {
            "body": "dealing with Kuwaits unbearable heat - insert north american family? you kiddin bro?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "looks like she's still driving a combustion engine car...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "She is a great lady doing really something to save humanity. God bless her",
            "polarity": 0.5,
            "subjectivity": 0.475
        },
        {
            "body": "Poor people in sad for you crying🥲",
            "polarity": -0.45,
            "subjectivity": 0.8
        },
        {
            "body": "Feel free to smash the Dislike button people!",
            "polarity": 0.5,
            "subjectivity": 0.8
        },
        {
            "body": "I think of the women who wear the full body coverings that are black (which attracts heat) and going through menopause and having hot flashes. It must be awful!!",
            "polarity": -0.14166666666666666,
            "subjectivity": 0.7083333333333334
        },
        {
            "body": "Gee, no hat, walking g on pavement,  masses of concrete and glass creating heat islands, wearing black fitted ( probably manmade fibets)clothing \ndoesn't help. Trees do grow but they have over built the city.",
            "polarity": -0.008333333333333318,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "I only like Om Naif in this video",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Bravo to the lady who planted those trees, she should be an influencer to the people of Kuwait not the so call Instagram influencer showing  her and kids lifestyle. \nGREEN VEGETATION CAN MAKE A BIG DIFFERENCE IN KUWAIT.",
            "polarity": -0.1,
            "subjectivity": 0.2
        },
        {
            "body": "The only way to stop it is to pull the plug on the life you now take for granted. An electric car still needs power which they get from power stations, not the green fairy. Let alone shipping, flight, trains and trucks.",
            "polarity": -0.1,
            "subjectivity": 0.65
        },
        {
            "body": "Oh so we should feel so sad because she can't \"film\" when it's hot nobody cares!! What about all the people who have to work in this heat everyday and they have the lowest salaries!! This is garbage",
            "polarity": -0.140625,
            "subjectivity": 0.8166666666666668
        },
        {
            "body": "heheheh. maybe selling all that oil wasnt such a great idea. maybe camel herding was actually the more noble option all long.",
            "polarity": 0.3083333333333333,
            "subjectivity": 0.525
        },
        {
            "body": "You had me until \"in my line of work\" as an Instagram influencer",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would like to have seen more about the retired lady planting those trees, and if the Kuwaiti authorities will follow her lead in doing mass planting in the desert.  🏜",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "How are people surviving after that big explosion at the harbor and is electricity is on and staying on or are the Kuwaiti people suffering more from the extreme heat? How are the rest of people surviving the heat because this lady worries as she can leave and go elsewhere to live and her family also",
            "polarity": 0.1278409090909091,
            "subjectivity": 0.525
        },
        {
            "body": "BBC is such a waste of money!!",
            "polarity": -0.15625,
            "subjectivity": 0.25
        }
    ]
}