{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-31 00:58:05",
    "ups": "1548",
    "downs": "244",
    "views": "68716",
    "top_comments": [
        {
            "comment": "Because of the economic crisis and rate of unemployment, now is the best time to invest and make money💯",
            "likes": 22,
            "number_of_replies": 29,
            "polarity": 0.6,
            "subjectivity": 0.25
        },
        {
            "comment": "🤔🤔😘😘😘👏👏👏👏👏👏👏👏👏 For all WOMEN 🗽🗽😎",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Bless the Kuwait City is better soon.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "How about not living there and maxing out the A/C and contributing to more power consumption",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Dear friends,  I am here to kindly appeal for your help.i am a Zimbabwean and in severe financial distress,  my health is failing due to my troubles. Any amount is greatly appreciated. Am sorry if I sounded rude or offended anyone",
            "polarity": -0.020833333333333325,
            "subjectivity": 0.49583333333333335
        },
        {
            "body": "This stupid influencer could simply wear cooler and more comfortable clothes and stop bitching about the problem and do something about it, just saying.  I've done construction work in 120 degrees f (50c) before, she needs to grow up",
            "polarity": 0.025000000000000022,
            "subjectivity": 0.6642857142857144
        },
        {
            "body": "Where I live in the high Canadian rockies, it is -45 degs C in Dec to end of Feb.  Stop your whining.",
            "polarity": 0.1481818181818182,
            "subjectivity": 0.52
        },
        {
            "body": "Thank you Ms. Naief.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "https://youtu.be/x4kgMyGki4g",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "https://youtu.be/x4kgMyGki4g",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hmm... I don't get what the \"influencer\" contributed to this video in showing her perspective on the country's intense heat. If anything, makes her look bad and spoiled. Yes, it's hot because Kuwaitis are enjoying a modern, civilised, concrete jungle in the middle of the scorching desert heat. I mean, kudos to the older woman and the meteorologist for recognising this, acknowledging the problem, and proposing feasible solutions followed by real action and \"boots on the ground.\" Other than that, what I got from the \"influencer\" was whining about how hot it is, how much she and her family suffer, and how to live your life around this heat crisis by structuring daily necessities, etc. Pathetic and sad, I recommend an additional crisis be recorded for Kuwait to tackle... a detached generation of spoiled brats who want cooler temperatures without having to give up any of their modern-day luxuries or change any of their carbon inducing habits.",
            "polarity": -0.02555704099821745,
            "subjectivity": 0.5183823529411765
        },
        {
            "body": "If you would've told me yesterday that is hot af in the desert I would've never known. Thanks BBC!",
            "polarity": 0.25,
            "subjectivity": 0.525
        },
        {
            "body": "wow - and people say it is wrong to burn women",
            "polarity": -0.2,
            "subjectivity": 0.95
        },
        {
            "body": "Keep up the propaganda, climate change is a brilliant example of the big lie, there is nothing so absurd that people will not believe it as long as they hear it repeated endlessly. Humans create less than a thousandth, much less, by the IPCC's own figures, of so called greenhouse gasses, but we are supposed to believe it contributes a measurable warming effect? The Earth is colder now, a lot colder that at most other times since life arrived, there has been no measurable increase in the gradual rise in sea level ever since the end if the last Ice Age, in fact the IPCC has run out of sea level experts to have on there advisory list, they have all refused to go along with the sea level predictions which are just stupid. 1934 was warmer by a long way than any time since. The last 6 months have been the coldest since records started in Antarctica. And most importantly we already know that CO2 levels are driven by temperature, Not the other way round, as Al Gore pretended in his film, by showing a graph back to front. That film got him an Oscar and a Nobel prize, so we know those two bodies are in on the scam, because they know that he lied outright, many times in An Inconvenient Truth. The only people who believe in it are simply people who know nothing about it. Well that's my rant for the evening.",
            "polarity": 0.016319444444444456,
            "subjectivity": 0.5009920634920636
        },
        {
            "body": "About time they spare some time and money aside from luxury holidays and expensive cars into improving the climate .. like the lady who planted trees and maintains at personal cost !!",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Because of the economic crisis and rate of unemployment, now is the best time to invest and make money💯",
            "polarity": 0.6,
            "subjectivity": 0.25
        },
        {
            "body": "This is garbage.. intended to play on your emotion.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🤔🤔😘😘😘👏👏👏👏👏👏👏👏👏 For all WOMEN 🗽🗽😎",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Why do people keep insisting they know the reason for climate change?? Maybe it's fossil fuels and maybe it isn't.\n\nThe historical record is filled with large climate swings. Do you blame fossil fuels for climate change that occurred 10,000 tears ago?",
            "polarity": 0.20476190476190478,
            "subjectivity": 0.44285714285714284
        },
        {
            "body": "This isn’t news. This is propaganda. Shame on you BBC.",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "Yes, Kuwait is hot. It was hot when I was there in the late 70s.",
            "polarity": 0.06666666666666667,
            "subjectivity": 0.7666666666666667
        },
        {
            "body": "Love Kuwait! Godbless with this heat 🖤",
            "polarity": 0.625,
            "subjectivity": 0.6
        }
    ]
}