{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-31 13:18:29",
    "ups": "2123",
    "downs": "326",
    "views": "104308",
    "top_comments": [
        {
            "comment": "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today..",
            "likes": 28,
            "number_of_replies": 27,
            "polarity": 0.7,
            "subjectivity": 0.9
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "المقطع عبارة عن ترويج لرجيع الأمم وقيء الحضارات ماعدا التي زرعت الأشجار .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That Kuwaiti lady who plants the trees is awesome. She takes the issue head on and never backs down despite all the disparagement. She's so inspiring.",
            "polarity": 0.4481481481481482,
            "subjectivity": 0.762962962962963
        },
        {
            "body": "Massive solar farms will shade the ground so it can be cultivated. They reflect the heat and keep the heat off the ground and make it arable and produce massive amounts of electricity. Also thermal vectors can harness rising heat to produce electricity. It's the only way.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "That lady is living in some imaginative lifestyle delusion of what an average Western family lives like. It's cringe.",
            "polarity": 0.15,
            "subjectivity": 0.36666666666666664
        },
        {
            "body": "Kuwait hot?\nYou do surprise me....😂",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "It's time to return all u have spent guys... It's a vicious circle, exploiting oil and selling it to live comfortably, whereas it is going all wrong and u can't buy a life of ease by destroying ur environment. OPEN YOUR EYES, JUST OPEN YOUR EYES.",
            "polarity": -0.15795454545454546,
            "subjectivity": 0.5375000000000001
        },
        {
            "body": "Out of all Kuwaitis, you ended up getting some spoiled \"social media influencer\"?\nGod, even her immitation of an American accent is infuriating.",
            "polarity": -0.18888888888888888,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "It's a desert. It's supposed to be hot.",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "The fossil fuel producing countries are responsible for global warming, they financed the disinformation campaign that tried to hide it for decades - we are supposed to be sympathetic to them now? They had a free ride, often holding the world to ransom, and they spent the money on mansions, private jets and super yachts instead of infrastructure and the betterment of their populations.",
            "polarity": 0.19047619047619047,
            "subjectivity": 0.4988095238095238
        },
        {
            "body": "Talk talk talk. Then do something. The govt needs to plsnt more trees, more vegatation..",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Lots of wishes and thanks to that lady ...",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "You should ask daily labours about heat instead of some random fancyass influencers..🤦‍♂️🤦‍♂️🤦‍♂️",
            "polarity": -0.25,
            "subjectivity": 0.25
        },
        {
            "body": "Good God! This is terrible.",
            "polarity": -0.0625,
            "subjectivity": 0.8
        },
        {
            "body": "So even when it is so obvious what they need to do, namely built solar and plant trees, the Kuwaiti government can't be assed since they profit from fossil fuels. Same as in Australia, where they had to add a new color for the weather forecast to be able to depict the new heat coming for them, yet they continue to put their coal economy over everything else. Mankind is so dumb it hurts.",
            "polarity": 0.06628787878787878,
            "subjectivity": 0.4431818181818182
        },
        {
            "body": "Kuwait hello from America!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pls, take climate change more seriously around the world.  That is the message.",
            "polarity": 0.08333333333333334,
            "subjectivity": 0.5833333333333333
        },
        {
            "body": "\"Kharak is burning.\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today..",
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "body": "She’s keeping a car running for 30 mins to cool it down?! Not sure how sustainable that is 😂😭🙃",
            "polarity": -0.0314814814814815,
            "subjectivity": 0.6092592592592593
        },
        {
            "body": "Construction in Kuwait is carried out in accordance with international standards. Without taking into account local environmental.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}