{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-05 08:40:41",
    "ups": "4102",
    "downs": "529",
    "views": "222256",
    "top_comments": [
        {
            "comment": "Hello, kuwaiti here. Lived my entire life in kuwait. Nothing worse than going to work while forced to park your car under no shade in this heat. By the time work is done, the inside of the car temperature reaches 60c and no amount of AC helps. Imagine almost every single day getting cooked alive like that. Its inhumane. I despise the idea of leaving home no matter how boring it gets.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.3673469387755102,
            "subjectivity": 0.5627551020408162
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Stop talking make an impact ...a journey of a thousand miles start with one step..the government should start encouraging its people to start tree planting and implement that program\nWhen the temperatures are low and in ten years from now  kuwait will be vegetative and no more compains\n#stoptalkingact",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "Why keep making shallow people who do more harm than good famous? Even her botox get in the way of making her story a little bit compelling. \"You've got to stop using straws to save the turtles.\" 🤣Someone tell her about microplastics, oil spills, toxic waste, the fashion industry of which she's a captive customer...\r\nWhy feed into the toxic Instagram culture, BBC? —Rhetorical question. \nPeople who are trying to make a positive impact should be given the spotlight. People like this awesome lady and the metereologist who are actually doing something about the problem. Even the thumbnail shows the \"influencer.\" 🙄",
            "polarity": 0.24603994490358128,
            "subjectivity": 0.540495867768595
        },
        {
            "body": "This is utterly stupid.if you wanna how bad the heat would be..you gotta talk to migrant laborers",
            "polarity": -0.3499999999999999,
            "subjectivity": 0.8333333333333333
        },
        {
            "body": "And the Hedghogs!!! ahh how i miss that, hedgehogs are cooler common critters than squirrels lol",
            "polarity": 0.25,
            "subjectivity": 0.6
        },
        {
            "body": "Women in Kuwait are amazing like Om Naief you cant mess with them lol If they want to get it done they will get it done. ask the mullahs who kept trying to keep them out the Government.",
            "polarity": 0.4083333333333334,
            "subjectivity": 0.5916666666666667
        },
        {
            "body": "Mashallah, i want to come back to Kuwait and make the whole place green, god bless you khalty",
            "polarity": 0.0,
            "subjectivity": 0.2333333333333333
        },
        {
            "body": "Hated those sandstorms never saw it in my whole life living there and all of the sudden from 2006 more and more",
            "polarity": 0.06000000000000001,
            "subjectivity": 0.52
        },
        {
            "body": "The \" influencer\" is full of BS and herself.",
            "polarity": 0.35,
            "subjectivity": 0.55
        }
    ]
}