{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-02 10:37:57",
    "ups": "3127",
    "downs": "455",
    "views": "171581",
    "top_comments": [
        {
            "comment": "They have so much sun! Why not talk about putting up solar panels in all that desert and on the buildings? We did it in Las Vegas. It's affordable, clean energy.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.30833333333333335,
            "subjectivity": 0.45000000000000007
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Well, that is karma for exploiting crude oil.",
            "polarity": -0.7,
            "subjectivity": 1.0
        },
        {
            "body": "If it's so hot why are the people there so white?",
            "polarity": 0.125,
            "subjectivity": 0.42500000000000004
        },
        {
            "body": "Its scary",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "The lady with the tatoos is a American as blueberry pie",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You shouldn't have that dog there , if your struggling then that dog is literally dying , so your a terrible owner making him live there",
            "polarity": -0.4318181818181818,
            "subjectivity": 0.75
        },
        {
            "body": "This is horror. Specially for people not wealthy and people pushed to wear black.",
            "polarity": -0.019841269841269837,
            "subjectivity": 0.6682539682539682
        },
        {
            "body": "The desert area always is hotter than other land''s",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "Solar panels and wind turbines would massively decrease their consumption of fossil fuel.  The Kuwait government MUST get these things in place and it has to happen NOW!!!\nThey also need to consult with the lady who, out of her own pocket, has shown them that trees can, indeed, be grown successfully. \n\nWhy did I have to watch entering and exiting an internal elevator?   Why did the BBC think it was important for us to see her (and her family) enjoy the privileges that being an influencer has provided?  \n\nI would much rather have seen the people who don't have an a/c, those people who are so poor they don't have shoes  -  shoes that would protect their feet from scorching ground,   I would have loved to have the coping strategies of these people.",
            "polarity": 0.2944444444444445,
            "subjectivity": 0.6722222222222222
        }
    ]
}