{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-30 16:46:01",
    "ups": "1120",
    "downs": "166",
    "views": "38533",
    "top_comments": [
        {
            "comment": "The impact of the oil that made them wealthy is now going to make them poor. Ironic",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.09999999999999999,
            "subjectivity": 0.8333333333333334
        },
        {
            "comment": "This video is basically like asking a rich man what living in poverty is like.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "comment": "This Influencer is essentially tutoring that dog, keeping him in a country so hot. - \"BAD/EVIL INFULENCING!\"",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.15625,
            "subjectivity": 0.5750000000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Wealthy influencer, lazy journalism.",
            "polarity": 0.125,
            "subjectivity": 1.0
        },
        {
            "body": "Kuwait is a small city-state, which makes it more feasible to attempt to geo-engineer it for a cooler ambient temperature. But it's quite a ambitious dream to think that some trees in the desert would change it noticably. Think about all the heat coming from Iraq and Saudi Arabia. The amount of thermal mass is incredible by comparison.\n\nI think that this city is a heat island, in the desert, like many of the urban landscapes of that region. And it absolutely is a \"snowball\" effect in terms of making it even hotter attempting to cool it down with a/c.\n\nPotential short term solutions could be to decrease activities in the summer. Basically, get people in doors, and reduce the need to commute. It's definitely better in the winter, and that should be their \"summer\", in terms of activity. It's not something you can just do on a whim though, they need economic support during down times.\n\nIn extreme climates like this, you really have to think outside the box. Maybe there's a way to store the cold during the winter, and use it to regulate the summer. Sounds absurd though.",
            "polarity": 0.09546783625730998,
            "subjectivity": 0.5488304093567251
        },
        {
            "body": "This video is basically like asking a rich man what living in poverty is like.",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "People keep electing absolute idiots that deny climate change is a thing. We’re more advanced than ever technologically and people are dumber than ever",
            "polarity": 0.07499999999999998,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "eeeeeew 0:50 look at the tattoos on the stinking animal",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Whaaaaat! Everytime she spoke she dissed kuwait seriously!!\nYou’re living in kuwait not in hell.. people do go out but there are certain timings.\n\nAlso; show the real life expats living and working there outside at 50c\n\nIt’s a luxurious apartment with central AC. \n\nTry going to some random people.. the life is great out there. It’s amazing. 11am to 4pm markets are usually close. And night life is amazing! \n\nIt’s alarming the increase heat but doesn’t mean people are living in hell. \n\nIf she’s too concerned she might aswell go back to USA.",
            "polarity": 0.0677655677655678,
            "subjectivity": 0.4942765567765568
        },
        {
            "body": "Couldn't happen to a nicer bunch. They all have servants and they treat them like slaves. That's aside from the fact that they are dealing with a problem of their own making.",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "She has American accent.  She thinks she is American 😂🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "God given solar energy needs to be used.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The impact of the oil that made them wealthy is now going to make them poor. Ironic",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "When climate scientists warn you that many areas in the world will become inhabitable for humans by the end of this century, they are not joking.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "This Influencer is essentially tutoring that dog, keeping him in a country so hot. - \"BAD/EVIL INFULENCING!\"",
            "polarity": 0.15625,
            "subjectivity": 0.5750000000000001
        },
        {
            "body": "solar panels (and batteries)? take some of the fossil fuel money and put them on top of every house, building, and vehicle, and reduce the 100% reliance on fossil fuel...if the companies won't do it, might take the government to take responsibility",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Their country is baking, yet they generate 100% of their electricity from fossil fuels...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't moan Ascia, think about all the kids that are in those temperatures in a tent instead of your lovely house or car",
            "polarity": 0.5,
            "subjectivity": 0.75
        },
        {
            "body": "It can't be that hot if she is dressed from head to toe in all black.",
            "polarity": 0.04166666666666667,
            "subjectivity": 0.6416666666666667
        },
        {
            "body": "Save 🌿🌏🌏🌿",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Save 🌿🌏🌏🌿",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "She is watering the trees she planted. How would they water vast stretches of planted forest in a desert?",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "She’s a clueless idiot who over uses phrases and ideas like “speak truth to power” or  “aspirational experience”",
            "polarity": -0.8,
            "subjectivity": 0.8
        }
    ]
}