{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-31 17:25:31",
    "ups": "2305",
    "downs": "347",
    "views": "112888",
    "top_comments": [
        {
            "comment": "Right now we are in winter, so it's not hot  anymore, and from last year the heat has not been too much, so it's good the way it is and we are used to it.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2151785714285714,
            "subjectivity": 0.513095238095238
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "@2:00  She may be a talentless  tiktoker ....which is irrelevant with bad overacting ...I clicked to obtain some info not this b.s 👎",
            "polarity": -0.5999999999999999,
            "subjectivity": 0.8333333333333333
        },
        {
            "body": "Maybe if she took a layer of her clothing it would be 10c less hot. Kuwait of all countries has the money, gold and cash to air condition what they find a need to cool down. They built islands out of sand that didn't exist there for God's sake.",
            "polarity": 0.06944444444444445,
            "subjectivity": 0.46388888888888896
        },
        {
            "body": "What the other ( and not the rich influencer) woman does - planting trees - is much more interesting!!!",
            "polarity": 0.431640625,
            "subjectivity": 0.53125
        },
        {
            "body": "Lets hold a football match every day for a month see how hot they get LMAO",
            "polarity": 0.425,
            "subjectivity": 0.925
        },
        {
            "body": "Death Valley: are you challenging me?",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "After watching DUNE recentlys cannot imagine how the people are coping to live in that heat wave.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "She is wearing long sleeve",
            "polarity": -0.05,
            "subjectivity": 0.4
        },
        {
            "body": "Total list opportunity.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "Couldn’t you have found more normal people . I mean who really cares about the lifestyles of the rich and famous , not me .",
            "polarity": 0.2354166666666667,
            "subjectivity": 0.63125
        },
        {
            "body": "I think I have counted far too many hypocracy points.\n.....\n3 kids not 1\nVery big car with big engine.\nBeing influencer\nBulding towns in deserts in the first place.\nDark 3 lane wide roads that ends massively to accumulation of heat\nNo public transport. What for?if the fuel is cbeap. \nAir conditioning at least tbey mentioned it\nFlying to States and Europe few times a year\nElectrics blinds\nPromoting fashion is the best one.\n....... \nBBC. THE CHANNEL OF PROPAGANDA AND HYPOCRACY. \n....... \nHow one tv station can support massively Royals(upper clases) , bashing every 5 minutes  comunism, speak at the same time so passionately about ecology. \n...... \nCan someone explain me tbis? \n....... \nWhat is communism?\nComunism is one surgery where GP works in one place. \nCapitalism is GP works for 3 days in one place for NHS and has extra second office in private surgery with the same amount of equipment that needs to be produced and exposed. At tbe end of the day you need two buildings and the CO2 adds up.",
            "polarity": 0.0475,
            "subjectivity": 0.36759615384615374
        },
        {
            "body": "If you want to fix the climate then you have to end capitalism\nCapitalism is dead, Communism works\nKill money save people\nProduce goods for all without polluting the earth and give it to all\nEverybody will be happy\nCapitalism cannot do that because it can only produce goods for the people who can afford it\n\nNot everyone will be able to afford BEV & FCEV vehicles globally\n\nBut nature wants us to stop and end fossil fuel immediately it's very urgent requirement for the very existence of mankind\n\nKarl Marx hated money more than God\n\nCommunism is not about killing God \nCommunism is about killing money",
            "polarity": 0.12999999999999998,
            "subjectivity": 0.4925
        },
        {
            "body": "Must be very difficult trying to plan things in such very high temperatures",
            "polarity": -0.14733333333333334,
            "subjectivity": 0.734
        },
        {
            "body": "I am from Scotland and 30 degrees celsius is unbearable for me. I couldn't imagine 50 degrees.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Islam is the worst than global warming..More than 1400 years of superstition, ignorance and imagination.",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Influencer? Give me a break! You say that is the reality for all parents over there? You dont have a clue because youre living an Ac apartment ,Have an AC car & dont have to work out in the heat,! You definately influence me! With disgust that is!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "At least they plant 🌱 trees 🌲 so the soil around it will keep cool. In Latin America the Governors and presidents continue to cut trees 🌲.",
            "polarity": 0.024999999999999994,
            "subjectivity": 0.525
        },
        {
            "body": "I have mixed feelings about hearing their issues, they became immensely rich by selling the oil which has greatly contributed to their own problems.",
            "polarity": 0.44375,
            "subjectivity": 0.6875
        },
        {
            "body": "That lady lied, the temperature didn't reach 56° this year",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Right now we are in winter, so it's not hot  anymore, and from last year the heat has not been too much, so it's good the way it is and we are used to it.",
            "polarity": 0.2151785714285714,
            "subjectivity": 0.513095238095238
        },
        {
            "body": "Live at night?",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        }
    ]
}