{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-06 01:10:11",
    "ups": "4266",
    "downs": "547",
    "views": "229608",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Informative mini documentary minus the influencer seemingly moaning about the heat affecting her luxurious lifestyle for her and her ‘poor’ children. 🥱",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.2333333333333333
        },
        {
            "body": "Why dont they ask the locals these questions not some rich person telling us how unbearable the heat is under the AC 24/7. While the other lady in hijab planting trees out in the heat without any artificial air around her. The local lady in her hijab is  the real hero. Why dont the rich one go out and plant a tree with her if she is so concerned, but no instead she decides to build climbing 🧗‍♀️rocks for her kids lool wtf are we watching",
            "polarity": -0.03928571428571428,
            "subjectivity": 0.5964285714285714
        },
        {
            "body": "Respect to the lady who set an example by growing the trees! But the fashion show of the instagrammer is ridiculous!!!!",
            "polarity": -0.8138020833333331,
            "subjectivity": 1.0
        },
        {
            "body": "The worst documentary from BBC",
            "polarity": -0.5,
            "subjectivity": 0.5
        },
        {
            "body": "please people let's be nice to that influencer she did nothing wrong",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.95
        },
        {
            "body": "The influencer is in better conditions than me in Switzerland. What's the point of interviewing her in her air conditioned apartment, car and ice cream shop. I mean, there should be more suffering people there?! What can she tell us more about than a worker which has to go out and really suffer and went back in his non luxury home.",
            "polarity": 0.2520833333333333,
            "subjectivity": 0.3979166666666667
        }
    ]
}