{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-01 14:01:44",
    "ups": "2808",
    "downs": "427",
    "views": "147235",
    "top_comments": [
        {
            "comment": "I appreciate this. But BBC you could also interview the workers and other residents living in the State of Kuwait because what Ascia said is from her POV and her struggles, not the common peoples. There are much more people struggling in Kuwait than Ascia who has everything on a golden spoon and plate. BBC, you could do much better.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.175,
            "subjectivity": 0.475
        },
        {
            "comment": "The Story of two women; one is superficial \"influencer\" complaining about the weather and another brave one making an impact.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.8,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Hey, influencer girl go find a patch and plant some trees. spend some of your non producer money producing something.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The crazy thing is this place and it's surrounding is where human civilization began",
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "body": "When climate change makes it impossible to grow grains at scale, humans will go extinct.",
            "polarity": -0.5333333333333333,
            "subjectivity": 0.8
        },
        {
            "body": "What have I just watched ?????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I really wanted to watch the video but a few minutes in, the influencer already made me stop watching. I needed to see common Kuwaitis how they handle the heat, not with an American. Gladly I forwarded it to see the lady planting trees. :)",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "Look at how the Persian Arabs live compared to the actual Persians in Iran.",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.3
        },
        {
            "body": "Its the planet arrakis alias dune, where they harvest spices err i meant oil... And those local should wear stilsuit",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "THE FINAL WARNING OF\nTHE CLIMATE CRISES .\nESSENTIALLY TO A HUMAN-\nHABIT CHANGE .\nDO NOT USE THE WORLD BILLIONS\nOF CARS IF NOT EXTREMELY\nNECESSARY .",
            "polarity": 0.0,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Lol go to Iraq you’ll see it’s even higher and people don’t even have electricity…",
            "polarity": 0.525,
            "subjectivity": 0.6
        },
        {
            "body": "I appreciate this. But BBC you could also interview the workers and other residents living in the State of Kuwait because what Ascia said is from her POV and her struggles, not the common peoples. There are much more people struggling in Kuwait than Ascia who has everything on a golden spoon and plate. BBC, you could do much better.",
            "polarity": 0.175,
            "subjectivity": 0.475
        },
        {
            "body": "100 degrees Fahrenheit!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Islam is the solution",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "move to Scotland then, and remember to take thick clothing, and that's for summer not winter...",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.475
        },
        {
            "body": "A rich, privileged ‘influencer’ talks about how hot it is in her country. She discusses how it is a reality for people in her circumstances to deal with not having proper ac ventilated into the back of their  cars.  \n\nWhat about people who live in abject poverty in  say India who have NO AC and struggle to feed and clothe their children in also very hot climates. \n\nAnd, also bearing in mind Kuwait is a petro chemical based economy with nearly 90% of their exports made up of mineral fuels - instead of bleating on about how hard her life is perhaps she should reflect on her and Kuwaits role in bringing about irreparable global warming in the first place.",
            "polarity": 0.11446969696969697,
            "subjectivity": 0.44749999999999995
        },
        {
            "body": "Bring back the ice age and then they will be comfortable in concrete cities at the equator?",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "The Story of two women; one is superficial \"influencer\" complaining about the weather and another brave one making an impact.",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "disgraceful  report   why is this woman being interviewd m  most people dont have her money  and cant  live as she does   where is the reality of heat rise   the poor  and land workers,  the women stuck in houses with no air cond",
            "polarity": 0.07878787878787878,
            "subjectivity": 0.5333333333333333
        }
    ]
}