{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-31 09:11:44",
    "ups": "1917",
    "downs": "298",
    "views": "87976",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Only gonna get worse…",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Don’t have much sympathy for rich influencer who probably lives in other countries like all the rich Arabs do in the summer.",
            "polarity": 0.20625,
            "subjectivity": 0.51875
        },
        {
            "body": "Maybe should not been using that black gold money to build massive city in deserts.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.7166666666666667
        },
        {
            "body": "the BBC on 9:20 \" DELIBRATLEY \"missed the word \"\" SUBHAN ALLAH \"  this is dishonesty and \"  FAKE NEWS \".",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "*BBC only Interview Elite and influencer people instead of Common and middle class ..Well done at being Elite Narcissist BBC*",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.5
        },
        {
            "body": "With all its wealth- unbearable temperature extreme heat - and to top it all if you had a heated system/ body - that could send you crazy - \nAir conditioning- planting trees helps \nWhat is the solution- opt to live in a cooler place for some - \nWhat can the government- the influencers do to bring temperatures down in more ways than one -",
            "polarity": 0.042634680134680136,
            "subjectivity": 0.6148148148148148
        },
        {
            "body": "I salute the Kuwaitis. Why? Well, because, so far, they are then ONLY ones in the gulf prepared to be open about what the REAL temperature is. I was in Qatar a few years ago when the official temperature was \"37 degrees\". Bullshit! On that very same day, I registered 52 degrees IN THE SHADE! (no joke). Until the authorities in the Gulf start to produce REAL and ACCURATE temperatures, then there can be no progress. This is not a joke, and I am not joking.",
            "polarity": 0.08125000000000002,
            "subjectivity": 0.49947916666666664
        },
        {
            "body": "All these are Kuwaiti citzens, the majority living in Kuwait are expats and migrants are are poor and can't even afford such a big house, your report should have considered interviewing with at least one of them, not only the rich Kuwaiti citizens!",
            "polarity": -0.03854166666666666,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "They live by the sea and certainly have a ridiculous amount of money to desalinate the water and move it to the desert. But having the latest expensive car is more important.",
            "polarity": 0.13104514533085962,
            "subjectivity": 0.7387755102040815
        },
        {
            "body": "Atleast they can go for a swim in the ocean. We Iraqis don't have oceans or seas or full electricity and it's just as hot as Kuwait",
            "polarity": 0.3,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "People should STOP 🚫🤚🏾🚫🤚🏾 saying \nIT CANNOT BE DONE 👀👀 SAY I DON'T KNOW HOW TO DO IT BUT I AM WILLING TO TRY or even good luck...🥲 at least you won't kill off a good idea with negativity.",
            "polarity": 0.33749999999999997,
            "subjectivity": 0.5875
        },
        {
            "body": "lets build a city in the dessert then moan about the heat? your bbc license fee payed for this crap",
            "polarity": -0.8,
            "subjectivity": 0.8
        },
        {
            "body": "The influencer lady should talk to Om Naief (Desert Tree Mother👸🏽) and try to use her platform for good.\n I pity all children who can't run free outside and breath clean fresh air. It is not OK 😭😭😭😭😭",
            "polarity": 0.20238095238095238,
            "subjectivity": 0.4785714285714286
        },
        {
            "body": "50 degrees is no big deal, for now, the middle east is a dry place.\n\nWhat measures the habitability of a location though, is the wet bulb temperature, \nif the wet bulb temperature hits more than 35 degree Celsius, people will die of heat stroke within hours, doesn't matter if you are outside catching any wind or hiding in shelter, you will die, it is so bad that even an AC unit would not last because of thermal stress, and going out there to repair it will make you faint and die.\n\nMany places in this planet is already above the comfortable wet bulb temperature, and BBC is doing such documentary in Arab, what a joke.",
            "polarity": 0.02549019607843138,
            "subjectivity": 0.4107843137254902
        },
        {
            "body": "Haha jokers i was born there in that heat we had a window AC which we could turn on only when we sleep in the afternoon and night.  I used to walk and play in that heat. And I'm from India.\nWhiny girl",
            "polarity": 0.1,
            "subjectivity": 0.65
        },
        {
            "body": "To people of all nations. If you are oppressed in anyway, or you are finding it difficult to get shelter food and water, these are the words of Jesus. \n“How blessed are those who know their need of God; the kingdom of Heaven is theirs.” – (at Matthew 5: 3) – \n\nWhere you will never have to worship and pray in the way of religions (not even in the way of the pope nor Christianity) because religions are all led by the many false prophets that Jesus already warned us to beware of, almost 2,000 years ago. When he alone (in the name of Immanuel) is the Son of Man and the true Prophet sent by the Lord God, to be always our one Teacher…\n\nThese are the words of the Lord God: \n“I will raise up for them a prophet like you [Moses] from among their fellow Israelites, and I will put my words in his mouth.” – (at Deuteronomy 18: 18) –\n\n“Therefore the Lord himself shall give you a sign: A young woman is with child, and she will bear a son, and will call him Immanuel.” [“God is with us”] – (The Prophet Isaiah 7: 14) –\n\n“If you have ears to hear, then hear.” – (Jesus, in the name of Immanuel, the Messiah, at Mark 4: 23) –\n\n“God is spirit, and those who worship him must worship him in spirit and in truth.” – (at John 4: 24) –\n\n“In truth I tell you, anyone who gives heed to what I say and puts his trust in him who sent me, has hold of eternal life and does not come up for judgement, but has already passed from death to life.” – (at John 5: 24) –\n\n“Beware of false prophets, men who come to you dressed up as sheep while underneath they are savage wolves. You will recognize them by the fruits they bear.” – (at Matthew 7: 15-16) –\n\n“Do not call any man on earth ‘father’; for you have one Father and he is in heaven. Nor must you be called ‘teacher’; you have one Teacher, the Messiah.” – (Matthew 23: 9-10) –\n\n“Take care that no one misleads you: For many will come claiming my name…” – (Jesus, at Matthew 24: 4) – \n“Many false prophets will arise, and will mislead many; and as lawlessness spreads, men’s love for one another will grow cold. But the man who holds out to the end will be saved. And this gospel of the Kingdom will be proclaimed throughout the earth as a testimony to all nations; and then the end will come.” – (Matthew 24: 11-14) –\n\n“I am the way; I am the truth and I am life; no one comes to the Father except by me. If you knew me you would know my Father too.” – (John 14: 6-7) –\n\n“When you pray, go into a room by yourself, and shut the door. Pray to your Father who is there in the secret place; and your Father who sees what is secret will reward you. \nIn your prayers do not go babbling on like the heathen, who imagine that the more they say the more likely they are to be heard. \nDo not imitate them. Your Father knows what your needs are before you ask him. \nThis is how you should pray:\nOur Father in heaven, hallowed be your name,\nYour kingdom come; your will be done, on earth as in heaven,\nGive us today our daily bread, \nForgive us the wrong we have done, as we have forgiven those who have wronged us.\nAnd do not bring us to the test, but save us from the evil one. \nFor yours is the kingdom and the power and the glory, for ever. \nAmen. \nFor if you forgive others the wrongs they have done, your heavenly Father will also forgive you; but if you do not forgive others, then the wrongs you have done will not be forgiven by your Father.” – (at Matthew 6: 6-15) –\n\n“Pass no judgement, and you will not be judged. For as you judge others, so you will yourselves be judged, and whatever measure you deal out to others will be dealt back to you.” – (Matthew 7: 1-2) –\n\n “Truly I tell you; if anyone obeys my teaching he shall never know what it is to die.” – (John 8: 51) –\n\n“Always treat others as you would like them to treat you: that is the Law and the Prophets. \nEnter through the narrow gate. For wide is the gate and broad is the road that leads to destruction, and many enter through it. But small is the gate and narrow the road that leads to life and only a few find it.” – (Matthew 7: 12-14) –\n\n“I am the gate; anyone who comes into the fold through me shall be safe. He shall go in and out and shall find pasturage.\nThe thief comes only to steal, to kill, to destroy; I have come that men may have life, and may have it in all its fullness.” – (John 10: 9-10) –\n \n“Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but only the one who does the will of my Father who is in heaven.” – (Matthew 7: 21) –\n“I am the resurrection and I am life. If a man has faith in me, even though he dies, he shall come to life; and anyone who is alive and has faith shall never die.” – (John 11: 25-26) –\n  \n“I have not come to judge the world, but to save the world” – (John 12: 47) – \n“Whoever will acknowledge me before men, I will acknowledge him before my Father in heaven; and whoever disowns me before men, I will disown him before my Father in heaven.” – (Matthew 10: 32-34) –\n\n“Any plant that is not of my heavenly Father’s planting will be rooted up. Leave them alone; they are blind guides, and if one blind man guides another they will both fall into the ditch.” – (Matthew 15: 13-14) –\n\n“The disciples came to Jesus and asked, ‘Who is the greatest in the kingdom of Heaven?’ \nHe called a child, set him in front of them, and said, ‘I tell you this: unless you turn round and become like children, you will never enter the kingdom of Heaven. \nLet a man humble himself till he is like this child, and he will be the greatest in the kingdom of Heaven. Whoever receives one such child in my name receives me. But if a man is a cause of stumbling to one of these little ones who have faith in me, it would be better for him to have a millstone hung round his neck and be drowned in the depths of the sea.\nAlas for the world that such causes of stumbling arise! Come they must, but woe betide the man through who they come!’”  – (Matthew 18: 1-7) –\n\n“Though many are called, few are chosen.” – (Matthew 22: 14) –\n \n“An expert in the law, [a leading religious Pharisee] tested him with this question: ‘Teacher, which is the greatest commandment in the Law?’ He answered, ‘Love the Lord your God with all your heart, with all your soul, with all your mind. That is the greatest commandment. It comes first. The second is like it: Love your neighbour as yourself. Everything in the Law and the Prophets hangs on these two commandments.’” – (Matthew 22: 35-40) –\n\n“There is no greater love than this, that a man should lay down his life for his friends.” – (John 15: 13) –\n\n\"Stay awake, and pray that you may be spared the test: The spirit is willing, but the flesh is weak.\" – (Matthew 26: 41) –\n“However, when he comes who is the Spirit of truth; he will guide you into all the truth.” – (John 16: 13) –\n\n“Teach them to observe all that I have commanded you. And be assured, I am with you always, to the end of time.” – (Matthew 28: 20)\n\nYours, in true Spirit and in our one given prayer, 2gointruth, on Sunday the 31st of October 2021: – (Matthew 5: 14-16) – Where every minute (of both day and night) can be a new beginning for any one of us. Let it always be you. Pray to God often, in the way prescribed above, before it is too late.",
            "polarity": 0.05728497092133457,
            "subjectivity": 0.556781833486379
        },
        {
            "body": "Jesus what great a love bound you to that cross. You destroyed death and rose from the grave so we can too. You are our hope of glory and eternal life. 🙏",
            "polarity": 0.475,
            "subjectivity": 0.575
        },
        {
            "body": "yea naa yea those bathing in oil money complaining of ac problems",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What an absolute moron... the lady who plants a dozen trees ‘just dont know why’ they dont plant millions more... ok lady, let me break it down for your tiny brain. You have, lets say a dozen “trees” planted on your little triangle, if you even want to call some of them that. I would say several hardly qualify as a bush even. But now you spend $100 a MONTH to keep them alive. She says she hopes “people” plant millions more. Of course i assumed the same thing since they talked about planting a whole region, which if i were to randomly guess, would probably be several several millions but whatever. Lets say its only 2 million for sh*ts and giggles. They said it would be impossible because there is not precipitation to sustain that kind of life. Now im not going to pretend to be a botanist but i can tell you that plants need f***ing water to survive. And with 2 millions trees planted, unless you can come up with $16.6 million a MONTH to bring water to all of them. (Yea i know, its an idiotically rough estimate of cost, but its only there to try and illustrate a point. Not be an actual statistic.) Good f***ing luck. Oh and hilarious, at the end you talked about there being a drought. Yea, probably a good idea to waste a ton of precious fresh water on some trees... You know the saying, if you cant take the heat then get out of the fire. In no way shape or form am i against or debating the merits of climate change. Its a ridiculously bad situation and we need to fix it, but attempting to plant millions of tree in an inhospitable environment such as the one being suggested is an asinine idea and a waste of time and energy. Apparently noone has considered the massive undertaking that would be. BBC is idiotic for having a story like this because it tries to convince people of a problem and a solution without taking the time to think about the ramifications. Stop being retarded and maybe come up with ideas that arent a huge waste of time....",
            "polarity": 0.004788011695906436,
            "subjectivity": 0.5317251461988303
        }
    ]
}