{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-03 03:07:04",
    "ups": "3485",
    "downs": "485",
    "views": "193374",
    "top_comments": [
        {
            "comment": "This feels like a futuristic insight into a post-climate-crisis world where people have to live and work around the environmental extremities. \n\nSad thing is: it's happening right now.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.025974025974025983,
            "subjectivity": 0.6785714285714285
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "BBC, do better.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "This reminds me of a Philip K Dick Novel, I think it was Do Androids Dream of Electric sheep, which Blade Runner was based on, but in the novel it was so hot outside that the heat would literally kill anyone who wasn't inside an air conditioned building during certain hours of the day. I forget if he ever mentioned how hot it was, or when this took place. But thinking about it is making me want to visit the book again. And I'd suggest everyone else follow suit if you're even remotely interested in Sci-Fi. Though if you're gonna give Philip K Dick a try for the first time, I'd VERY STRONGLY suggest starting with UBIK. It's an outstanding read. And not too heavy at all.",
            "polarity": 0.20776190476190476,
            "subjectivity": 0.5583095238095238
        },
        {
            "body": "Isn't it a human's monumental ego that caused them to build metal buildings in a middle of a desert? Humans are not supposed to live there in the first place and now you are shocked?",
            "polarity": -0.06272727272727271,
            "subjectivity": 0.3466666666666667
        },
        {
            "body": "A priest in ancient arabia need to ask the spirits for protection for Arabia he asked the Djinn the accepted and cast fires to act as protection.....this fire is now very strong and needs to be taken back as Allah-Elohim the God of the Sun brother to I Am who created the fire angels to remove it.",
            "polarity": 0.2816666666666667,
            "subjectivity": 0.4766666666666666
        },
        {
            "body": "It's a f#@ing desert and then they paved it with aspahlt...  Hmmm temps rising.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "What about the kids around the world that doesn't have food to eat this people are selfish",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "It was not the hottest place on earth death valley in the United states of AMERICA was so sorry",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Many years ago I worked in Kuwait for a year, and never remember it getting that hot.  Sure it was hot but you still went outside for a cold coke.  My KAC  apartment did not have a/c!",
            "polarity": 0.125,
            "subjectivity": 0.6898148148148149
        },
        {
            "body": "\"In this, God's love for us was manifested: in which God sent his only begotten Son into the world, so that we might live through him.\" (Ijo4.9). Hey you: Jesus loves you and has a plan of salvation for your life. God bless you. Good morning. From Brazil.🙋🙏🌹🌹🌺🌺🌷🌷🌹🌹🌺🌺🌷🌷🌷",
            "polarity": 0.3340909090909091,
            "subjectivity": 0.675
        },
        {
            "body": "Can’t they start using solar panels?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So We got an amazing lady paying her own dime to plant trees to make an actual difference for the collective good of others. A scientist studying and advising the changes needed to adopt. And a skank who does nothing of value and more of a burden with her very existence continuing to breed while complaining how horrible her dog walks have become. And the video starts with the latter's interview. BBC is certainly hiring some fine journalist.",
            "polarity": 0.22309523809523815,
            "subjectivity": 0.5471428571428572
        }
    ]
}