{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-04 20:19:12",
    "ups": "4015",
    "downs": "519",
    "views": "217515",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Hello, kuwaiti here. Lived my entire life in kuwait. Nothing worse than going to work while forced to park your car under no shade in this heat. By the time work is done, the inside of the car temperature reaches 60c and no amount of AC helps. Imagine almost every single day getting cooked alive like that. Its inhumane. I despise the idea of leaving home no matter how boring it gets.",
            "polarity": -0.3673469387755102,
            "subjectivity": 0.5627551020408162
        },
        {
            "body": "Why keep making shallow people who do more harm than good famous? Even her botox get in the way of making her story a little bit compelling. \"You've got to stop using straws to save the turtles.\" 🤣\nSomeone tell her about microplastics and the fashion industry of which she's a captive customer have a more significant impact than straws alone.\nWhy feed into the toxic Instagram culture, BBC? You could give inspiring people who are trying to make a positive impact the whole spotlight like this awesome lady and the metereologist who are actually doing something about the problem.",
            "polarity": 0.32010281385281386,
            "subjectivity": 0.6228896103896104
        },
        {
            "body": "Once oil finish Kuwait will finish",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How about the common man ? The poor ? Workers in labor camps , how about the domestic helpers , Filipina, Indonesian woman ?",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.4000000000000001
        },
        {
            "body": "👎 BBC with the silly focusing on \"influencer\" \nSimply I'm not interested to watch the rest of the video! I had nausea!\nHoped to see something \"real\" about ( Kuwait heat) as a \"normal\" citizen.",
            "polarity": -0.086328125,
            "subjectivity": 0.58125
        }
    ]
}