{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-10-30 20:51:43",
    "ups": "1381",
    "downs": "213",
    "views": "57114",
    "top_comments": [
        {
            "comment": "Lots of trees are being cut in road sides without replanting any trees what u expect?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "God bless Lady Naief and the meteorologist for doing everything they can to save their country and ultimately the world❤\nThere's enough money in Kuwait, why don't they fund Lady Naief's project, it would'nt cost them much but it would make a great difference.",
            "polarity": 0.25,
            "subjectivity": 0.6125
        },
        {
            "body": "Considering that the Middle East makes the majority of their money by selling oil and carbon based fuels, I just can't feel sorry for them because of the effects of climate change.  If they truly wanted to help they could use all that money they acquire and educate a large number of the world's female population to the level of the women of the EU or America.  Doing that would lower the birth rate ( i.e.  giving them choices other than motherhood as a career ), improve living standards, increase the economic prosperity of all the countries involved, and show the world that Islam is a modern religion that cares for the most vulnerable members of every society.  But, the leaders of the Middle East countries will ALWAYS choose spending money on their elite, male, ruling class rather than assisting the poor of the world.  Muhammad, during his lifetime and through his teachings, did more than any other human up to that time to advance women's rights and opportunities in the world.  But within only a couple of centuries of his death, corrupt and evil hearted men began the slow process of returning women to second class citizens of their countries.  I truly believe in my heart that if either Muhammad or Jesus were to see the way we have corrupted their teachings that they would weep and beg God to show us mercy.",
            "polarity": -0.09178571428571428,
            "subjectivity": 0.4272619047619048
        },
        {
            "body": "What rubbish nonsense is this?? Showing a lady who is such a snob influencer.",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "King James Version\n\nRevelation 22:18-19\nThis Book\n\nExodus 24:7\nThe Book\n\nRoman 8:28\nLove God\n\nLight\nPsalm 118:27\n\nGod and Father\nEphesians 1:3\n\nGod\nPsalm 99:9\n\nOne Is Your Father\nMatthew 23:9\n\nGod is Light\n1 John 1:5\n\nEphesians 1:4\nUs In Him\n\nLight\nGenesis 1:3\n\nLight\nJohn 12:36\n\nThe Mighty One\nIsaiah 1:24\n\nMale and Female\nMatthew 19:4\n\nLight\nPsalm 90:8\n\nIn Him we Live\nActs 17:28\n\nOne People\nGenesis 11:1-9\n\nChildren of Light\nEphesians 5:8\n\nThe Holy One\nIsaiah 43:3\n\nChildren of Light\n1 Thessalonians 5:5\n\nOne God\nEphesians 4:4-6",
            "polarity": 0.31969696969696965,
            "subjectivity": 0.5972222222222222
        },
        {
            "body": "What do you expect if living in desert in a city that is predominantly made off concrete and asphalt and people traveling in cars that emit carbon and other toxic emissions. Like with most Middle Eastern countries, there is lake of sustainable environmentally friendly planning and design based on  to suit the land and climate concept using traditional dwelling designs.",
            "polarity": 0.15,
            "subjectivity": 0.4041666666666666
        },
        {
            "body": "There is one & only solution to get rid of that type of massive problem; and that is very simple... please stop using ACs, central ACs in those very big buildings & fossil fuels.\nFind some ways that are ecofriendly system. This is the high time. The government can officially launch a massive tree plantation programme across the country. You have world class weather specialist & architects. Spend those oceans of dollars for tree plantation. Not fancy dress, cars (of course not those electric cars), construct big buildings. Pay some serious attention to climate changing issues. \n\nBe a good child of our mother earth. Stop disturbing the mother earth. Neither she will react beyond your imagination. We, the humans are so vulnerable & too little to stand against our mother earth.\nRemember ! This is the high time !",
            "polarity": -0.03626488095238096,
            "subjectivity": 0.5779251700680271
        },
        {
            "body": "The woman with so much wealth , moans about everything, the poor woman planted trees.",
            "polarity": -0.1,
            "subjectivity": 0.4
        },
        {
            "body": "And for those without airconditioning?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "blant millions of TREES nomadic people that will cool the tiny country and decrease the hotness.❤️",
            "polarity": 0.175,
            "subjectivity": 0.575
        },
        {
            "body": "If it's so hot that woman wouldnt have that crazy religious dress on",
            "polarity": -0.11666666666666665,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Lots of trees are being cut in road sides without replanting any trees what u expect?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You go girl  .       🐺",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Start digging an underground city and everyone move there.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And this is why normal people who struggle day to day unsubscribe from your BS content. No more poor little rich people's content. Badly done BBC.. badly done.",
            "polarity": -0.24464285714285708,
            "subjectivity": 0.619047619047619
        },
        {
            "body": "Influencer? Really ?!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "body": "Very interesting to see how life is at 50 degrees, tough even for the wealthy. The retired lady seems to be the only one doing anything though. The weatherman is right about needing to plant forests, but apart from the old lady planting a few bushes, what is being done? Surely one of the wealthiest governments on earth should have some programs up and running?",
            "polarity": 0.1808531746031746,
            "subjectivity": 0.6509920634920634
        },
        {
            "body": "BBC please interview the people most affected by the climate change.  The elite class and Instagram influencers have  means for their protection",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "In Tucson and Phoenix, we get shit done at night! Besides, the night sky is amazing in the desert. Adapt.",
            "polarity": 0.17500000000000004,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "It's kind of mind boggling that with piles of cash and energy supplies that cost next to nothing they haven't spent a few billions to plants a green forest barrier and the solar power required to desalinate and pump the water.",
            "polarity": 0.019999999999999997,
            "subjectivity": 0.28
        }
    ]
}