{
    "time_posted": "2021-10-30 11:36:41",
    "url": "https://www.youtube.com/watch?v=UbYCEjbWBFs",
    "time_now": "2021-11-02 22:59:42",
    "ups": "3422",
    "downs": "478",
    "views": "190714",
    "top_comments": [
        {
            "comment": "This feels like a futuristic insight into a post-climate-crisis world where people have to live and work around the environmental extremities. \n\nSad thing is: it's happening right now.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.025974025974025983,
            "subjectivity": 0.6785714285714285
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "This feels like a futuristic insight into a post-climate-crisis world where people have to live and work around the environmental extremities. \n\nSad thing is: it's happening right now.",
            "polarity": -0.025974025974025983,
            "subjectivity": 0.6785714285714285
        },
        {
            "body": "Kuwaits heat Crisis is minor compared with the UKs Turkey shortage Crisis",
            "polarity": -0.05,
            "subjectivity": 0.2
        },
        {
            "body": "This is overly exaggerated",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "What’s the Government of Kuwait’s are doing or better still,What’s the Sheikh of Kuwait doing",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "What about stop spending money in Mercedes Benz and other futile things and learn with Israel how to make a desert into a garden?",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "She's a fantastic lady!!",
            "polarity": 0.625,
            "subjectivity": 0.9
        },
        {
            "body": "Its ironic that Kuwait which pumps so much oil from the ground will burn first",
            "polarity": 0.21666666666666667,
            "subjectivity": 0.4777777777777778
        },
        {
            "body": "To be honest , ppl of Kuwait they  re fully dependent on government. No cleaning awareness ,no tree planting awareness at all . If the government or ppl of Kuwait come forward of planting the tress, we expatriates living in Kuwait re ready to come forward freely and live in pure and fresh natural air .",
            "polarity": 0.27866419294990724,
            "subjectivity": 0.5857142857142857
        },
        {
            "body": "Can someone tell me what university teaches how to be an \"influencer\"? And what specifically does an influencer do? Can one call an influencer if you need  legal/medical/engineering advice?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am from east India , I am used to heat but I experienced till 40 degree c till I moved bhubaneswar for job in 2016 ,to my next state, without ac I was baked though I only used to stay in apartment before 9am and after 9pm between time in office with ac., weekends in Kolkata.I was told by local they also never experienced this kind of heat. Those two years was most difficult time in my life, Heat is hard.",
            "polarity": 0.07870370370370369,
            "subjectivity": 0.637962962962963
        },
        {
            "body": "Kuwait should resource their power from solar energy, period!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I know how it is like. I am a AC mechanic in Kuwait. Maximum time, i have to work on rooftop. No matter how hot out there.",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "Show the life of regular people NOT  the advert of this Hollywood wannabe. \n\nShame ! You should have done better",
            "polarity": 0.25,
            "subjectivity": 0.28846153846153844
        },
        {
            "body": "life at 50C is the best series ever! Congrats BBC!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Can you believe that lady. God bless her!.. She care enough to find a solution and in turn helping the environment and even climate change. The government did even attempt to try like I don't know bring experts to help with plant growth in the area. Imagine what she could do with a solid plan and funding. This woman should be proud she deserves a medal or some acknowledgment from her country.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "All those ac units in kuwait have vent hoses that blast out hot air into the environment which has an obvious impact on increase in temperatures in built up urban areas like cities.",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.45
        }
    ]
}