{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-11-03 15:28:46",
    "ups": "23246",
    "downs": "1684",
    "views": "579131",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "By hugging the Pope Nathan Moris Modi is giving a free hand to the Christian missionery a free hand to convert Hindus to Chrisitnaty\nBye Bye Hindhu India Welcome Christian India with the blessing of Moris Modi",
            "polarity": 0.32,
            "subjectivity": 0.5
        },
        {
            "body": "Where Modi is concerned, he has surrendered his entire PMship to the interests of the West and the Sheikhs of the ME. He chases collars from UAE (even Palestine) and crawls to Meet the pope even though he was was not even invited. A compromised PM is not going to stand for anything but will crawl for anything.",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "body": "As a consequence of this Western and Islamic slave Modi who craves for their awards and their pats on the back, many product brands in India have also started abusing Diwali and other Hindu festivals in overt and covert ways. Brands like  have recently put out idiotic ads and while they portray Diwali as some kind of evil to avoid any festivities, they portray Islamic and Christian festivals as great fountains of humanity:",
            "polarity": 0.010833333333333339,
            "subjectivity": 0.4608333333333333
        },
        {
            "body": "Unfortunately, Hindus invested their trust in a village bumpkin with no qualms who has become a Climate Coolie in particular and a Western Coolie in general –Narendra Mike Modi  . The ban on festivities and crackers flows directly from him and none else. Activists who are mostly non-Hindus started filing PIL after PIL in the SC to attack Hindu traditions in Sabarimala, Shani Shingapur, Holi and so on. The attack on Diwali crackers grew stronger with the arrival of Modi & his Commie gang.",
            "polarity": 0.05277777777777778,
            "subjectivity": 0.45555555555555555
        }
    ]
}