{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-11-04 03:50:49",
    "ups": "23382",
    "downs": "1698",
    "views": "587624",
    "top_comments": [
        {
            "comment": "As a Christian I'm happy to see you modi ji with our pope",
            "likes": 3,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Y será predicado este evangelio del reino en todo el mundo, para testimonio a todas las naciones; y entonces vendrá el fin.\nMateo 24:14Por tanto, cuando veáis en el lugar santo la abominación desoladora de que habló el profeta Daniel (el que lee, entienda),\nMateo 24:15entonces los que estén en Judea, huyan a los montes.\nMateo 24:16El que esté en la azotea, no descienda para tomar algo de su casa;\nMateo 24:17y el que esté en el campo, no vuelva atrás para tomar su capa.\nMateo 24:18Mas ¡ay de las que estén encintas, y de las que críen en aquellos días!\nMateo 24:19porque habrá entonces gran tribulación, cual no la ha habido desde el principio del mundo hasta ahora, ni la habrá.\nMateo 24:21Y si aquellos días no fuesen acortados, nadie sería salvo; mas por causa de los escogidos, aquellos días serán acortados.\nMateo 24:22Entonces, si alguno os dijere: Mirad, aquí está el Cristo, o mirad, allí está, no lo creáis.\nMateo 24:23Porque se levantarán falsos Cristos, y falsos profetas, y harán grandes señales y prodigios, de tal manera que engañarán, si fuere posible, aun a los escogidos.\nMateo 24:24Ya os lo he dicho antes.\nMateo 24:25Así que, si os dijeren: Mirad, está en el desierto, no salgáis; o mirad, está en los aposentos, no lo creáis.\nMateo 24:26Porque como el relámpago que sale del oriente y se muestra hasta el occidente, así será también la venida del Hijo del Hombre.\nMateo 24:27\"Porque los ojos del Eterno contemplan toda la tierra, para fortalecer a los que tienen corazón íntegro hacia él. Neciamente has procedido, porque de aquí en adelante habrá guerra contra ti\".\" 2 Crónicas  16:9He aquí que viene con las nubes, y todo ojo le verá, y los que le traspasaron; y todos los linajes de la tierra harán lamentación por él. Sí, amén.\nApocalipsis 1:7. ante el Señor que viene. Viene a juzgar la tierra. Juzgará al mundo con justicia, y a los pueblos con su verdad.\" Salmos  96:13Velad, pues, en todo tiempo orando que seáis tenidos por dignos de escapar de todas estas cosas que vendrán, y de estar en pie delante del Hijo del Hombre.\nLucas 21:36Y oí una voz de en medio de los cuatro seres vivientes, que decía: Dos libras de trigo por un denario, y seis libras de cebada por un denario; pero no dañes el aceite ni el vino.\nApocalipsis 6:6........",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Porque ya está en acción el misterio de la iniquidad; sólo que hay quien al presente lo detiene, hasta que él a su vez sea quitado de en medio.\nII Tesalonicenses 2:7.Y entonces se manifestará aquel inicuo, a quien el Señor matará con el espíritu de su boca, y destruirá con el resplandor de su venida;\nII Tesalonicenses 2:8.inicuo cuyo advenimiento es por obra de Satanás, con gran poder y señales y prodigios mentirosos,\nII Tesalonicenses 2:9.y con todo engaño de iniquidad para los que se pierden, por cuanto no recibieron el amor de la verdad para ser salvos.\nII Tesalonicenses 2:10.vcn.....",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}