{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-10-31 05:04:56",
    "ups": "16507",
    "downs": "527",
    "views": "295841",
    "top_comments": [
        {
            "comment": "Only pagan religion that has faced all religions Bharath Mata ki jai",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment": "Vatican never gets involved with other countries shenanigans. It always kept itself camouflaged successfully for years. Modi has the habit of meeting other countries, thinking he can tie bonds with them. But with Vatican he will have to do just more than meeting & hugging😂🤣",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.55
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Only pagan religion that has faced all religions Bharath Mata ki jai",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Wow Mr Modi tells pope see we kill Christians and Muslims in India and you can't do anything about it.",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Km sm km ab India ko dhng se jaanne toh lge log... Aur jlne waale jlne aur b lge",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "PRAISE THE LORD ✝️ HALLELUJAH HALLELUJAH",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🙏🙏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi Trying To Eliminate All The Christian From India at the same time He Went To Visit Pop Francis",
            "polarity": 0.0,
            "subjectivity": 0.0625
        },
        {
            "body": "Good morning SIR",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Modiji 500 subs karne me madat kardijiye❤️❤️🇮🇳🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modiji 500 subs karne me madat kardijiye❤️❤️🇮🇳🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modiji 500 subs karne me madat kardijiye❤️❤️🇮🇳🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modiji 500 subs karne me madat kardijiye❤️❤️🇮🇳🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modiji 500 subs karne me madat kardijiye❤️❤️🇮🇳🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kitni bhi rajniti kr lo... Leader MODI JI jisa he hona chaiye... \nNo Biden Or trump can be compared to the legendary leader MODI JII\n❤❤",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Vatican never gets involved with other countries shenanigans. It always kept itself camouflaged successfully for years. Modi has the habit of meeting other countries, thinking he can tie bonds with them. But with Vatican he will have to do just more than meeting & hugging😂🤣",
            "polarity": 0.25,
            "subjectivity": 0.55
        },
        {
            "body": "Modi:- come to India \nPope:- ab mza aaega conversion me",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modiji aap sache pyar ka partik hai.apka acha Dil hmesha achayi ko hi pasand krta hai.sachi dosti kaise nibhate hai vo aap sikhate hai.bahut bahut dhanyawad apke Karan Hume bhi dharti ke ache persons dekhne ko mile. Jo is dharti pr achayi chahte hai.sabki Khushi chahte hai apki trah.🌍🇮🇳🙏❤️👌👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "4 It was destroyed, the earth fell; got sick, the world fell; the high peoples of the earth fell ill. 5 And the land was polluted under its inhabitants; because they broke the laws, they distorted the law, they broke the everlasting covenant. 6 For this reason the curse consumed the land, and its inhabitants were laid waste; for this cause the inhabitants of the earth were consumed, and men were diminished.\n7 The wine is lost, the vine is sickened, all who were merry in heart groaned.\n8 The rejoicing of the tambourines has ceased, the noise of those rejoicing has ceased, the joy of the harp has ceased.\n9 They will not drink wine with singing; cider will be bitter to those who drink it.\n10 The city is broken by vanity; every house has been closed, so that no one can enter.\n11 There are cries for lack of wine in the streets; all joy is darkened, joy is banished from the earth.\n12 The city was desolate, and the gate was broken down with ruin.\n13 For so it shall be in the midst of the earth, in the midst of the peoples, like a shaken olive tree, like gleanings after the harvest.\nIsaiah 24: 4-13.\n-\n6 And you will hear of wars and rumors of wars; See that you are not disturbed, because it is necessary that all this happens; but the end is not yet.7 For nation will rise against nation, and kingdom against kingdom; and there will be plagues, and famines, and earthquakes in different places. 8 And all this will be the beginning of pain. Matthew 24: 6-8 JESUS.\n-\n26 “Just as it happened in the time of Noah, so it will be when the Son of man comes. 27 They ate, they drank, and they married and gave in marriage, until the day that Noah entered the ark; then the flood came and destroyed them all.\n28 “The same thing happened in Lot's time: they ate and drank, bought and sold, sowed and built. 29 But on the day that Lot left '' \"'(Sodom)\"' '' fire and brimstone rained down from heaven and destroyed them all.\n30 “So it will be on the day the Son of man is revealed. Luke 17: 26-30 JESUS\n-\n9 And when you hear of wars and seditions (protests against their rulers), do not be alarmed; because it is necessary that these things happen first; but the end will not be immediately. 10 Then he said to them: Nation will rise against nation, and kingdom against kingdom; 11 and there will be great earthquakes, and in different places famines and pestilences; and there will be terror and great signs from heaven.\nLuke 21: 7-11\n-\n12 and because wickedness has multiplied, the love of many will grow cold.\n13 But the one who endures to the end will be saved. 14 And this gospel of the kingdom will be preached in all the world, for a witness to all nations; And then the end will come. Matthew 24: 12-14\n-\n22 And if those days were not shortened, no one would be saved; but because of the elect, those days will be shortened. Matthew 24:22 JESUS\n-\n8 But God shows his love for us, in that while we were still sinners, Christ JESUS ​​died for us.\n9 For much more, being already justified in his blood, by him we will be saved from wrath.\n10 For if, being enemies, we were reconciled to God by the death of his Son, much more, being reconciled, we will be saved by his life. Romans 5: 8-10\n---\n16 “For God so loved the world that he gave his only Son (JESUS), so that everyone who believes in him may not perish, but may have eternal life. John 3:16\n-\n18 Come quickly, says the Lord, and let us be aware: if your sins are like scarlet, they will be white as snow; if they are red like crimson, they will be like white wool. Isaiah 1:18\n-\n9 that if you confess with your mouth that Jesus is Lord, and believe in your heart that God raised him from the dead, you will be saved.\n10 For with the heart it is believed for righteousness, but with the mouth it is confessed for salvation.\n Romans 10: 9-10\n--23 For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord. Romans 6:23\n-\n12 And in no one else is there salvation; for there is no other name under heaven, given to men, by which we can be saved. Acts 4: 11-12\n-\n10 so that in the name of Jesus every knee should bow, of those who are in heaven, and on earth, and under the earth;\n11 and every tongue confess that Jesus Christ is Lord, to the glory of God the Father. Philippians 2: 10-11\n-\n12 But to all who received him, to those who believed in his name, he gave the right to become children of God; John 1:12\n-\n6 Jesus said to him: I am the way, and the truth, and the life; no one comes to the Father except through me. John 14: 6\n-\n23 But the hour is coming, and now is, when true worshipers will worship the Father in spirit and in truth; because the Father also seeks such worshipers to be adored.\n24 God is Spirit; and those who adore him, in spirit and in truth it is necessary that they adore.\nJohn 4: 23-24\n27 Peace I leave with you, my peace I give you; I don't give it to you like the world gives it. Not your heart be troubled, neither let it be afraid. John 14:27\nJESUS.\nThere is power in THE NAME OF JESUS..",
            "polarity": 0.12426414768806074,
            "subjectivity": 0.5172601794340924
        },
        {
            "body": "Ye dekh kar liberal aur bhi jalenge kyoki sab Goa ka election hai aur Goa me kafi Christian log hai ye Modiji Pope milte dekhkar Christian vote BJP ko milenge.What a shot.Haa Haa Haa .Modi is great. Hats of to you.",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.25
        },
        {
            "body": "Namaskar prime minister modi sir ji",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dalindar modi.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}