{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-10-31 13:18:30",
    "ups": "19259",
    "downs": "901",
    "views": "388718",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Heartly Amazing Again now",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "सर्व धर्म आणि संस्कृती पालन मोदी करत आहे. याचे उत्तम उदाहरण आहे.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Good",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "great to see modi welcome  pope fraancis  to india",
            "polarity": 0.8,
            "subjectivity": 0.825
        },
        {
            "body": "Hi bharat mata ki Jay🎉🎉🎉🎉🎉",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Op",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hi SO best💯 hindustan king👑 of world🌎🌎🌎🌎🌎🙏🙏🙏🙏🙏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi modi",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Be it Tirupati, Kedarnath or holy see you gave the same privilege o.\nThank you for sharing.\nThank you YouTube",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Pope Francis ki mehmannawazi",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "मोदी जी गरी बो के लिए म कान द वा  के 5 लाख फ्री में चावल व्ही ट सब धर्म का स न मा न\nवे मह आ पुरू ष हैं",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Proud to see the respect for pm of India",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "अद्भुत",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "👍 👍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jo admi Christian logo ko India se Bahar karne ki baat Kar raha tha woh kis mukh se pope se miline gaya😡😤😡",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Desh ko jaldi se bech Do. Modi ji..",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I wish Pop would've taught him some humanity. . Modi is an ambassador of brutality, hatred and discrimination. The whole selfish world is only bearing with him because of their selfish economic reasons. Otherwise, none of the European state will like to adopt policies of Modi in their own countries because they know these are pathetic. Rich American and rich European states do not want to loose a large Indian market and they don't want to angry powerful Indian elites who had been bringing tonnes of dollars in their lands through the money laundering and corruption and hence promoting the economy of these states. They don't care if India does Muslim atrocities, Sikh killings or Kashmiri killings. All they need from India as a big market and someone who could handle China for them. Selfish world will only realize their fault when this hatred arrives at their own shores and this hatemongering fire burns their own homes where they are living peacefully and letting India/Modi play all dirty games. It looks like whatever Modi says, that is the gospel truth. You say anything against him, you die and humiliated like he is doing to Shah Rukh Khan's family these days. I am not surprised why Pakistan Prime Minister, Imran Khan, called him ''Hitler of this era''. One day when India, finally, will get rid of this monster, you will hear hundreds of stories of injustice on the social media and many of the Bollywood movies will be made against his era and his extremist BJP, who even didn't spare great man like Mahatma Gandhi and killed him. Modi Jee, scared of Baghwaan (God). His wrath comes with great silence. No one will be able to save you from HIM, then.",
            "polarity": 0.07808696679664423,
            "subjectivity": 0.6383699633699634
        },
        {
            "body": "is there a country Modi has not gone to. he even went to pakistan and vatican.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love u my bro and sis",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "My mg",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}