{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-11-06 09:24:31",
    "ups": "24295",
    "downs": "1774",
    "views": "641557",
    "top_comments": [
        {
            "comment": "Viva Papa!🇻🇦 Har har Modi!🇮🇳❤️❤️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🔪🔪🔪🔪🔪",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "IT was Britishers who up to great extent stopped the conversation of Hindus into Islam as continued Muslims rule would have converted almost all the Hindus.see in Pakistan in less than 75 years Hindus reduced from 20 percent to less than 2 percent.moreover Christian and Hindus have no problem between them as in lots European countries lots of Christians also believe in Hinduism.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.09333333333333335,
            "subjectivity": 0.17666666666666667
        },
        {
            "comment": "Modi,:Thank you so much and very very sukruriya..\nPop:What?\nModi:I mean thanks 🫂\n😂 😆 😂",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.08687500000000001,
            "subjectivity": 0.369375
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Se credessero veramente in Dio,al mondo di vivrebbe bene,ma siccome nessuno di essi crede in Dio,fanno i potenti ,i professori,scienziati ,scrittori ecc,ecc,Ma non sanno che tra un po' il grande giudice che Dio sta per mandare li sistemerà ,anche i grandi potenti così chiamati,se la faranno addosso come tutte le varie religioni ed. Uomini e donne,giocate con Dio e Gesù ,esaltate i vostri santi sante ecc e lasciate da parte Dio e Gesù .Eppure Dio mando uno dei suoi servi come Maestro ,ma non avete capito niente di niente,il maestro era Gesù.Ma tra un po' Dio lo manderà come Giudice per il Giudizio universale,e questa volta non ci sarà nessun maledetto Assassini che potrà Ucciderlo di Nuovo,perché sarà Gesù a Giudicare ,e saranno Dolori per tanti,tanti Gesù li farà entrare nella nuova terra,che Dio Creerà,e tanti li farà buttare nel fuoco eterno,e lì i potenti,i bugiardi,ladri,assassini tutti quelli che fanno guerre ecc,ecc,si divertiranno moltissimo a piangere e a gridare per tutta l'eternità,e nessuno potrà più aiutarli,si perché il fuoco non brucia la carne ,ma darà un forte dolore,i morti resuscitati quelli che entreranno nella nuova terra vivranno in spirito,ma quelli che andranno nel fuoco eterno ,Dio darà loro un nuovo corpo,perché serve loro nel fuoco.Ricirdatevi quante persone Dio lascio in vita nel giorno del diluvio universale,continuate a giocare a scherzare e a disubidjre alle Leggi e alle Disposizioni ni di Dio,AMEN,tra un po' vedrete e sentirete così vedrete di come e tutto vero",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🔪🔪🔪🔪🔪",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Great man pm modi ji 🙏🙏🙏🙏🙏🇮🇳",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Wow, its nice to see Indian Prime minister in Vatican. Here in Philippines we have Indian community practicing Hinduism and Christianity and we are very okay with them, they are peaceful unlike the other religion who claims to be \"religion of peace\".",
            "polarity": 0.29500000000000004,
            "subjectivity": 0.705
        }
    ]
}