{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-11-04 20:19:13",
    "ups": "23720",
    "downs": "1728",
    "views": "607888",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Pope Francis is a demon and is lead by demons.His institution has change the true Sabbath( Saturday) to Sunday without God's  authority and knowingly has millions following falsehood.",
            "polarity": 0.175,
            "subjectivity": 0.375
        },
        {
            "body": "Message to pope Francis- you do NOT sit in the place of Christ and NEVER will.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bergoglio o filho do diabo",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just don't serch *i feel fantastic* on YouTube.",
            "polarity": 0.4,
            "subjectivity": 0.9
        },
        {
            "body": "सृष्टि संचालन के कार्य में सबकी भागीदारी सुनिश्चित हुई यही समुद्र मंथन का सार था, हैं। परम पिता परमेश्वर महादेव जी महादेवी जी की कृपा का प्रसाद एवं आशीर्वाद सम्पूर्ण में बांट दिया गया हैं इसको सहज एवं निर्मल भाव से ग्रहण कर आगे की और प्रस्थान करें आपके पीछे आपकी भावी पीढ़ी भी इंतजार कर रही हैं।\n\n      卐🕉卐🐚 कल्की🦅🏹🦚🦄\n\n     दश अवतार भगवान श्री हरिमहाविष्णु \n\n🪔🕉🌏🌞🌝📿🔔🐳🐗🐯🐮🦣🦌🔱🏹🦅🦉🐓🦜🦢🦚💐🌸💮🏵🌹🥀🌺🌻🌼🌷⚘🌱🪴🌲🌳🌴🌵🌾🌿☘🍀🍁🍂🍃🦋🐵👣🧘🏾🦄🖋🖊🎨🌈卐🕉माँ 👣🕉 वंदेमातरम् 🚩🪔 🙏🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "आपातकाल हालातों के कार्यों में नियमों में छूट का प्रावधान हैं लेकिन नियमों में छूट का आधार दूसरे नियम रच लेना,बना लेना कदापि नहीं। नींव एक बार बनने के बाद परिवर्तन लाना व्यवस्था को कमजोर करने जैसा होगा। जो यह कार्य हो रहा हैं तत्काल परिवर्तन हो जाए ऐसा भी नहीं हैं लेकिन हम सब मिलकर करने जा रहे हैं। इसमें कोई भेदभाव नहीं हैं छोटे बड़े का कम ज्यादा का क्योंकि प्राणवायु सृष्टि पर सभी के लिए समान रूप से बहती है सभी के लिए अलग- अलग नहीं बहती। सृष्टि में भाँति-भाँति की मौजूद व्यवस्था हैं और सभी प्रकार के पुष्प खिलें हैं। विभिन्नता में भी एकता हैं अगर ऐसा नहीं होता तो मनुष्यों का भविष्य समाप्त हो जाता। जहर फैलने से बचाना हैं। जाति यानि मनुष्य, धर्म यानि मानवता ,यहीं दो व्यवहारिक बातें हैं जिनके बल पर आगे आकर कार्य करने हैं।",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}