{
    "time_posted": "2021-10-30 11:12:29",
    "url": "https://www.youtube.com/watch?v=uIMfV3jqUKo",
    "time_now": "2021-10-30 20:51:44",
    "ups": "14850",
    "downs": "444",
    "views": "258247",
    "top_comments": [
        {
            "comment": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "love that",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Revelation 17:1-6 \"And there came one of the seven angels which had the seven vials, and talked with me, saying unto me, Come hither; I will shew unto thee the judgment of the great whore that sitteth upon many waters: With whom the kings of the earth have committed fornication, and the inhabitants of the earth have been made drunk with the wine of her fornication.  So he carried me away in the spirit into the wilderness: and I saw a woman sit upon a scarlet coloured beast, full of names of blasphemy, having seven heads and ten horns. And the woman was arrayed in purple and scarlet colour, and decked with gold and precious stones and pearls, having a golden cup in her hand full of abominations and filthiness of her fornication: And upon her forehead was a name written, MYSTERY, BABYLON THE GREAT, THE MOTHER OF HARLOTS AND ABOMINATIONS OF THE EARTH. And I saw the woman drunken with the blood of the saints, and with the blood of the martyrs of Jesus: and when I saw her, I wondered with great admiration.    Revelation 17:18 \"And the woman which you saw is that great city, which reigns over the kings of the earth.\"",
            "polarity": 0.4272727272727272,
            "subjectivity": 0.6454545454545454
        },
        {
            "body": "💓💓\nBharat Mata ki Jai....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Most thought PM Modi was communal and intolerant in 2002 gujarat riots, but we know that most hindu is always best at all time because of our powerful  thoughts and roots, We are definately proud in worls because of PM Narendra Modi is Hindu. He is patriot because of trained under RSS and his roots. But he has great heart for all people but lethal tough for people have interset against nation and our vedic values.",
            "polarity": 0.5015873015873015,
            "subjectivity": 0.6976190476190476
        },
        {
            "body": "Pope Francis ko Gita deni chahiye",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Raam raam N pranaam always Modi ji 🙏🙏🙏🙏🙏🙏❤️🙏❤️❤️❤️❤️❤️❤️❤️ ahobhagya hamara.. Aap jaisa RAJA hy hamaraa 💯",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "HAR HAR MODI GHAR GHAR MODIIIII. BHAARAT MAATA KI JAI❤",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bharat mata ki Jai Ho 🙏🙏🙏🙏🙏🙏🙏🙏 bharat bhagya vidhata Modi ji always 🙏🙏🙏🙏🙏 bharat ka Kohinoor Modi ji always 🙏🙏🙏🙏🙏🙏 Bharat ka Gaurav modi ji",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The biggest spiritual person both of them congratulations Prime Minister Sir,,, 🙏🇮🇳🙏",
            "polarity": 0.0,
            "subjectivity": 0.13333333333333333
        },
        {
            "body": "May God bless you and your family",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi ji please tell them to stop conversion in India.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Vatican - world headquarters for global pedophiles, female trafficking, child trafficking..",
            "polarity": 0.0,
            "subjectivity": 0.08333333333333333
        },
        {
            "body": "Amazing relationship and it will impact on china because of ughur muslim and Taiwan issue",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "Congratulation to our PM nd POPE FRANCIS.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hare Rama Hare Krishna..to everyone in Vatican.. hopefully we can see idols of Buddha in Vatican very soon..",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "ജയ് ഹിന്ദ് 🇮🇳",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi's hugs are world famous now",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Islam hind op 😍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi to Pope- Mera Yeshu Yeshuuu mera yeshuuu yeshuuu 😂😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}