{
    "time_posted": "2021-10-30 14:00:24",
    "url": "https://www.youtube.com/watch?v=UIOiw_bED1M",
    "time_now": "2021-10-30 20:51:28",
    "ups": "4297",
    "downs": "134",
    "views": "82579",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I think when the ps5 pro comes out if so. We all will see some 4k 60 up to 4k 120",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "1080p/60 seems like a poor showing and a massive downgrade in resolution over 4k/30 and it baffles me why there is such a massive drop when 1440p or higher would have been a better option, I mean, surely these new consoles should be able to handle 1440p/60.\n\nAnyway, I suppose we'll find out with how it runs on the PC and how demanding it is.",
            "polarity": 0.11738636363636364,
            "subjectivity": 0.6755934343434343
        },
        {
            "body": "Gamers: give us 60fps on next-gen consoles!! \n\n*1080p at 60fps*\n\nGamers: Nooo not like that!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "A last gen game cant run higher than 1080p 60fps on ps5? what the hell?",
            "polarity": -0.05000000000000001,
            "subjectivity": 0.32222222222222224
        },
        {
            "body": "Considering what I’ve seen on my PS5 and XSX vs this game, the devs clearly just couldn’t be bothered.",
            "polarity": -0.15,
            "subjectivity": 0.39166666666666666
        },
        {
            "body": "Thats why Im getting Xbox SX version VRR...\nSony needs VRR this mode for titles like this",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I will never play this",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All these old legacy game engines need to be scrapped. Absolutely ridiculous when UE5 exists.",
            "polarity": -0.2111111111111111,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "We need sfs ,mesh shading and Vrs t2 .. the xbox series s is really limited when we use the old way of coding games , \nI m sure we could have put a 1080p 60fps on series s with the new tech. But we still need to wait  at least until 2023 before seeing those technologies as standard 😅",
            "polarity": 0.06082251082251083,
            "subjectivity": 0.3477152477152477
        },
        {
            "body": "Should be nice and patched by the time it reaches Game Pass.",
            "polarity": 0.09999999999999998,
            "subjectivity": 0.7
        },
        {
            "body": "It is too expensive at the moment, I might pick it up when it gets around 20.",
            "polarity": -0.5,
            "subjectivity": 0.7
        },
        {
            "body": "Looks great I'll probably get it,but it does seem like it's poorly optimised",
            "polarity": 0.2,
            "subjectivity": 0.675
        },
        {
            "body": "I'm sorry but I lost interest in this game as soon as you said it can only do 1080P 60FPS on the PS5 and Xbox Series X. If you can't at least give me a dynamic 1440P with a mostly locked 60FPS in an action game this generation then I'm honestly not interested.",
            "polarity": -0.125,
            "subjectivity": 0.4962962962962963
        },
        {
            "body": "This game is running on a 2070/6700xt at 60-67 fps minimum at ultra settings 1440p\nIt should run it the same as pc on consoles.\nI think they just rushed it.",
            "polarity": -0.2,
            "subjectivity": 0.2625
        },
        {
            "body": "1080p 60fps on the PS5 and Xbox Series X ??????????????? FUCK my life :)))))))))) what a joke it is that the new consoles can't do 4K 60fps...",
            "polarity": 0.07878787878787878,
            "subjectivity": 0.6848484848484849
        },
        {
            "body": "Next gen...\nHey, it's not all bad. You have super fast gen 4 nvme storage so you can get into these trainwrecks quicker!",
            "polarity": -0.029166666666666632,
            "subjectivity": 0.4833333333333333
        },
        {
            "body": "Well on PC even with an RTX2080TI this thing only hits 80fps at 1440p with ULTRA settings without DLSS and Raytracing (According to SkillUp). I simply wouldn't expect it to run native 1440p 60fps even on next gen console.",
            "polarity": 0.0,
            "subjectivity": 0.4523809523809524
        },
        {
            "body": "I’m probably the only one who has been playing it on PS five at 60 and loving the visuals",
            "polarity": 0.3,
            "subjectivity": 0.975
        },
        {
            "body": "Why have you stopped comparing with previous generation consoles PS4 PRO and Xbox One X, majority of people sit on the older consoles and then the comparison between PS5 series X becomes meaningless.\n\nAnd it's a big disappointment that you can not play the latest games in 4K 60fps, what was the point of these consoles?? You can play the game on Xbox One X in 4K and 30fps so I see no reason to get a console that runs the game much like previous generation consoles.",
            "polarity": -0.13666666666666666,
            "subjectivity": 0.4066666666666666
        },
        {
            "body": "14:11 Is that a dig at Shang Chi ? 🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}