{
    "time_posted": "2021-10-30 14:00:24",
    "url": "https://www.youtube.com/watch?v=UIOiw_bED1M",
    "time_now": "2021-10-30 16:45:43",
    "ups": "2667",
    "downs": "81",
    "views": "34104",
    "top_comments": [
        {
            "comment": "Quality Mode It is Than.Ghostrunner runs at native 4k 60fps with ray tracing reflections on PS5 and Xbox Series X. \n1080p performance mode is really bad optimization from the developers all graphic settings are reduced from the ultra settings in quality mode just for 60fps not worth it",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.28333333333333327,
            "subjectivity": 0.3888888888888889
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "If there was this cost for the new consoles to be able to run the game at 60fps I wonder what was the cost for the old-gen consoles to be able to run the game at all (especially the Xbox One S which is the weakest among the four consoles) , it's a Too bad Digital Foundry hasn't been focusing as much on old-gen, I really wanted to see how the game does compared to old-gen.",
            "polarity": -0.033057851239669415,
            "subjectivity": 0.45192837465564745
        },
        {
            "body": "Awful picture quality in performance mode. Doesn't match the level of Insomniac",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "30FPS is unplayable when coming from 120Hz games",
            "polarity": -0.4,
            "subjectivity": 0.7
        },
        {
            "body": "Been playing this since it came out on series x and didn't realise it was only 1080p lol looked great",
            "polarity": 0.5333333333333333,
            "subjectivity": 0.8166666666666668
        },
        {
            "body": "The scenes look pretty big and detailed, but I fail to see how even that makes this game so heavy other than it being really badly optimized.\nI will still play it for sure, but I wish I could have at least gotten 1440@60 on my PS5",
            "polarity": -0.1075,
            "subjectivity": 0.5380555555555556
        },
        {
            "body": "1080p and not a solid 60fps 🤣🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "\"scripted single player\" indeed this game is so scripted, it's wank af.",
            "polarity": -0.2357142857142857,
            "subjectivity": 0.30714285714285716
        },
        {
            "body": "I'm disappointed there's no mention of PS4 here. Will you be putting out another video?  Lots of us only have access to last gen consoles, and I find the comparisons really interesting.  I hope you continue to put out last gen content while it is still very relevant.",
            "polarity": 0.045000000000000005,
            "subjectivity": 0.5638888888888889
        },
        {
            "body": "Why i cant notice any difference??? Watching this in my 4k phone",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Some of these are fixed already by the day 1 patch. I experienced no slowdown whatsoever",
            "polarity": 0.45,
            "subjectivity": 0.55
        },
        {
            "body": "Damn Xbox series S smh ,games might be like this in the future weak and 1080 low settings 30fps",
            "polarity": -0.125,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Yeah, im gonna wait with buying this one for ps5 or just buy it on pc.. but honestly, the gameplay seems a bit lackluster to me.. should have been able to play with all thw characthers and the shooting seems, well, lackluster",
            "polarity": 0.55,
            "subjectivity": 0.7625
        },
        {
            "body": "Digital foundry never really compares the 2 consoles. Alex just says \"oh it's the same story on the other console as well.\" Enough with this nonsense. Change the title.",
            "polarity": -0.045,
            "subjectivity": 0.24
        },
        {
            "body": "A ps5 and series x optimized game with 1080p too funny",
            "polarity": -0.07500000000000001,
            "subjectivity": 0.7
        },
        {
            "body": "Was thinking of buying this game now definitely not until the game is patched\nNot even able to maintain 60 at 1080 with heavy compromises...",
            "polarity": -0.1,
            "subjectivity": 0.485
        },
        {
            "body": "Consoles again proving to be weak and holding back next-gen graphics",
            "polarity": -0.1875,
            "subjectivity": 0.3125
        },
        {
            "body": "The ultimate snoozefest of a brain-dead game. At least it looks good",
            "polarity": 0.0,
            "subjectivity": 0.6
        },
        {
            "body": "Quality Mode It is Than.Ghostrunner runs at native 4k 60fps with ray tracing reflections on PS5 and Xbox Series X. \n1080p performance mode is really bad optimization from the developers all graphic settings are reduced from the ultra settings in quality mode just for 60fps not worth it",
            "polarity": -0.28333333333333327,
            "subjectivity": 0.3888888888888889
        },
        {
            "body": "1080 60 wtf 🤮",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I played through the whole game in performance mode and not once did I stop to think about the resolution. I think people should stop obsessing over this stuff and just enjoy the games. GOTG is an amazing experience.",
            "polarity": 0.2,
            "subjectivity": 0.55
        }
    ]
}