{
    "time_posted": "2021-10-30 14:00:24",
    "url": "https://www.youtube.com/watch?v=UIOiw_bED1M",
    "time_now": "2021-10-31 00:57:49",
    "ups": "5165",
    "downs": "159",
    "views": "110723",
    "top_comments": [
        {
            "comment": "The only way I care about 4k or RT, is if it runs at 60 fps, minimum. I'll take 1080/60 over 2160/30 any time I have the choice to make. This game sounds horribly optimized. 1080/30 on the S? There are much better looking games that hit 60fps an the S.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": -0.22499999999999998,
            "subjectivity": 0.725
        },
        {
            "comment": "I’m very happy that devs include 60 fps modes in their games now, I hope it’s gonna stay this way for years to come.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 1.0,
            "subjectivity": 1.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "looks like i'll stick with fishing planet and dirt 5.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "drops to 40 FPS on 1080p .... Did we get too cocky console bros ?",
            "polarity": -0.2,
            "subjectivity": 0.9
        },
        {
            "body": "where exactly is the evidence of the \"more powerful\" series x VS ps5? because all I've seen so far has been ps5 games either matching the xbox or completely dominating the series x",
            "polarity": 0.25000000000000006,
            "subjectivity": 0.63
        },
        {
            "body": "No RT that's weird",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "where did this game come from?",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "Looks sharper on ps5",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "im a pc gamer but have been blown away by my ps5 performance and overall features since launch, its made me put off upgrading my pc to RTX and just enjoy the games",
            "polarity": 0.2,
            "subjectivity": 0.25
        },
        {
            "body": "I feel sorry for the \"next gen\" Xbox series s owners.",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "4K 30fps  🤦🏽🤦🏽 very disappointing that these new consoles cannot even handle at 2K60fps. 108060fps is very disappointing 😑",
            "polarity": -0.4745454545454546,
            "subjectivity": 0.7581818181818182
        },
        {
            "body": "I don’t don’t really get these last few console generations…\nThe Xbox 360 & PS3 were supposed to be HD and generally games were not.. PS4 & XBOX One X were supposed to deliver 4K resolutions but didn’t (generally), and now not even PS5 & XBOX one series can barely provide 4K resolutions at decent frame rates. Even this DF retro video seems to miss the point of gaming as a form of entertainment. Focus on resolution or technical aspects of games is almost soulless… it’s entertainment: how does it do this is? Is it fun to play?\nNo wonder Nintendo is killing it with the switch",
            "polarity": 0.06851851851851852,
            "subjectivity": 0.27037037037037037
        },
        {
            "body": "So the amazing Ps5 with its “8k/120fps “ box badges and it’s magic SSD has performance issues and streaming stuttering even at 1080p ? ….ok 😂",
            "polarity": 0.55,
            "subjectivity": 0.95
        },
        {
            "body": "I will wait for a patch for ray tracing on PS5 and see the differences between resolution and fps and then I will decide I want to play this game or not. Or maybe a patch to reach dynamic 4K at 60fps. If any of this won't happen, then I will choose Quality Mode since I have 4K monitor (if I still desirable to play this game). It is still a shame to not play on Performance Mode.",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.32222222222222224
        },
        {
            "body": "Curious if the hitching is a engine issue.",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "I’m very happy that devs include 60 fps modes in their games now, I hope it’s gonna stay this way for years to come.",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I'd love to be a fly on the wall during the meeting between Crystal Dynamics and Squenix where they decided to make this single player with no MTX.\n\"So, will you let us make a video game this time?\"\n\"...Fine.\"",
            "polarity": 0.20714285714285716,
            "subjectivity": 0.5285714285714286
        },
        {
            "body": "The only way I care about 4k or RT, is if it runs at 60 fps, minimum. I'll take 1080/60 over 2160/30 any time I have the choice to make. This game sounds horribly optimized. 1080/30 on the S? There are much better looking games that hit 60fps an the S.",
            "polarity": -0.22499999999999998,
            "subjectivity": 0.725
        },
        {
            "body": "All this is irrelevant when you sat back on your tv. I wouldn't see the different unless you go looking. whats the real point in these",
            "polarity": -0.075,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "We should blame the engine they are using which is the same one from Deus Ex Mankind Divided and we all know how that game ran…",
            "polarity": -0.2,
            "subjectivity": 0.2625
        },
        {
            "body": "It should be 4k30fps (like now) in Quality mode and 1440p60fps in performance mode (with NO visual downgrades).\nI don't want to seem toxic but I feel so disappointed.",
            "polarity": -0.375,
            "subjectivity": 0.375
        },
        {
            "body": "Seeing the combat they should have done something to lower the quality where you don't look around the edge instead of everywhere I'm pretty sure they could have gain a lot and run at 1440p instead of 1080p ... that's a huge gap to 4k.",
            "polarity": 0.38333333333333336,
            "subjectivity": 0.9296296296296296
        }
    ]
}