{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 17:25:33",
    "ups": "6849",
    "downs": "509",
    "views": "205089",
    "top_comments": [
        {
            "comment": "None of my business and I don't give a fk. \n🖕 America",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Global business/corporate interests should be held accountable for their greed and pushing of unnecessary, cheaply made, consumer products to imaginary \"mass markets\".",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.5333333333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The only people you will convince with this video are the ones like me that are already fully aware. If you want to reach a wider audience you should show the impact on 1st world countries.",
            "polarity": 0.125,
            "subjectivity": 0.625
        },
        {
            "body": "Yea I don't give a fk",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The melting of all the ice from global warming will dilute the oceans and make it less acidic than it is. This will make the oceans more conducive to marine life, returning it to an older time when the oceans were a lot more healthy. Healthy oceans mean more seafood.  So, embrace global warming, it’s not so bad. A couple more sweaty days a year is a small price to pay for rehabilitating our oceans.",
            "polarity": 0.13365384615384618,
            "subjectivity": 0.396474358974359
        },
        {
            "body": "None of my business and I don't give a fk. \n🖕 America",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This are not real issues....we need to address and tackle real issues...you spend millions of dollars trying to stop climate change while poverty is destroying the world.. What nonsense...imagine how the world would be if we channelled that money to eradicate disease and extreme poverty..",
            "polarity": -0.05625,
            "subjectivity": 0.4
        },
        {
            "body": "WHAT WILL IT ????\nIt’s already happened tool",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "pue garbage read the news papers from 1930 for heat !",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Propaganda",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "Utter AGW Cult BS propaganda.\nMeanwhile the Amazon and Indonesian forests are being burned to grow sugarcane, soy and palm for biofuels, because the IPCC has been pushing it as \"green\".\nThe AGW Cult won't stop until they fulfil their prophesies of doom and gloom, while the Chicken Littles cheer them on.",
            "polarity": -0.20666666666666664,
            "subjectivity": 0.4966666666666667
        },
        {
            "body": "COP-26 Summit will decide what will be next ahead for the entire mankind, the outcomes from the summit will be the indicator either we really want a better future for next generation or we are the reason behind the mass destruction of ourselves. As a human being more intellectual than other species, it's one of our core duties that we should think about not only our species but also other species. Humble request as a global citizen to the global leaders don't mix up your bilateral conflicts with it. Because, if this summit's outcomes are not fruitful then the whole world become suffered.\n\"What does the temple avoid when the city burns down\".",
            "polarity": 0.03858024691358024,
            "subjectivity": 0.3327160493827161
        },
        {
            "body": "Global business/corporate interests should be held accountable for their greed and pushing of unnecessary, cheaply made, consumer products to imaginary \"mass markets\".",
            "polarity": 0.0,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "See what the Economists doomsday none sense looks like !!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would propose a quota on CO2 emission and energy consumption for each person on this earth, to be fair! If you are under you would be rewarded and if you exceed you will be punished by either a significant fine or less quota next year.\nHow’s that sound? Guess who will whine first? The Al Gore kind! What hypocrite! Pure Wester propoganda, they don’t give a s**t about the climate, they just want their super privileged extravaganza lifestyle being preserved at any cost!",
            "polarity": 0.37184523809523806,
            "subjectivity": 0.5141666666666667
        },
        {
            "body": "Wet-bulb temperature? Scary.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "More deaths are caused by cold than heat. The earth has historically flourished in warmer epochs.",
            "polarity": -0.033333333333333326,
            "subjectivity": 0.5
        },
        {
            "body": "Can we leave out the extreme images and say it like it is. Natural desasters will cost a lot of money, a lot of people/animals will die, and even more will have to look for a new home. Would you want to take in millions of poorly educated migrants? Of course not, so just fix it before we get to that point. Climate change won't end humanity, but it will make all our current problems worse.",
            "polarity": -0.02694805194805196,
            "subjectivity": 0.564935064935065
        },
        {
            "body": "Thought of forwarding but then whats the point....i give up",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fire up the carbon catching machines. Nobody talks about all the forrest fires and volcanoes that causes majority carbon in air. I live in the north. Cold as fk. Bring on the warm!",
            "polarity": 0.2215909090909091,
            "subjectivity": 0.75
        },
        {
            "body": "That \"poor\" guy was wearing an expensive new hat...",
            "polarity": -0.2545454545454546,
            "subjectivity": 0.5848484848484848
        },
        {
            "body": "The climate is changing but its not warming and its not caused by human generated CO2... its cooling and its caused by the sun going into a grand solar minimum which is a natural 400 year solar cycle where the suns magnetosphere weakens which causes our planet and the rest of the surrounding planets magneto-spheres to weaken too which alters our weather patterns...the last time  this happened was in the mid 1600's and lasted approx 70 years... the earth generally cooled and we had longer colder harsher more snowy winters, extremely wet spring and autumns causing flooding and generally shorter and hotter summers... another side effect of the grand solar minimum is more volcano's become more active due to the suns cosmic rays penetrating the earth through the weakened protective magnetosphere... so pretty much the same as whats currently happening now and increasing over the next 5-10 years when we'll be in the midst of the grand solar minimum",
            "polarity": 0.16458333333333333,
            "subjectivity": 0.4583333333333333
        }
    ]
}