{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-04 20:19:13",
    "ups": "18393",
    "downs": "1520",
    "views": "704922",
    "top_comments": [
        {
            "comment": "To learn how we can move beyond our denial, our pursuit of our own interests at the expense of the rest of the world, our fear of what the future will bring, consider reading The Great Waves of Change by Marshall Vian Summers. \n\"The first great challenge facing you is to face the great challenge--without insisting upon solutions, without fighting against the truth of what you know and what you see, without blaming other people or expecting someone else to take care of the problem for you. Everyone must take responsibility in how they live, how they think, in what they do, in the decisions before them today and in the decisions that they will have to face in the future.... It is certainly not a time to be ambivalent or complacent...Therefore you stand at the precipice. Will you choose to remain ignorant and in denial...or will you choose the path of courage and wisdom to prepare and to allow God's great gift of Knowledge to guide you and to direct you now?\"",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.33785173160173154,
            "subjectivity": 0.5358134920634922
        },
        {
            "comment": "It's rich countries that cause global warming. They should live like poor countries.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.027840909090909083,
            "subjectivity": 0.4625
        },
        {
            "comment": "Crimea is Ukraine, why did you mark it as a part of Russia?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Dinosaurs lived in temperatures much higher than today. They did great until a meteoroid sent them packing. The research behind climate change is too much speculation.",
            "polarity": 0.21250000000000002,
            "subjectivity": 0.5375
        },
        {
            "body": "attacking climate change required global industries to change their way of doing business to go greener and take less profits by giving back to the communities to help them improve their livelihood instead of giving multimillions to their white collars and lobbyists and politicians. 95% of the world population is poor and just make enough to live pay check to paycheck while the rest of the 5% are reaping all the wealth. Focus on them and the change would snowball down to your average joe.",
            "polarity": -0.08176206509539843,
            "subjectivity": 0.2617283950617284
        },
        {
            "body": "To learn how we can move beyond our denial, our pursuit of our own interests at the expense of the rest of the world, our fear of what the future will bring, consider reading The Great Waves of Change by Marshall Vian Summers. \n\"The first great challenge facing you is to face the great challenge--without insisting upon solutions, without fighting against the truth of what you know and what you see, without blaming other people or expecting someone else to take care of the problem for you. Everyone must take responsibility in how they live, how they think, in what they do, in the decisions before them today and in the decisions that they will have to face in the future.... It is certainly not a time to be ambivalent or complacent...Therefore you stand at the precipice. Will you choose to remain ignorant and in denial...or will you choose the path of courage and wisdom to prepare and to allow God's great gift of Knowledge to guide you and to direct you now?\"",
            "polarity": 0.33785173160173154,
            "subjectivity": 0.5358134920634922
        },
        {
            "body": "Propaganda as usual...",
            "polarity": -0.175,
            "subjectivity": 0.175
        },
        {
            "body": "It's rich countries that cause global warming. They should live like poor countries.",
            "polarity": 0.027840909090909083,
            "subjectivity": 0.4625
        },
        {
            "body": "simple solution : stop driving Cars, take the Bus instead",
            "polarity": 0.0,
            "subjectivity": 0.35714285714285715
        },
        {
            "body": "Okay. Get this straight , I am not responsible for what may or may not happen in the future. The carbon footprint and contribution to climate change of just 1 self-obsessed VIP at COP - is bigger than mine has or will ever be. Go figure!",
            "polarity": 0.12,
            "subjectivity": 0.41500000000000004
        },
        {
            "body": "Given that the IPCC reports and other studies don't include tipping points in their predictions, we are bound to hit 3C much sooner than media suggests—although since scientists don't even know how to model those effects accurately, it is everyone's guess when it might be exactly.",
            "polarity": 0.18125000000000002,
            "subjectivity": 0.36458333333333337
        },
        {
            "body": "When I was little, I would wear warm clothes in November in Egypt, now I'm still wearing a t.shirt and it feels hot. 30 years has changed the weather drastically and I witnessed it myself.",
            "polarity": 0.22083333333333333,
            "subjectivity": 0.65
        },
        {
            "body": "The irony of that we all is sitting with our highteck,  energy consuming devices produced in China with coalpowererd factories, shipped around the globe on fuelconsuming megaships and watch this video.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Crimea is Ukraine, why did you mark it as a part of Russia?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Catastrophe sells. Doomsday. I wished very much it would be warmer here.",
            "polarity": 0.26,
            "subjectivity": 0.26
        },
        {
            "body": "This is a very optimistic way to look at a 3C world to me. The greater concern is that a rapid increase in temperature in a complex system with feedback loops at every level is ecological collapse. The bottom layers of food chains may collapse simply because the conditions that microorganisms require to support more complex life will change faster than they can adapt. This could lead to rapid unpredictable changes including irreversible collapse. Regions could descend into chaos. It could bring on total war",
            "polarity": 0.0925925925925926,
            "subjectivity": 0.5341269841269841
        },
        {
            "body": "We MUST end the fossil fuel industry now, expropriate their profits without compensation and use that money to build the green world that might, if we are extremely lucky save most of us.",
            "polarity": 0.2111111111111111,
            "subjectivity": 0.5444444444444444
        },
        {
            "body": "I really enjoyed that very informative.",
            "polarity": 0.35,
            "subjectivity": 0.5
        },
        {
            "body": "Temperature was never stable on earth, and CO2 has nothing to with with climate change.\nAsk globalsits why they keep using mega diesel boats to tansoort merchandise from china etx...instead of producing locally, aks why ther plnes and jets are not electric nd why elon musk sell polluting space trips to millionires",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "antactica was never as cold in history as this year ... they are pushing their agenda of fear, Clima change is a natural process.",
            "polarity": -0.25,
            "subjectivity": 0.7
        },
        {
            "body": "Propaganda😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We along with most of our future generation will perish before we can witness the far reaching consequences of climate change. My money in on earthquake or some other potent disease will wipe out half of the homosapiens",
            "polarity": 0.13472222222222222,
            "subjectivity": 0.4444444444444444
        }
    ]
}