{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-02 22:59:44",
    "ups": "14487",
    "downs": "1150",
    "views": "519449",
    "top_comments": [
        {
            "comment": "Alarmism at it's best. Congrats.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "comment": "Climate change is entirely linked to overpopulation in China and India. There are 1,446,736,218 people in China and 1,398,087,214 in India...the rest of the world will have to deal with the consequences !",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.625
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The world is doom....enjoy the present...no waste your time !!!",
            "polarity": -0.390625,
            "subjectivity": 0.0
        },
        {
            "body": "Oh dear. What does 6 degrees feel like? \n\nWhat do the 50 thousand children a year who die of Rabies feel like? \n\nWhat was it like living in Greenland, (the clue is in the name) when the Vikings farmed it with cattle and vinyards grew just south of Edinburgh? \n\nWhat's it like living with White narcissists, who know that the demographics are firmly against them; and imagine that instead of their own extinction, it is the (white) Polar Bear and the whole world that is facing extinction. \n\nSorry folks, the Earth is not flat. \nWe are on a planet spinning on its axis at 1,000 miles per hour and hurtling through space at 67,000 miles per hour, in orbit around a star whose radiation is not constant and you worry about an increase in levels of CO2 of 100 parts per million?",
            "polarity": 0.003240740740740734,
            "subjectivity": 0.38981481481481484
        },
        {
            "body": "More than half the people in the world do not care about climate change. It's the educated people who are paying more while the illiterates contribute more to the raising in temperature. We want lawmakers to hold everyone responsible for the consequences not just over tax the working class while criminals and polluters get a slap on the wrist.",
            "polarity": 0.3066666666666667,
            "subjectivity": 0.44333333333333336
        },
        {
            "body": "Quit fear mongering. Climate change is not a crisis. It’s not largely caused by human activity and life can adapt to changing temperatures like it always has.",
            "polarity": -0.05357142857142857,
            "subjectivity": 0.2642857142857143
        },
        {
            "body": "This is fiction 100% The Cabal is is running the fear factor and it's all about the dollar. Gaia is way ahead of humans and we're like flea's on a elephants back. Don't believe the criminals their here to destroy. The human race only has one enemy....... Government.",
            "polarity": -0.05,
            "subjectivity": 0.275
        },
        {
            "body": "Human civilization is fiddling while Rome burns.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "There was a 18 degrees hike in temperature in the ice core data and life still got going 🤔",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "30 years of talk, talk, and talk! The only cause of world distruction “OVERPOULATION” is not even mentioned! All they could agree on, so far, is to stop farting! What a shame!",
            "polarity": 0.078125,
            "subjectivity": 1.0
        },
        {
            "body": "Alarmism at it's best. Congrats.",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Tony heller would have a field day here",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fossil fuels are secondary to the effects of over population; fix this or lose everything.",
            "polarity": -0.3,
            "subjectivity": 0.3
        },
        {
            "body": "Big cities should all be under an umbrella, under a dome. Umbrella for each one of those buildings that radiate grave heat. Mist should down pollution every evening then filtered so pollution doesnt escape into farmlands....",
            "polarity": -0.07777777777777779,
            "subjectivity": 0.19444444444444448
        },
        {
            "body": "It looks like the skybis falling chicken little.  Lol .. global climate joke.",
            "polarity": 0.0031250000000000167,
            "subjectivity": 0.5375
        },
        {
            "body": "As far as I can tell, none of the agreements are being met, and in fact human  release CO2 is increasing, not decreasing. More coal in 2021, and more still in 2022. Then there is the warming of the permafrost that could release massive amounts of methane. And then there is the increase of melting in the arctic and Antarctic that is not yet understood. If an Antarctic glacier gives why, massive sea level rise..",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.6833333333333332
        },
        {
            "body": "Climate change is a hoax just like extinction robellion and their so called (77bot) supporters in the comment section.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Great that you have models, we all know how accurate models are at predicting an impending apocalypse... Not.",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.6916666666666667
        },
        {
            "body": "Climate change is entirely linked to overpopulation in China and India. There are 1,446,736,218 people in China and 1,398,087,214 in India...the rest of the world will have to deal with the consequences !",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "body": "How are the scientists sure the recent 1.3 C rise would not have happened anyway? Doesn't the planet warm and cool despite what humans do?",
            "polarity": 0.36250000000000004,
            "subjectivity": 0.5972222222222222
        },
        {
            "body": "Are we getting closer to the sun or something?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}