{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 21:32:48",
    "ups": "7659",
    "downs": "576",
    "views": "239497",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Problem is human greed.  I.e. taking the time to create this video just to use as a vehicle to ram 200 ads down your throat while you are watching it.  /smh",
            "polarity": -0.07777777777777779,
            "subjectivity": 0.19444444444444448
        },
        {
            "body": "How many small farmers are there in the world?\n\n600,000,000 farmers produce 1/3 of the world's food?",
            "polarity": 0.125,
            "subjectivity": 0.45
        },
        {
            "body": "c c p is the problem",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Fossil fuels what a joke 🤦🤦🤦 🤣 the planet will continue to get warmer it is the national circle of the planet . There are Vulcan eruption generate more toxicity than car's pffff . Plant longer lasting tree 🌲🌲🌲 that is a better solution I believe . Places were climate it's affecting people and stuff . Plant trees that last may years will be helpful I believe",
            "polarity": 0.25,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "Really want to save the planet?  Stop producing humans.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "So 2000 plus atmospheric and underground nuclear weapons testing worldwide has nothing to do with climate change ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ask yourself  what you can do to change.  1) drive you car less to none 2) isolate your home (if you live in the north) 3 ) eat local grown food and less meat 4) buy local products (or consume less) 5) work from home if possible 6) spend holiday close to home. 7) reduce population .... any other ideas?  if we all do 4 things of this list..  then we are getting some where...",
            "polarity": -0.061079545454545456,
            "subjectivity": 0.259375
        },
        {
            "body": "when I went to school in the late 60s and early 70s we where tought of a coming Iceage, I am still waiting for this, now its global warming, we hear a lot about raising ocean levels.\nName me one city over 50,000 people and the country it is in, that is flooded as a result of raising Ocean levels today - you wont find one, its all just fear and money making",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.3
        },
        {
            "body": "What a bunch of propaganda claptrap. If you want to take some measures to adapt to the small amount of warming seen, fine. But in reality, there have been very few measurable effects from that small warming. The idea that we're going to be net zero by 2050 (or 2030 as some politicians claim) is pure fantasy. We'd have to go to a pre-industrial way of living to meet those goals.",
            "polarity": -0.03272108843537415,
            "subjectivity": 0.29
        },
        {
            "body": "Like all plaques, they all have a breaking point. Incluiding the human plaque.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "The reality we face is not the phoney CO2 3 degree C rise but the 13 degrees C DROP. We are thousands of years past the average time interglacial warm periods last. When the COLD of the end of the interglacial begins, temperatures drop fast. To full glacial cold in less than a century, and possibly in as short a time as a decade.",
            "polarity": -0.06166666666666667,
            "subjectivity": 0.4833333333333333
        },
        {
            "body": "\"The climate system is a coupled non-linear chaotic system, and therefore the long-term prediction of future climate states is not possible.\"\nIPCC 2003\n\nThis is something Corporate Media and The Narrative never talk about.",
            "polarity": 0.0,
            "subjectivity": 0.375
        },
        {
            "body": "They lie because the Industrial Revolution didn't start in 1900 it started in 1750 which they won't give you those numbers they keep moving the goalposts",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Remember everyone, Elon musk isn’t going to fix this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There are climate changes occuring on all planets of the solar system. How do you explain that? Maybe changes on the Sun?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "yep. its a con job. the sea level HAS NOT RISEN. if it had, the sydney opera house would have flooded right? and the statue of liberty. its all GARBAGE. and when they did make electric cars, they made Porsche cars that do 180mph/ what a buncnh of a-holes. its just to regulate small business with restrictions.",
            "polarity": 0.01785714285714285,
            "subjectivity": 0.46785714285714286
        },
        {
            "body": "Those sideburns are scarier than climate change 👀",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Dear human beings. Climate has allways changed. Carbondioxid is the food for life. It is not a poison. If you are not aloud to speak of some things you should be suspicious.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "why is there a border between crimea and ukraine?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Help them to collect rain.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}