{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-30 16:46:02",
    "ups": "1582",
    "downs": "115",
    "views": "28077",
    "top_comments": [
        {
            "comment": "And there's the rub...the poor will pay the price while it's the wealthy causing most of the issue so the wealthy have no incentive to do anything. The only thing made clearer to me than global warming is there is absolutely no way we are going to change in any meaningful way. We've been talking about this for decades and have kept adding to the problem. Yes we're burning less but that has been driven almost 100% by the cost. It just isn't in human nature. We creature things, we consume, we rationalize.\n\nI'm 65 and see no big reason to do anything because I'm probably going to be OK. For me I'm moving to a new location to escape drought and I'm looking at warming effects when choosing a new location. I think talking about warming is now a waste of time that could be used to prepare for the coming results.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.12707070707070706,
            "subjectivity": 0.47838383838383824
        },
        {
            "comment": "In the meanwhile, the leaders of China and Brazil, two of the nations most at fault for ever increasing CO2 emissions, are absents in the COP26.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "comment": "They will only die once.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "comment": "I know media in general is trying to avoid panic and hopelessness; but they shoudn't ignore the importance of feedback loops in climate change development. Just to give one example of many: there are already reports of huge emisions of methane from the permafrost in siberia and other arctic tundra. In reality, a 3ºC rise is very optimistic, maybe naive, outcome. Brace for catastrophe, because it is coming.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.12083333333333335,
            "subjectivity": 0.5958333333333333
        },
        {
            "comment": "Carboon emission caused by 100 people in bangledash may be less than caused by one man in a developed country, high fuel consumption luxury cars， yachts, 24-hour none-stop air conditioning systems, etc., too much energy wasted for the purpose of pursuing so called high quality life while people in poor countries struggling for their lives",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.020952380952380962,
            "subjectivity": 0.32095238095238093
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Hey, don't kid yourself. We'll blow past 3 degrees of warming. Once the Siberian permafrost releases all that methane temperatures will rocket upwards.",
            "polarity": -0.25,
            "subjectivity": 0.25
        },
        {
            "body": "My mans looking like Petter Pettigrew",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I know media in general is trying to avoid panic and hopelessness; but they shoudn't ignore the importance of feedback loops in climate change development. Just to give one example of many: there are already reports of huge emisions of methane from the permafrost in siberia and other arctic tundra. In reality, a 3ºC rise is very optimistic, maybe naive, outcome. Brace for catastrophe, because it is coming.",
            "polarity": 0.12083333333333335,
            "subjectivity": 0.5958333333333333
        },
        {
            "body": "Carboon emission caused by 100 people in bangledash may be less than caused by one man in a developed country, high fuel consumption luxury cars， yachts, 24-hour none-stop air conditioning systems, etc., too much energy wasted for the purpose of pursuing so called high quality life while people in poor countries struggling for their lives",
            "polarity": -0.020952380952380962,
            "subjectivity": 0.32095238095238093
        },
        {
            "body": "Too much climate change commentary leaves out the problem of feedback loops and tipping points. Once we reach certain thresholds these can trigger even more changes which can become like an avalanche. I don't think humanity itself will be wiped out or made 'extinct' but what will become increasingly common is the breakdown of civilisation and more and more collapsed societies. I'm sure humanity will cling on for many more generations, but in what shape will we be? As our world deteriorates in every way, we will slowly lose any sense of hope and optimism for the future. What will children dream of in 2100? I still find it incomprehensible that many politicians and of course fossil fuel execs believe that this hellish vision for possibly the only intelligent life in the universe, is worth trading off for a few more years of profits before they are finally forced to admit that they are sitting on stranded assets. So basically our entire ecological system and millenia of human civilisation are worth a few more Louis Vuitton handbags and luxury cars. That's what we've come to folks.",
            "polarity": 0.19285714285714287,
            "subjectivity": 0.46578144078144074
        },
        {
            "body": "Looks like the Elite wanted their green stocks to grow,and had ordered TheEconomist to make a video",
            "polarity": -0.2,
            "subjectivity": 0.3
        },
        {
            "body": "Did Al Gore Predict Earth’s Ice Caps Would Melt by 2014?\n\nIn the late 2000s, the former U.S. Vice President sometimes inaccurately represented studies that predicted the timeline for an ice-free Arctic.",
            "polarity": -0.15,
            "subjectivity": 0.3
        },
        {
            "body": "Mass extinction.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Burning fossil fuels is our way of trying to prevent another Ice Age.  The American Petroleum Institute will be releasing new ads designed to scare children about the dangers of too little Global Warming, pictures of scary wooly mammoths eating their parents and mile high glaciers destroying their schools.",
            "polarity": -0.08444805194805194,
            "subjectivity": 0.3563636363636364
        },
        {
            "body": "They will only die once.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "\"The earth will dry up and wither. The world will languish and wither. Even the great people of the Earth will suffer. The earth will be defiled by its inhabitants; they will disobey God's laws, violate his statutes, break his everlasting covenant. Therefore a curse will consume the Earth. It people must bear their guilt. Therefore the inhabitants of the earth will be scorched, and few men will be left.\" Isaiah 24 4-7",
            "polarity": 0.13333333333333336,
            "subjectivity": 0.36250000000000004
        },
        {
            "body": "Cut their hearts out and spill their blood for the Gods, I think it used to work?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "You care future. He cares only power.",
            "polarity": 0.0,
            "subjectivity": 0.5625
        },
        {
            "body": "Why does only weak and poor bear the brunt of rich's mistakes and follies??",
            "polarity": -0.1,
            "subjectivity": 0.74375
        },
        {
            "body": "Surely 'poor peoples capitalism' is causing this. Look how many normal families have more than one car, fly abroad regularly, buy and waste food, but and waste cheap clothing manufactured in China (pushing up their CO2 levels), eat large volumes of methane producing meat. As a multimillionaire property developer I would welcome huge price increases on cars, travel, meat etc.. Stop 'normal people' from affording these luxuries, and leave it to us rich. Problem solved.",
            "polarity": 0.249234693877551,
            "subjectivity": 0.5396781789638933
        },
        {
            "body": "In the meanwhile, the leaders of China and Brazil, two of the nations most at fault for ever increasing CO2 emissions, are absents in the COP26.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "this is why we need to get new source of energy,solar panels and such are just short term solution",
            "polarity": 0.04545454545454545,
            "subjectivity": 0.4181818181818182
        },
        {
            "body": "And there's the rub...the poor will pay the price while it's the wealthy causing most of the issue so the wealthy have no incentive to do anything. The only thing made clearer to me than global warming is there is absolutely no way we are going to change in any meaningful way. We've been talking about this for decades and have kept adding to the problem. Yes we're burning less but that has been driven almost 100% by the cost. It just isn't in human nature. We creature things, we consume, we rationalize.\n\nI'm 65 and see no big reason to do anything because I'm probably going to be OK. For me I'm moving to a new location to escape drought and I'm looking at warming effects when choosing a new location. I think talking about warming is now a waste of time that could be used to prepare for the coming results.",
            "polarity": 0.12707070707070706,
            "subjectivity": 0.47838383838383824
        },
        {
            "body": "I cannot believe the economist has fallen into ideological nonsense like this, such a disappointing perspective and propaganda.",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "Lucky for us CO2 is a Refrigerant \nScience, Try Some…",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.8333333333333334
        }
    ]
}