{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 05:04:56",
    "ups": "3373",
    "downs": "228",
    "views": "86516",
    "top_comments": [
        {
            "comment": "When it gets colder, you'll realize how moronic this really is!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.2
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "🦇🤍🌈🤍🦇",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All unproven scare mongering by big money making consortiums to make the average person pay them money by way of a climate tax nothing more.",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "This BS makes me laugh. We have absolutely no idea what the global temperature trends are. We have approximately 0.000004% of the earths climatological history accurately mapped.\n\nConsidering that archeologist are uncovering well used trade routes that have previously been covered by glaciers for hundreds of years if not a millennium. I would say that the earth was warmer.\n\nThe people who follow the religion of global cooling. Sry, I mean warming. Or is it man made climate change. No, I remember now. It's the orwellian climate change. Those fanatics want you to believe that with absolutely no evidence, the world is going to end.",
            "polarity": -0.04212962962962963,
            "subjectivity": 0.44305555555555554
        },
        {
            "body": "is there enough time to go carbon neutral in 5 years",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "Was warmer than that a while back. Looking forward to palm trees n no snowblowers. Just need to reintroduce Dinos. Go full Cretaceous. Better than that aoc dingbats plan",
            "polarity": 0.2833333333333333,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "Net Zero is difficult to achieve.",
            "polarity": -0.25,
            "subjectivity": 0.5
        },
        {
            "body": "People dont care about climate change because it is the future's problem. Not them.  When a children or youngster says something about actions to curb gas emission, they laugh.",
            "polarity": 0.15,
            "subjectivity": 0.1125
        },
        {
            "body": "three degrees cooling means the next ice age and starvation.  without co2 plants cannot thrive and make food.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The side effects have been felt by most of mankind. The world is heading towards destruction due to pollution of water, air, soil, and disregard for efforts to stop this destruction.",
            "polarity": 0.1875,
            "subjectivity": 0.4375
        },
        {
            "body": "World leaders taking private jets to climate summit. Dont overthink it. Just eat your cake. Peasants",
            "polarity": 0.0,
            "subjectivity": 0.375
        },
        {
            "body": "Human will still survive that.\n\n\n\n\nBut with great cost... 😭",
            "polarity": 0.4,
            "subjectivity": 0.425
        },
        {
            "body": "Genesis 8:22 KJV \n\"While the earth remaineth, seedtime and harvest, and cold and heat, and summer and winter, and day and night shall not cease.\"\n\nGlobal warming is a scam!",
            "polarity": -0.3,
            "subjectivity": 0.5
        },
        {
            "body": "\"Science is the belief in the errors of the experts.\" (Richard Feynman)\n\"Ideologistic science is the belief into the stomache feeling of politicians.\" (me)\n\nLet's talk about ocean acidification.\nThe music in carbon binding and oxygene production plays in the oceans, not at land.\n\nWe could breath without trees, but not without phytoplancton, that produces over 75% of the global oxygene. And binds over 75% of the carbon dioxyde into organic mass. These organisms as well as coral reefs and diatoms, are endangered by carbon acid, CO2 in H2O.\n\nHow did the CO2 get into the oceans?\nBy the cooler water temperatures of the current ice-age, as cool water can absorb far mor gases as warm water.\n\nWhen will the CO2 gas leave the oceans, again?\nWith the warmer water temperatures at the end off the ice-age.\n\nWhen is the current ice-age over?\nThe current ice-age (that started around 30 millions years ago) is officially over, when both poles, arctic and antarctic, melt once a year away.",
            "polarity": 0.14999999999999997,
            "subjectivity": 0.4928571428571428
        },
        {
            "body": "When it gets colder, you'll realize how moronic this really is!",
            "polarity": 0.25,
            "subjectivity": 0.2
        },
        {
            "body": "We're all going to die unless we make al gore richer. Ha ha, I'm not giving climate change cultists a single cent, EVER.",
            "polarity": -0.07142857142857142,
            "subjectivity": 0.21428571428571427
        },
        {
            "body": "Hoax",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It shouldn't be called climate change. What is being described is actually population change. Poor countries becoming over populated. Statistics show higher rainfall and much higher food production world wide. The whole premise of this video is a crock.",
            "polarity": 0.09285714285714287,
            "subjectivity": 0.47857142857142854
        },
        {
            "body": "F off with your fear mongering. For FOURTY YEARS YOU FCKS HAVE TRIED TO SCARE PEOPLE WITH THIS. YOU ALL NEED TO HANG.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Science can help us we must plant trees each year around trillions",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Alarmist!",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}