{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-03 19:36:19",
    "ups": "16606",
    "downs": "1364",
    "views": "624978",
    "top_comments": [
        {
            "comment": "Three degrees will melt a lot of permafrost and release a lot of methane.  Add the increase in fires and 4 and 5 degrees will soon follow.  Stop making babies people.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Really pathetic and absurd how capitalism and it's representatives are dealing with this issue: until a few years ago, authorities were expecting to heat the planet \"only\" 1,5 degree Celsius, at most 2. Now you're talking about 3, making many people think 1,5 degree is acceptable, but it never was. Capitalism must be destroyed worldwide through revolutions, otherwise this distopian world we already live in will get much worse, with even more problems and barbarism",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.051515151515151514,
            "subjectivity": 0.6333333333333333
        },
        {
            "comment": "The world has been warmig for 20,000 years. Only 12,500 years ago the northern hemisphere was covered in ice. The Sahara used to be similar to the Serengeti. Cave men must have driven their cars and run their factories a lot to melt half a planet of ice and turn the largest grassland into the largest desert.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.05555555555555555,
            "subjectivity": 0.5222222222222223
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The single biggest thing anyone can do to combat climate change and be more ethical is to adopt a plant-based diet.\nFax are fax. I said it.",
            "polarity": 0.20952380952380953,
            "subjectivity": 0.4380952380952381
        },
        {
            "body": "i hope the OnePercenters with allow only a 3 degrees rise.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "I have to call lets go Brandon on this one.  Where are the studies they cite and that can be used as a basis for these out of this world and beyond reality predictions?  When there is no evidence to base your predictions on, you are no better than a ghost hunter or spiritualist.\nWhy not spend some time showing the consequences to the poor and middle class in this world of the cessation of using fossil fuels?  Are you trying to say the people of this world will be better off without them?  Thats just plain delusional.",
            "polarity": -0.19404761904761905,
            "subjectivity": 0.4928571428571429
        },
        {
            "body": "BS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The temperatures in the 1930s were just as hot if not hotter than now. The temperature records have been fraudulently changed. \n\nTo find out how where you now live will look like with a 3ºC rise in temperature, simply visit the nearest area where the temperature is 3ºC hotter than now.\n\nThis pseudo-since scaremongering is a disaster for our children and grandchildren. The climate is no more extreme than it has been before. There is no 'climate crisis'.\n\nI used to think the Economist was a reputable magazine. Ugh!",
            "polarity": 0.10606060606060606,
            "subjectivity": 0.6678571428571428
        },
        {
            "body": "Climate change is a lie!\nThere is no such thing!\nThe real reason for these weather anomalies is because of the ‘destroyer’ comet which fast approaching earth, which will cause the apocalypse by the end of 2021.\nDon’t believe the mouth piece of Satan “The mainstream media”.\nAll they know how to do is to LIE!\nStore food and water NOW",
            "polarity": 0.1,
            "subjectivity": 0.35
        },
        {
            "body": "Propaganda",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "blame corporations and not consumers",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Mass migration from failed crops will increase 10 fold.",
            "polarity": -0.5,
            "subjectivity": 0.3
        },
        {
            "body": "Its annoying that the \"Developed\" countries since the industrial revolution have till now totally contributed more than 50% of the emissions, and now are switching to green energy and forcing developing countries to do so. It may seem like China and India are the ultimate culprits who cause climate change, but when you add the historical emissions since the industrial revolution, they aren't the culprits, it's the western developed countries. Since the industrial revolution India has barely contribution 3% to world CO2 emissions while accounting for 17% of the world population, where as US has contributed 23% CO2 emissions with just 4% of the world population, and that's without considering the CO2 for imported products from Asia. The west first industrialized itself and polluted the climate, and then outsourced all manufacturing(which means even the CO2 emissions) to Asia in late 20th century, what happens is that China becomes the largest CO2 emitter, but that's obvious because it's literally producing everything for the world.  Its as though the western population got our products and we got their pollution and in the future Asian countries will even get the blame for climate change while the west  must be accountable for climate change if you see total historical emission.😤😑 The original 1995 Agreement was that the western developed countries would reduce their net emission to zero which would give developing countries \"the room\" to emit more, develop quickly and switch to greener methods. But the western countries never got their emissions down and developing countries started emitting more which just boosted climate change at the end of the day 😭",
            "polarity": 0.048313492063492065,
            "subjectivity": 0.3320436507936508
        },
        {
            "body": "But no mention of how a rise in 3 degrees would allow for a lot more crops to be grown in places of the world they would not otherwise be able to be grown.  Why aren't we thinking logically about any of this?  Why is it all on the negative side, but nothing on the positive?  \n\nWhy do we never see actual charts and data in raw form (for example actual degree temperatures over time) -- not interpreted or manipulated?  Let's actually discuss the science.  CO2 being .04% of the atmosphere, and how CO2 molecules break down, they don't stay in the atmosphere forever.  Water vaper is the most abundant \"greenhouse\" gas,  etc, etc......",
            "polarity": 0.1575789950789951,
            "subjectivity": 0.401740157990158
        },
        {
            "body": "The world has been warmig for 20,000 years. Only 12,500 years ago the northern hemisphere was covered in ice. The Sahara used to be similar to the Serengeti. Cave men must have driven their cars and run their factories a lot to melt half a planet of ice and turn the largest grassland into the largest desert.",
            "polarity": -0.05555555555555555,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "Awareness is known by awareness alone.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Really pathetic and absurd how capitalism and it's representatives are dealing with this issue: until a few years ago, authorities were expecting to heat the planet \"only\" 1,5 degree Celsius, at most 2. Now you're talking about 3, making many people think 1,5 degree is acceptable, but it never was. Capitalism must be destroyed worldwide through revolutions, otherwise this distopian world we already live in will get much worse, with even more problems and barbarism",
            "polarity": -0.051515151515151514,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "The climate changes all the time due to the sun being closer to earth. Try and do the impossible and move the sun further and we will all freeze to death.",
            "polarity": -0.2638888888888889,
            "subjectivity": 0.625
        },
        {
            "body": "whats up with this guy's beard",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It hasn’t warmed up by 3 degrees so how do you know what it looks like?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We're the most invasive species the world has ever had. Climate disaster will happen. I just hope once we are extinct, mother nature will be able to thrive again.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.5750000000000001
        },
        {
            "body": "Dropping thousands of nuclear bombs hasn't helped. Wouldn't surprise me if it was that that changed our climate but are twisting it on us so we are to blame .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Three degrees will melt a lot of permafrost and release a lot of methane.  Add the increase in fires and 4 and 5 degrees will soon follow.  Stop making babies people.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}