{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 09:11:45",
    "ups": "4435",
    "downs": "319",
    "views": "112550",
    "top_comments": [
        {
            "comment": "A 3⁰ world would mean livestock would need to have air-conditioned sheds, which is unfeasible.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.3125,
            "subjectivity": 0.6875
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Stop complaining politician you stop eating or cut down non veg,purchase less cloth,gadget,dont waste food.",
            "polarity": -0.17407407407407408,
            "subjectivity": 0.11851851851851852
        },
        {
            "body": "China is the biggest polluter and I doubt they really understand the severity of what will happen to their country in the nex few years! It has been bad now, it will be much worse! The same goes for the US and Europe!",
            "polarity": -0.24999999999999994,
            "subjectivity": 0.3383333333333333
        },
        {
            "body": "A 3⁰ world would mean livestock would need to have air-conditioned sheds, which is unfeasible.",
            "polarity": -0.3125,
            "subjectivity": 0.6875
        },
        {
            "body": "I don't know what is scariest. A 3 degree increase in world temperatures or the dude with beard on his face cheeks",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Too bad all the old people that have hoarded all the power would rather see billions of people suffer and die and entire ecosystems collapse than have their personal wealth or power decrease. Life is going to be so awful for the next few generations if there even get to be that many more.",
            "polarity": -0.08888888888888886,
            "subjectivity": 0.43240740740740746
        },
        {
            "body": "Should already be a more practicle part of our lives. Leave and adapt elsewhere. This isn’t going away.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "As long as the far east continues on it's current course, nothing the west can do will matter. If we want to adapt, then the first step is to stop trusting news outlets owned multinational conglomerates. The corporations will not give honest assessments nor reasonable solutions as their goal is to monopolize all wealth to further their own power. If destroying the developed world will accomplish that...then they'll do just that.😒",
            "polarity": 0.15999999999999998,
            "subjectivity": 0.5433333333333332
        },
        {
            "body": "Most people in Asia never heard of climate change. Here in Thailand it is not taught in schools or even discussed among teachers.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Ugh I really want to escape to Canada",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "- 30% human people  = - 3 degree...",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "This is dishonest, you show a sea level animation for 10m but the narration says in the worst case scenario we might be facing up to a 0.5m rise.\nYou are tricking people with effects 20x worse than the worst case scenario.\nYou don't bother pointing out that since the last ice age sea levels have risen 120m and during that time humans did rather well and created every civilisation on earth.",
            "polarity": -0.54,
            "subjectivity": 0.6333333333333334
        },
        {
            "body": "Didn't the GOP including Trump said climate change wasn't real?",
            "polarity": 0.2,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "We have to step back and look at the problem of global warming from a new perspective. I propose that we ask all the world governments to allow one or more of their top scientists and/or inventors to work together with other countries' top experts to transform CO2 gas in the atmosphere to environmentally safe substances or gasses. Why do I say this? Because they are opening up new coal mines at this writing. Let's be real; no one is going to stop burning fossil fuels until its too late. The only viable solution is to solve the problem at the source. The atmosphere is heating up because there is too much CO2. Let's put the top brains and talent of the entire world into coming up with machines that pull out the CO2 to acceptable levels. We are dreaming to think by certain governments diminishing their emissions by miniscule amounts that this is going to work.",
            "polarity": 0.18512581168831171,
            "subjectivity": 0.4425324675324675
        },
        {
            "body": "Yes but 2° is coming anyway so why bother,also neither citizens nor politicians will act accordingly",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Pretty normal",
            "polarity": 0.2,
            "subjectivity": 0.825
        },
        {
            "body": "I would request 5C it will be nice where I live. Also this will solve the over population in africa problem.",
            "polarity": 0.36818181818181817,
            "subjectivity": 0.75
        },
        {
            "body": "Death to the Greenies, make them choke on aborted fetuses.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "at first thot \"3 degrees? thats fine, its just like turning up your AC from 20 to 23 degrees\"",
            "polarity": 0.33333333333333337,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "what does the scientific evidence of 3 degrees look like?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Too late, growth economics won.  Please stop telling us the consequences so we can live in relative bliss.  All of this was known back in the 60s...",
            "polarity": -0.04090909090909091,
            "subjectivity": 0.275
        }
    ]
}