{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-02 10:37:58",
    "ups": "12798",
    "downs": "1013",
    "views": "451023",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "the population must stop to grow.all we do is futile if not",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Lies",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Still waiting for the rising sea levels we've been promised for the past 30 years.  Or maybe the extra heat/water will just cause greater humidity?",
            "polarity": 0.08333333333333333,
            "subjectivity": 0.2833333333333333
        },
        {
            "body": "tick-tock tick-tock tick-tock time is running out",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "look this is happening we should be focusing more about how to mediate it and make moves that assist the maximum number of people if you want to do something.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "BS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "At the end they always say that there's still time...been earning that since the 80's...now that some 3 world countries are catching up we need that they stopped their well deserve development? Not seeing that happening brothers...otherwise the westernised  countries should expect the migration by the billions in a near future!",
            "polarity": 0.2333333333333333,
            "subjectivity": 0.47500000000000003
        },
        {
            "body": "I just spotted a country called Greenland that's the  size of Africa and has 57,000 people living there. Will it be habitable with the coming  temperature rises?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And this video explains why I've decided not to have children. It's almost cruel at this point to bring new humans into the world. I don't want to be blamed by my own child for bringing them into what's likely effectively the twilight years of human life on this planet.\n\nI don't see the \"world's leaders\" fixing this issue. They haven't held themselves to ANY of their previous promises, why would they start now? Most of them will be dead before the worst hits us. Why would they care what future generations think of them if they're not around to suffer the consequences themselves?\n\nI miss having hope for the future.",
            "polarity": -0.04419191919191919,
            "subjectivity": 0.5559343434343434
        },
        {
            "body": "1.5C around 2032, 2C around 2045, and everybody has chosen 2050 to become zero C02! If it wasn't so scary, it would be funny. But \"cities in rich countries may be OK\".... Followed by:        \"rural areas will suffer more\". Where do you think the food is grown that city dwellers eat?!",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.625
        },
        {
            "body": "I propose to trigger a nuclear winter to decrease solar radiation. This will be the most effective way to cool the earth back to the ice age.",
            "polarity": 0.36250000000000004,
            "subjectivity": 0.48750000000000004
        },
        {
            "body": "If GW exists...its Gods punishment on liberals",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Bunch of BS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This documentery shows its like just the developing countries under the threat. Truth is the western world is emitting more and going to suffer even more.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Why don't I find this video believable?  Could it be that it's more hype than substance; more opinions than science; more unfounded conclusions than critical analysis?",
            "polarity": 0.4,
            "subjectivity": 0.5599999999999999
        },
        {
            "body": "Human are too greedy, we forget that nature are in control.",
            "polarity": 0.0,
            "subjectivity": 0.1
        },
        {
            "body": "Nobody cares",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Ots adorable how everyone still believes that this has anything to do with fossil fuels.\nAll while talking about starving children. You can't keep jamming more and more people onto this rock and expecting a reduction of greenhouse gasses to fix this.\nTime to have the hard conversation. We need systemic population controls immediately. Breeding is killing us, not oil...",
            "polarity": 0.3020833333333333,
            "subjectivity": 0.6354166666666666
        },
        {
            "body": "Jakarta is already sinking",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "jesus, those sideburns... come on man...",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}