{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-03 23:43:38",
    "ups": "16964",
    "downs": "1408",
    "views": "643039",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "How come there are more than one thousand dislikes?",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "WORLD LEADERS be like \"Blah Blah Blah😲, climate change Blah Blah Blah😠",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All topic . are  not including the Solar Dynamics data . and blame mankind . yet its the SUN/our STAR that is  the 80% cause  topped with a Weakening of earths magnetic field . all ads to the climate changes we see today.. mans influence is a bi-product, compaired to celestial influence.. Yet the VOICE's of the Power's that be, rant about .... \"It's  Your  Fault..!\"",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And don't forget about the Himalayan glaciers melting by 2035 only 14 more years to see them.",
            "polarity": 0.25,
            "subjectivity": 0.75
        },
        {
            "body": "Hope the apocalyptic movies don't come to reality",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Awsome! I like more warm weather.",
            "polarity": 0.55,
            "subjectivity": 0.55
        },
        {
            "body": "There will be 4 billion dead within 10 years.",
            "polarity": -0.2,
            "subjectivity": 0.4
        },
        {
            "body": "See the results from the Greenland isotope core samples. The world has cycles as it has since it’s start, there’s a graph showing weather patterns (caused by these cycles) starting from in the hundreds of thousands to present day. It even shows interruptions where the earth has suffered big catastrophe’s ie around 11600 years ago we suffered a strike by a large meteor or comet and this shows up on the graph by an 18c jump in global temperatures, its thought to be what ended the last ice age. The scientists drilled down something like 2 miles into the Greenland ice cap over 5 years and this is what they’ve found by studying the layers of the core samples. It’s not something we’re going to stop from happening. We still do need to live cleaner and look after the planet a lot more than we do for lots of reason but we won’t have an effect on the cycles of the earth, and I believe that’s what we’re experiencing. have a look into it!\n\n JR podcast had one with a guy called Randall Carlson he’s brilliant. I believe it’s around the 20min mark.",
            "polarity": 0.1720093795093795,
            "subjectivity": 0.2984126984126984
        },
        {
            "body": "Thee number 1 cause for greenhouse gas emissions that directly cause an exponential increase in climate temperature is from ANIMAL AGRICULTURE. I'm not a vegan and this is absolutely true so stop looking to blame only the factories and engines because their footprint come now where near the emissions from livestock and the deforestation that occurs to accommodate raising them on land in areas where the rainforest is already depleted. Wake up world!",
            "polarity": 0.14375,
            "subjectivity": 0.6124999999999999
        },
        {
            "body": "Ok then do it all of us park the cars do it they won't they talk",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Fantastic and tragic....thankyou",
            "polarity": 0.4,
            "subjectivity": 0.9
        },
        {
            "body": "This is all lies in less than 10 years you will be in a pending ice age, they are setting you up for a massive fall. I wonder how they will explain that away? Lies lies lies......... Just give us your money and we will stop the gigantic all powerful sun from doing it's cyclic cycles, we'll call it into the office for a meeting FFS",
            "polarity": 0.044444444444444446,
            "subjectivity": 0.6888888888888888
        },
        {
            "body": "More “global warming” propaganda",
            "polarity": 0.13333333333333333,
            "subjectivity": 0.19999999999999998
        },
        {
            "body": "Looking at this comment section as a species we are to far gone to act on such a huge problem. Our politics and beliefs makes us ignorant to the science and data and we deserve what’s coming to us…",
            "polarity": 0.1666666666666667,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "Lies.\nAnything that comes from the elites is a lie\nWake the f. up.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How does anyone actually know that any amount of human intervention to stop it will work? How do we know that the earth is not just in a cycle of warming up? I don't disagree that the earth is warming, but I'm skeptical that we can stop it. Mother Nature will correct itself, possibly by expelling human life, but it will find a way. The Earth has been through many cycles of hot and cold.",
            "polarity": -0.04375,
            "subjectivity": 0.51875
        },
        {
            "body": "When we fail to change, the world will change us.",
            "polarity": -0.5,
            "subjectivity": 0.29999999999999993
        },
        {
            "body": "Nothing but “dezinformatsiya”. CO₂ cannot change temperatures according to the Ideal Gas Law: PV=nRT.",
            "polarity": 0.9,
            "subjectivity": 1.0
        },
        {
            "body": "We have to fight RIGHT NOWWWWWW",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "the world will flourish just as it did during the Medieval Warming period, 1000-1300CE.....",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}