{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-05 16:54:58",
    "ups": "19302",
    "downs": "1617",
    "views": "753043",
    "top_comments": [
        {
            "comment": "People from 180 countries united to shine an honest spotlight on catastrophic climate change at the Dec. 4 Global Crisis conference. A Time for Truth.\" This conference is an unprecedented event for all people of the planet. Only by uniting the potential of all humanity can we survive the impending climate catastrophes. Join us, this is our last CHANCE!!!!",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.19999999999999998,
            "subjectivity": 0.6444444444444445
        },
        {
            "comment": "We don't have that 20, 30 or 50 years! The climate is changing catastrophically fast and people are not prepared for it in any country. Only by uniting and building a Creative Society can we get through these difficult times with dignity and survive as a civilization.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.04999999999999999,
            "subjectivity": 0.9
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I think the computer estimates are very optimistic - could be 6 degrees centigrade rise by the end of the century unless somthing drastic is done - like I have discussed comprehensively on Facebook - the trouble is no one will read my facebook entries.",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "Global warming is caused by the Sun not by humans!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't understand how people in this video living in poverty have so many children, animals, vehicles and all are very overweight",
            "polarity": 0.35,
            "subjectivity": 0.4
        },
        {
            "body": "West countries first waste fossil emisions to atmosphere !!!",
            "polarity": -0.0703125,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "Ever heard about Milankovic or international socialisme =UN  politics ???\nThe problems like migrations  in this video can also be explained by the exploding world populations and political instability or faling UN states . \nAlso systemic poverty due by high birthrates not addressed by the UN ? \nScientific questions :\n1 is life (photosynthesis)  possible if the CO 2 concentrations decreased ?\n2 Due by global warming we could measure thermionic expansion  of the earth ? \n3 It's even difficult to predict weather but how realistic are predictions over 50 or 70 years about climate ???",
            "polarity": -0.08233333333333334,
            "subjectivity": 0.4423333333333333
        },
        {
            "body": "Don’t worry the earth will be rid of a lot of people that are taking the vaccines 🤪 that will help!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We have already warmed the earth by 2 degrees",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So you are driving an electric car, right ?",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "The last time the planet was 3C warmer, 2.5 million years ago, was it a big catastrophic disaster?",
            "polarity": 0.0,
            "subjectivity": 0.08333333333333334
        },
        {
            "body": "Capitalism is not a problem. Capitalism WITHOUT boundaries is what have us all here. Consuming without consciousness is what have us here, based on a logic of a literal poor mind where our fears are ruled by not having enough and to try to hold as much as we can to demonstrate to society our selfish needs by accumulating things like money, cars, houses, yachts, planes, humongous amounts of food and clothes we don't need. If you take a look at this doc very closely, the ones of us that live in cities are quite selfish and we don't stop to think what our impact will be for every unnecessary purchase, for every unnecessary accumulation to become \"someone in society\" when truly, our nature as species is to be united as one. Let's stop thinking our way of life doesn't affect everyone because it truly does. Let's start getting things because we truly need them and not to appear as someone in society when we are just feeding the greed of certain companies that want us to consume in an unlimited and disproportionate way. If you really want to be someone in society, have consciousness of every sister and brother around the world who is suffering because of our selfish acts.",
            "polarity": -0.1457792207792208,
            "subjectivity": 0.6392857142857143
        },
        {
            "body": "\"global warming\" 👉FAKE🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "•Jesus Christ is the Way, the Truth, the Life. No one comes to the Father except through Him. There is no other intermediary. May Jesus Bless you, trust Him, give your life - and He will take care of it :pray Convert yourself and believe in the Gospel♡:*",
            "polarity": 0.0625,
            "subjectivity": 0.375
        }
    ]
}