{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-02 14:45:09",
    "ups": "13385",
    "downs": "1025",
    "views": "469020",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "This climate  change is way overblown  when I was a kid in seventies there  was much more  pollution no one  talked  about  climate  change 🙄",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "The world population is growing and need more energy. Governments are all talk with no significant action, the result is clear, climate change is unstoppable.",
            "polarity": 0.128125,
            "subjectivity": 0.46458333333333335
        },
        {
            "body": "So what is it? Lots of climate lockdowns so the Billionaire class behind your publication can become even more obscenely rich while small businesses become even more impoverished? You would like that, wouldn't you, Economist?",
            "polarity": 0.145,
            "subjectivity": 0.5700000000000001
        },
        {
            "body": "one drastic measure could be people who are so concerned about climate change stop using toilet papers and do tree's a big favour.",
            "polarity": -0.016666666666666666,
            "subjectivity": 0.05
        },
        {
            "body": "Propaganda Newspaper!",
            "polarity": -0.125,
            "subjectivity": 0.1
        },
        {
            "body": "People will become more nocturnal to escape daytime heat",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Really believable when Joe hypocrite Biden flys fossil fuel burning jets and arrives in 85 fossil fuel burning cars at a fake conference about the extinction of mankind in 8 years.",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "You can't stop use coal, oil, gas and etc. - only what we can do is start control Earth population.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "I am more terrified of that guy's extremely high side burns than climate change.  😂😂",
            "polarity": 0.33,
            "subjectivity": 0.52
        },
        {
            "body": "Too many people in africa, asia, and india; and not enough fish in the ocean.",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Thus video is ,at least for now.... utter tosh.\n\n3 degrees of rising doesn't equate to a global apocalyptic scene.....",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "Top 20 polluted cities.  Fix that first.",
            "polarity": 0.375,
            "subjectivity": 0.41666666666666663
        },
        {
            "body": "The climate change already happened it's not a hoax but it's a total hoax the so called eco friendly technologies. They're totally not eco friendly but they will help bring down the economies of the world with covid and other things. For the NWO to achieve fake global peace which is the beginning of Armageddon",
            "polarity": -0.0038194444444444448,
            "subjectivity": 0.5204861111111111
        },
        {
            "body": "Will leaders ever understand unless human population is prevented from further increase temperature ,   pollution will keep increasing",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "Let the billionaires pay. Not ordinary citizens. Let blackrock and vanguard pay.",
            "polarity": 0.125,
            "subjectivity": 0.5
        },
        {
            "body": "A very nice fairy tale, however with no dragon!",
            "polarity": 0.9750000000000001,
            "subjectivity": 1.0
        },
        {
            "body": "Remember nothing is going to change, until we react.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Let us bring the heat back 🔥🔥🔥",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Buncha BS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "\"plane go crash\" - that's our future right there. Educate your children with survival/agriculture skills, become vegan but learn how to hunt in case it becomes necessary, study earlier periods of social unrest and figure out how to cope with riots and potential new fascist societies, develop mutual aid communities around you and do not broadcast your preparations on social media or to anyone except close family. Make your children promise you that they will do the same with their children, because the worst is still a few decades ahead.",
            "polarity": -0.06465958284140103,
            "subjectivity": 0.4521448248720976
        }
    ]
}