{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-04 16:11:54",
    "ups": "18134",
    "downs": "1482",
    "views": "691335",
    "top_comments": [
        {
            "comment": "I wonder if the ice age people all got together and fear mongering sessions like today?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "propaganda",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "comment": "🤣🤣🤣🤣🤣🤡🤡🤡🤡.\nThe temperature from last night was 4°D and now its 16°D. I didn't die.\nStop telling lies",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Estar nas mãos de uns velhos fdp é uma poha viu.\nEm um mundo de 3°C suicídio vai virar uma opção sim.\nNinguém merece sofrer calor/frio e fome extrema até a morte.\nSe esses idiotas não fizerem nada logo não quero nem saber o que pode acontecer daqui pra frente.\nE tudo por causa de dinheiro.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm left with more questions",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "It’s high time to safe our planet. Every PM of every country on the earth figure out the change of climate. They should take proper step to reduce the use of natural resources  such as fossil fuels, coal, CH4 etc. COP Convention should be much more active to reduce natural resources. We are really going to face natural calamities in future. From BANGLADESH ❤️",
            "polarity": 0.1387878787878788,
            "subjectivity": 0.38772727272727275
        },
        {
            "body": "scaremongers out again,",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This is the next climate communist propaganda.\nThe world is not heating 3°, not even 1°.\nBut he I wonder who will become the dictator in this global climate communism.\nWho will make people give up their cars, mobility, food, holiday's and way of life ???\nBecause of course it will no way be voluntary, it will be made by force.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.03333333333333333
        },
        {
            "body": "Look doom over there, and doom over here. Look more doom if half of the hot air was spent on the solutions instead of all the fear we might get somewhere.  It always boils down to the banks and the control over money.",
            "polarity": 0.06555555555555556,
            "subjectivity": 0.3811111111111111
        },
        {
            "body": "mankind has 2 choices..It either abandons capitalism like NOW...or dies.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Focusing on poor countries does nothing to change anything. Focus on the wealthier countries that are the main contributors instead",
            "polarity": -0.11666666666666668,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "Americans wanting to build a wall on our border do not understand that at the core of the crisis is climate change. You get these Trumpers in trucks driving around with their flags complaining about America being overrun and they can’t grasp that a wall won’t stop mass migration of desperate human beings. I chose not to have children bc I don’t want to bring any more humans on to this planet. I genuinely get angry when I see families have two three four five plus kids.",
            "polarity": -0.039999999999999994,
            "subjectivity": 0.62
        },
        {
            "body": "What a bunch of goverment funded bulshit",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Earth has warmed more like 2c over the 1750 basline per square meter some scientist said!?",
            "polarity": 0.625,
            "subjectivity": 0.5
        },
        {
            "body": "Is anyone going to talk about how this guy has whiskers?!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "thermogeddonites using non scientific words like could / might / rather than WILL / SHALL / SHOULD - BS - Oh tell me about the hockey stick again - tell me about the homogenisation of the temperature records that are then used rather than the physical original written records - tell me about the change in size of the stevenson screen temperature measuring box - tell me the difference in peak and min temps with digital and mercury thermometers - the earth has warmed from the days when the Thames used to freeze over - why was Greenland called that, but it is now covered in ice that is melting again",
            "polarity": 0.125,
            "subjectivity": 0.2976190476190476
        },
        {
            "body": "propaganda",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "May the force be with us",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Seguirán los DESASTRES NATURALES si no hay REFORESTACION de árboles nativos para que VUELVA el ciclo de vida.  Los árboles regulan la temperatura en la corteza TERRESTRE.  Resguardan las NAPAS SUBTERRÁNEAS.  Cómo tan poca visión? Ahora estamos parados en una bomba de tiempo.  Nuestra tierra está muy caliente.  PRIORIDAD para todos los países del mundo.  Juntos podemos.    NO  MAS DESFORESTACIÓN.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I wonder if the ice age people all got together and fear mongering sessions like today?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}