{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-01 22:16:24",
    "ups": "11135",
    "downs": "862",
    "views": "378981",
    "top_comments": [
        {
            "comment": "hmm Maby Mark ZukkenBorg and his Android inner core would face this book of the doom? Sunny bless to all ;D",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.125,
            "subjectivity": 0.5833333333333334
        },
        {
            "comment": "If there was a real problem, we would simply build an orbital sunshade instead of following this braindead global CO2-reduction agenda. Water conflicts can be totally negated by just using graphene filter based sea-water desalination. Existing technology (or existing concepts) can solve all these problems, but here we see a concentrated plan against the rational use of this science/education/technology.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.04,
            "subjectivity": 0.30142857142857143
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Paint every structural engineering feats white. My cat is white so something tells me he knew in advance what is to come. He has sort of sped up his own evolutionary process.",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "hmm Maby Mark ZukkenBorg and his Android inner core would face this book of the doom? Sunny bless to all ;D",
            "polarity": 0.125,
            "subjectivity": 0.5833333333333334
        },
        {
            "body": "Building seawalls just push the water to other areas. So big cities with a lot of wealth, that are in low lying areas build a massive seawall, then all the water that will have flooded that area has to go somewhere. It will go to other poorer cities or rural farmlands, that don't have money to build a city wall. Those people will face even more severe flooding. \n\nIt's too late to stop global warming. We need to find ways to adapt. Even if we stop all fossil fuels today. The planet will still probably warm to 3C or warmer.",
            "polarity": 0.05500000000000001,
            "subjectivity": 0.385
        },
        {
            "body": "When was the last time the media referred to \"man made climate change theory\"? The IPCC has not issued a consensus that all \"climate change\" is man made or that there is evidence of causation through \"carbon dioxide ppm\" compared to correlation because this cannot be proven. Temperature has been at least 2 degrees higher than today only a few thousand years ago...no cars, factories, coal power stations...just the Malinkovitch cycles. Stop believing the world is full of constants because its actually full of variables and this propaganda relies on us believing and not questioning whilst people like Al Gore make huge sums of money from the green con. There's 45 times more carbon in the ocean and as the sun heats it more is released to the atmosphere, when the sun is cooler then more is absorbed by the ocean which is why there is correlation with ice core data temp and carbon dioxide ppm and not causation.",
            "polarity": 0.16785714285714284,
            "subjectivity": 0.4904761904761905
        },
        {
            "body": "If there was a real problem, we would simply build an orbital sunshade instead of following this braindead global CO2-reduction agenda. Water conflicts can be totally negated by just using graphene filter based sea-water desalination. Existing technology (or existing concepts) can solve all these problems, but here we see a concentrated plan against the rational use of this science/education/technology.",
            "polarity": 0.04,
            "subjectivity": 0.30142857142857143
        },
        {
            "body": "Earth + Plastic -3 Billion people =Rise of the Insects",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hasn’t nobody noticed this guys sideburns or isit just me ? And why are they showing just the poorer counties like it won’t effect developed counties to 🤔",
            "polarity": 0.1,
            "subjectivity": 0.3
        },
        {
            "body": "Solution is so simple, don’t make more kids, specially if you cannot afford it, they will suffer climate change and poverty, kids didn’t asked for this, so better not have any …",
            "polarity": 0.3392857142857143,
            "subjectivity": 0.48214285714285715
        },
        {
            "body": "They can't  predict weather for 2 weeks in advance but can predict temperature in 10, 20 30 years.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "off topic - I understand being all manly and all but when you enter Wolverine blush situation , get the trimmer doc",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I predict that by the end of 2022 parts of the earth will start to freeze due to the amount of volcanic eruptions around the world at the moment, particularly if the current eruptions increase.",
            "polarity": 0.013888888888888886,
            "subjectivity": 0.36944444444444446
        },
        {
            "body": "A lot of the issues portrayed in this video appear to be linked to poverty. The prospect of climate change should encourage Western nations to fund developing nations' economic and industrial development.",
            "polarity": 0.1,
            "subjectivity": 0.1
        },
        {
            "body": "The Covid Fearmongers must be going back to their climate change fearmongering.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "People should stop run away from real problem,the real problem might not be CO² but deforestation of global rainforest which for millions 9f years if not billions those trees have been there to clear the air and gives fresh air and recycling the rain. \nWhy no one is pin pointing the catastrophic destruction of natural trees and forest all over the world. Congo, Amazon, Indonesia, Europe,U.S,China and India?\nThe media are selling the government officials story but the problem is deforestation and you will thank me later. CO² is heavy to stay where even normal O² which lighter than CO² is not enough to sustain a person for a day.",
            "polarity": 0.08499999999999999,
            "subjectivity": 0.35333333333333333
        },
        {
            "body": "Want drastic measures?  Reduce the world's population by about 50%  But since no scientist would dare propose that even though logical thinking would say that fewer people will require fewer resources to provide food and shelter and other needs, let's start the endless dance of stating we need to transition to solar and wind, which is helpful but is ignoring easier and quicker solutions like nuclear.  Plus costs and materials for building the solar panels and wind turbines aren't as readily available for such a large undertaking.",
            "polarity": 0.10238095238095239,
            "subjectivity": 0.45059523809523805
        },
        {
            "body": "We know already all that stuff, the only thing that can change the situation is a STRONG POLITICAL DECISION. It will never happen cause governments are so frail about the economical consequences. Lobbies are pulling out the threads and the 1% and bankers are impatient for the 3c* increase to make more MONEY!",
            "polarity": 0.19305555555555554,
            "subjectivity": 0.6888888888888888
        },
        {
            "body": "And tonight that lot in Glasgow are having a slap up meal in a 5 star hotel, no doubt at tax payers expense....",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Monumental scam. The earth is cooling.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Would be, but never will be. \nAll we will get at the end of the century 2100 is 0.5 Degrees C more than todays average.",
            "polarity": 0.175,
            "subjectivity": 0.44999999999999996
        },
        {
            "body": "See what 3 degrees of global warming looks like? Unless the Economist have a time machine they don't know because this is just computer graphics. Much like the climate models, CGI is not evidence.",
            "polarity": 0.1,
            "subjectivity": 0.1
        }
    ]
}