{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-05 08:40:42",
    "ups": "18989",
    "downs": "1597",
    "views": "736876",
    "top_comments": [
        {
            "comment": "Modern man is not the man who goes off to discover himself, his secrets, and his hidden truth; he is a man who tries to invest himself in something beneficial for the future.",
            "likes": 15,
            "number_of_replies": 12,
            "polarity": -0.016666666666666663,
            "subjectivity": 0.2895833333333333
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "soooo my house will be closer to the beach while New York City will be washed away, I see no problem with this",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "As if governments can decide or rule anything in the era of global corporatocracy. Acceptable rate of profit-  this is what rules the world. Capitalists will never give up on what's theirs. So we are  in a supermassive black hole.",
            "polarity": -0.08333333333333333,
            "subjectivity": 0.21666666666666667
        },
        {
            "body": "what people dont understand is they dont have a brain !!!!!!\nmost scientists agree that global warming was invented to stop people eating cows and meat !!!!!\nso people need to get a brian moving forward !!!!!",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "'The heat during the day is unbearable' Maybe removing your full body clothing would help a bit",
            "polarity": 0.35,
            "subjectivity": 0.55
        },
        {
            "body": "Cold and Famine is the future",
            "polarity": -0.3,
            "subjectivity": 0.5625
        },
        {
            "body": "There is no global warming in  fact we are in a grand solar minimum with cooler temperatures being recorded worldwide",
            "polarity": 0.25,
            "subjectivity": 0.5
        },
        {
            "body": "Weather connected to humanity more than we know already from climate change some magic music of the ...  kinda way",
            "polarity": 0.5,
            "subjectivity": 0.75
        },
        {
            "body": "Modern man is not the man who goes off to discover himself, his secrets, and his hidden truth; he is a man who tries to invest himself in something beneficial for the future.",
            "polarity": -0.016666666666666663,
            "subjectivity": 0.2895833333333333
        },
        {
            "body": "I live in Australia & our Summers are getting drier & nastier. The last bushfires were horrific & unprecedented. The problem with the human race is we are controlled by the selfish, wealthy & powerful who only care about themselves & the now. It’s always the next generations problem to solve. Self interest is always paramount. This is getting desperate & becoming more real for most because now it’s your recently born children who will suffer the consequences of our inaction. I watch these videos & it just breaks my heart. What are we leaving behind for our children?",
            "polarity": 0.04037433155080214,
            "subjectivity": 0.6274509803921569
        },
        {
            "body": "You know Climate Change is taken seriously by the Left when they call for zero population growth and a halt to mass immigration into developed countries.",
            "polarity": -0.07777777777777777,
            "subjectivity": 0.3222222222222222
        },
        {
            "body": "I see it from the lack of snow in my area and I'm 60yrs old...",
            "polarity": 0.1,
            "subjectivity": 0.2
        },
        {
            "body": "I don't know what is worse: That not enough is being done to fight Global warming, or that guy's beard.",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "I do believe global warming comes about with what  we do in our countries. Thus all countries must try to prevent it by following guidelines set by experts. The effort is made by individual countries but the effect would be global ultimately.",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "No such thing as global warming, climate change, or what ever you'd like to call it - I call it BS - waste of video.",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "They never EVER talk about what the Solutions are, because they know these scary stuff makes clicks. Never even a mention of a Resource Based Economy. Very sad that we're stuck at this stage.",
            "polarity": -0.575,
            "subjectivity": 1.0
        },
        {
            "body": "china is the #1 country for burning coal, get them to stop first",
            "polarity": 0.25,
            "subjectivity": 0.3333333333333333
        }
    ]
}