{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 13:18:30",
    "ups": "5732",
    "downs": "441",
    "views": "166500",
    "top_comments": [
        {
            "comment": "This is IPCC dogma garbitch. Wen you count back 1 year nothing is correct.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Egypt was once lush and green,  however thousand of years ago climate change destroyed that and turned it into a dessert.  The Bible mentions a great flood that destroyed civilization thousands of years ago...I assume that too was caused by climate change ...flood stories are common amongst coastal civilizations...cities can be found 30 feet under the Oceans...I guess that too was climate change...unfortunately for man this climate change thing has been destroying life for a long time.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.025000000000000012,
            "subjectivity": 0.375
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The sad part is, we, as people may have an impact on climate change, but it’s the biggest companies and industries that are polluting our planet. Not the people itself.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "What alarmism looks like! They don't know",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "7:59 I feel like you twisted almost the whole documentary to climate change. Yes I believe global warming, I don’t understand why it’s so difficult to get a real science simulation of exactly how it will affect us. You just add some somber music and twist some interviews, call it a day.",
            "polarity": -0.05000000000000001,
            "subjectivity": 0.42142857142857143
        },
        {
            "body": "0:40  ---  I feel ashamed of admitting this but if I am honest I do hate some of the babies I pass in the street, in fact, usually their parents too.",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.6833333333333332
        },
        {
            "body": "Except the planet ISNT GOING TO WARM IS IT.\nIts going to freeze great swarths of the Northern Hemisphere in the very near future",
            "polarity": 0.38249999999999995,
            "subjectivity": 0.49875
        },
        {
            "body": "Somewhere between 2.5 degrees and 3 degrees it will become impossible to grow grains at scale. Billions will die, society will collapse, and the world will look like a Mad Max film.",
            "polarity": -0.6458333333333333,
            "subjectivity": 1.0
        },
        {
            "body": "Egypt was once lush and green,  however thousand of years ago climate change destroyed that and turned it into a dessert.  The Bible mentions a great flood that destroyed civilization thousands of years ago...I assume that too was caused by climate change ...flood stories are common amongst coastal civilizations...cities can be found 30 feet under the Oceans...I guess that too was climate change...unfortunately for man this climate change thing has been destroying life for a long time.",
            "polarity": 0.025000000000000012,
            "subjectivity": 0.375
        },
        {
            "body": "Climate change is going to be a challenge, but this is just too alarmist. For example, the comparison is made between getting on a plane with a 1 in 20 chance of crashing, and going forward with a 1 in 20 chance of temperatures rising an average of 3C. THIS IS A FALSE ANALOGY. The global population will be far better equipped to deal with a 3C rise over 80 years than 300 passengers in a 5 second airline crash.\n\nAnd then there are the interviews with a random selection of poor people who try to deal with environmental challenges that millions have done before them. \n\nPoor form, Economist!",
            "polarity": -0.15000000000000002,
            "subjectivity": 0.4666666666666667
        },
        {
            "body": "To be fair, what would 3 degrees of cooling look like",
            "polarity": 0.7,
            "subjectivity": 0.9
        },
        {
            "body": "You always show the shitholes on the global south who are suffering of the global warming, but it's not important because they will suffer anyway with or without global warming. Why you do not tell the advantages of the global warming - espessially in Canada and Russia? Siberia will become green and warm - that is excellent news! Just imagine the large plains of Siberia and Canada wich become new agroculture heaven.",
            "polarity": 0.15506493506493504,
            "subjectivity": 0.37831168831168827
        },
        {
            "body": "This whole video is tosh, there is no climate science instead there is climate politicalisation where climate data is manipulated, hidden, cherry picked and misinterpreted all to give the answer the politicians want. Where is the critical peer reviews of IPCC assumptions and outcomes, there is none, that is hardly science, so go ahead and assume all the above it wont happen and it isn't happening today.",
            "polarity": -0.05166666666666666,
            "subjectivity": 0.43500000000000005
        },
        {
            "body": "This is IPCC dogma garbitch. Wen you count back 1 year nothing is correct.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Go and tell the Chinese. It makes not a jot of difference what Britain does.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Northern countries, who happen to have benefited the most from the industrial revolution, haven't really felt the effects of climate change. So they don't care. And they generally dislike liberal immigration policies.",
            "polarity": 0.25,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "It's Look like BLADE RUNNER 2049 IS A DOCUMENTARY!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The future generations will pay for our ignorance.\nWe only care about what happens now. \nThat is the human response to anything that threatens the future.",
            "polarity": 0.0,
            "subjectivity": 0.3375
        },
        {
            "body": "David bellamy not seen on mainstream media, with his unfashionable views on climate change",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's gonna be 2.5°C at least.\nBut 3.0°C are very well possible.\nThat means the world needs to prepare.\n\nIn addition to CO2 reduction we also need to prepare to remove gigantic amounts of CO2 from the atmosphere once we have a surplus of solar energy available or even have nuclear fusion power.\n\nFor example around old, empty oil wells we could build huge solar power plants and use that energy right there to pump CO2 in those empty oil wells.",
            "polarity": 0.09841269841269844,
            "subjectivity": 0.5261904761904762
        },
        {
            "body": "Where are we going as humanity…???  Have you asked yourself that??? Have you guys debated that with your friends and relatives??? Are you talking about that with your sons and daughters??? Put some conscious work on the matter…👍",
            "polarity": 0.1,
            "subjectivity": 0.5
        }
    ]
}