{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-05 21:02:44",
    "ups": "19450",
    "downs": "1635",
    "views": "761651",
    "top_comments": [
        {
            "comment": "The last time the planet was 3C warmer, 2.5 million years ago, was it a big catastrophic disaster?",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.08333333333333334
        },
        {
            "comment": "Global warming is caused by the Sun not by humans!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "To change the climate on Earth, it is necessary to make a series of nuclear explosions on the territory of the Russian Federation in cities such as Moscow, Perm, Krasnoyarsk, Novosibirsk, Irkutsk!\nThen the climate on Earth will change in a positive direction, since it is from this territory that intensive pollution of the climate occurs throughout the Earth, which threatens humanity with extinction!\nOnly 5 nuclear strikes on these industrial cities that pose a threat to humanity and the problem will not exist!",
            "polarity": 0.05681818181818181,
            "subjectivity": 0.6090909090909091
        },
        {
            "body": "Does winter or summer stops from coming depending on Earth creatures activities? The same is with the entering season of Earth! Wether there is a change of policy, wether Greta appears in TV or not, soon no one will even care what a child has to say about something she doesn't understand not nearly as fully as her parents had made he believe. It has not even enter the mind of scientists or clever roles the things that are already happening! Enjoy while you came for very soon there will be no enjoyment!",
            "polarity": 0.16166666666666668,
            "subjectivity": 0.43166666666666664
        },
        {
            "body": "Fósil fuels AND OTHER ENERGY SOURCES will be cut out, ALONG with a change of climate as a change EARTH SEASON! NOT ONLY a cause of men's activities! Infinate growth on FINITE PLANET has never been a possibility. Get ready for things on Earth are about to get REAL!",
            "polarity": 0.0734375,
            "subjectivity": 0.54375
        },
        {
            "body": "Its a really serious topic i know, but can we talk about this guys beards?!",
            "polarity": -0.41666666666666663,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "If you care about climate change and blobal warming you should be 100% pro nuclear energy, otherwise you don't really care about the enviroment.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Save the world",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "this neds more views. So, 1 more like and 1 more comment for this =)!",
            "polarity": 0.53125,
            "subjectivity": 0.625
        },
        {
            "body": "Heat is released from air conditioning too. It’s a catch 22 . I’m just thinking out loud.",
            "polarity": 0.1,
            "subjectivity": 0.8
        },
        {
            "body": "Climate change, how did global warming morph to climate  change? \n\nShall we check numbers? \nChoose any search engine, yahoo, bing or G\nSearch for, ( earth atmosphere content , pie chrt) choose any 3 results, it will be Nitrogen 72%, Oxygen 16%, Argon 1%, is co2 missing?  CO2 an be found in trace gas section,  CO2 content is 0.048%\nThis trace gas is responsible for all life and all food chains on earth. Responsible for  all meats,  grains and fruits we eat. \nGlobal warming today is a trillion  $ industry.\nAll leaders have to fly first class to the first world, meet at a 7 star resort and sign a treaty and drink wine and whiskey, it only costs tax payers a few million $\nTrace gas CO2 (0.048%) can have trace effects on earth atmosphere",
            "polarity": 0.13,
            "subjectivity": 0.3816666666666667
        },
        {
            "body": "The desperate far outnumber the privileged. Remember this when the food and water become scarce.",
            "polarity": -0.25,
            "subjectivity": 1.0
        },
        {
            "body": "One day these people are not going to take it anymore and they are going to be very, VERY angry.",
            "polarity": -0.65,
            "subjectivity": 1.0
        }
    ]
}