{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-04 12:04:44",
    "ups": "17807",
    "downs": "1481",
    "views": "679274",
    "top_comments": [
        {
            "comment": "Countries should make laws on one child policy like couples with more than one child have to pay more taxes",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.5,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "🤣🤣🤣🤣🤣🤡🤡🤡🤡.\nThe temperature from last night was 4°D and now its 16°D. I didn't die.\nStop telling lies",
            "polarity": 0.0,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "The final day is coming",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "Its okay, just end this world already",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "As if we have not enough panic . \nJust take water comming from rising sea levels and put it into dessert, how hard can it be?",
            "polarity": -0.14583333333333334,
            "subjectivity": 0.5208333333333333
        },
        {
            "body": "Думали на ваш век хватит? А вот не хватило!!!!!!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Переведите на русский!!! Умоляю!!! Люди в России не понимают, что происходит, они политизированы режимом и считают запад извращенцами и идиотами!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "There are much more grave environmental problems like shrinking wildlife habitats and over fishing, but somehow CO2 is a hype. I guess nobody's invented how to get incentive from \"solving\" these problems (yet).",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "The Joseph Poore, Oxford study of 40,000 farms worldwide confirms what is logically known into more detail than just the perception.\n\nThat 83% of all farmland is for animal farming, and all that wasted land provides just 18% of the food calories humans consume.\n\nIt is not just climate this wasted usage causes, animal farming land use is contributing more than the direct emissions alone by all that land with minuscule vegetation to what would be there without it soaking up more Co2 than right now.\n\nSo animal farming, in particular, is the leading cause of deforestation, species loss, and ocean dead zones.",
            "polarity": 0.17023809523809524,
            "subjectivity": 0.3419047619047619
        },
        {
            "body": "💩💩💩💩💩💩💩💩💩💩💩💩",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All I see is people blaming each other and zero solutions to your made up problems.",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "I see a lot of people blaming the “West” here in the comments, wow you people really do live in the basement. China pumps out more pollution in an hour then a years worth in the US. They have pollution alerts, hello is anybody home, Mcfly.",
            "polarity": 0.2590909090909091,
            "subjectivity": 0.525
        },
        {
            "body": "Well - I think the answer is pretty obvious: drink beer and watch football. Like always.",
            "polarity": 0.125,
            "subjectivity": 0.75
        },
        {
            "body": "First-World Countries should do their best in reducing their carbon emission, because we all know that they have the WORST carbon emissions . If these countries could reached the net zero, as soon as possible, I think that can make a change.",
            "polarity": 0.0,
            "subjectivity": 0.575
        },
        {
            "body": "Why only 3 degrees higher? Why not 5 - 8 degrees. The later was the reality of the 'Paleocene-Eocene' Thermal Maximum' period that began around 56 million years ago.  Like the period before it there was no icecaps but with even higher temperatures and CO2 levels. Did the world shrivel up under the blistering heat? No, the fossil record shows it was covered in tropical rain forest and supported the development of early mammals including our primate ancestors. So instead of images of parched desserts, imagine sitting on the treetops looking out over a luxuriant green canopy or bathing in the warm waters of the arctic circle. If there ever was a 'Garden of Eden' that led to the eventual establishment of man this was it.  If you are still not convinced you only have to go back to the warmer periods in the Roman and Medieval times. The later witnessed Southern England with a climate akin to the Loire valley today and Greenland being more habitable than present (encouraging a brief Viking settlement). Let us not also forget the remains of vast forests that lie under Northern Tundra revealing a time of warmer weather that made more of the world more habitable.",
            "polarity": 0.1388888888888889,
            "subjectivity": 0.39074074074074067
        },
        {
            "body": "See James Hanson's solutions on his 'You Tube' talks.  One, have a carbon fee to be directly paid back to the general public.  Two, get the US and China to cooperate on this and on developing technologies to overcome these dangers so drawing in others.  I'd hope IF that could nbe set up the EU will join.  That will mean perhaps all the major economoes joining that must draw in the rest.  This is an excellent video but I suggest in future any such video includes James Hanson.   Before we lose him.",
            "polarity": 0.1,
            "subjectivity": 0.4199074074074074
        },
        {
            "body": "My house nearly burnt down in Australia 2019/2020 .  The area I live is usually lush rainforests but lack of rain turned it into a tinder box. The effects are already being felt.",
            "polarity": 0.045202020202020195,
            "subjectivity": 0.37222222222222223
        },
        {
            "body": "what we to stop the climate change how will we stop end of the world",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thanks to modern science",
            "polarity": 0.2,
            "subjectivity": 0.25
        },
        {
            "body": "Countries should make laws on one child policy like couples with more than one child have to pay more taxes",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Unfortunately climate change is still closed in talks, conference or videos instead of taking fast and real steps to overcome it by spreading awareness and resources in all over the world. Otherwise, climate change is the enemy, who produced by ourselves, will be never defeated.",
            "polarity": -0.04999999999999999,
            "subjectivity": 0.5
        }
    ]
}