{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-02 18:52:27",
    "ups": "13930",
    "downs": "1072",
    "views": "493202",
    "top_comments": [
        {
            "comment": "What uncited propaganda looks like",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "comment": "Thanks for this film, which I watch shivering in England, a country that is unbearably cold for most of the year. It's a pity we can't share out the heat more.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1,
            "subjectivity": 0.48
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Dangerous wet-bulb temperatures by the end of the century?!? Please refer to June of 2021, parts of Canada at 122 degrees F.",
            "polarity": -0.75,
            "subjectivity": 0.9
        },
        {
            "body": "Thanks for this film, which I watch shivering in England, a country that is unbearably cold for most of the year. It's a pity we can't share out the heat more.",
            "polarity": 0.1,
            "subjectivity": 0.48
        },
        {
            "body": "So disturbing",
            "polarity": -0.5,
            "subjectivity": 0.8
        },
        {
            "body": "Geoengineering is causing climate change !!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The biggest problem facing the World, is the one that isn't mentioned anywhere in the whole film. It's people, or rather, too many people. The finite wealth of the Earth is being used up in increasing amounts as populations grow unchecked. Land which is essential for producing food, is being swallowed up by more people wanting places to live in. Cities are moving out into more and more areas, leaving fewer food producing areas. As a species, we cannot go on breeding uncontrollably for ever. There has to be a point where population control has to be a factor in continuing to maintain the status quo..There is a tipping point, fast approaching, where the planet will be overwhelmed by horde's using up diminishing assets, essential to existence and we will no longer have a World in which we can survive. I wonder what will move into the new environment and be successful? The World will still be here, only not for us",
            "polarity": 0.26328671328671327,
            "subjectivity": 0.5003496503496504
        },
        {
            "body": "This is the near future. This is inevitable.",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.5083333333333333
        },
        {
            "body": "Sorry to break it to ya, but currently we have excess 120ppm of CO2 in atmosphere - and accelerating in wrong direction. And even ZERO emissions (not 'net zero' - JUST ZERO) emissions by miracle from tomorrow onward DON'T change a thing.  With zero emissions and 0,3ppm sequestered naturally - planet will continue to warm up even with ZERO emissions for decades to come.  Don't forget also that there's humongous amount of both CO2 and HEAT ( 1.5 degreee since 1890s ) sequestered in the oceans.",
            "polarity": -0.05000000000000001,
            "subjectivity": 0.5499999999999999
        },
        {
            "body": "Travel the world and see for yourself. This is pure propagana. Not my problem how they live in Bangladesh.",
            "polarity": 0.17532467532467533,
            "subjectivity": 0.5
        },
        {
            "body": "According to the graph at 0:29 nothing was wrong till the 1930s.",
            "polarity": -0.5,
            "subjectivity": 0.9
        },
        {
            "body": "As long as everyone will thinks that it doesnt concern him, our world will collapse. Exactly, Goverments are guilty of using fossil fuels by thereby ignoring carbon dioxide emissions but not only emissions increase global temperature. People often forget that they themselves pollute by throwing garbage into the sea or on land:(",
            "polarity": -0.17500000000000002,
            "subjectivity": 0.6083333333333333
        },
        {
            "body": "Politicians/Cop out26 wont remedy climate change. All they are are blah blah, hot air, photo ops and posturing.  They wont deliver on their commitments.",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "I’m fascinated by the historic climate change in Europe since the Mesolithic period .it seems more critical now that we are no longer able to move in response .",
            "polarity": 0.25,
            "subjectivity": 0.48125
        },
        {
            "body": "I feel blessed rn.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Weather disaster-related deaths are down....",
            "polarity": -0.15555555555555559,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "What uncited propaganda looks like",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "we are currently at 1.24 degree celcius",
            "polarity": 0.0,
            "subjectivity": 0.4
        },
        {
            "body": "All weather is manipulated by the same governments that pretend to get together and care about this planet. \n\nWhy is it they never sacrifice their palaces or millions spent on political buildings. Or their $14 glasses of orange  juice. We were told plastics would save the planet by these same governments. Then they neglected to build the necessary infrastructure to process all our recyclables. \n\nNow we are told that green energy and electric cars will save us. A complete scam to enrich the rich and make life more difficult for the poor. Things will never get better until you lemmings realize you are lied to every day of your life.",
            "polarity": 0.022916666666666658,
            "subjectivity": 0.4583333333333333
        },
        {
            "body": "No one knows that for sure.",
            "polarity": 0.5,
            "subjectivity": 0.8888888888888888
        },
        {
            "body": "Imagine still thinking that humans have any meaningful impact on worldwide temperatures. 50 years of scaremongering lies not enough for you?\n\nSome people sure like being played by the psychopathic elite.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.6296296296296297
        },
        {
            "body": "Maybe if they had not of been crying wolf for the last 50+ years people would care",
            "polarity": -0.1,
            "subjectivity": 0.3333333333333333
        }
    ]
}