{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-01 14:01:45",
    "ups": "9982",
    "downs": "801",
    "views": "332582",
    "top_comments": [
        {
            "comment": "Global warming alarmism LOL",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.4,
            "subjectivity": 0.35
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I have to pose this question, and before you tear me apart please do your research. In our geological history we have seen the Earth warm to up to 8 degrees higher than today, during the Paleocene-Eocene Thermal Maximum, where the world was much hotter and had much more carbon in the air. While we saw sea life diminish during this time, we also saw the rise of animals like Titanaboa (largest snake ever), this era was much hotter but life on land looked more like Florida with rainforests all over the world including Antarctica. Our world will always change but 3 degrees difference will NOT be an armageddon scenario!",
            "polarity": 0.3958333333333333,
            "subjectivity": 0.4166666666666667
        },
        {
            "body": "What about in the u.s\nIn the past 10 years... does it still snow where it should ?  \n\nOr it is no more..?  What are the changes that was severely significant?  In the Past 10 years?   Gotta be a lot... but... \n\nSeems like... it has not reached the u.s yet i guess... for now... it'll effect... other countries... yep....",
            "polarity": -0.1,
            "subjectivity": 0.45
        },
        {
            "body": "The scary thing is that the original target was 2°C but that is now impossible. The 2 degree world was to maintain our current civilization. Staying below 3 degrees is about survival.",
            "polarity": -0.19791666666666666,
            "subjectivity": 0.7875
        },
        {
            "body": "Total f_cking propaganda.",
            "polarity": -0.05,
            "subjectivity": 0.425
        },
        {
            "body": "Cool can't wait",
            "polarity": 0.35,
            "subjectivity": 0.65
        },
        {
            "body": "Wow, please don't tell me people believe this.  Mideval times was warmer than what you're suggesting. This is so cherry picked on info it makes my brain hurt. If truth is a steak, this is a rice patty 😋",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "Only one way to conquor human-caused degradation to the environment: a free market that allows a healthy profit motive as incentive.  Period.",
            "polarity": 0.3,
            "subjectivity": 0.7666666666666666
        },
        {
            "body": "If you really care, walk rather than ride, turn the heat down and the air conditioning off.  But you're not going to do that.   And politicians could park the planes and go virtual, and they're not going to do that.",
            "polarity": 0.022222222222222213,
            "subjectivity": 0.24444444444444446
        },
        {
            "body": "Why arent franchise buildings and just business building\"shopping centers\" using solar panels yet? Most of the power consumed in americia is consumed by these public and private businesses not the houses, yet people are only selling to house owners to put them in even more debt if America can send stimulus checks to people why cant they send stim checks to help people change there car for a electric car and only electric cars",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.5736111111111111
        },
        {
            "body": "Quite amazing how we make this all about \"us\", isn´t it? Like we own this planet and we should control it. Quite sad if you ask me.",
            "polarity": 0.2333333333333334,
            "subjectivity": 0.9666666666666667
        },
        {
            "body": "I had hoped that this might have delved into some climate modelling and some comparisons of what the world was like in the past when the global temp was 3deg warmer than it is now.\nInstead it is pretty much propaganda, with ifs and maybes and the obligatory tug on the heart strings.\nIt is remarkable that so many of these warning clips seem to make the assumption that somehow the Earth is currently in the perfect state, and any movement of temperature is going to be catastrophic. We certainly can't deny that the climate is changing, but the alarmism has always been more about politics and profit than anything else.",
            "polarity": 0.2864285714285714,
            "subjectivity": 0.5071428571428571
        },
        {
            "body": "Global warming alarmism LOL",
            "polarity": 0.4,
            "subjectivity": 0.35
        },
        {
            "body": "Wake up! It’s just 1 problem  population nothing else but never gets mentioned.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just want to stop watching these videos. Can't bear more anxiety. \nI know this planet is messed up, and I'm already doing what I can.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "We have no climate crisis at all...only in self serving agenda of the corrupt UN.",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Lol west rely China on production. And China refused the climate change plan looool",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "I wish for Natural Revolution",
            "polarity": 0.1,
            "subjectivity": 0.4
        },
        {
            "body": "I just hope it doesnt catch us off gaurd in a short span, just like covid did!",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "In tropical countries temperature stay the same all the year.",
            "polarity": 0.0,
            "subjectivity": 0.125
        }
    ]
}