{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-01 05:47:18",
    "ups": "8869",
    "downs": "708",
    "views": "291445",
    "top_comments": [
        {
            "comment": "I suffer just thinking about it as I like the winter.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "If you're young, it's to bad, live with it. I'm not changing any of my habits to reduce emissions.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.1545454545454545,
            "subjectivity": 0.5222222222222223
        },
        {
            "comment": "Absolutely! USA needs to change the way we do business, but it is a process. China will surge ahead while we cut back bc we don't want to use gas and oil. We will pay China for our goods.\n\nChina (30%) ...\r\nUnited States (15%) ...\r\nIndia (7%) ...\r\nRussia (5%) ...\r\nJapan (4%)\n\nSaudi Arabia — 19.39 per capita.\r\nCanada — 16.85 per capita.\r\nUnited States — 15.74 per capita.\r\nGermany — 9.7 per capita.\r\nChina — 7.72 per capita.\n\r\n \nThe information is readily available by google. The USA economy is getting much worse. Paying people to stay at home was the start.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0625,
            "subjectivity": 0.475
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "It's not just about fossil fuels. Will we stop flying? Stop getting our goods through container shipping? Stop making use of the Internet and the heat all those servers and our computers produce, not to mention the power required? Stop using cars (although they may be electric, all that power has to be generated)? Stop buying new products we don't really need? We have created a monster and there's no turning back now.",
            "polarity": 0.11212121212121212,
            "subjectivity": 0.21818181818181817
        },
        {
            "body": "Anthropogenic climate change is a cult. But people should be free to exercise their religion freedom. Peace.",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "I'm curious if anyone has said exactly what is required to stop and reduce this.  With the current population and the exponential growth I see either a bigger divide between rich and poor or a necessary drastic dying off of population.  Everyone complains about fossil fuel use but fail to mention that current renewable energy is completely incapable of replacing it.  On top of that you have the vast majority of climate activists telling other people to stop but they are unwilling to change their behaviors.",
            "polarity": 0.007692307692307691,
            "subjectivity": 0.5750000000000001
        },
        {
            "body": "We are pathetic creatures",
            "polarity": -1.0,
            "subjectivity": 1.0
        },
        {
            "body": "how to compare 3 degrees global warming and a plane crash ? seriously",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Absolutely! USA needs to change the way we do business, but it is a process. China will surge ahead while we cut back bc we don't want to use gas and oil. We will pay China for our goods.\n\nChina (30%) ...\r\nUnited States (15%) ...\r\nIndia (7%) ...\r\nRussia (5%) ...\r\nJapan (4%)\n\nSaudi Arabia — 19.39 per capita.\r\nCanada — 16.85 per capita.\r\nUnited States — 15.74 per capita.\r\nGermany — 9.7 per capita.\r\nChina — 7.72 per capita.\n\r\n \nThe information is readily available by google. The USA economy is getting much worse. Paying people to stay at home was the start.",
            "polarity": 0.0625,
            "subjectivity": 0.475
        },
        {
            "body": "Oh, and all you doomsayers if you want to save the planet when it comes up vote for nuclear power because the \" renewables \" aren't the super clean alternatives you think they are  !",
            "polarity": 0.39583333333333337,
            "subjectivity": 0.6833333333333333
        },
        {
            "body": "The propaganda never ceases",
            "polarity": -0.1,
            "subjectivity": 0.1
        },
        {
            "body": "I suffer just thinking about it as I like the winter.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We need to force our leaders to tackle this problem head on as a top priority.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Global warming is not because of burning fossil fuels. It's because the poor and extreme poor are breeding like rats. If the governments do nothing to stop it, there will be no chance to stop global warming.",
            "polarity": -0.185,
            "subjectivity": 0.44000000000000006
        },
        {
            "body": "If you're young, it's to bad, live with it. I'm not changing any of my habits to reduce emissions.",
            "polarity": -0.1545454545454545,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "Then why would all our leaders take their jets to the summit? Talk about tone deaf!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just all  speculation,  unproven  , not testable,   cannot be demonstrated.    The Planet Earth  has \"Weather\"  not  \"Climate\" .   Climate is limited to regional  weather patterns that are persistent for a long period of time.   But the Planet does not have a \"Climate\".     Something like the Sahara Desert in Northern Africa is a Climate,  but the Earth  itself does not have in the singular tense a \"Climate\"   or  \"Climate Change\".    It is bad Science.",
            "polarity": -0.28869047619047616,
            "subjectivity": 0.4273809523809524
        },
        {
            "body": "China produces more c02 pa than all of europe and the US combined.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "It's sad to see that world leaders don't do anything about global warming. Its also sad to see that these people are already suffering and governments don't care at all.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "There is no science here. I'm surprised they don't blame COVID on climate change. All they do is use their black box \"models\" to fulfill their confirmation bias. They never actually explain the science behind their projection. It's all about \"97% of scientists agree\", or \"change in temperature MUST be bad\".  Having studied mathematics and theoretical physics climate change comes across as more propaganda than science.",
            "polarity": -0.09583333333333331,
            "subjectivity": 0.43750000000000006
        }
    ]
}