{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-03 07:14:19",
    "ups": "15316",
    "downs": "1248",
    "views": "566877",
    "top_comments": [
        {
            "comment": "3-deg increase is a certainty because failed governments, the corrupt fools that run them and the people who live lavish carbon footprint heavy lifestyles. It's already set in stone. Just need to wait and suffer.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.26590909090909093,
            "subjectivity": 0.575
        },
        {
            "comment": "I live in Scotland and i can already see the impact of Climate change. We've had 2 days of sunshine this year.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I feel really scared and helpless.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "This global warming religion is making us all priest and nuns, LOL!",
            "polarity": 0.5,
            "subjectivity": 0.35
        },
        {
            "body": "Anthropogenic global warming is the greatest pseudoscientific hoax ever perpetrated.\n/Lonewolf Liberties",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "2C is likely just after 2030... an actual tipping point.",
            "polarity": 0.0,
            "subjectivity": 0.55
        },
        {
            "body": "+3°C of warmer global temperature is nothing!\nA nuclear winter can easily bring down global temperature by 50°C. Even Sahara desert freezes over.",
            "polarity": 0.06944444444444445,
            "subjectivity": 0.28055555555555556
        },
        {
            "body": "You totally failed the message. It seems an oxfarm raising money video. You just focused on showing poor people in poor countries. Sad to say, in the rich world none is really interested about central America Fiji and Philippines. If you want be effective and supportive you have to smash the problem to the face of the western people. Show them their money invested on villas near by the sea are wasted. Show their houses  in London flooded to death, or Paris shopping while cooked. Show them California silicon Valley a desert and LA flooded. Show them their rich houses and wealthy life in NY destroyed, in the cold storms. Show them the Mediterranean Europe destroyed by the new typhoons in the Mediterranean Sea. Only then you'll be effective.\nThis is not a problem of greedy old generations, but also new millennial kids generating their richness by e-commerce, by buying over the super polluter Internet.\nBut at the end you are the Economist another riches owned magazine who just need to make profit not scoops nor showing the reality. Sad very sad",
            "polarity": 0.011133069828722,
            "subjectivity": 0.6315546772068511
        },
        {
            "body": "Just adjust the thermostat",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That guy at 5:12 looks like a james bond villian that will artificially raise the temps to end the world.",
            "polarity": -0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Unfortunately, Poor countries will get hit really bad by climate change.",
            "polarity": -0.5499999999999999,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "Just another scaremongering propaganda based on guesses with no solid evidence. Why no one see the real problem? The world\"s overpopulation. Should I stay cold in winter time to save a fisherman\"s life in BanglaDesh?",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "I live in Scotland and i can already see the impact of Climate change. We've had 2 days of sunshine this year.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "Yay",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Please send this all picture to China and India and see their reaction. They don’t give a f*** on it. Even when everyone on this Planet have the same climate rules, maybe then it will be working to degrade the temperature",
            "polarity": 0.0,
            "subjectivity": 0.125
        },
        {
            "body": "Hopefully we can get our act together",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🙏🏻🙏🏻",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "🥲",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "3-deg increase is a certainty because failed governments, the corrupt fools that run them and the people who live lavish carbon footprint heavy lifestyles. It's already set in stone. Just need to wait and suffer.",
            "polarity": -0.26590909090909093,
            "subjectivity": 0.575
        },
        {
            "body": "BS",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "It's sad to know that people in the third world country who have the smallest carbon foot print suffered the most because of the people in the first world country's lifestyle of abundance. And yet they tweet about going green and saving the planet from global warming as they fly around the globe in polluting airplanes, drive their electric cars that destroy natural resources to make. I include myself in this group. We are hypocrites. If we want to save the planet, how about living in dirt floor tiny huts with no electricity and wifi, and all the nice convenient amenities that we expect to have. Can you do that? Can I do that? I doubt it.",
            "polarity": 0.12272727272727274,
            "subjectivity": 0.4484848484848485
        }
    ]
}