{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-01 18:09:05",
    "ups": "10527",
    "downs": "806",
    "views": "354968",
    "top_comments": [
        {
            "comment": "Climate related deaths are at their lowest point in history, also fossil fuels make farming more efficient which means more forest can be conserved, oh and fossil fuels are the most economical way to transport food, build irrigation and desalination systems, provide relief to people hit by natural disasters, also the globe is greening die to warming and more carbon dioxide and water (because carbon dioxide is food for plants), fossil fuels are the most economical way to not freeze to death over winter, and they are the most economical way to build hydroelectric power and nuclear. Also when countries get richer they cut emissions per capita. But I guess we should just use climate change as an excuse to transfer money to your green corporate doners. Your concern is not human well-being if you think the government should reduce our access and use of them, poverty kills. And also subsidising “green” energy just takes money form more productive parts of the economy, so we are poorer, and that kills.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.23823529411764705,
            "subjectivity": 0.4558823529411764
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Someone wake up Joey he is asleep at the climate conference. I don’t think he cares",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Actually I like warm weather. I've lived in the tropics for years.  It was great. I hope that folks in New York will one day pick bananas from their back yard. I think that warming will generate more rain, not arid areas. That's what the tropics experience. Of course, one day the trend will reverse and great ice sheets will move from the north. You think you have environmental migrants now. Just wait.",
            "polarity": 0.40519480519480516,
            "subjectivity": 0.45064935064935063
        },
        {
            "body": "Great work, the economist!👏👏",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Climate change deniers come back to all of this is essentially just \"Nuh uh!\"",
            "polarity": 0.0,
            "subjectivity": 0.15
        },
        {
            "body": "There is curently no alternative to fossil fuels and to pretend otherwise is  not just denial and goverment polices that follow this fantsy wreck economies   Nuclear power is the only workable  alternative and it is proven to work.",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "It's always been on the chilly side here in the UK and summers are not constantly warm, so a 3c or 5c rise would be much more welcome better summer days.",
            "polarity": 0.18000000000000002,
            "subjectivity": 0.6799999999999999
        },
        {
            "body": "the earth will be fine.  we will adapt or die, as always and that's fine too.  northern countries stand to benefit the most.  more resources should be poured into adapting and making the most of it as well as cleaning the air instead of forcing zero emissions.  we're still going to have to deal with warming and needing to clean the air even if we went to zero tomorrow",
            "polarity": 0.45,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "They show poverty and talk about climate change. It seems more like a technique  to break your reason down.",
            "polarity": 0.17222222222222222,
            "subjectivity": 0.3944444444444445
        },
        {
            "body": "Worthless.  At 3.56 the guy says they are expecting a 2 degree increase, but there's a 1 in 20 chance of it being 3 degrees.   So the rest of the video devotes itself to describing this worst case 3 degree scenario and conveniently forgets to mention that this is only a 1 in 20 possibility.  I always thought of the Economist as a serious publication - not any more.",
            "polarity": -0.32666666666666666,
            "subjectivity": 0.8133333333333332
        },
        {
            "body": "thought 3 degrees is something to do with Freemasonary",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "shave ya cheeks freako",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "PS. Normal that they are after the farmers, with global harvestfailures as in the 17th century during the Maunder minimum, there won't be enough grain for humans, no use to try feeding lifestock (unless you raise and feed it on your own, but they'll come after you for that, too, I suppose). Worldwide harvestfails up to 60,  70 % until 2030. THAT'S why they'll try to reduce meat production at the quickest pace possible.",
            "polarity": 0.15,
            "subjectivity": 0.63
        },
        {
            "body": "Ok Covid ain't working anymore, so let's jump back to Global warming. Says all Democrats!!!!!😂😂😂😂😂😂😂😂😂😂😂😂",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.16666666666666666
        },
        {
            "body": "Explain how global warming can produce 2 M km2 MORE arctic ice than last year at the same period???? It has risen to 8,69 million squarekm this year. Could someone change the narrative, PLEASE??? We are in a grand solar minimum that might evolve into an ice age. Heinrich events, and Dansgaard-Oeschger events follow one another quickly. Why do you think that govts. make such haste  to implement their \"agenda\"?? Because it's getting cold and they know, that the SUN makes our climate. Not CO2.",
            "polarity": 0.09166666666666666,
            "subjectivity": 0.4614583333333333
        },
        {
            "body": "Climate related deaths are at their lowest point in history, also fossil fuels make farming more efficient which means more forest can be conserved, oh and fossil fuels are the most economical way to transport food, build irrigation and desalination systems, provide relief to people hit by natural disasters, also the globe is greening die to warming and more carbon dioxide and water (because carbon dioxide is food for plants), fossil fuels are the most economical way to not freeze to death over winter, and they are the most economical way to build hydroelectric power and nuclear. Also when countries get richer they cut emissions per capita. But I guess we should just use climate change as an excuse to transfer money to your green corporate doners. Your concern is not human well-being if you think the government should reduce our access and use of them, poverty kills. And also subsidising “green” energy just takes money form more productive parts of the economy, so we are poorer, and that kills.",
            "polarity": 0.23823529411764705,
            "subjectivity": 0.4558823529411764
        },
        {
            "body": "Seems like geoengeneiring is the only solution right now. All that cutting emmisons thing simply isn't working.",
            "polarity": -0.07857142857142857,
            "subjectivity": 0.6982142857142857
        },
        {
            "body": "Ecologism: the new enemy of humanity. Mark my words.",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Heard what the man said, at 15 min 40 ?\n\nEmissions are set to _Rise_ 16% from 2010 levels to 2030.\n\nMeaning, about a sixth _more_ gasses will be released into the atmosphere, whereas even with the same amount emitted, still the warming effect _increases_ from year to year. \n\nSo, from 2010 to 2030, we're emitting more greenhouse gas each year, exacerbating the extra warming every year.\n\nThat's why I'm saying, we're only seeing the early beginnings of extreme weather. 50c C in Canada, a years precipitation in a day in north Italy, these are not the prelude to the concert, not even the conductor making his entry. \nNope, the conductor has just read his sheet music, and is now making his first plan. The real live concert will only stay to play out some time in the 30s. Enjoy the quiet while you can.",
            "polarity": 0.15246212121212122,
            "subjectivity": 0.5368055555555555
        },
        {
            "body": "Climate \"refugees\" are going to be the next excuse to flood Europe.",
            "polarity": -0.025,
            "subjectivity": 0.025
        }
    ]
}