{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-05 12:47:43",
    "ups": "19154",
    "downs": "1619",
    "views": "745261",
    "top_comments": [
        {
            "comment": "Well the Truth is Greta is projected into the Mainstream to appeal to the rest of Children to Push The Global Warming Nonsense. Paid by World Economic Forum. The Climate Change Is Based on Computer Data by Imperial College headed by Neil Ferguson, One of the Advisory Figures to Government at start Of Plandemic, only problem is they seem to have Conveniently forgotten the Medieval Period when Earth was Warmer than it is now, well forgotten on purpose because after Medieval times they had A Mini Ice Age, this is from when they use the Data saying its the earliest Records, Starting from The last Coldest Spell, so all you see is Temperature raising over the last few hundred years, other truth is we didnt have enough Co2 for plantlife back then and the planet is actually greener after the Industrial Revolution because of the Extra Co2. Other truth is it goes in an 800 year cycle of Temperature Rising and Cooling because which is due to Sea absorbing Co2 when and after 800 years releases Co2 were now nearing the 800 years cycle and thus why planet is warmer but were still not experiencing the heat levels seen in Medieval Times",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.009722222222222222,
            "subjectivity": 0.23935185185185187
        },
        {
            "comment": "We don't have that 20, 30 or 50 years! The climate is changing catastrophically fast and people are not prepared for it in any country. Only by uniting and building a Creative Society can we get through these difficult times with dignity and survive as a civilization.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.04999999999999999,
            "subjectivity": 0.9
        },
        {
            "comment": "In 07 they were saying buy  diesel and then it was  petrol and now it is Electric",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "Well it has taken the whole industrial revolution to supposedly  lift temperate half of a degree and all is fine now so 3 degrees may not even be possible.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.11250000000000002,
            "subjectivity": 0.5166666666666666
        },
        {
            "comment": "People from 180 countries united to shine an honest spotlight on catastrophic climate change at the Dec. 4 Global Crisis conference. A Time for Truth.\" This conference is an unprecedented event for all people of the planet. Only by uniting the potential of all humanity can we survive the impending climate catastrophes. Join us, this is our last CHANCE!!!!",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.19999999999999998,
            "subjectivity": 0.6444444444444445
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "if this becomes true, the rest 5 billion people in the world should flock to western countries and china.",
            "polarity": 0.175,
            "subjectivity": 0.325
        },
        {
            "body": "is like building a house and dumping the leftover and garbage on the street. then asking ur small and old housed neighbor not to dump building leftovers. 😊 niiice.",
            "polarity": -0.075,
            "subjectivity": 0.30000000000000004
        },
        {
            "body": "We don't have that 20, 30 or 50 years! The climate is changing catastrophically fast and people are not prepared for it in any country. Only by uniting and building a Creative Society can we get through these difficult times with dignity and survive as a civilization.",
            "polarity": 0.04999999999999999,
            "subjectivity": 0.9
        },
        {
            "body": "People from 180 countries united to shine an honest spotlight on catastrophic climate change at the Dec. 4 Global Crisis conference. A Time for Truth.\" This conference is an unprecedented event for all people of the planet. Only by uniting the potential of all humanity can we survive the impending climate catastrophes. Join us, this is our last CHANCE!!!!",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.6444444444444445
        },
        {
            "body": "Unfortunately, ever weakening and greedy governments and people worship the dollar rather then respecting what keeps them alive.  The result, climate  wise is obvious. But the naysayers, mostly rich and powerful deny the science, and spread their misinformation in their quest for the dollar and power.",
            "polarity": 0.16249999999999998,
            "subjectivity": 0.7583333333333333
        },
        {
            "body": "CO2 is a trace gas in the atmosphere only 0.04 percent, but the IPCC say that CO2 is a dangerous GHG because it absorbs and emits strongly at 15 microns.  According to Wien's displacement law 15 microns has a corresponding temperature of -80⁰ C.  The troposphere, that's the part of the atmosphere we live in, is defined by molecules with a temperature of -60⁰ C and above.  Emissions of IR from CO2 @ 15 microns cannot heat any molecules in the troposphere. That would violate the laws of physics.\nIt is the sun that drives the climate on earth and not humans or our carbon emissions.",
            "polarity": -0.006060606060606067,
            "subjectivity": 0.6466666666666667
        },
        {
            "body": "Governments want this to happen, that's why they are so disinterested in making changes. They want the majority of the population to die off because it serves their agenda. It's so obvious, we all know what will happen if action isn't taken to curb humanities effect on the environment, but those actions are controlled by the minority who's self interests are driving how the majority have to live.",
            "polarity": 0.07878787878787878,
            "subjectivity": 0.3666666666666667
        },
        {
            "body": "it's already too late. capitalism is not compatible with life on earth.",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "body": "CNN workers were saying during 2020 that as soon as lockdowns and covid subsides, they will launch into full time global warming coverage. This is all mainstream media too no doubt. because what they need are another global scale, vague yet catastrophic dangers. to keep us unable to act. a vague threat means there are no clear ways to make meaningful progress to solve, leading to anxiety and depression. also meaning overwhelming resources go towards efforts claiming to tackle it, instead of putting them towards clearer, solvable problems, which in turn would help to solve environmental crises'. \nAfter 15 minutes of doom and gloom, we are told our best option is mitigation and adaptation. no solutions. No one at the UN seems to think its conceivable that we are able to solve this problem? how is any of this type of messaging helpful? If the problems are so dire, and the world is the richest its ever been, how about we go about funding research into actionable plans, to solve these problems.",
            "polarity": 0.09743589743589744,
            "subjectivity": 0.407051282051282
        },
        {
            "body": "Well the Truth is Greta is projected into the Mainstream to appeal to the rest of Children to Push The Global Warming Nonsense. Paid by World Economic Forum. The Climate Change Is Based on Computer Data by Imperial College headed by Neil Ferguson, One of the Advisory Figures to Government at start Of Plandemic, only problem is they seem to have Conveniently forgotten the Medieval Period when Earth was Warmer than it is now, well forgotten on purpose because after Medieval times they had A Mini Ice Age, this is from when they use the Data saying its the earliest Records, Starting from The last Coldest Spell, so all you see is Temperature raising over the last few hundred years, other truth is we didnt have enough Co2 for plantlife back then and the planet is actually greener after the Industrial Revolution because of the Extra Co2. Other truth is it goes in an 800 year cycle of Temperature Rising and Cooling because which is due to Sea absorbing Co2 when and after 800 years releases Co2 were now nearing the 800 years cycle and thus why planet is warmer but were still not experiencing the heat levels seen in Medieval Times",
            "polarity": -0.009722222222222222,
            "subjectivity": 0.23935185185185187
        },
        {
            "body": "so what made the last 10k year ago ice age end??? lets me guess,,, AOC says it was cow farts haahah,,,, planet go thru hot and cold cycles,,,, that s nature",
            "polarity": -0.12083333333333332,
            "subjectivity": 0.5208333333333334
        },
        {
            "body": "If the China, US, and Russia dropped their Nuclear Bomb, I will say Game over",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "All fake!!",
            "polarity": -0.78125,
            "subjectivity": 1.0
        },
        {
            "body": "what they look like ? DESERT WORLD , world pop will drop less than 50%, even wars over land and water",
            "polarity": -0.16666666666666666,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "Well it has taken the whole industrial revolution to supposedly  lift temperate half of a degree and all is fine now so 3 degrees may not even be possible.",
            "polarity": 0.11250000000000002,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "In 07 they were saying buy  diesel and then it was  petrol and now it is Electric",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "UAE is A naturally hot place it is a. Desert",
            "polarity": 0.25,
            "subjectivity": 0.8500000000000001
        },
        {
            "body": "The countries they’re showing it is  called poverty nothing to do with climate change",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This was happening for hundreds of years",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Just say it “Reduce fossil fuels”",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}