{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-10-31 00:58:06",
    "ups": "2718",
    "downs": "181",
    "views": "65876",
    "top_comments": [
        {
            "comment": "We have massive drought and fires spreading in Western States without enough water",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "comment": "The fascinating part of all this has been that I spent the fist half of my life listening to scientists say that the Earth is dynamic and never stops changing. It has been far hotter and far colder , far more carbon laden and far less carbon laden then we are today.\nThe hubris involved here is epic. To think that things Must stay the same or it will be detrimental to humans is misplaced. We as a species have a far far greater chance of self destruction and misery(as history has proven) from internal fighting then from ecological change ...change being a certainty no matter what we do or don't do.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.12037037037037039,
            "subjectivity": 0.5375
        },
        {
            "comment": "I live in phoenix where we regularly hit 115 and occasionally 120+ yall are just weak willed",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.05965909090909091,
            "subjectivity": 0.3317307692307692
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "What is the cause of 3 degrees world ? What is the roots of climate change ? Shall we all stop developing  ?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Volcanoes, fire and water rule the Earth, not us.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hypocrite.....????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "More thermal, more heat.\nMore water vapor, more moisture.\nUpside down ocean - like, more rain.\nMore waterfall, more mudslide.",
            "polarity": 0.4180555555555555,
            "subjectivity": 0.4736111111111111
        },
        {
            "body": "Body temp plus near 100% humidity? Welcome to Cleveland in August.",
            "polarity": 0.45,
            "subjectivity": 0.65
        },
        {
            "body": "I continue to be highly optimistic about our world's future and I think this century is going to see huge numbers of people getting out of poverty and into comfortable, prosperous lives in medium-developed countries. And we will find a way to first adapt to, and then mitigate climate change. Most of the solutions are already on the drawing board, we just need to implement them. Imagine if we didn't even know what to do. It's going to be great!",
            "polarity": 0.3871428571428571,
            "subjectivity": 0.5640476190476191
        },
        {
            "body": "Ironic, coming from the Economist. Seeing all of those impoverished people, this could have just as easily been about how capitalism is destroying the world.\n\nThe crazy thing about all of this, is that it's supposedly being caused by a minutia of 0.01% increase in atmospheric CO2 concentration. Not to mention that average temperature has only increased by 1° after all these years. How could this possibly be responsible for the inclement weather?\n\nHow can anyone take climate change seriously? It's about as serious as that guys beard. It's just fear mongering. By the rate we're going, it's unlikely we'll even add 0.01% more CO2 in this century.\n\nIt's obvious to me, and it should be obvious to everyone else, that any increase in temperature is just because of urbanization, population growth and tremendous amounts of heat being pumped into the environment.",
            "polarity": -0.029999999999999992,
            "subjectivity": 0.5944444444444446
        },
        {
            "body": "Its because of america since most american using v8 suv and eats a lottss.",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "One hears 3 degrees centigrade banded about, but when translated in to optics it is very harrowing.\n\n   If only the new summit in Scotland can thrash out a policy consummate with the urgency required.",
            "polarity": 0.25727272727272726,
            "subjectivity": 0.5709090909090909
        },
        {
            "body": "Fake....",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "There is a cruelty about climate change which is very seldom ever articulated. It is cruel to deny the science or bury your head in the sand and pretend it's something an ocean or 2 away when so many people in this world are actually suffering from the results of climate change. The U.S. is no more immune from the effects of AGW than any other country or the tsunami of displaced people that will be slamming across our borders.",
            "polarity": -0.1125,
            "subjectivity": 0.4625000000000001
        },
        {
            "body": "Be proud you get to live in the time where you can see the end of it all.  The vast majority of humans did not receive this blessing",
            "polarity": 0.31212121212121213,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "If human behavior is predictable, then a 3 degree world is inevitable...",
            "polarity": -0.06666666666666667,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "0:48\n\nMeanwhile my grandparents explaining to me the “extreme weather” they had to go through to go to school",
            "polarity": -0.125,
            "subjectivity": 1.0
        },
        {
            "body": "I live in phoenix where we regularly hit 115 and occasionally 120+ yall are just weak willed",
            "polarity": -0.05965909090909091,
            "subjectivity": 0.3317307692307692
        },
        {
            "body": "The fascinating part of all this has been that I spent the fist half of my life listening to scientists say that the Earth is dynamic and never stops changing. It has been far hotter and far colder , far more carbon laden and far less carbon laden then we are today.\nThe hubris involved here is epic. To think that things Must stay the same or it will be detrimental to humans is misplaced. We as a species have a far far greater chance of self destruction and misery(as history has proven) from internal fighting then from ecological change ...change being a certainty no matter what we do or don't do.",
            "polarity": 0.12037037037037039,
            "subjectivity": 0.5375
        },
        {
            "body": "We\"re a doomed species of hominids and we wont be the first or the last",
            "polarity": 0.125,
            "subjectivity": 0.19999999999999998
        },
        {
            "body": "It would be way better to have nuclear and all the things that nature can supply",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "The world has never had set temps.. The ocean pumps out more Co2 than us small little Human Beings",
            "polarity": 0.015625,
            "subjectivity": 0.375
        },
        {
            "body": "We have massive drought and fires spreading in Western States without enough water",
            "polarity": 0.0,
            "subjectivity": 0.5
        }
    ]
}