{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-01 01:40:15",
    "ups": "8341",
    "downs": "645",
    "views": "268191",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Hilarious!",
            "polarity": 0.625,
            "subjectivity": 1.0
        },
        {
            "body": "We are going to stop burning fossil fuels pretty soon and it has nothing to do with Climate Change. Our  fossil fuel supply lines are starting to break down. It's getting to expensive for the oil companies to extract what remains of our fossil fuel reserves, unfortunately Green/Renewable energy is neither green nor renewable. Wind turbines and solar energy panels are made from materials which must be extracted from the earth. These materials are just as finite as fossil fuels and to extract these materials will cause a great deal of damage to the environment - as I said NOT green and NOT renewable. At this point in time civilization has nothing to transition to from fossil fuels that is truly renewable and green.",
            "polarity": -0.04506172839506173,
            "subjectivity": 0.5265432098765432
        },
        {
            "body": "World powers will do something significant about it when New York, Shanghai, etc. are underwater.",
            "polarity": 0.2556818181818182,
            "subjectivity": 0.6647727272727273
        },
        {
            "body": "Everyone should move to northern Canada then....oh wait....they will freeze to death!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Sorry not buying it!",
            "polarity": -0.625,
            "subjectivity": 1.0
        },
        {
            "body": "Asteroid wud give us a global winter.. that cool the planet down...🤷🏻‍♂️",
            "polarity": 0.175,
            "subjectivity": 0.325
        },
        {
            "body": "Is that why the world oligarchs are buying up oceanfront property?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Guatamala has been in a drug cartel danger zone for 20 yrs. Buddy! Yup.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "This video needs showing at COP26, Glasgow.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "😋😍. Lets Pray it out. 🙏🏼😇",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Paint all highway grey black asphalt emits heat U DID IT BACK ASPHALT REALLY STOP CLIMATE TODAY",
            "polarity": -0.004166666666666666,
            "subjectivity": 0.18333333333333335
        },
        {
            "body": "We can't do anything about it lol. No cap",
            "polarity": 0.8,
            "subjectivity": 0.7
        },
        {
            "body": "😂😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Don't we have 5+ yrs. To live now? \nLiars!!!!!!!",
            "polarity": 0.6502324884588068,
            "subjectivity": 0.5
        },
        {
            "body": "And china is a starving nation....it is their gov't that f's people. Get with the peogeam.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "So.....you depend on hollywood... A chinese shill",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We got global warming to worry about now but when does over population of the planet become an issue?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Jesus Christ is coming repent is not too late at the end of the world",
            "polarity": -0.3,
            "subjectivity": 0.6
        },
        {
            "body": "I do NOT believe any of this is man made nor do I believe it is going to happen.   The entire part of the Saharan desert and all of Northern Africa was once I green wet jungle and it all dried up over 2400 years ago.....What human agency caused that ?   NONE.   Also, the longer the frost free period the more different types of fruits, vegetables, and even grains can grow and so the areas in the Northern Continents, e.g. the Great Plains of North America and Canadian and the great expanses of Russian tundra will become world cropping centers with citrus growing as far north as the Canadian border.   Deciduous trees will replace pines, scrub oak will replace oak and the area of grassland prairie will expand.  These 'global warming' horror shows only show the monster and not how climate change can be manipulated to MAN KINDS ADVANTAGE.    What School Child doesn't want five more weeks of summer ?",
            "polarity": 0.17333333333333334,
            "subjectivity": 0.5283333333333334
        },
        {
            "body": "Climate change is a constant, we live in a living breathing planet where carbon represents .04 of the atmosphere.  Stories like these are sensationalist and do nothing but add to the nightmares of young children, who spot the mantra of mass extinction and end of days. Why not have a story  that an area the size of Brazil has greened since 2000. It is not all doom and gloom, my kids and there children will do well. It is only human hubris that thinks we can stop climate change. What we can do and do well is adapt, improve and prosper.",
            "polarity": 0.01717171717171717,
            "subjectivity": 0.41111111111111115
        }
    ]
}