{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-04 03:50:49",
    "ups": "17286",
    "downs": "1436",
    "views": "657863",
    "top_comments": [
        {
            "comment": "\"Global Warming\" and \"Climate Change\"  ...... professional terms used as substitutes for REVELATIONS.",
            "likes": 1,
            "number_of_replies": 1,
            "polarity": 0.05,
            "subjectivity": 0.05
        },
        {
            "comment": "human society is on verge of collapse.\nall systems made to deal with the proper smooth flow will fail as the population of cities will swell to point which is overburdening.\ncheap humans.\ni truly now hate human.\nbecause no one but the human is going to be the reason of my extinction.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.0625,
            "subjectivity": 0.35
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "The climate change documentary especially those made by big brand influencer should start portraying climate change impact on middle class and modern lives in developed nations also, instead of just typically highlight the plights of the poor and the third-worlds …. Unceasing burning of l fossil fuel and addiction of plastics and whatnot that affect the weather, oceans and forests are not the problems of the poor nations or the third-words alone.",
            "polarity": -0.07407407407407407,
            "subjectivity": 0.3777777777777778
        },
        {
            "body": "They tell you global warming \nI tell you God's wrath \nElites know it so they try to explain it \"scientifically\"but oh they know and they're getting ready in rush.Its at the doorstep...",
            "polarity": 0.1,
            "subjectivity": 0.25
        },
        {
            "body": "3 degrees doesn’t seem like much to Americans because for better (or more probably, worse) we still measure temperature in Fahrenheit. To get Americans to start paying attention to global warming, journalists should start expressing warming in terms of Fahrenheit, where 3 degrees translates to almost 6 degrees of change. Whoa, now we might pay attention.",
            "polarity": 0.15999999999999998,
            "subjectivity": 0.36
        },
        {
            "body": "What they say is absolutely true. Lemme give my example..i live in West Bengal, India,  parts of which are  very low-lying. When i was born, our home never used to get flooded even in heavy rain... A few years ago, it started getting flooded with about an hour of rain... And this year our home was flooded on about 30 days with just about 20 mins of heavy rainfall",
            "polarity": 0.014393939393939376,
            "subjectivity": 0.425
        },
        {
            "body": "human society is on verge of collapse.\nall systems made to deal with the proper smooth flow will fail as the population of cities will swell to point which is overburdening.\ncheap humans.\ni truly now hate human.\nbecause no one but the human is going to be the reason of my extinction.",
            "polarity": -0.0625,
            "subjectivity": 0.35
        },
        {
            "body": "imaginations of interstellar coming to life.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "CO2 has very little to do with it. Its solar climate forcing.",
            "polarity": -0.24375000000000002,
            "subjectivity": 0.65
        },
        {
            "body": "The change in the climate is a natural event and is, in part, due to the spiritual power flowing towards the planet.The cabal seized on this and used the knowledge as a means of creating more limitation on freedom of action by man and also as a means of extracting more money from people.",
            "polarity": 0.17916666666666667,
            "subjectivity": 0.3347222222222222
        },
        {
            "body": "The earth is dynamic . if it heats up too much it will cool itself.",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.33888888888888885
        },
        {
            "body": "The earth will get ''tired'' of us and clean us up so the climate can sustain it's natural cycle.",
            "polarity": 0.022222222222222227,
            "subjectivity": 0.6
        },
        {
            "body": "Sometimes i think Thanos was right🤔",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I know that it might seem mean or selfish but it's simply fact. People don't care about slums in Dhaka or minor countries like fiji. \n\nWhile its sad that this happens, northern Germany/Poland and half of Italy sinking underwater will make quicker change than if the entire coastline of indonesia goes underwater. \n\nIt's the way things are.",
            "polarity": -0.21845238095238098,
            "subjectivity": 0.5766156462585034
        },
        {
            "body": "Grasshoppers rule the world. There is no chance of avoiding this.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "No walls can block the sea, silly!  You can never block nature!",
            "polarity": -0.78125,
            "subjectivity": 0.875
        },
        {
            "body": "Having been north of Canada and seen the melting of the permafrost which has effectively started the positive feedback loop. It's now just a matter of time, no longer and \"if\" issue, it's existential.",
            "polarity": 0.41363636363636364,
            "subjectivity": 0.6727272727272727
        },
        {
            "body": "\"Global Warming\" and \"Climate Change\"  ...... professional terms used as substitutes for REVELATIONS.",
            "polarity": 0.05,
            "subjectivity": 0.05
        },
        {
            "body": "fake news",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "It’s not global warming it’s climate change. Why is it not global warming? Because the globe is not warming.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "The Sun is the main driver of climate change... Not mankind or CO2... all the planets in our solar system are warming at the same rate... we are experiencing a natural climate change and it's going to get very cold real soon... no amount of taxes will ever change it....",
            "polarity": -0.06266666666666668,
            "subjectivity": 0.43166666666666664
        },
        {
            "body": "still waiting to see how the world would be if the temperature rises 3 degrees...",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}