{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-03 15:28:46",
    "ups": "16146",
    "downs": "1309",
    "views": "602665",
    "top_comments": [
        {
            "comment": "5:33 Indian farmers are at high risk\nThe situation is very tense\nI pray and hope things change for better",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.07555555555555556,
            "subjectivity": 0.5633333333333334
        },
        {
            "comment": "This is nothing but more of our daily dose of “existential threats”. So called weather experts can’t tell us what will happen tomorrow but they’re quite sure of themselves being able to predict things 70 yrs into the future. I would rant longer but my parents said to never argue with idiots: they’ll drag you down to their level and crush you with experience.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.05555555555555555,
            "subjectivity": 0.4123263888888889
        },
        {
            "comment": "WHERE        WERE        YOU         WHEN        REPUBLICONS       DRSTROYED       THE          WORLD      ?          ",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "comment": "As has been predicted by the none corrupted Russian climat scientists for years, we are actually entering a cooling trend since ~ 2012. Furthermore, The « modern warm period » which started roughly in 1750 is coming to an end and since human green house gas emissions are barely 2.4% of all green house gasses and only 1 factor in the complicated climate change issue out of hundreds of factors, I fail to be worried about the 179th doomsday prediction of the “green religion lunatics” working for the Economist !",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": -0.06923076923076922,
            "subjectivity": 0.3692307692307692
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Given the choice, I still wouldn’t move to Mars.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "WHERE        WERE        YOU         WHEN        REPUBLICONS       DRSTROYED       THE          WORLD      ?          ",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "A very big deal out of nothing. If you said 33 degrees then that would be different but come on, 3 is a perfectly fine tempurature difference. That vague graph only shows how close we are getting to the sun. Dont forget that the universe has a cycle of changes. If you really want to prove something then go back thousands of years and you'll notice a pattern will appear....",
            "polarity": 0.01666666666666667,
            "subjectivity": 0.4185714285714286
        },
        {
            "body": "\"There is a 1 in 4 chance that under current policies we will hit at least 3 degrees by the end of the century. this is just one of the scenarios Joeri looks at. Another one imagined that all policía are kept . The most optimistic assumes that all policíe promises have been kept and net zero targets are met. Where our best estimate ends up around 2 degrees at the end of the century, there is still a 1 in 20 chance that we end up with 3 degrees instead. One wouldn't be entering a plane if there was a 1 in 20 chance that the plane will crash.\"\nWe have the technological capacity to do a 180° turn to our economy and get a decent chance to keep organized human life. The insane question is, do we have the will?",
            "polarity": 0.04583333333333334,
            "subjectivity": 0.42083333333333334
        },
        {
            "body": "All these fear mongering.. And the World Summits can't do jacksh!t 😂",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yes and dinosaurs also died from global warming. Yes we should care about our planet, however until there are universal and equal limits per capita everywhere, whole eko and limiting Co2 have not much sense. So what if EU limits that while china and us are increasing, pointless, EU makes own products less competitive and more expensive to produce (Added cost of Co2 limits) so companies are moving production to china. Limit should be same (per capita) for underdeveloped countries as for biggest waste producers like china and us.",
            "polarity": 0.006944444444444443,
            "subjectivity": 0.3118055555555556
        },
        {
            "body": "3 degrees? The way things are currently going it is more like 6 degrees that we are heading for.",
            "polarity": 0.25,
            "subjectivity": 0.45
        },
        {
            "body": "As has been predicted by the none corrupted Russian climat scientists for years, we are actually entering a cooling trend since ~ 2012. Furthermore, The « modern warm period » which started roughly in 1750 is coming to an end and since human green house gas emissions are barely 2.4% of all green house gasses and only 1 factor in the complicated climate change issue out of hundreds of factors, I fail to be worried about the 179th doomsday prediction of the “green religion lunatics” working for the Economist !",
            "polarity": -0.06923076923076922,
            "subjectivity": 0.3692307692307692
        },
        {
            "body": "We will be underwater just like all the other civilization to we have evidence of that end of story we did it again to herself",
            "polarity": -0.125,
            "subjectivity": 0.375
        },
        {
            "body": "This is nothing but more of our daily dose of “existential threats”. So called weather experts can’t tell us what will happen tomorrow but they’re quite sure of themselves being able to predict things 70 yrs into the future. I would rant longer but my parents said to never argue with idiots: they’ll drag you down to their level and crush you with experience.",
            "polarity": 0.05555555555555555,
            "subjectivity": 0.4123263888888889
        },
        {
            "body": "I live in Bangladesh😭",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.5
        },
        {
            "body": "well guess what.. the earth has been warming since the last ice age. global warming is completely natural! ever had bag of ice? it will last a long time, now compare the melting time to a single ice cube. the single ice cube will melt way faster.. the exact same scenario can be said towards the ice on the earth. it look a long time for it to melt down but now that its smaller the melting process speeds up. the world has always gone through cycles of heating and cooling. they never seem to talk about how there are parts of the world that have been slowly getting colder too. climate change is real. naturally real. its natural for the climate to change!!",
            "polarity": 0.002189153439153435,
            "subjectivity": 0.2683862433862434
        },
        {
            "body": "You cannot stop what the Sun controls;  man has a very small effect when compared to all the different freaquencies of EM spectrum ,  various atomic level particles,  & several magnetic mechanisms  from the Sun & Earth that absolutely effect Earths weather regardless of what lies the TPTB try to force down your throat .  In the next 20 years we will experience what the onset of an Ice age looks like as we decend into the Grand Solar Minimum due by 2031.  Prepare!  Cheers,  FREE",
            "polarity": 0.04631944444444445,
            "subjectivity": 0.4983888888888889
        },
        {
            "body": "What really scares me is the ignorance of older people.\nI remember my dad saying:  “I remember 50 years ago the winters were so cold. It was horrible! There was snow from September till March“\nThen he said something shocking: “I think the climate change turned the weather to the better”\nHe really doesn’t have a sense for what’s comming when climate change doesn’t stop.",
            "polarity": -0.21904761904761907,
            "subjectivity": 0.6047619047619047
        },
        {
            "body": "Global warming is a casual occurrence like leaves growing on trees. Humans are part of the natural process and \"human based climate change\" is a complete manipulation of info. Stay sleepin",
            "polarity": -0.06000000000000003,
            "subjectivity": 0.35333333333333333
        },
        {
            "body": "Human cannot agree anything on cutting back emmissions because of greed. Our only solution is to rely on renewable technology which may or may not come soon enough. Eventually, our doom is inevitable.",
            "polarity": -0.09999999999999999,
            "subjectivity": 0.5833333333333334
        },
        {
            "body": "5:33 Indian farmers are at high risk\nThe situation is very tense\nI pray and hope things change for better",
            "polarity": 0.07555555555555556,
            "subjectivity": 0.5633333333333334
        },
        {
            "body": "Pity Al Gore made that movie that said we would already have the 3 degrees and many places under water.... best not to put a date on things.. kind of like second comings etc.",
            "polarity": 0.4,
            "subjectivity": 0.38
        },
        {
            "body": "3 degree C = 3 x 1.8 deg F or about 5.4 deg F",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "...the great problem with all the hype is that the actual, observed rise in temperature is well below ~95% of the computer models whose output is the basis of the nonsense this video attempts to cite. There is no rise in 'extreme' weather, there is no real alteration in 'sea level rise' ...its been rising for centuries. There are no 'climate refugees', islands are not 'sinking' and coastlines are not observed shifting.'Climate Models' are speculative, those of the UN even more so. None are predictive of even past events... perhaps then some sensibility might work itself into 'climate activism' as, afterall, the hype is itself now 40+ years long. There is not even a process capable of anthropogenic affect upon Climate. Have a less stressed time...",
            "polarity": 0.08981481481481483,
            "subjectivity": 0.41851851851851857
        }
    ]
}