{
    "time_posted": "2021-10-30 11:00:25",
    "url": "https://www.youtube.com/watch?v=uynhvHZUOOo",
    "time_now": "2021-11-06 09:24:32",
    "ups": "19816",
    "downs": "1669",
    "views": "779174",
    "top_comments": [
        {
            "comment": "Disappointing. The two big complaints are due to their focus on the direct impacts from the environment over the next eighty years.\n\nFirst, they miss the feedback loops that the gradually escalating interim crises will create. As rich countries are called upon for aid by their citizens, they'll be less likely to help poorer countries (witness the lack of COVID vaccines going to the poorest countries), or even cooperate with other wealthy countries (beyond lip service — already evident at climate summits). The economic disruption will accelerate as the climate crisis becomes more and more evident, reducing the likelihood that anything ever gets done.\n\nSecond, by pointing to the 3°C increase at the end of the century, they make it easy for people to treat this like a horror story that will maybe happen to strangers. “That's a long time from now, surely someone will fix the problem well before then.” They should be pointing to the unprecedented flooding in Germany, the unprecedented heat wave in Australia, the melting of permafrost in Alaska and Siberia, the fires in the U.S. west — all happening now, and all harbingers of worse to come. People need to be scared about their own futures, not that of their grandchildren's.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1746527777777778,
            "subjectivity": 0.513425925925926
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "it is a weapon of mass destruction and a selfdestruct button is  already pushed no race to blame none",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "as man has done so has.   🌍😨",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "All this is a part of life \nChange is inevitable.  We can only do our best to change our way of living but honestly I think it's a battle lost",
            "polarity": 0.4,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "there should be a See!? button because clicking like feels weird",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "What about recycling the showers wasted water for home pool reservoires? We all know how waterfalls are natural refreshing systems, giving oxygen the atmosphere nearby and each single house should work as a tree by now, it might become even the most successful new economy and welfare strategy for the future, veggies are our salvation fans",
            "polarity": 0.21436688311688312,
            "subjectivity": 0.4554788961038961
        },
        {
            "body": "You can pay a visit from my behalf, some bio research labs to check, which vegetals are biggest smog eaters? Wild roses or wild beans climbing vegetals? Usually there were used green natural baricades against wild animals to end up on highways, the best anti crashes filters and how many green walls should be planted of wild bushes to eat the traffic smog? You can do a lot of great things guys, we have all the solutions to manage the situation before its too late, its a matter of survival, journalists can make the difference indeed, when each individual can get the proper tips about the matter",
            "polarity": 0.13214285714285717,
            "subjectivity": 0.3928571428571428
        },
        {
            "body": "There are the clouds and storm maps by now, what if digging some ditches and holes to give space rain water to stop at least for a while, for the next artificial lake and for using the rivers as waterfall refreshing architectures, what a wonderful world this could be fans think about it Ok?",
            "polarity": 0.18333333333333335,
            "subjectivity": 0.65
        },
        {
            "body": "I think students might have a lot of fun, trying to understand, each family how much oxygen is burning, how many seeds must be planted to neutralize each family's pollution, next to lemon trees, how many more veggies are so cute as home decorations, even beans or corn, grass or grain, cereals or peaches, if possible an entire wall filled of shelves for leaves to refresh the air. If you try to watch some more Sci Fi movie fantasies, yeah, mass media can do a lot of great things indeed",
            "polarity": 0.35000000000000003,
            "subjectivity": 0.55625
        },
        {
            "body": "Newspapers & journalists can help a lot, each time you do the groceries, try to pick up fresh organic veggies so you could use the seeds and let them smog eaters grow up, maybe there will not give you fresh tomatoes apples or lemons, but having green leaves all around the house is.  ..a heavenly bliss fans, mostly for kids and for each one's home conscience l think we can do a lot of great things indeed",
            "polarity": 0.33999999999999997,
            "subjectivity": 0.51
        }
    ]
}