{
    "time_posted": "2021-10-30 13:20:41",
    "url": "https://www.youtube.com/watch?v=WHTOZc4F6hc",
    "time_now": "2021-10-31 13:18:25",
    "ups": "463",
    "downs": "23",
    "views": "42724",
    "top_comments": [
        {
            "comment": "Standard jogger outfit\n-Hoodie (any color)\n-Sagging pants (below ass more gansta)\n-Gun (when shooting preferably to the \n             side, in their mind it looks cooler)\n-Nike sneaker (J’s, AF1 etc)\n-$900 phone (IPhone, Samsung, Obama)\n-Box cutter (any will do)",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.25,
            "subjectivity": 0.25
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "That is really sad story , how is he going to jog with bullet in knee 🥺?",
            "polarity": -0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Hellhound sinners who are going to be in for a ride awakening, when they realize that their whole life is in a book before God and he will reveal everything said and done in their bodies. They will surely regret the very day that they were born. It is appointed man once to die and then the judgement. It's Jesus or hell, you choose.",
            "polarity": 0.3,
            "subjectivity": 0.5296296296296296
        },
        {
            "body": "About to get worse after this weekend. Strap on NYC",
            "polarity": -0.4,
            "subjectivity": 0.6
        },
        {
            "body": "Standard jogger outfit\n-Hoodie (any color)\n-Sagging pants (below ass more gansta)\n-Gun (when shooting preferably to the \n             side, in their mind it looks cooler)\n-Nike sneaker (J’s, AF1 etc)\n-$900 phone (IPhone, Samsung, Obama)\n-Box cutter (any will do)",
            "polarity": 0.25,
            "subjectivity": 0.25
        },
        {
            "body": "Upholding stereotypes one deed at a time",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I  guess BLM does not matter anymore after they received millions in donations and ran off with the money .  Second biggest scan in this century",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "damn  it must be easy for people to get  illegal guns in new york but they  make  it hard  for the  legal people to get guns.",
            "polarity": -0.0043939393939393945,
            "subjectivity": 0.505909090909091
        },
        {
            "body": "Watch carefully maybe stepped on them j’s, shadow bumped definitely no shoulder bump, playing victims all the damn time, AA in public schools in NYC be baggin them baddest bitches, rocking them exclusive j’s, cmon man let’s go Brandon,” can’t have the cake and eat it”",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.5222222222222223
        },
        {
            "body": "The fact that he survived at that range is the greatest argument as to why gun control laws are ineffective. A fire arm is a tool. Gun safety is the first thing one needs to learn, just like any other tool. Gun control laws breed irresponsible gun ownership, instead of a healthy respect for the tool. \n\nNo responsible person would ever draw his weapon, with such disregard for his surroundings. We need heavy penalties for illegal gun ownership and more education on gun safety. This is America people. You're not getting rid of guns. Villfying them does nothing but increase crime. \n\nHAVE WE NOT LEARNED ANYTHING FROM PROHIBITION????",
            "polarity": 0.14722222222222223,
            "subjectivity": 0.5287037037037037
        },
        {
            "body": "Is this a content of character thing?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "And they wonder why they are hated and why nobody wants to live near them.",
            "polarity": -0.1159090909090909,
            "subjectivity": 0.42499999999999993
        },
        {
            "body": "What dis world is coming to people need to get 25 years just for having a gun 🙏🙏🙏🙏🙏",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Ridiculous",
            "polarity": -0.3333333333333333,
            "subjectivity": 1.0
        }
    ]
}