{
    "time_posted": "2021-10-30 12:29:47",
    "url": "https://www.youtube.com/watch?v=wSuXis9ynmM",
    "time_now": "2021-11-01 22:16:19",
    "ups": "54134",
    "downs": "2723",
    "views": "1986615",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Parasites",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Modi is yucking it up with Biden for the Fauci Patented Miracle Elixir for the WuFlu Hysteria, that will lead to India monopoly over pharmaceuticals, as will India VP Kamala Harris' Wide Open Borders with Unlimited Green Cards for South Asian medical workers to replace the US No Jab No Jobs. Amazing, that an in-plain-view Fauci's Crime Against Humanity and Harris' Great Reset to India domination in High Tech, in Journalism, Education Curriculum and now Healthcare, proceeds unabated, without a single protest. _E pluribus tent'em!_",
            "polarity": 0.1300793650793651,
            "subjectivity": 0.4004761904761905
        },
        {
            "body": "Saab kissed Trump's smelly one...now Bhai has no choice to kiss Joe...modi shud be ashamed of his strategy that truly sucks. It takes only stock market up while the poor become poorer..",
            "polarity": -0.2333333333333333,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "Dolaaaaaand",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Kannada Rajoyssavh hudukki grhhachyyrha thappuththy",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "“In one way we think a great deal too much of the atomic bomb. ‘How are\nwe to live in an atomic age?’ I am tempted to reply: ‘Why, as you\nwould have lived in the sixteenth century when the plague visited\nLondon almost every year, or as you would have lived in a Viking age\nwhen raiders from Scandinavia might land and cut your throat any\nnight; or indeed, as you are already living in an age of cancer, an\nage of syphilis, an age of paralysis, an age of air raids, an age of\nrailway accidents, an age of motor accidents.’\n\nIn other words, do not let us begin by exaggerating the novelty of our\nsituation. Believe me, dear sir or madam, you and all whom you love\nwere already sentenced to death before the atomic bomb was invented:\nand quite a high percentage of us were going to die in unpleasant\nways. We had, indeed, one very great advantage over our\nancestors—anesthetics; but we have that still. It is perfectly\nridiculous to go about whimpering and drawing long faces because the\nscientists have added one more chance of painful and premature death\nto a world which already bristled with such chances and in which\ndeath itself was not a chance at all, but a certainty.\n\nThis is the first point to be made: and the first action to be taken is to\npull ourselves together. If we are all going to be destroyed by an\natomic bomb, let that bomb when it comes find us doing sensible and\nhuman things—praying, working, teaching, reading, listening to\nmusic, bathing the children, playing tennis, chatting to our friends\nover a pint and a game of darts—not huddled together like\nfrightened sheep and thinking about bombs. They may break our bodies\na microbe can do that, but they need not dominate our minds.”\n\n - CS Lewis",
            "polarity": 0.09100168350168351,
            "subjectivity": 0.5253703703703705
        },
        {
            "body": "Daadi chota kardiya nautanki babu",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Mask se jyada Camera imp hai 🤣🤣",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I don't know why but sometimes I feel modi is the cutest guy",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "PM modi is a master seducer he can seduce any world leader.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "👏👏👍🇮🇹🇮🇹",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Not sekiratoing Modiji Indian🇮🇳 Army Lajan My family supposed 100% I am Rikivaseto one more Modiji All indian pupils father Rolls But india power full doesn't Likes to BJP Amita miser  Rajanasing Ap to visetonavaradan Reddy  some one mlc now following telagan BJP Badaru datathiriya old Krishan Reddy Now Badi",
            "polarity": 0.2375,
            "subjectivity": 0.3375
        },
        {
            "body": "Ladies ke sath kya whispered karti he feku pm of india.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}