{
    "time_posted": "2021-10-30 14:24:01",
    "url": "https://www.youtube.com/watch?v=WyHPyumEmSg",
    "time_now": "2021-11-02 22:59:21",
    "ups": "11215",
    "downs": "115",
    "views": "136975",
    "top_comments": [
        {
            "comment": "Want THREE (3) Masters booster boxes (2015, 2017, and Ultimate)? It's the Triple Masters giveaway! Just donate in multiples of $4.00 to Trans Lifeline below and I will send one donor ALL THREE boxes on Oct 30 at 6pm PST! I'll mail worldwide! But there's also 45 additional MTG prizes going out to 45 additional donors! You can see the full list here: https://twitter.com/TolarianCollege/status/1454226004130426884?s=20 and you just need to donate in $4 multiples. Each $4 is another chance to get a cool prize! Donate---> https://secure.givelively.org/donate/trans-lifeline/tolarian-community-college-1",
            "likes": 187,
            "number_of_replies": 6,
            "polarity": 0.2625,
            "subjectivity": 0.7333333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Reminiscent on SmallAnt's Argument about every Pokemon Move being a derivative of Dig.\n\"If you look closely enough at every pokemon move, it turns out that everything is just a derivative of Dig. Fly; It's just Bird Dig. Protect; It's just the first turn of Dig. Earthquake; It's just the second part of Dig. Flamethrower; It's just the second part of Dig, but fire type. Swords Dance; The first turn of Dig, but it raises your Attack, but to balance it out you can still get hit. What about Splash though? It's just like not using Dig.\"\nVery Enjoyable.",
            "polarity": 0.24375000000000002,
            "subjectivity": 0.41833333333333333
        },
        {
            "body": "Simic value engine with no real win con gets me every time.",
            "polarity": -0.26666666666666666,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "\"Ninjitsu?!\"\n\"It's just Kicker with extra steps\"\nGot me good with that one. The reference wasn't lost on me (as I fear it may have been for many).",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.4000000000000001
        },
        {
            "body": "fan·tas·tic",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Haste would like to know your address",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}