{
    "time_posted": "2021-10-30 14:24:01",
    "url": "https://www.youtube.com/watch?v=WyHPyumEmSg",
    "time_now": "2021-10-30 20:51:25",
    "ups": "6053",
    "downs": "55",
    "views": "52711",
    "top_comments": [
        {
            "comment": "Want THREE (3) Masters booster boxes (2015, 2017, and Ultimate)? It's the Triple Masters giveaway! Just donate in multiples of $4.00 to Trans Lifeline below and I will send one donor ALL THREE boxes on Oct 30 at 6pm PST! I'll mail worldwide! But there's also 45 additional MTG prizes going out to 45 additional donors! You can see the full list here: https://twitter.com/TolarianCollege/status/1454226004130426884?s=20 and you just need to donate in $4 multiples. Each $4 is another chance to get a cool prize! Donate---> https://secure.givelively.org/donate/trans-lifeline/tolarian-community-college-1",
            "likes": 108,
            "number_of_replies": 5,
            "polarity": 0.2625,
            "subjectivity": 0.7333333333333334
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "They said Kicker so many times, I don't even recognize the word anymore.",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "i had no idea what you meant by flying, but if its just Horsemanship or shadow, that makes sense",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "How about landfall? Or Revolt?\nOr Cascade? Or Exalted?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "delete this",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Honestly, after watching this video... Cleave should have just been Kicker.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "Oh god, I hate it.",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "Can I play verazol and use this argument? Haha",
            "polarity": 0.2,
            "subjectivity": 0.3
        },
        {
            "body": "What's her @ ? On right",
            "polarity": 0.2857142857142857,
            "subjectivity": 0.5357142857142857
        },
        {
            "body": "thing is you can cast cards for free via stuff like cascade and pay the kicker cost of spells cast, but stuff like overload you cant",
            "polarity": 0.4,
            "subjectivity": 0.8
        },
        {
            "body": "Cascade is no Kicker",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I've never soon George before, but damn he's entertaining, informative and somewhat charismatic.",
            "polarity": 0.5,
            "subjectivity": 0.85
        },
        {
            "body": "Hey Prof. Thank you for also pointing with your pinky and index. Makes me feel less weird.",
            "polarity": -0.3333333333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Flanking?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I have the same hoodie lol",
            "polarity": 0.4,
            "subjectivity": 0.4125
        },
        {
            "body": "Tue was maybe the best mtg video i have aeen in some time.  Well done",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I don't see how cycling is kicker",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey, Prof. I’ve been meaning to suggest something for awhile that I think you would be best at. Could you do a rundown on what to expect when moving from Arena to paper? I’ve gotten into the game over the past year or two through videos from you and others and now play Arena every day, but my paper experience consists of…let’s just say informal ‘games’ as a kid 20+ years ago. I’d love to build some decks and find a playgroup, but the idea is kind of intimidating, since arena takes care of everything for me, and I feel like I’d show up wildly unprepared and inadvertently annoy my opponents. Any tips on things for someone who’s only ever played Arena to expect and prepare for in that transition would be appreciated, and I’m guessing there are others in the same boat. Thanks!",
            "polarity": 0.2,
            "subjectivity": 0.42749999999999994
        },
        {
            "body": "Yes all the abilities are \"kicker\", this Is entwined with the mana cost of EVERY spell in the game, \"kicker\" as ability Is only the choice to cut some part of the card (less mana less effects)",
            "polarity": -0.18333333333333332,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "Mentor?",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}