{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-02 14:45:18",
    "ups": "1696",
    "downs": "36",
    "views": "20568",
    "top_comments": [
        {
            "comment": "FRAGRANCES FEATURED IN TODAYS VIDEO\r\nhttps://go.magik.ly/ml/1bhfz/\r\nhttps://go.magik.ly/ml/1bhgn/\r\nhttps://go.magik.ly/ml/1bhge/\r\nhttps://go.magik.ly/ml/1bhgl/\r\nhttps://go.magik.ly/ml/1bhgs/",
            "likes": 8,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "One of my top ten fragrance. Got one from my ex when it first came out. Armani makes most of my favorites.",
            "polarity": 0.3125,
            "subjectivity": 0.3333333333333333
        },
        {
            "body": "Never owned ADG Original but aware of its reputation, it has been on my to-get list.",
            "polarity": 0.3125,
            "subjectivity": 0.5
        },
        {
            "body": "I would like to be entered! I have not used ADG before but would like to have that for the next year and warmer days the rest of this year.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I love ADG, it was my teenage signature scent, but upgraded to Profumo years ago. I'd love to revisit where it all started!",
            "polarity": 0.375,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I found a half full bottle of 100 ML ADG at a garage sale for $20 about 10 yrs ago. Used it everyday until it ran out. Was my absolute favorite until I started trying other scents.",
            "polarity": 0.09305555555555556,
            "subjectivity": 0.5986111111111111
        },
        {
            "body": "ADG Profondo is my signature scent. I’d love to have the OG in my collection. Please enter me in the contest.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I’d like to be entered into the giveaway. Never smelled the original. Have tried Profumo and Profundo but wasn’t a fan of either.",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "I've never owned AdG but I've tried it recently with a sample and way back in the day at the mall, one of the first scents I tried when I was like 11 when it was new. I remember it rocking the fragrance world. All the 'rich' kids had it. I'd love to have the bottle.",
            "polarity": 0.2102272727272727,
            "subjectivity": 0.39797979797979793
        },
        {
            "body": "I would like to try ADG, since its a anysituation fragrance and I just started collecting fragrances, I would like to try ADG and I believe it might  become one of my signature scent",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Would love to join the giveaway and finally add adg to my routine!",
            "polarity": 0.25,
            "subjectivity": 0.8
        }
    ]
}