{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-31 21:32:56",
    "ups": "1538",
    "downs": "32",
    "views": "17993",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Definitely rocked adg back in the day. Not for years, unfortunately. Profumo is fantastic imo. Thanks for great content as always.",
            "polarity": 0.15000000000000002,
            "subjectivity": 0.5583333333333333
        },
        {
            "body": "I miss Acqua di Gio. I wore it for years as well and it was my gateway into this hobby. I’d love to be entered and be reunited with that fragrance.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I had bottle Aqua Di Gio a few years ago. It was one of the many things that was stolen from my car. I only wore if a handful of times and I loved it.",
            "polarity": 0.25,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "great video as usual, would be awesome to get your perspectivenon cool weather frags that can be worn in the heat (im a Floridian) never got my hands on ADG thi",
            "polarity": 0.475,
            "subjectivity": 0.6625
        },
        {
            "body": "Never worn aqua di gio always wanted to try it , only ever worn a smell alike",
            "polarity": 0.0,
            "subjectivity": 1.0
        },
        {
            "body": "ADG was my signature in my early 20s. Rocked it heavy back in the day. Appreciate the offer of the giveaway.",
            "polarity": -0.03333333333333333,
            "subjectivity": 0.26666666666666666
        },
        {
            "body": "I have never even smelled the og adg, i know its a reason to hate me. Never felt like smelling it because i know how profondo and profumo smells but still would be hyped to add this to my collection",
            "polarity": -0.8,
            "subjectivity": 0.9
        },
        {
            "body": "I would love to be entered into the giveaway! I've wanted to but acqua di gio for a long ti.e but haven't gotten around to it. When I was 15 I wore this body spray that said I spired by acqua di gio and I loved it. Wore the absolute heck out of it. From then on I was always interested in acqua di gio and have always wanted to wear it. Thanks for doing these giveaways, you rock!",
            "polarity": 0.32916666666666666,
            "subjectivity": 0.5666666666666668
        },
        {
            "body": "I haven't owned it but its on my short list",
            "polarity": 0.0,
            "subjectivity": 0.3
        },
        {
            "body": "I would like to enter the giveaway, I've tried clons of the ADG but not ADG itself, but I'm sure the real OG is something else.",
            "polarity": 0.35,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "Never worn the OG but I love AdG Profumo!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Oh the OG is almost empty please enter me thanks",
            "polarity": 0.05,
            "subjectivity": 0.35
        },
        {
            "body": "I have never worn Aqua de Gio but I would absolutely love too!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Adg has been my favorite scent to wear. If I could only wear one I would definitely be what I pick",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Just thought I should mention..I watched with captions and I did rock Awkward Joe back in the day",
            "polarity": -0.3,
            "subjectivity": 0.5
        }
    ]
}