{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-01 09:54:20",
    "ups": "1599",
    "downs": "35",
    "views": "19092",
    "top_comments": [
        {
            "comment": "I’d like to enter the giveaway.I’ve worn clones of ADG when I was very young as I did not have money for the real thing, and by the time I grew up I started using other scents so I never owned one. It would be nice to have it in the collection ✌️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.20124999999999998,
            "subjectivity": 0.5487500000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Never rocked the Armani. Would like to try it!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I’d like to be entered I’ve never smelled adg so I’d like to smell it \n\nThanks for the opportunity",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "Never tried it always great vids was so impressed to finally hear someone say (you) forget the season thing forget the age thing if you like it then wear it. Yeah someone finally said it ! You rock keep up the great vids.",
            "polarity": 0.52,
            "subjectivity": 0.9
        },
        {
            "body": "Hi Ash!\nThanks for this video - I really enjoyed. \nI would love to try ADG and enter the giveaway.\nAs you said it’s your most complimented fragrance and I would like to proof this 😁\n\nCheers",
            "polarity": 0.425,
            "subjectivity": 0.5
        },
        {
            "body": "I’d like to enter the giveaway.I’ve worn clones of ADG when I was very young as I did not have money for the real thing, and by the time I grew up I started using other scents so I never owned one. It would be nice to have it in the collection ✌️",
            "polarity": 0.20124999999999998,
            "subjectivity": 0.5487500000000001
        },
        {
            "body": "I would really like to be entered in this giveaway. I have been wanting to add aqua di geo in my collection cause I really like how it smells. In fact, I am wearing the oil based ADG right now which I got as a gift yesterday. And I would be more than happy if I got chance to win the original flanker and add it too my collection :)",
            "polarity": 0.4575892857142857,
            "subjectivity": 0.5732142857142857
        },
        {
            "body": "I would like to enter the giveaway, I've tried clons of the ADG but not ADG itself, but I'm sure the real OG is something else.",
            "polarity": 0.35,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        }
    ]
}