{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-01 01:40:23",
    "ups": "1567",
    "downs": "32",
    "views": "18471",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Acqua di Gio is fantastic but the performance not much. overall I like I have nostalgia with this perfume.",
            "polarity": 0.2,
            "subjectivity": 0.45
        },
        {
            "body": "I have never rocked any Aqua Di Gio ! my brother has one but I have not I would love to win!",
            "polarity": 0.75,
            "subjectivity": 0.5
        },
        {
            "body": "I’d love to be entered in the give away I’ve never owned or smelt the original ADG despite own ADG profumo would love the opportunity to win and finally smell the best selling fragrance of all time",
            "polarity": 0.5392857142857144,
            "subjectivity": 0.6642857142857143
        },
        {
            "body": "Please put me in raffle. I always love the ADG. great stuff.",
            "polarity": 0.65,
            "subjectivity": 0.675
        },
        {
            "body": "Hey Ash I'd like to be entered, and We all appreciate you doing these give aways. Stay blessed everyone",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I rocked, and still rock the OG AdG. My first bottle from the late 90’s lasted me 10 years since I alternated between this, Cool Water and the OG D&G Light Blue. I used to wear all three of these year round . Now I have a 300ml of AdG that gets love just during the summer now…",
            "polarity": 0.14285714285714285,
            "subjectivity": 0.48333333333333334
        },
        {
            "body": "I never owned a bottle of AdG but I would like to win one :)",
            "polarity": 0.65,
            "subjectivity": 0.7
        },
        {
            "body": "I’ll be wearing spicebomb night vision edt in the cold 🥶",
            "polarity": -0.6,
            "subjectivity": 1.0
        }
    ]
}