{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-01 14:01:54",
    "ups": "1616",
    "downs": "35",
    "views": "19286",
    "top_comments": [
        {
            "comment": "I’d like to enter the giveaway.I’ve worn clones of ADG when I was very young as I did not have money for the real thing, and by the time I grew up I started using other scents so I never owned one. It would be nice to have it in the collection ✌️",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.20124999999999998,
            "subjectivity": 0.5487500000000001
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Recently got into fragrances but I’ve got to smell ADG and a few of its flankers and they’ve been amazing. Having a bottle of the original for myself would be great.",
            "polarity": 0.31500000000000006,
            "subjectivity": 0.55
        },
        {
            "body": "Hi Ash, I’ve never owned ADG, but I would love to add this classic to my collection! I appreciate the giveaway opportunity!",
            "polarity": 0.3802083333333333,
            "subjectivity": 0.3833333333333333
        },
        {
            "body": "I am only starting to collect fragrances... I have never worn acqua di gio before, infact its not easily accessible at retail here in south africa. Hopefully i get to own one someday",
            "polarity": 0.103125,
            "subjectivity": 0.61875
        },
        {
            "body": "My dads favourite fragrance!I used to steal some of his when i was younger and didnt own any fragrance of my own.",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "I would like to enter the giveaway. Personally i have never owned ADG but i would love that to change.I've heard great things about it. My fragrance collection is pretty small and the addition of ADG in it would be amazing!",
            "polarity": 0.34166666666666673,
            "subjectivity": 0.6583333333333333
        },
        {
            "body": "Love the Acqua do Gio DNA Profondo is my signature scent. Wouldn’t hurt to have the OG back in my rotation !",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "I purchased ADG Profundo 3 months ago and love it. I'd like to try the the original and compare the two.",
            "polarity": 0.4375,
            "subjectivity": 0.675
        },
        {
            "body": "Acqua Di Gio is a parfume that match with my country Indonesia that have tropic weather",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Man....last time I rocked it was 99...I would love it again...if I don't win..I might just buy me one",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I can say I’ve never owned or smelled Aqua Di Gio , well maybe unknowingly smelled it. That being said I’ve herd that it is amazing just haven’t picked up a bottle yet to try.",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "I’d like to be entered.  Wore this back in the late 90’s.  These days only have Profumo and Profondo so adding again would be great.  Thanks",
            "polarity": 0.13999999999999999,
            "subjectivity": 0.51
        },
        {
            "body": "Great giveaway. Wore ADG many, many years ago. Nearly everyone loves this scent 👍",
            "polarity": 0.47500000000000003,
            "subjectivity": 0.5375
        }
    ]
}