{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-31 00:58:24",
    "ups": "1147",
    "downs": "25",
    "views": "11996",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Ash, I've gotta say I have taken your advice on many fragrances, and I haven't been disappointed yet!. Cheers! I haven't worn AdG before, and my local stores rarely have a tester available. Please enter me in the draw :)",
            "polarity": 0.11666666666666665,
            "subjectivity": 0.5916666666666667
        },
        {
            "body": "Watch your channnel …you are the best …at 60 yrs. old living in God’s Waiting Room(Florida)…my favorite scent …the one I wear almost on a daily basis is ADG ….running low…Xmas coming …and Grandkids need stuff..would appreciate a full bottle of G-pop juice….thanks again for your great vids",
            "polarity": 0.4583333333333333,
            "subjectivity": 0.4666666666666666
        },
        {
            "body": "I'd like to join the giveaway as well! ADG has been my signature scent since I started wearing fragrances in middle school and has never steered me wrong. As you said it works anytime, any situation, and I still love it to this day. Will likely be my scent of the day tomorrow now that I think about it.",
            "polarity": 0.0,
            "subjectivity": 0.625
        },
        {
            "body": "I rocked Aqua Di Gio for a little bit back in the early 2000's. It was my buddies signature scent and I always used a few sprays haha.",
            "polarity": -0.017499999999999995,
            "subjectivity": 0.24
        },
        {
            "body": "Those \"times\" or \"situations\" you referred to (Summer, Winter, etc.) are called \"seasons.\"  Glad to help.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Rocked the ADG bck in college...would love to be selected",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Yeah I would like to be entered in the giveaway! I own Profumo, but that incense doesn’t work that well in the intense heat and humidity of Florida… at least on my skin",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "I‘ve smelled it a bunch of times on different people, in the store, basically everywhere but never actually worn it myself. I quite like the scent tho. It makes sense why a lot of people like it!",
            "polarity": 0.0,
            "subjectivity": 0.35
        },
        {
            "body": "I wanna be a part of the giveaway, i've only tried this fragance in stores because i think its a little too expensive where i live, but i love it",
            "polarity": -0.010227272727272729,
            "subjectivity": 0.66
        },
        {
            "body": "I have never tried it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Of course ill love to enter the giveaway. I haven't sampled the original but i love profumo. The orignal would be a nice addition to my recent collection.",
            "polarity": 0.24583333333333335,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Would love to be entered in the conteat, I've never had the original Armani..I've had a sample of profondo..that I like",
            "polarity": 0.4375,
            "subjectivity": 0.675
        },
        {
            "body": "I have ADG profumo and I absolutely love the scent but I haven't tried the original. I would like to enter the giveaway.",
            "polarity": 0.4375,
            "subjectivity": 0.675
        },
        {
            "body": "ADG was my first ever fragrance! Started off my fragrance collection but is long gone and empty :( I’d love to own it again",
            "polarity": 0.08541666666666665,
            "subjectivity": 0.638888888888889
        },
        {
            "body": "I like to enter the giveaway i only have the clones adg would be perfect having the original",
            "polarity": 0.4583333333333333,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "I would like to be entered in the giveaway. I never owned any ADG fragrance.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "ADG I used when I was a teenager, then got the Perry Ellis dupe which had much better longevity (for me).  I ran out of that a year ago so could do with a replacement! :)",
            "polarity": 0.5625,
            "subjectivity": 0.75
        },
        {
            "body": "I have had Acqua di Gio but in a very different way. Before collecting fragrances, I used to have one signature scent per year and in 2019, that was Invictus. I was running low on that and wanted a change so agreed a swap with my brother for his Acqua di Gio (which is his favourite fragance and was also running low). I guess you would say I got an upgrade lol.",
            "polarity": 0.2,
            "subjectivity": 0.52
        },
        {
            "body": "Never had nor tried ADG... Wouldn't mind giving it a shot if I could get it for free. Haha :)",
            "polarity": 0.3666666666666667,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Aqua Di Gio is a classic, had it several times in my younger days. AMAZING FRAGRANCE!!!! Great suggestions Ash!!!",
            "polarity": 0.4333333333333334,
            "subjectivity": 0.36333333333333334
        }
    ]
}