{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-01 18:09:13",
    "ups": "1642",
    "downs": "35",
    "views": "19553",
    "top_comments": [
        {
            "comment": "I'd really like to win the giveaway!\nI'm italian so it's pretty common here to wear ADG as a signature.\nPersonally i don't have it, but i hope to add that to my collection :)",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.2357142857142857,
            "subjectivity": 0.4857142857142857
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Aqua di gio is the best!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "I've always wanted to add this fragrance to my collection, but everytime I find it discounted...I'm broke smh",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would like to enter the giveaway, I've tried clons of the ADG but not ADG itself, but I'm sure the real OG is something else.",
            "polarity": 0.35,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I have gotten a couple carded samples of the original Acqua Di Gio, and it's probably my wife's absolute favorite scent on me. I own, and absolutely love, Profumo. But haven't gotten around to purchase in the original yet which I really need to because, I'm not kidding, my way wife loves the stuff.\nSo I would love to win this. And I just celebrated my 12-year wedding anniversary, so it would be perfect.",
            "polarity": 0.49090909090909085,
            "subjectivity": 0.7227272727272728
        },
        {
            "body": "I have many fresh Scents but ADG is still missing",
            "polarity": 0.20000000000000004,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "I would like to be entered in the giveaway. I was gifted a bottle of ADG years ago but never rebought it. It would be neat to try it again.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "I have personally only tried ADG but have never owned a bottle myself. Love your videos and keep up the great work!!",
            "polarity": 0.5,
            "subjectivity": 0.7833333333333333
        },
        {
            "body": "In fact I’m in love with it, but never bought it before. I would like to have it in my collection.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I would like to be entered for the giveaway. I have never rocked aqua di gio, but I'm certainly down to!",
            "polarity": -0.19444444444444448,
            "subjectivity": 0.2888888888888889
        },
        {
            "body": "I'd really like to win the giveaway!\nI'm italian so it's pretty common here to wear ADG as a signature.\nPersonally i don't have it, but i hope to add that to my collection :)",
            "polarity": 0.2357142857142857,
            "subjectivity": 0.4857142857142857
        },
        {
            "body": "Count me in for the giveaway Ash! I used Acqua Di Gio a long time ago, never as a signature scent though. I have ADG Profumo now, and absolutely love it",
            "polarity": 0.225,
            "subjectivity": 0.5
        },
        {
            "body": "Yes I would love to be entered in the giveaway. I have not tried or smelled the Original ADG. I do and wear Profumo and Profondo. Profumo is my favorite. Profondo was purchased through recommendation from You Ash. Thanks by the way!😅 U certainly know your stuff.",
            "polarity": 0.3578571428571428,
            "subjectivity": 0.6242857142857143
        },
        {
            "body": "First love, wore it for years after going through 2 50ml and then 3 of the 3.4oz and then the 6.7oz. Never threw away any of the bottles because it's nostalgic for me now. Also currently rock the EDP. The perfect fragrance.",
            "polarity": 0.25,
            "subjectivity": 0.6666666666666667
        },
        {
            "body": "I have only tried ADG once and I loved it but never had the chance to buy it. Would be nice to win it.",
            "polarity": 0.5249999999999999,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "I ROCKED Aqua Di GIO for years. I still wear it on occasion now. I could always use a backup bottle.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I loved ADG back in the day, like you Ash I'd wear it everywhere",
            "polarity": 0.35,
            "subjectivity": 0.4
        },
        {
            "body": "Last year a friend of mine gifted me a bottle of adg and I finished in 2 months",
            "polarity": 0.25,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Never tried the original but I am currently rocking Profumo",
            "polarity": 0.1875,
            "subjectivity": 0.575
        }
    ]
}