{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-31 17:25:42",
    "ups": "1508",
    "downs": "32",
    "views": "17461",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I used to wear ADG as my scent in High School. It was my first real cologne with Chrome by Azzaro 🔥",
            "polarity": 0.20333333333333337,
            "subjectivity": 0.39111111111111113
        },
        {
            "body": "Intrigued to own it... 😊😋",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "I had never had ADG. But already tried and found it great.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Never had a perfume from the ADG line.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'm almost embarrassed to admit that I have neither owned or smelled Acqua di Gio. If I win..that will all change..:)",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Enter me into the giveaway. I’ve never worn Acqua do gio.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Love the ADG line, except for absolu instinct and absolu is meh but not bad. I wear the OG from time to time but have only had travel size bottles. I wear profumo and profondo all the time. To be honest I'd wear the OG a lot more if I had a bigger bottle of it. I'm guilty of buying things at full retail a lot because once I smell something at Macy's that I want, it's hard to wait when I could leave with it then.",
            "polarity": 0.16759259259259257,
            "subjectivity": 0.6953703703703703
        },
        {
            "body": "I have never worn ADP but I have smelled the Profumo version at Sephora and it was amazing. I would love to be entered into this giveaway and hopefully I can win so I can try out the OG fragrance.",
            "polarity": 0.6333333333333334,
            "subjectivity": 0.6333333333333333
        },
        {
            "body": "I love Armani fragrances. Please enter me in this giveaway. I have worn this many times I love the plum dry down.",
            "polarity": 0.25555555555555554,
            "subjectivity": 0.5177777777777778
        },
        {
            "body": "I have never even smelled this fragrance or any Armani ones I cannot afford them but I would love to have this if I won. I would love to be entered into this giveaway.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I have only worn Acqua Di Gio Profumo but I would love to be entered into this giveaway to try out the original one if I win.",
            "polarity": 0.41875,
            "subjectivity": 0.6875
        },
        {
            "body": "I owned it at one point. It was very played out that I moved in to something else,  but now it’s nice to bring it out every now and then.",
            "polarity": 0.4,
            "subjectivity": 0.65
        },
        {
            "body": "Never had the original ADG, I think it would be cool to own",
            "polarity": 0.44166666666666665,
            "subjectivity": 0.7999999999999999
        },
        {
            "body": "Morphin Giveaway Time: AdG bottle winner!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Oh yeah..greatness in the making!!! # aquaGio",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey Ash, hope your doing well. Would love a bottle of ADG. It such an amazing scent I used to wear it before I got into fragrances. Compliment king I agree!",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Never tried the og adg, i have profumo tho and love it",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "artisan pure is like 60 bucks at discounters? that can't be worth it can it? isn't varvatos cologne known for not lasting all that long?",
            "polarity": 0.11607142857142856,
            "subjectivity": 0.25
        },
        {
            "body": "I used to wear Guerlain l'homme ideal cool in the cold, and i never had Acqua di Gio",
            "polarity": 0.21666666666666667,
            "subjectivity": 0.8833333333333333
        },
        {
            "body": "I am out of my Adg Og...I had a 30mm from a friend but it's all gone now...I wear perry Ellis red 360...now 😅😅😅",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}