{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-31 09:11:55",
    "ups": "1372",
    "downs": "31",
    "views": "15290",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I've never tried the fragrance, only been collecting for a few months.",
            "polarity": -0.1,
            "subjectivity": 0.55
        },
        {
            "body": "I have tried only Aqua Fi gio Profumo,and not the original.",
            "polarity": 0.1875,
            "subjectivity": 0.875
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I would love to add ADG to my collection, I don’t have it yet, thanks",
            "polarity": 0.35,
            "subjectivity": 0.4
        },
        {
            "body": "I don't need to win the ADG, because a couple of older dudes in my workplace overdid it for me, and I've become a Mont Blanc geek, so I'm really just here to say I appreciate you highlighting Legend Spirit. That's my jam, even though I wish it had more longevity.",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.35833333333333334
        },
        {
            "body": "I'd like to be entered in the contest. Never tried Acqua di Gio. Here's to getting that bottle!🍀😆",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I wanted to buy a full bottle, because I have a Sample and it smelled amazing. On Just one day I became three Compliments! So, I really need a full bottle.",
            "polarity": 0.4125,
            "subjectivity": 0.55
        },
        {
            "body": "I never owned or smelled the OG AdG, i smelled only flankers like Profumo which i love. I would be very curious of how this one smells in cold weather situation.",
            "polarity": -0.057499999999999996,
            "subjectivity": 0.9
        },
        {
            "body": "I love wearing Acqua di Gio! One of my favorite fresh fragrances!",
            "polarity": 0.5,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "I’d like to be entered to win the ADG bottle, I really enjoy watching reviews from the channel!",
            "polarity": 0.65,
            "subjectivity": 0.45
        },
        {
            "body": "I like to Join the giveaway,i have a mini size ADG\" manly clonnes of it like PE'360\"Red..exc.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I only tried AdG but would love to wear it more!",
            "polarity": 0.375,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "I wore adg until I moved to the flankers. I need to revisit the original",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "Got the profumo enter me,would rock it all the time.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd like to be entered into the giveaway. Never smelled the og, only the Profondo & Profumo, so would love to own the one which started it all. \nAs always thanks for the opportunity Ash from Gents Scents 🙌🏻🙌🏻",
            "polarity": 0.325,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "I had a shipmate friend when I was in the navy which he rocked gio as his sig scent . I've always liked the scent just never bought it, maybe I couldn't afford it then",
            "polarity": 0.6,
            "subjectivity": 0.8
        },
        {
            "body": "ADG was my first scent as well, my grandparents got it for me when i was 12. Still have a tiny bit left of my original bottle. hope i can win a new one lol.",
            "polarity": 0.3373376623376623,
            "subjectivity": 0.44826839826839826
        },
        {
            "body": "I've actually never owned it, but would love to try it",
            "polarity": 0.25,
            "subjectivity": 0.35
        },
        {
            "body": "Always liked aqua di gio had a few testers but never bought it because I couldn’t cough up the cash and bought cheapies instead.. hoping I can get it finally🙏",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.45
        },
        {
            "body": "I haven't smelled aqua di gio in my life. The reason is that I would like to spend 80 bucks on something else instead of aqua di gio. I am not saying it's a bad scent because I haven't smelled it. But I was thinking that instead of spending on aqua si gio I can spend it on something better than aqua di gio. That's the reason I haven't smelled aqua di gio. It would be great if I get a chance to smell it. And I will be lucky by having a chance of winning the giveaway. Thanks 😊",
            "polarity": 0.27222222222222225,
            "subjectivity": 0.6166666666666667
        }
    ]
}