{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-30 16:46:11",
    "ups": "532",
    "downs": "13",
    "views": "2658",
    "top_comments": [
        {
            "comment": "FRAGRANCES FEATURED IN TODAYS VIDEO\r\nhttps://go.magik.ly/ml/1bhfz/\r\nhttps://go.magik.ly/ml/1bhgn/\r\nhttps://go.magik.ly/ml/1bhge/\r\nhttps://go.magik.ly/ml/1bhgl/\r\nhttps://go.magik.ly/ml/1bhgs/",
            "likes": 5,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "FRAGRANCES FEATURED IN TODAYS VIDEO\r\nhttps://go.magik.ly/ml/1bhfz/\r\nhttps://go.magik.ly/ml/1bhgn/\r\nhttps://go.magik.ly/ml/1bhge/\r\nhttps://go.magik.ly/ml/1bhgl/\r\nhttps://go.magik.ly/ml/1bhgs/",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would love to win this fragrance to help complete my collection. I had it back in the days but my girlfriend loved it so much that she used it more than I did",
            "polarity": 0.4,
            "subjectivity": 0.4142857142857143
        },
        {
            "body": "I would like ADG because currently I don’t have any fragrances. Everyday I peel an orange and lime and rub the rinds all over my neck and body. For a nice dry down, I chop wood and rub it on me as well. My body is covered in splinters. Please send me ADG",
            "polarity": 0.03555555555555555,
            "subjectivity": 0.5777777777777777
        },
        {
            "body": "I never rocked Acqua Di Gio",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I have rocked the original and it's a masterpiece,  to own Aqua di Gio again would make me beyond happy.",
            "polarity": 0.5916666666666667,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "I would LOVE to be entered in the giveaway, ADG the classic banger. Where I live I can get plenty of wear out of it in Md",
            "polarity": 0.2676767676767677,
            "subjectivity": 0.4222222222222222
        },
        {
            "body": "Definitely used Aqua di gio",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I would like to win the giveaway. I’ve tried ADG before but never owned a bottle.",
            "polarity": 0.8,
            "subjectivity": 0.4
        },
        {
            "body": "I owned a bottle when it first came out and loved it. \nThen picked up a bottle a few years ago and was sadly disappointed. It’s not what it used to be. \nStill, pick me! I’d love a new bottle. Ha!",
            "polarity": 0.08049242424242424,
            "subjectivity": 0.5063131313131314
        },
        {
            "body": "Leaving comment below...\nComment 🤨\nNever smelled it. Never owned it.. Thought about it but...",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd like to enter, had a bottle in 98",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Had the ADG a few years back, and it's always on my wish list",
            "polarity": -0.1,
            "subjectivity": 0.05
        },
        {
            "body": "Happy to see Mugler Cologne here. Indeed works well in the cold, in fact imho it's signature scent material. Anyone who just wants one and only only fragrance all year round for everything should definitely try it. Ultimate versatility, one of the most easy to wear, never wrong, likeable, least offensive clean fragrances of all time.\nBy the way even if called Mugler Cologne Come Together now, in Spain I've seen the 300ml bottles back in stores. Here in Germany I have not seen those yet though, unfortunately. Online it can be purchased for around €60, that brings its cost per ml to one of the best values among all fragrances, even beating many/most cheapies.",
            "polarity": 0.121875,
            "subjectivity": 0.6645833333333333
        },
        {
            "body": "ADG OG is my first favorite fragrance. But I cant afford it because Im a student so I just went with inspired scent fragrances. I always buy ADG on those inspired scent stores. Hope to win this giveaway so I can finally own a real bottle of ADG. ❤️",
            "polarity": 0.47000000000000003,
            "subjectivity": 0.6066666666666667
        },
        {
            "body": "I would like to enter the giveaway, I have never rocked an Acqua Di Gio myself but I do love this fragrance",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I never owned a bottle of \"\"Acqua DE GeeoO\"\"..    I was either looking to get the OG or Profondo as my first real Armani fragrance.",
            "polarity": 0.225,
            "subjectivity": 0.31666666666666665
        },
        {
            "body": "Used to wear it in high school 95-96\nI'd like to be entered into the giveaway",
            "polarity": 0.16,
            "subjectivity": 0.5399999999999999
        },
        {
            "body": "I've tried the acqua di gio and to me that's the most masculine fresh perfume ever made",
            "polarity": 0.3,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "Aqua Di Gio is an oldie but a goodie but some might say the same about me. It’s still worth rocking! Please enter me in the giveaway.",
            "polarity": 0.1875,
            "subjectivity": 0.1125
        },
        {
            "body": "I only wore Aqua in middle school so idk what it smells like lol",
            "polarity": 0.26666666666666666,
            "subjectivity": 0.5666666666666667
        }
    ]
}