{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-02 06:31:00",
    "ups": "1683",
    "downs": "35",
    "views": "20216",
    "top_comments": [
        {
            "comment": "FRAGRANCES FEATURED IN TODAYS VIDEO\r\nhttps://go.magik.ly/ml/1bhfz/\r\nhttps://go.magik.ly/ml/1bhgn/\r\nhttps://go.magik.ly/ml/1bhge/\r\nhttps://go.magik.ly/ml/1bhgl/\r\nhttps://go.magik.ly/ml/1bhgs/",
            "likes": 8,
            "number_of_replies": 1,
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "just smeeled this master peice recently but it's out of my budget",
            "polarity": 0.0,
            "subjectivity": 0.25
        },
        {
            "body": "I would love to enter the giveaway! I actually haven’t worn the OG! I own Profumo and have sampled Profondo, both of which are fantastic. Thank you to Ash, Macy’s, and Armani for this opportunity!",
            "polarity": 0.43125,
            "subjectivity": 0.65
        },
        {
            "body": "I’d like to be entered in the adg giveaway this scent is just clean and great can never go wrong sadly I don’t own it in my collection no more since I’ve used up my old bottle",
            "polarity": 0.0880952380952381,
            "subjectivity": 0.7214285714285714
        },
        {
            "body": "I’ve never rocked ADG yet but have always wanted to try it.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "i wish could rock adg, my dad used to wear it alot and every time i go to the mall i get a refresher into the scent.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd like to be entered into the give away. I have a decant of aqua di gio, and a full size bottle of profondo.  I also have perry ellis 360 red 😆\n\nThanks!",
            "polarity": 0.19999999999999998,
            "subjectivity": 0.25
        },
        {
            "body": "Ofcourse I’ve wore ADG .. I thought we all did at some point .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would love to enter the giveaway, my brother rocks Perry Ellis 360 red and I absolutely love it, but I have never tried ADG. Thank you Ash for the opportunity.",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.39999999999999997
        },
        {
            "body": "I would like to enter the giveaway, I've tried clons of the ADG but not ADG itself, but I'm sure the real OG is something else.",
            "polarity": 0.35,
            "subjectivity": 0.5944444444444444
        },
        {
            "body": "Never worn adg before but I definitely want to get my hands on it",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "My goodness that Aqua Di Gio brings back such amazing memories my mother bought for me for Christmas many of years ago when came out.  I couldn’t have been more than 20 years of age and I loved it that much that I used it sparingly normally when i was taking a girl out to the city and honestly I mostly wore in winter smelt great off my sweaters.  Not knowing much back in those days did not realize it would expire.  i had it for more than 20 years before throwing the bottle away by that time was shot lol \n\nI may go buy a bottle in a paycheck or two thanks for reminding me how great it is 👏👏👏",
            "polarity": 0.4166666666666667,
            "subjectivity": 0.49666666666666676
        }
    ]
}