{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-10-31 05:05:04",
    "ups": "1293",
    "downs": "30",
    "views": "13966",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Never owned it. But would be nice to. 🙏🏻",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "I’ve heard a lot about adg I would like to try it",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I’d like to enter the giveaway. AdG was my very first fragrance purchase and I have some great memories. Haven’t worn it in ages though and no longer own a bottle.",
            "polarity": 0.5750000000000001,
            "subjectivity": 0.7277777777777779
        },
        {
            "body": "Have been using it since my teen",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I'd love to be entered in the giveaway. I never tried this warm fragrance classic Acqua Di Gio only the profumo i tried. Would love to give a try on it if lucky to won.",
            "polarity": 0.35000000000000003,
            "subjectivity": 0.6333333333333334
        },
        {
            "body": "I've never tried the original, however profumo is one of my signature go tos",
            "polarity": 0.375,
            "subjectivity": 0.75
        },
        {
            "body": "I didn't know aqua di gio would work in fall and winter! I have the shower gel and deodorant as well.  I gotta pull it back out the closet.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I would love to get the original ADG back in my collection",
            "polarity": 0.2916666666666667,
            "subjectivity": 0.45
        },
        {
            "body": "I owned it back in my high school days",
            "polarity": 0.08,
            "subjectivity": 0.26999999999999996
        },
        {
            "body": "Artisan pure and doir sauvage is killer",
            "polarity": 0.21428571428571427,
            "subjectivity": 0.5
        },
        {
            "body": "Never worn or even smelled ADG before but I’d love to have it. Would be amazing if I won it thx 🤓",
            "polarity": 0.55,
            "subjectivity": 0.75
        },
        {
            "body": "No, I've never worn - not even tried - the original Acqua di Giò!",
            "polarity": 0.46875,
            "subjectivity": 0.75
        },
        {
            "body": "I've sampled ADG and like it quite a bit, but I've never owned a bottle.  Thanks for entering me in the giveaway.",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "I've never worn ADG but definitely want to try it out after watching this video !",
            "polarity": 0.0,
            "subjectivity": 0.5
        },
        {
            "body": "I’ve rocked it couple of times with ADG. Still a great fragrance today.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "back in the day, i Never rocked coz my friends were wearing it😇i’d love to have it now though",
            "polarity": 0.25,
            "subjectivity": 0.3
        },
        {
            "body": "ADG was the first fragrance I ever wore, I would spray on some for junior high. I would always take my dad’s bottle lol",
            "polarity": 0.4033333333333333,
            "subjectivity": 0.5244444444444444
        },
        {
            "body": "I actually never owned a ADG perfume! Lol, weird cause I live in Florida. However, I do love the scent of it!",
            "polarity": 0.2122727272727273,
            "subjectivity": 0.58
        },
        {
            "body": "I agree with the theme of the video. I have used a freshy  in a climate controlled environment and the smell still nice. \nThe closest I've had to ADG(I have only tried it) is Armaf Bleu Home. I would like to be entered for the giveaway of the real thing.\nThanks!",
            "polarity": 0.2625,
            "subjectivity": 0.625
        },
        {
            "body": "I have never worn adg but I've always wanted to try. It checks all the boxes for what I look for in a fragrance. And with winter coming up it would be awesome to give it a try in the colder months!",
            "polarity": 1.0,
            "subjectivity": 1.0
        }
    ]
}