{
    "time_posted": "2021-10-30 14:00:11",
    "url": "https://www.youtube.com/watch?v=X1ISQ_LyoAE",
    "time_now": "2021-11-01 05:47:27",
    "ups": "1584",
    "downs": "35",
    "views": "18820",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Rocked the original back in 1996! Now I've moved on to Aqua di gio purfumo and Profondo!",
            "polarity": 0.1875,
            "subjectivity": 0.375
        },
        {
            "body": "Never wear that,im really new in frag game,i hope i can get that someday🙏🏽",
            "polarity": 0.13636363636363635,
            "subjectivity": 0.45454545454545453
        },
        {
            "body": "Believe it or not, have only ever smelled the flankers from the ADG line! Would love to give myself a history lesson and check out the original!👌🏻",
            "polarity": 0.25,
            "subjectivity": 0.8
        },
        {
            "body": "Man, I used to shower with ADG and hit salsa parties from 2010 to 2015, huge success with the ladies!!! Then I discovered AVENTUS 😏😏😏",
            "polarity": 0.49296875000000007,
            "subjectivity": 0.45
        },
        {
            "body": "I would like to be entered. Actually, I've never smelled the original ADG, but I love Profondo, so it would be nice to wint that bottle and give the OG a try.",
            "polarity": 0.36875,
            "subjectivity": 0.6125
        },
        {
            "body": "I have never worn Aqua Di Gio, but I own Perry Ellis Red and I love Profomo.  So I'm crazy for that DNA and look forward to a possible addition to that collection.",
            "polarity": 0.10000000000000002,
            "subjectivity": 0.7
        },
        {
            "body": "I will definitely check Artisan Pure and Chrome Aqua. Need some freshies for my cold season rotation. Thanks for the awesome review Ash!",
            "polarity": 0.16285714285714287,
            "subjectivity": 0.64
        },
        {
            "body": "I would like to be entered. I have actually never owned the original",
            "polarity": 0.1875,
            "subjectivity": 0.425
        },
        {
            "body": "I’ve never rocked Acqua Di Gio the original. I only have Profumo in the line. But it would always be great to have another dumb reach in the collection",
            "polarity": 0.2,
            "subjectivity": 0.75
        },
        {
            "body": "Love Acqua di Gio!",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "I have never owned the OG AdG, but I have Profumo and Profondo. I have always wanted to add this to the collection.",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}