{
    "time_posted": "2021-10-30 13:00:14",
    "url": "https://www.youtube.com/watch?v=XmD0eg0vzh0",
    "time_now": "2021-11-01 09:54:24",
    "ups": "5834",
    "downs": "44",
    "views": "106475",
    "top_comments": [
        {
            "comment": "Amanda new age women's angles yes age new Glen Hunt New angles growing up yes growing up yes new age angles Aiden New age growing up yes earth new Age Eartha new angles age growing up training Liam new age growing training Liam new age growing up yes Jude new age growing up yes new angles age growing up yes new family friends have fun play special sleepover yo yo new William new house cousins angles new age growing up training and Miller family new training age new age Yvonne hunt new age growing up yes women's angles growing up yes new family friends have fun Glen Hunt New age Growing upNew both Jude new new age growing growing ilam new age growing up yes new training ilam new age growing up yes new Keary angles growing up new age",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1546320346320346,
            "subjectivity": 0.44147186147186157
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "I may have missed it since I enjoy watching your videos while I get ready for the day, but are the fur babies staying in the RV with you until they get accustomed to the outdoors at the new home?",
            "polarity": 0.24545454545454548,
            "subjectivity": 0.48484848484848486
        },
        {
            "body": "Liam and Ethan are so funny together",
            "polarity": 0.25,
            "subjectivity": 1.0
        },
        {
            "body": "Love rainbows 🌈",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Amanda~ Oh I can SO relate to all these feelings. We are at the beginning of our journey so similar to yours.  We sold our home in Oregon and we're moving this weekend to TN. We're a family of 8 and we homeschool but would like to have our kids in school once we're settled. I just found your channel and its been so neat to watch your journey. You're an amazing mom to all your kids and I love your heart for adoption. God bless!",
            "polarity": 0.4083333333333334,
            "subjectivity": 0.6333333333333333
        }
    ]
}