{
    "time_posted": "2021-10-30 13:00:14",
    "url": "https://www.youtube.com/watch?v=XmD0eg0vzh0",
    "time_now": "2021-10-30 16:46:16",
    "ups": "2425",
    "downs": "24",
    "views": "21811",
    "top_comments": [
        {
            "comment": "Hey Stephen, cover that pipe with mulch or something as a temp solution so no one trips over it and gets hurt. Just saying. You trust Lincoln with the girl but she needs her face blurred out! Hah ha, Lincoln's lip smudges on the lens, lol.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.8,
            "subjectivity": 0.7
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "pls Videos in 4k!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I cannot figure out why you keep pairing Liam with Ethan. There is a five year age difference and a huge maturity difference. Liam should be hanging with the older kids and not with an eight year old child, just because he is small in stature. There is a huge difference in an eight year old and a 14 year old. Not tormenting a maturity level.",
            "polarity": 0.14523809523809525,
            "subjectivity": 0.4476190476190477
        },
        {
            "body": "squid game costumes…",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "HI MILLER FAM! So sad to see the house so empty. ☹ 🥺 But So happy you guys are finally moving to your own place. Praying for a very soon well moving day and hoping there be no inconvenient that will ruin anything. Very fustrating to move on rainy days because sometimes it's hard to have much motivation to do anything when the weather is not helping. But stay safe and God bless you all. Sending love from Puerto Rico 🇵🇷",
            "polarity": 0.20069444444444443,
            "subjectivity": 0.6618055555555555
        },
        {
            "body": "To be honest, I am very worried about you ... in front of winter ... I hope you will be comfortable there ... I love you ... good luck in a new place......I write through translator❤💛💙💜❤💛💚💙💜💋",
            "polarity": 0.4227272727272728,
            "subjectivity": 0.6090909090909091
        },
        {
            "body": "As a military family who homeschools… we always make our temporary houses “home” so that we are comfortable. And I always cry when we leave 😢. I cannot wait for the day that we have our forever home!! It’s a dream of ours to be settled. I am excited to see your new RV and the house when it’s done ❤️",
            "polarity": 0.2590909090909091,
            "subjectivity": 0.5261363636363636
        },
        {
            "body": "I m gonna miss this house of yours bcoz this house, it looked amazing..a good space,fireplace inside.. n beautiful nature vibes outside..\nBeautiful family in the beautiful house..💙",
            "polarity": 0.65,
            "subjectivity": 0.7300000000000001
        },
        {
            "body": "Though he struggles With language having an communication divice willl help. It's amazing how everyone helps.  Good luck in the new property.",
            "polarity": 0.4787878787878788,
            "subjectivity": 0.6515151515151515
        },
        {
            "body": "squid games!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Praying for everything will going well with the Millers' from Indonesia with love🥰🥰",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Did Steven has his nose pierced. Looks like he has a nose ring.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "17:58 haha! In the Philippines we celebrate Christmas as early as September. The Malls and other public places starts decorating when the \"Ber\" months enter..  🥰🥰🥰",
            "polarity": 0.056249999999999994,
            "subjectivity": 0.2604166666666667
        },
        {
            "body": "So happy for the new phase of adventures. Much love",
            "polarity": 0.4787878787878788,
            "subjectivity": 0.6848484848484849
        },
        {
            "body": "I think we all will miss the blue house. It is a beautiful property,  but it will all be worth it when your dream home is done.",
            "polarity": 0.3833333333333333,
            "subjectivity": 0.4000000000000001
        },
        {
            "body": "Are you going to have a fireplace in the new house? 🏠\nBtw I want to say thank you, you are the only youtubers that acknowledge all the comments!! 🥰",
            "polarity": 0.06818181818181818,
            "subjectivity": 0.7272727272727273
        },
        {
            "body": "I love your falmy",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Nice video",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Mudança sempre é um pouco complicado mais no fim da tudo certo.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Hey Stephen, cover that pipe with mulch or something as a temp solution so no one trips over it and gets hurt. Just saying. You trust Lincoln with the girl but she needs her face blurred out! Hah ha, Lincoln's lip smudges on the lens, lol.",
            "polarity": 0.8,
            "subjectivity": 0.7
        }
    ]
}