{
    "time_posted": "2021-10-30 13:00:14",
    "url": "https://www.youtube.com/watch?v=XmD0eg0vzh0",
    "time_now": "2021-11-01 05:47:30",
    "ups": "5751",
    "downs": "44",
    "views": "103217",
    "top_comments": [
        {
            "comment": "Reese's angles growing new age growing up yes training  special Olympics Memphis",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.24675324675324675,
            "subjectivity": 0.512987012987013
        },
        {
            "comment": "Amanda new age women's angles yes age new Glen Hunt New angles growing up yes growing up yes new age angles Aiden New age growing up yes earth new Age Eartha new angles age growing up training Liam new age growing training Liam new age growing up yes Jude new age growing up yes new angles age growing up yes new family friends have fun play special sleepover yo yo new William new house cousins angles new age growing up training and Miller family new training age new age Yvonne hunt new age growing up yes women's angles growing up yes new family friends have fun Glen Hunt New age Growing upNew both Jude new new age growing growing ilam new age growing up yes new training ilam new age growing up yes new Keary angles growing up new age",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.1546320346320346,
            "subjectivity": 0.44147186147186157
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Always god is with you guys more god bless this beautiful family",
            "polarity": 0.675,
            "subjectivity": 0.75
        },
        {
            "body": "Your family made it seem easy moving. I bet it wasn't. I am so excited for you new adventure. You are making it work. It looks like you got a great RV. I hope settling on is pretty easy and smooth.",
            "polarity": 0.404004329004329,
            "subjectivity": 0.7316017316017316
        },
        {
            "body": "Very impressive but im sure super tiring for mom and dad.",
            "polarity": 0.611111111111111,
            "subjectivity": 0.8518518518518517
        },
        {
            "body": "Wish you all the best!",
            "polarity": 1.0,
            "subjectivity": 0.3
        }
    ]
}