{
    "time_posted": "2021-10-30 13:00:14",
    "url": "https://www.youtube.com/watch?v=XmD0eg0vzh0",
    "time_now": "2021-10-30 20:51:57",
    "ups": "3531",
    "downs": "31",
    "views": "45120",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Good luck, it’s exciting time for you all 😁💞",
            "polarity": 0.5,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "I'm going to miss you guys in that house too but the RV is waiting😊.  Looking fwd to the videos you'll be filming over there....can't wait.   \nEnjoy the weekend 🙂❤",
            "polarity": 0.4,
            "subjectivity": 0.5
        },
        {
            "body": "8:40 Even before Stephen mentioned \"Korean\" I knew what was up. I'm excited for this!",
            "polarity": 0.46875,
            "subjectivity": 0.75
        },
        {
            "body": "Ow sad to say goodbye to a good house but it’s a step closer to staying in yr own property. So much to do,so much to clean,so much to move. You both are amazing at packing and moving.\nLooking forward to see yr blog in yr new rev. Hope the couch you want get change. \nLincoln is saying a good few words now which is lovely.\nYou have good helpers Ethan and Liam n Jude are great. The girls must b3 busy packing their own stuff.\nI am sure you would be glad when it’s all done.\nHave a good rest.",
            "polarity": 0.3909090909090909,
            "subjectivity": 0.6190796857463523
        },
        {
            "body": "Love you guys 💖🌱🇯🇲🇬🇭🇬🇧",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Wish you the best in the new RV. It will be so cool to see you living in this new home, how you organize things to fit in less space. \nLincol's new T-shirt is amazing. And, omg, I don't want Liam and Ethan to grow up, they are such a great team together. It was fun to see them sharing the jacket.\nLove you guyd",
            "polarity": 0.3493686868686869,
            "subjectivity": 0.4775252525252525
        },
        {
            "body": "Squid game",
            "polarity": -0.4,
            "subjectivity": 0.4
        },
        {
            "body": "Good luck and exciting  times ahead…..you will need lots of energy in the weeks ahead…..so look after yourselves…….",
            "polarity": 0.5,
            "subjectivity": 0.7000000000000001
        },
        {
            "body": "Where is Lincoln going to take his naps in the RV?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Amanda I agree with you most of the time but please decorate ASAP we all need Christmas happiness and extra month on Christmas decorations is exactly what the world needs ❤",
            "polarity": 0.3625,
            "subjectivity": 0.26249999999999996
        },
        {
            "body": "I'm so excited to see the squid game costume on the Halloween!! (not sure if I am guessing the right tv show)",
            "polarity": -0.053571428571428575,
            "subjectivity": 0.6436507936507936
        },
        {
            "body": "God bless you",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Aww Liam and Ethan sharing the jacket 🥺.  I love these videos, so nostalgic but I cannot wait to see how y'all live in the RV and vlog there <3❤️✨ Buenas tardes 🇪🇸😊",
            "polarity": 0.1090909090909091,
            "subjectivity": 0.75
        },
        {
            "body": "Lincoln must be heavy... Poor daddy😟fighting",
            "polarity": -0.30000000000000004,
            "subjectivity": 0.55
        },
        {
            "body": "So happy for all of you that you are one step closer to your dream home.  In the meantime, your awesome and cozy RV is perfect!! I",
            "polarity": 0.65,
            "subjectivity": 0.9375
        },
        {
            "body": "I love the brother love between Liam and Ethan. Such good brothers to each other",
            "polarity": 0.315,
            "subjectivity": 0.5349999999999999
        },
        {
            "body": "OMG, Linky is sooo adorable in his very special way... 😍💟... The bond between Ethan and Liam is so strong and cute at the same time too... Managed to catch a glimpse of Penny's jacket and I probably know what the Halloween theme is gonna be ... Lol... Hope the family will be able to adjust comfortably in the RV... Love you guys..",
            "polarity": 0.45529100529100536,
            "subjectivity": 0.7029100529100529
        },
        {
            "body": "I have been following your sweet family for your two moves and since you adopted Penny and  Lincoln ( l just noticed that those two names describe out one cent coin)Love you our families story do much❤️❤️❤️❤️",
            "polarity": 0.175,
            "subjectivity": 0.375
        },
        {
            "body": "I am Ethiopian but I am very surprised you are happy God bless you",
            "polarity": 0.465,
            "subjectivity": 1.0
        }
    ]
}