{
    "time_posted": "2021-10-30 13:00:14",
    "url": "https://www.youtube.com/watch?v=XmD0eg0vzh0",
    "time_now": "2021-10-31 00:58:30",
    "ups": "4186",
    "downs": "35",
    "views": "59475",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "I think you might have some issues with the pvc pipe plumbing on the rv. Because when it dumps they work on a gravity system. And it doesn’t flush with normal water pressure to push out waste like regular house plumbing. So normally when people use a hose they angle it on a slope so the waste goes down with gravity. And if you do get a clog you can shake the hose up and down to help free it. So keep an eye on that. Honestly, I’m surprised that the builder designed it like that.",
            "polarity": 0.009876543209876536,
            "subjectivity": 0.4060778727445394
        },
        {
            "body": "God’s blessings",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I am guessing you are dressing up as squid games.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Squid games",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "God bless always",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Is the tv show that you guys are dressing up as Squid games?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Congrats Miller Family💋 i Love You All😘😘😘  GODBLESS Always Your Family",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "I'm so excited for your new adventure Miller Fam. I just don't get why you only have 700k subscribers. It should be 1 million.. People are really missing out with your you tube channel. I can't wait to see the new house and can't wait for the tour on your RV. Love the Miller Fam..",
            "polarity": 0.15795454545454546,
            "subjectivity": 0.5515151515151515
        },
        {
            "body": "I haven't watched your videos in awhile where's resse",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Good Evening. I remember when you guys move in to that house. Can't wait to see the new one. Love u guys and Bless you all. 😘😘😘😘😘",
            "polarity": 0.4454545454545455,
            "subjectivity": 0.5515151515151516
        },
        {
            "body": "Hope you get the L shape couch you ordered on time.😁",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Such sweet brothers",
            "polarity": 0.175,
            "subjectivity": 0.575
        },
        {
            "body": "im guessing stephen's gonna do a squid game costume with keira and penny and stephen's gonna be the big doll the one with the lazer eyes",
            "polarity": -0.2,
            "subjectivity": 0.25
        },
        {
            "body": "Better put insulation on all pipe",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "MUCHAS MUDANZAS EN POCO TIEMPO.....MUCHO TRABAJO .",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I thought I'd already commented on the video. I forgot I commented whenever I set a reminder to watch your video. I'm excited to see how everything comes together. You probably already have the correct seating. Just a couple more months before you move into your house 🏡. I know it'll be in the basement but just think once you move upstairs it's for life.",
            "polarity": 0.4375,
            "subjectivity": 0.625
        },
        {
            "body": "So sorry with it raining that makes it more challenging",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Hi beautiful Miller family so excited for your new journey. Linky is talking so much more how grown up he is. Thank you for sharing this journey with us stay safe  from the uk x",
            "polarity": 0.4722727272727273,
            "subjectivity": 0.6409090909090909
        },
        {
            "body": "Woohoo !!! Start of your new life journey lads !!! It’s gonna be great 😍☘️🇮🇪",
            "polarity": 0.5331676136363637,
            "subjectivity": 0.6022727272727273
        },
        {
            "body": "Yes too early say Happy Holidays.  L.o.l   and Every year Go by so fast and Holidays is back again. L.o.l",
            "polarity": 0.275,
            "subjectivity": 0.475
        }
    ]
}