{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-11-02 06:30:56",
    "ups": "10172",
    "downs": "150",
    "views": "130020",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Another great makeover! It feels like a styled space. You really elevated the look for her! Beautiful",
            "polarity": 0.7000000000000001,
            "subjectivity": 0.65
        },
        {
            "body": "I’m wondering if Alexandra compensated for the storage loss from removing the huge dresser. This transformation is fantastic I am stealing some ideas to redecorate my room!",
            "polarity": 0.45000000000000007,
            "subjectivity": 0.9
        },
        {
            "body": "Like the makeover, but vid way too long, not necessary. I fast forwarded to the last 6'.",
            "polarity": 0.037500000000000006,
            "subjectivity": 0.5166666666666667
        },
        {
            "body": "Sue here:  I love it!!! Every inch - the colors, textures, layout, and art ... perfect. You did it again. ♥️",
            "polarity": 0.98828125,
            "subjectivity": 0.8
        },
        {
            "body": "While I think there are some really cute things added to the small space there were a few that were not in my opinion.\nI felt that the little drawer unit in the bedroom that was moved over from one side to the next wasn't needed. It looks out of place. The lamp appeared to be short and like it stuck outward alot (could be the angle filmed from).  The plant divider idea was great yet I felt you could have staggered the heights. The bed could've used a tailored bedskirt, perhaps in the same color as the cover.",
            "polarity": 0.08281250000000001,
            "subjectivity": 0.396875
        },
        {
            "body": "Can I just say I had to re-watch this video, because I was too distracted by your cute jumpsuits. Please share where you got them.",
            "polarity": 0.5,
            "subjectivity": 1.0
        },
        {
            "body": "Amazing 🤩",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        }
    ]
}