{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-11-01 22:16:29",
    "ups": "9814",
    "downs": "143",
    "views": "122968",
    "top_comments": [
        {
            "comment": "Alex! This is my favorite small space makeover you’ve ever done.  I love your delineation of space/zones by color!  Such a good job finding VERY STRICT renter friendly solutions.",
            "likes": 1,
            "number_of_replies": 0,
            "polarity": 0.3071428571428571,
            "subjectivity": 0.5571428571428572
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "Xico! Noooooo! Sending good wishes for a speedy and complete recovery.",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.5
        },
        {
            "body": "I(clap)AM(clap)LIV(clap)ING(clap) for the more dynamic interactions between the AG team now that you can all be back together!",
            "polarity": 0.16666666666666666,
            "subjectivity": 0.2222222222222222
        },
        {
            "body": "Love, love love your channel! Always looking for those little smart details you bring to decore. I am writing because I would like some input  from you. I don’t live in Canada 😩 but I need some help with my studio. It’s 370 sq feet not including bathroom since it is a step up inside the studio. Wondering if it would be okay if I share some fotos of how it is now. It is a garage converted no walls or divisions in it just a big square. I will only share fotos if you answer me back. I have a decorator inside me I know but not as stylish as you are. Will appreciate any input. Thank you for always being so fun, smart and aware of the world you live in. See you soon.🐳",
            "polarity": 0.2459199134199134,
            "subjectivity": 0.5090476190476191
        },
        {
            "body": "I hope Chico feels better soon and heals completely prayers his way",
            "polarity": 0.3,
            "subjectivity": 0.45
        },
        {
            "body": "...is the console mirror paint job supposed to look like that...?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "I actually used peel and stick in my shower on the top section and down the sides beside the glass doors and from the outside it is so nice and it really does come right off - like one LARGE MASSIVE POST IT.",
            "polarity": 0.18271604938271602,
            "subjectivity": 0.4559082892416225
        },
        {
            "body": "What an amazing transformation! You did a tremendous job. So many great ideas. I’ve bookmarked a bunch of them. Thanks for sharing.",
            "polarity": 0.5166666666666668,
            "subjectivity": 0.67
        },
        {
            "body": "Get better soon, Chico! My husband is at the end of his recovery from a similar accident where he took his thumb off! They were able to save it but it was frustrating for him to not be able to work, so stay sane!",
            "polarity": 0.27,
            "subjectivity": 0.61
        },
        {
            "body": "All good thoughts and prayers to Xico and his family. Im so excited for what you did here. There were pretty big hurdles to jump",
            "polarity": 0.33125,
            "subjectivity": 0.6125
        },
        {
            "body": "Get well soon Xico!!! Love this challenge for you. Great job!!!",
            "polarity": 0.75,
            "subjectivity": 0.675
        },
        {
            "body": "Awesome transformation!!!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Alex! This is my favorite small space makeover you’ve ever done.  I love your delineation of space/zones by color!  Such a good job finding VERY STRICT renter friendly solutions.",
            "polarity": 0.3071428571428571,
            "subjectivity": 0.5571428571428572
        },
        {
            "body": "Get well soon Chico! I hope you get all the function and dexterity in your hand again! Love this makeover! I had no idea about the Command ceiling hooks, that is a great hack! When you mentioned no light by the bed, I feel like I recall LoneFox did a hack for wireless DIY sconces by his bed that would solve that light issue in places like this. Also, love James' cameo and as usual his funny edits.",
            "polarity": 0.3321428571428572,
            "subjectivity": 0.6571428571428571
        },
        {
            "body": "No bathroom????",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "We love Chico. Sending him love and a speedy recovery.",
            "polarity": 0.5,
            "subjectivity": 0.6
        },
        {
            "body": "Girl you need some help with desk areas. Dining chairs may look nice but after 6 hours?? This kills the spine. Also you can get a monitor arm for more desk space. So much more than the monitor stand.",
            "polarity": 0.5333333333333333,
            "subjectivity": 0.6666666666666666
        }
    ]
}