{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-11-01 18:09:09",
    "ups": "9531",
    "downs": "135",
    "views": "118222",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "This is my favorite of yours!! 🔥✨🔥",
            "polarity": 0.78125,
            "subjectivity": 1.0
        },
        {
            "body": "@alexandragater what kind of command hooks were used for the ceiling? I tried to Google search and they don’t have the ones you used with the command brand.",
            "polarity": 0.6,
            "subjectivity": 0.9
        },
        {
            "body": "Am I the only one that thinks the bed cover is dark teal green!??",
            "polarity": -0.13333333333333333,
            "subjectivity": 0.5666666666666667
        },
        {
            "body": "Love this look! Also love the king size blanket hack. Might use that at my place.",
            "polarity": 0.5625,
            "subjectivity": 0.6
        },
        {
            "body": "I have been watching (and loving) all of your makeover videos....yes, I did subscribe!  I did wonder though......why do you never mention that a good bit of stuff is usually completely removed from the space in order to make it pretty? (I've noticed it in several videos)  I understand from the \"pretty\" aspect, but most of us have stuff that we need and have no where else to put it......",
            "polarity": 0.36428571428571427,
            "subjectivity": 0.6357142857142858
        },
        {
            "body": "Can’t help wondering how she “exacto’d” the edges off without damaging the wall?  Measure, pull away, put something under edge, then exacto?  Maybe measure before you put it up to begin with … 🤔😉",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Heads up, a great option for a headboard when there’s no room for a bedside table is a storage headboard. Mine is store bought with storage in it - like a bookcase behind our bed. but you could totally DIY it. Think of a tall, skinny box - width of the bed, depth of 5-6”, and tall enough that pillows can lean but you can still reach the top from laying down. The top surface gives you enough room for a little lamp, a couple books, baskets with bedside nicknaks, space for a water bottle, etc. Build it out of project board, sand and paint. It can be freestanding and you could still hang art or do an arch above it.",
            "polarity": 0.0960858585858586,
            "subjectivity": 0.47171717171717165
        },
        {
            "body": "Really well done! Her landlord sucks.",
            "polarity": -0.024999999999999994,
            "subjectivity": 0.25
        },
        {
            "body": "Love this makeover!!",
            "polarity": 0.78125,
            "subjectivity": 0.6
        },
        {
            "body": "Another great makeover!  Question about the throw rugs like the one by the door.  Do you use anything for the underneath to help them not slide around?  Also, I liked the suggestion in the comments for making the storage under the bed black boxes. And I would like to add that using labels so you know what is in each one would be quite helpful as well.",
            "polarity": 0.4777777777777778,
            "subjectivity": 0.6611111111111111
        },
        {
            "body": "😍😍😍✨✨🌟🌟💫",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "you made this space seem so much bigger...wow. I just have 1 question...where is her kitchen? Does she not have one?",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "i have a 2 bedroom apartment that looks horrible and i have not idea how to make it more homely. I wish you did a series where you selected subscriber houses to do your project. I would love if you did mine :)",
            "polarity": 0.125,
            "subjectivity": 0.775
        },
        {
            "body": "Wish Xico a good recovery 🙏  🙂",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Best yet!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Love this one! 😁",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "This might be the most impressive one so far, IMO. Bravo!",
            "polarity": 0.5416666666666666,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "i don't get the no drilling no paint when it's so easy to fix before you leave. like what?? especially holes!",
            "polarity": 0.21666666666666667,
            "subjectivity": 0.9166666666666667
        },
        {
            "body": "Great job!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "One of the best Studio Fix episodes, so many great ideas!",
            "polarity": 0.8333333333333334,
            "subjectivity": 0.5166666666666667
        }
    ]
}