{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-11-02 02:23:56",
    "ups": "10019",
    "downs": "148",
    "views": "127078",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Is that her printer on the floor next to the RV console? I would be so worried I would smash it when moving my chair out",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Great makeover. I can’t paint, put in hooks, use command hooks or peel & stick at my rental.",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "Omg 😱 Chico ! Hoping you get well soon 😌. Alexandra I enjoyed this video so much fun interaction with the hole team , loved James 🥰 . Thank you for sharing and keep up the good work 😏👏🏼👏🏼👏🏼👏🏼👏🏼",
            "polarity": 0.55,
            "subjectivity": 0.575
        },
        {
            "body": "Some details are great: wallpaper, console-table, picture-frames, plants, elektric-panel-cover; and the sofa-side-drape is ingenious. BUT there are main issues: bedside table ??? - the dresser was more functional; bedside lamp ??? - well, if you sleep upside down, lol; chair = uncomfortable for working and appropriate for how many guests ???; bedcover - the color is too \"bulky\", white is a better choice because it widens the room and makes the bed less expansive AND you should have ironed the pillowcases - it looks better and it's easier to iron on the stickers...but at least you didn't sort books by colour - well, there were'nt any.",
            "polarity": 0.26031746031746034,
            "subjectivity": 0.5027777777777778
        },
        {
            "body": "You did a great job with this space given how small it was. I love the king sized duvet idea, total game changer. I would say that I like the desk that you used for the work station but I disagree with the chair, given their height and the way the back of the chair slanted it's gonna cause back and neck strain. It might've also been worth it to get a bolted in monitor mount for the desk so that it can be raised or swiveled as needed. Great job seperating each space I think you really knocked this one outta the park.",
            "polarity": 0.195,
            "subjectivity": 0.395
        },
        {
            "body": "I might swap out the rectangle console table for a curved semicircle table so she doesn’t bump into the corner when walking in. I think it would also be cool to get a smaller media cabinet under the TV and then put a long mid-century dresser or 3’ tall bookcase at the foot of the bed to divide the room and add storage.",
            "polarity": 0.09999999999999999,
            "subjectivity": 0.5166666666666666
        },
        {
            "body": "Very classy! 🌼💛🌼💛🌼",
            "polarity": 0.1625,
            "subjectivity": 1.0
        },
        {
            "body": "Nice make over, however the hanging plants 🙄🙄",
            "polarity": 0.6,
            "subjectivity": 1.0
        },
        {
            "body": "Awe Chico -Take care!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "That tapestry is amazing! 😍 such a vibe & makes that corner even more cozy",
            "polarity": 0.2625,
            "subjectivity": 0.6625
        },
        {
            "body": "It’s looks so beautiful and homey. Great design ideas, the lamps are just perfect. The bed arrangement it’s so cozy and pretty 😍 \nSo sorry for Chicos accident, I hope he’s hand heals well, speedy recovery ❤️‍🩹",
            "polarity": 0.36666666666666664,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "Wow, I was dubious, but you nailed it ❤️",
            "polarity": 0.1,
            "subjectivity": 1.0
        },
        {
            "body": "James is an icon! Also,  we hope Xico is better soon!!",
            "polarity": 0.78125,
            "subjectivity": 0.5
        }
    ]
}