{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-11-01 05:47:23",
    "ups": "8829",
    "downs": "127",
    "views": "107166",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "But where are her clothes?!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Oh no Chico! 😱 Sending Chico some super healing vibes!",
            "polarity": 0.41666666666666663,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "I absolutely dislike the desk and hoped for a really cool solution for the monitor to be stored away in a cool way after a day's work and the desk to be beautiful, but I get it :) the only thing that Id finish this off with is actually a wall decal for the door! it would look so cool to have something on the same colours of the picture but on the door, it would be so unexpected and vibrant :) But all in all, this is absolutely gorgeous and super functional! :D",
            "polarity": 0.3655555555555556,
            "subjectivity": 0.7316666666666667
        },
        {
            "body": "If there's one major \"hack\" I've learned from YouTubers, it's that peel-and-stick wallpaper is the GOAT.",
            "polarity": 0.0625,
            "subjectivity": 0.5
        },
        {
            "body": "id divide the 2 areas at the end of bed with something and bedskirt",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "One of the best make over yet ! Amazing colours , just love it ! Thanks for the tons of ideas ( plants divider ! Wow!)",
            "polarity": 0.52,
            "subjectivity": 0.6
        },
        {
            "body": "Heaven's what kind of landlord are they have never heard of spackle? as long as you paint it back the original colour what is the deal? ah well I am sure as usual you will do your best with what you have and surprise us all. My goodness Xico take care of yourself aww poor man sending HUGS and well wishes you are already most of the time missed by us. Is this student housing the reason for the no paint no holes thing? I would have turned the bed around though away from the door if poss so head is not at the door. I agree with you no Christmas pillows. Did you make the peel and stick wallpaper with the Cricut? you didn't suggest a sofa bed for space as would allow for more space in apartment with bed and sofa together. I too use dining chair as desk chair it's fine just after first year add some padding or cushion on seat is fine.",
            "polarity": 0.2970238095238095,
            "subjectivity": 0.5230158730158729
        },
        {
            "body": "It turned out beautiful! Good call for changing the bedding😊",
            "polarity": 0.85,
            "subjectivity": 0.8
        },
        {
            "body": "I'm surprised you didn't use the classic Ikea shoe cabinet by her entry way!!",
            "polarity": 0.1802083333333333,
            "subjectivity": 0.5333333333333333
        },
        {
            "body": "Love this makeover!! You have such a golden touch. Its also much fun to see how much fun your team has together ❤️",
            "polarity": 0.33625000000000005,
            "subjectivity": 0.4
        },
        {
            "body": "This space is just off for me personally. Idk what it is exactly, I think something could have been placed in front of the large window? Idk just didn’t come together for me style wise, but still much better than before,",
            "polarity": 0.33285714285714285,
            "subjectivity": 0.4757142857142857
        },
        {
            "body": "I'm curious how you exacto the wallpaper without damaging the paint underneath.",
            "polarity": -0.1,
            "subjectivity": 1.0
        },
        {
            "body": "This makeover was so good!!",
            "polarity": 1.0,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Awesome job !",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I’m obsessed with that tapestry but I know I’ll never find that exact one…Home Goods just never seems to have the good stuff AG finds in Homesense in Canada.  Oh well…time to make one myself I guess!",
            "polarity": 0.20833333333333334,
            "subjectivity": 0.6166666666666667
        }
    ]
}