{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-10-31 05:05:00",
    "ups": "6001",
    "downs": "72",
    "views": "61826",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "As always very cute and well done! Many clever hacks!\n\nOn work desk though if she works there full time it could be more practical and ergonomic to get a bigger one and turn it to the wall where TV set is. It is a pain to work at such small desks.",
            "polarity": 0.26510416666666664,
            "subjectivity": 0.5979166666666668
        },
        {
            "body": "Wow cozy studio beautiful",
            "polarity": 0.25,
            "subjectivity": 0.9166666666666666
        },
        {
            "body": "Great job. That carpet and the plants did a great job of defining the spaces, and the colors made all of the difference. Excellent  reveal, as always.",
            "polarity": 0.8666666666666667,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Are you wearing your sisters sweater? She's so cute why is she never in videos? Like i didn't even know you had a sister.  This apt is cute i like both bed spreads",
            "polarity": 0.5333333333333333,
            "subjectivity": 1.0
        },
        {
            "body": "What a nasty owner. I would move. Not worth the heartache. Sorry for my strong opinion.",
            "polarity": -0.30416666666666664,
            "subjectivity": 0.7083333333333334
        },
        {
            "body": "The layout of that apartment was challenging.  Once again, you nailed it! (without using nails)",
            "polarity": 0.625,
            "subjectivity": 1.0
        },
        {
            "body": "This was amazing!! My back hurts thinking about using a dining chair for WFH but that plant hanger/floor lamp combo was epic!!",
            "polarity": 0.3645833333333333,
            "subjectivity": 0.43333333333333335
        },
        {
            "body": "I just wished you had pulled that king size bed cover even  it was crooked, and all the way to just barley touch the floor to completely cover the storage and the uneven line drove me crazy.....it is such a beautiful cover, but you can really tell when it was uneven...but the look as a whole was very pretty and bright. just wished you could have made a proper bed, it kind of looked like it was just thrown, pillows not straight.  in such a small space, little things like that just jump out....please think about it for the next time, i don't want to hurt your feelings, just give a bit more time to things being straight ok?  doesn't help that I have been a nurse for 41 years, talk about pulling sheets tight!! don't have to be that precise, just a bit neater.... lol,",
            "polarity": 0.19811282467532465,
            "subjectivity": 0.48116883116883125
        },
        {
            "body": "auwhhh our man chico. :(\nbtw so glad my favorite series is back for another season :)",
            "polarity": 0.15,
            "subjectivity": 0.8
        },
        {
            "body": "I covered my fuse box with a frame, and because I hate drilling holes in my rental, I have Command velcro strips ALL OVER MY STUDIO. And I absolutely love it that way. Whenever they come to check the fuse box, the frame goes on and off so easily. I highly recommend it to everyone",
            "polarity": -0.04666666666666668,
            "subjectivity": 0.68
        },
        {
            "body": "I WAS SO EXCITED TO SEE XICO 😩 \nhope you get better soon Xico 💖",
            "polarity": 0.4375,
            "subjectivity": 0.625
        },
        {
            "body": "As a cricket lover it hurts my heart everytime I see you use it. So much waste...you are creative, be creative with how you organize the cuts. 😭",
            "polarity": 0.39999999999999997,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "Very nice! I am looking forward to your next adventure and new decor finds.",
            "polarity": 0.3704545454545454,
            "subjectivity": 0.48484848484848486
        },
        {
            "body": "This one is da best small studio makeover",
            "polarity": 0.375,
            "subjectivity": 0.35
        },
        {
            "body": "Loved this!! Speedy Recovery Chico.",
            "polarity": 1.0,
            "subjectivity": 0.8
        },
        {
            "body": "Great solutions! Enjoyed this video 😍",
            "polarity": 0.75,
            "subjectivity": 0.725
        },
        {
            "body": "Awesome job it looks beautiful!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Get will soon Xico!!  No more slicing your hand!",
            "polarity": -0.3125,
            "subjectivity": 0.5
        },
        {
            "body": "Greeeeeat job….what could a renter do for some window covering?",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Team AG! Y'all nailed it! Esp. love bedroom area and art above the TV & cute wallpaper 😍 👌",
            "polarity": 0.3333333333333333,
            "subjectivity": 0.5666666666666667
        }
    ]
}