{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-10-31 13:18:35",
    "ups": "7134",
    "downs": "90",
    "views": "78950",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "AH mazing",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "SOOOOOO GOOOOD! really Amazing job Alexandra, I love it!  :)",
            "polarity": 0.5750000000000001,
            "subjectivity": 0.8333333333333334
        },
        {
            "body": "Looks Amazing 🤍",
            "polarity": 0.6000000000000001,
            "subjectivity": 0.9
        },
        {
            "body": "This is by far my favourite studio fix you've ever done!! Congrats Alexandra, it looks stunning :)",
            "polarity": 0.3854166666666667,
            "subjectivity": 1.0
        },
        {
            "body": "I really love this makeover. Only not well thought out idea is the dining chair as a desk chair is a horrible idea. If you work sitting at a desk for long periods of time you aren't getting the greatly needed comfort and support you need.",
            "polarity": 0.05,
            "subjectivity": 0.75
        },
        {
            "body": "One of your best makeovers ever!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "Sorry Alexander but we need more James",
            "polarity": 0.0,
            "subjectivity": 0.75
        },
        {
            "body": "nothing matches ! too all over the place !!!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yummy 😋...James is so Cute!! Got this Florida Bear ready to visit Canada!!!😜\nO, yea the place came out OK.",
            "polarity": 0.49374999999999997,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "Love it! The renter had done so well with the layout, and this makes it even better. Surprised Alexandra didn't use the IKEA shoe cabinet near the bed, I think that could be great :)",
            "polarity": 0.4375,
            "subjectivity": 0.6916666666666668
        },
        {
            "body": "Best studio fix sooo far!!!!",
            "polarity": 0.6220703125,
            "subjectivity": 0.65
        },
        {
            "body": "Great job!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "Feel better Xico!!! This is my favorite video ever! I loved seeing the behind-the-scenes; I LOVE James and I really love seeing you all have fun!! You seem to have a perfect team. It was such a great makeover.too The plants really worked as a divider without chopping up the space. I would say this was a perfect makeover with all the restrictions you had to work with. Seriously impressed.",
            "polarity": 0.6475260416666667,
            "subjectivity": 0.6791666666666667
        },
        {
            "body": "so happy to see another studio fix",
            "polarity": 0.8,
            "subjectivity": 1.0
        },
        {
            "body": "Such a cute makeover! I have been following since the beginning and have loved how the editing style has changed with the BTS clips and James goofing around with different gifs and memes. Makes me lol everytime",
            "polarity": 0.3541666666666667,
            "subjectivity": 0.6166666666666667
        },
        {
            "body": "Hi sweet Alexandra\nThis one came together really well. What a cozy, beautiful space you have created. And the interesting thing about this make-over is, that I don’t like much og the stuff you brought into the apartment: the wicker lamp takes away from the hanging plants - in wicker baskets. I don’t like any of the art you chose, especially the tapestry is hidious - sorry love☹️. And waaay to much black. But you know what - it all works together despite my dislike. Good job girl❤️",
            "polarity": 0.19333333333333333,
            "subjectivity": 0.6333333333333334
        },
        {
            "body": "This turned out so well, fab job Team AG! 👌",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Yay I missed this so much ❤️",
            "polarity": 0.2,
            "subjectivity": 0.2
        },
        {
            "body": "those hooks  are not command hooks, they are sticky back hooks, and will rip her ceiling out when she goes to remove them, I am speaking from experience.",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Thank you Team AG for another great video! I'm a native upstate New Yorker living abroad in Spain, and I discovered your channel about two years ago. I've found the videos really inspirational and fun. Because of the time difference, I usually enjoy your makeovers over a lovely Sunday breakfast - It's something I really look forward to on the weekend. I hope you hit 400,000 soon and that Xico makes a speedy recovery.",
            "polarity": 0.4337662337662338,
            "subjectivity": 0.5506493506493507
        }
    ]
}