{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-10-31 09:11:50",
    "ups": "6586",
    "downs": "81",
    "views": "69622",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "You did a fantastic job, it is cozy & warm & I love the colors",
            "polarity": 0.325,
            "subjectivity": 0.7125
        },
        {
            "body": "Only two things I don't agree with. The huge mirror opposite the bed - a slim bookcase diy'd would have been better (not to mention a mirror opposite your bed is very bad feng shui), and the chair is not suitable for working from home.",
            "polarity": -0.04071428571428567,
            "subjectivity": 0.5738095238095238
        },
        {
            "body": "Oh Chico wishing you a good recovery 🤗",
            "polarity": 0.7,
            "subjectivity": 0.6000000000000001
        },
        {
            "body": "Great Job! Looks really great.",
            "polarity": 0.9,
            "subjectivity": 0.75
        },
        {
            "body": "This is probably the most well done makeovers of yours! Very well executed, and actually had practical solutions. Everything goes well with everything. Small changes that make such a big impact! (Quick tip: can use a small wide dresser as an ottoman at the foot of the bed for extra storage and as a space divider!)",
            "polarity": 0.055833333333333325,
            "subjectivity": 0.33
        },
        {
            "body": "I absolutely love this makeover AG! Only thing I would say is the dining room chair for WFH is gonna be really uncomfortable. Would recommend a desk chair with arms instead!\nBut overall space looks incredible!",
            "polarity": 0.2,
            "subjectivity": 0.7
        },
        {
            "body": "Chico get well soon, James LOL!!!! love this one!!",
            "polarity": 0.890625,
            "subjectivity": 0.6499999999999999
        },
        {
            "body": "Brilliant job!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I love this makeover, except the dining chair as a desk chair. I did that for a year and it was a horrible!",
            "polarity": -0.25,
            "subjectivity": 0.8
        },
        {
            "body": "You surpass yourself, especially wird the new duvet and the plants!",
            "polarity": 0.08522727272727272,
            "subjectivity": 0.7272727272727273
        },
        {
            "body": "That bedspace was amazing. Love the tapestry and the colour scheme",
            "polarity": 0.55,
            "subjectivity": 0.75
        },
        {
            "body": "All the best for Xico! He was missed. Loved the James appearance. 😁 and the way the condo turned out is amazing!",
            "polarity": 0.8166666666666668,
            "subjectivity": 0.6666666666666666
        },
        {
            "body": "We need more of James’ Narration ❤️❤️❤️",
            "polarity": 0.5,
            "subjectivity": 0.5
        },
        {
            "body": "Loving this studio fix! My alltime favorite! Beautiful colors!",
            "polarity": 0.7916666666666666,
            "subjectivity": 0.9833333333333334
        },
        {
            "body": "Wow! What a difference! Good job you guys! Have you thought about a smaller sofa maybe or placing it differently? All in all I relly like it.",
            "polarity": 0.2578125,
            "subjectivity": 0.675
        },
        {
            "body": "Amazing 😍😍😍!!!!!!!!!",
            "polarity": 1.0,
            "subjectivity": 0.9
        },
        {
            "body": "Please tell Xico avoid eating rice and potatoes for speedy recovery and if he can he must have 2 tumeric latte a day..... Or just put 2 to 3 pinch tumeric in warm milk if he's not vegan....",
            "polarity": 0.6,
            "subjectivity": 0.6
        },
        {
            "body": "I am such a fan of James. He is so adorable 🥰",
            "polarity": 0.25,
            "subjectivity": 0.75
        },
        {
            "body": "🐼 Big Bear Hugs from a 68 yr old grandma in Kirby, Texas, USA 🐼 ❤️ 🎀 ❤️ 🎀 ❤️",
            "polarity": 0.05,
            "subjectivity": 0.15000000000000002
        },
        {
            "body": "Speedy recovery to Xico. The place looks so much better! I would stick to the ergonomic chair instead of the dining chair, as personally my back can't take dining chairs",
            "polarity": 0.3125,
            "subjectivity": 0.25
        }
    ]
}