{
    "time_posted": "2021-10-30 14:59:20",
    "url": "https://www.youtube.com/watch?v=zHZnQn6D-2E",
    "time_now": "2021-10-30 20:51:49",
    "ups": "3701",
    "downs": "42",
    "views": "30706",
    "top_comments": [],
    "comments_since_last_sample": [
        {
            "body": "Please get well Xico... looking forward to see you in upcoming videos. 😍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Great job!",
            "polarity": 1.0,
            "subjectivity": 0.75
        },
        {
            "body": "That was a great makecover. It looked heaps better.",
            "polarity": 0.65,
            "subjectivity": 0.625
        },
        {
            "body": "I add absolutely love every part of this makeover! Way to go😊👍🏻😊",
            "polarity": 0.625,
            "subjectivity": 0.6
        },
        {
            "body": "Love it! I would have layered a small round jute rug under the desk! But I love a good maximalist moment. More is more lol",
            "polarity": 0.390625,
            "subjectivity": 0.5375
        },
        {
            "body": "One of your best!",
            "polarity": 1.0,
            "subjectivity": 0.3
        },
        {
            "body": "OMG! Drop the ugly arch already! You even took it out of your own home. The arch is tacky!",
            "polarity": -0.0625,
            "subjectivity": 1.0
        },
        {
            "body": "Absolutely perfect and wonderful!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "Beautiful!",
            "polarity": 1.0,
            "subjectivity": 1.0
        },
        {
            "body": "I died when I saw the fabric art piece at home sense. I would of gotten that in a heart beat for my place 😍",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Wow you hit it out of the park on this one! Beautiful job! Love the darker accents!",
            "polarity": 0.5833333333333334,
            "subjectivity": 0.8666666666666667
        },
        {
            "body": "As someone who works from home (since 2017) AAAAND had used a dinning chair as an office chair, that won't work, in no time she will feel back pain. I know most office chairs are ugly but in order to make her enjoy her work she needs a different kind of chair, and there are some that are actually cute, please don't oversee that kind of details, they're very important.",
            "polarity": 0.2688888888888889,
            "subjectivity": 0.7111111111111111
        },
        {
            "body": "This is amazing! You made a small cramped space feel spacious and even luxurious! Amazing work Alexandra!!!! 😍😍😍",
            "polarity": 0.4791666666666667,
            "subjectivity": 0.7333333333333334
        },
        {
            "body": "The bed cover just changed everything! It was a great choice 👍🏻",
            "polarity": 0.8,
            "subjectivity": 0.75
        },
        {
            "body": "This was an amazing makeover!! I wish I had this as inspo in my 350 sq ft bachelor apartment!!",
            "polarity": 1.0,
            "subjectivity": 0.9
        },
        {
            "body": "Love it and the vibes!! Why not put the square dining table in front of the window? It would look cute plus make sense for all her board games",
            "polarity": 0.640625,
            "subjectivity": 0.8
        },
        {
            "body": "Fabulous transformation! I love it!",
            "polarity": 0.5625,
            "subjectivity": 0.8
        },
        {
            "body": "Great job Alexandra!!!! I was so glad you changed the bedspread, it turned out beautiful!!! I especially liked the console table behind the couch, it looked very sophisticated.",
            "polarity": 0.625,
            "subjectivity": 0.9083333333333333
        },
        {
            "body": "This was amazing!!!\n\nI didn’t like the style of wall hanging over the bed but the way you did the faux headboard with the hanging was awesome.\nI really loved all the attention to detail. And the thought of extra storage and key hanger etc. \n\nWow just wow!",
            "polarity": 0.41785714285714287,
            "subjectivity": 0.8285714285714286
        }
    ]
}