{
    "time_posted": "2021-10-30 14:15:02",
    "url": "https://www.youtube.com/watch?v=zqwaKFJW2PQ",
    "time_now": "2021-10-31 00:57:58",
    "ups": "162",
    "downs": "37",
    "views": "14948",
    "top_comments": [
        {
            "comment": "Come on Kinzinger, we need you. Don't let them do this to us. You belong in our government. You are one of the few good Republicans.",
            "likes": 2,
            "number_of_replies": 0,
            "polarity": 0.24999999999999997,
            "subjectivity": 0.35000000000000003
        }
    ],
    "comments_since_last_sample": [
        {
            "body": "We miss you President Trump ....Free speech and no shadow banning  Go Truth Social",
            "polarity": 0.03333333333333333,
            "subjectivity": 0.06666666666666667
        },
        {
            "body": "He may be running for president!",
            "polarity": 0.0,
            "subjectivity": 0.0
        },
        {
            "body": "Come on Kinzinger, we need you. Don't let them do this to us. You belong in our government. You are one of the few good Republicans.",
            "polarity": 0.24999999999999997,
            "subjectivity": 0.35000000000000003
        },
        {
            "body": "This is horrible he's the only Republican I think that is tolerable the rest seem like crazy wackos racists are insane people",
            "polarity": -0.65,
            "subjectivity": 0.975
        },
        {
            "body": "For the life of me I just do not understand how others do not see that Trump is bad for America and democracy.  There is nothing wrong with being a Democrat or a Republican and we do need each other no matter how much we differ on what is best for the country.  But you win some and you lose some.  That is how it’s supposed to be. That is what Democracy is...Trump is fighting to be dictatorial... Lying about the election to stay in power is one way a dictator regime gets started.  Keeping false conspiracies alive because those leader’s support you is dead wrong. Calling people SOB’s for trying to fight for injustice is dead wrong. Some people are ok with it because his ideology aligns with theirs. Making one side (Democrats) the enemy is dead wrong.  Trump represents all of that... He’s just not good to be President of the US...",
            "polarity": -0.09843749999999998,
            "subjectivity": 0.5526041666666667
        },
        {
            "body": "\"Cancer for the country\" hit that orange nail on the head. Senator Goldwater the father of conservatism warned when the GOP let the religious zealots take over that party it would be destroyed. I would never affiliate myself with Trumpism either. History will not be kind neither will God",
            "polarity": 0.3,
            "subjectivity": 0.575
        },
        {
            "body": "Another puppet will be inserted",
            "polarity": 0.0,
            "subjectivity": 0.0
        }
    ]
}